{"word":"a","definition":"The first letter of the English and of many other alphabets. The capital A of the alphabets of Middle and Western Europe, as also the small letter (a), besides the forms in Italic, black letter, etc., are all descended from the old Latin A, which was borrowed from the Greek Alpha, of the same form; and this was made from the first letter (Aleph, and itself from the Egyptian origin. The Aleph was a consonant letter, with a guttural breath sound that was not an element of Greek articulation; and the Greeks took it to represent their vowel Alpha with the ä sound, the Phoenician alphabet having no vowel symbols. This letter, in English, is used for several different vowel sounds. See Guide to pronunciation, §§ 43-74. The regular long a, as in fate, etc., is a comparatively modern sound, and has taken the place of what, till about the early part of the 17th century, was a sound of the quality of ä (as in far). 2. (Mus.)  The name of the sixth tone in the model major scale (that in C), or the first tone of the minor scale, which is named after it the scale in A minor. The second string of the violin is tuned to the A in the treble staff. -- A sharp (A#) is the name of a musical tone intermediate between A and B. -- A flat (A) is the name of a tone intermediate between A and G. A per se Etym: (L. per se by itself), one preëminent; a nonesuch. [Obs.] O fair Creseide, the flower and A per se Of Troy and Greece. Chaucer.\n\n1. Etym: [Shortened form of an. AS. an one. See One.]  An adjective, commonly called the indefinite article, and signifying one or any, but less emphatically.  \"At a birth\"; \"In a word\"; \"At a blow\". Shak. Note: It is placed before nouns of the singular number denoting an individual object, or a quality individualized, before collective nouns, and also before plural nouns when the adjective few or the phrase great many or good many is interposed; as, a dog, a house, a man; a color; a sweetness; a hundred, a fleet, a regiment; a few persons, a great many days. It is used for an, for the sake of euphony, before words beginning with a consonant sound [for exception of certain words beginning with h, see An]; as, a table, a woman, a year, a unit, a eulogy, a ewe, a oneness, such a one, etc. Formally an was used both before vowels and consonants. 2. Etym: [Originally the preposition a (an, on).]  In each; to or for each; as, \"twenty leagues a day\", \"a hundred pounds a year\", \"a dollar a yard\", etc.\n\n1. In; on; at; by. [Obs.] \"A God's name.\" \"Torn a pieces.\" \"Stand a tiptoe.\" \"A Sundays\" Shak. \"Wit that men have now a days.\" Chaucer. \"Set them a work.\" Robynson (More's Utopia) 2. In process of; in the act of; into; to; -- used with verbal substantives in -ing which begin with a consonant. This is a shortened form of the preposition an (which was used before the vowel sound); as in a hunting, a building, a begging. \"Jacob, when he was a dying\" Heb. xi. 21. \"We'll a birding together.\" \" It was a doing.\" Shak. \"He burst out a laughing.\" Macaulay. The hyphen may be used to connect a with the verbal substantive (as, a-hunting, a-building) or the words may be written separately. This form of expression is now for the most part obsolete, the a being omitted and the verbal substantive treated as a participle.\n\nOf. [Obs.] \"The name of John a Gaunt.\" \"What time a day is it \" Shak. \"It's six a clock.\" B. Jonson.\n\nA barbarous corruption of have, of he, and sometimes of it and of they. \"So would I a done\" \"A brushes his hat.\" Shak.\n\nAn expletive, void of sense, to fill up the meter A merry heart goes all the day, Your sad tires in a mile-a. Shak."}