{"word":"abate","definition":"1. To beat down; to overthrow. [Obs.] The King of Scots . . . sore abated the walls. Edw. Hall. 2. To bring down or reduce from a higher to a lower state, number, or degree; to lessen; to diminish; to contract; to moderate; toto cut short; as, to abate a demand; to abate pride, zeal, hope. His eye was not dim, nor his natural force abated. Deut. xxxiv. 7. 3. To deduct; to omit; as, to abate something from a price. Nine thousand parishes, abating the odd hundreds. Fuller. 4. To blunt. [Obs.] To abate the edge of envy. Bacon. 5. To reduce in estimation; to deprive. [Obs.] She hath abated me of half my train. Shak. 6. (Law)  (a) To bring entirely down or put an end to; to do away with; as, to abate a nuisance, to abate a writ. (b) (Eng. Law) To diminish; to reduce. Legacies are liable to be abated entirely or in proportion, upon a deficiency of assets. To abate a tax, to remit it either wholly or in part.\n\n1. To decrease, or become less in strength or violence; as, pain abates, a storm abates. The fury of Glengarry . . . rapidly abated. Macaulay. 2. To be defeated, or come to naught; to fall through; to fail; as, a writ abates. To abate into a freehold, To abate in lands (Law), to enter into a freehold after the death of the last possessor, and before the heir takes possession. See Abatement, 4. Syn. -- To subside; decrease; intermit; decline; diminish; lessen. -- To Abate, Subside. These words, as here compared, imply a coming down from some previously raised or exited state. Abate expresses this in respect to degrees, and implies a diminution of force or of intensity; as, the storm abates, the cold abates, the force of the wind abates; or, the wind abates, a fever abates. Subside (to settle down) has reference to a previous state of agitation or commotion; as, the waves subside after a storm, the wind subsides into a calm. When the words are used figuratively, the same distinction should be observed. If we conceive of a thing as having different degrees of intensity or strength, the word to be used is abate. Thus we say, a man's anger abates, the ardor of one's love abates, \"Winter rage abates\". But if the image be that of a sinking down into quiet from preceding excitement or commotion, the word to be used is subside; as, the tumult of the people subsides, the public mind subsided into a calm. The same is the case with those emotions which are tumultuous in their nature; as, his passion subsides, his joy quickly subsided, his grief subsided into a pleasing melancholy. Yet if, in such cases, we were thinking of the degree of violence of the emotion, we might use abate; as, his joy will abate in the progress of time; and so in other instances.\n\nAbatement. [Obs.] Sir T. Browne."}