{"word":"abstract","definition":"1. Withdraw; separate. [Obs.] The more abstract . . . we are from the body. Norris. 2. Considered apart from any application to a particular object; separated from matter; exiting in the mind only; as, abstract truth, abstract numbers. Hence: ideal; abstruse; difficult. 3. (Logic) (a) Expressing a particular property of an object viewed apart from the other properties which constitute it; -- opposed to Ant: concrete; as, honesty is an abstract word. J. S. Mill. (b) Resulting from the mental faculty of abstraction; general as opposed to particular; as, \"reptile\" is an abstract or general name. Locke. A concrete name is a name which stands for a thing; an abstract name which stands for an attribute of a thing. A practice has grown up in more modern times, which, if not introduced by Locke, has gained currency from his example, of applying the expression \"abstract name\" to all names which are the result of abstraction and generalization, and consequently to all general names, instead of confining it to the names of attributes. J. S. Mill. 4. Abstracted; absent in mind. \"Abstract, as in a trance.\" Milton. An abstract idea (Metaph.), an idea separated from a complex object, or from other ideas which naturally accompany it; as the solidity of marble when contemplated apart from its color or figure. -- Abstract terms, those which express abstract ideas, as beauty, whiteness, roundness, without regarding any object in which they exist; or abstract terms are the names of orders, genera or species of things, in which there is a combination of similar qualities. -- Abstract numbers (Math.), numbers used without application to things, as 6, 8, 10; but when applied to any thing, as 6 feet, 10 men, they become concrete. -- Abstract or Pure mathematics. See Mathematics.\n\n1. To withdraw; to separate; to take away. He was incapable of forming any opinion or resolution abstracted from his own prejudices. Sir W. Scott. 2. To draw off in respect to interest or attention; as, his was wholly abstracted by other objects. The young stranger had been abstracted and silent. Blackw. Mag. 3. To separate, as ideas, by the operation of the mind; to consider by itself; to contemplate separately, as a quality or attribute. Whately. 4. To epitomize; to abridge. Franklin. 5. To take secretly or dishonestly; to purloin; as, to abstract goods from a parcel, or money from a till. Von Rosen had quietly abstracted the bearing-reins from the harness. W. Black. 6. (Chem.)  To separate, as the more volatile or soluble parts of a substance, by distillation or other chemical processes. In this sense extract is now more generally used.\n\nTo perform the process of abstraction. [R.] I own myself able to abstract in one sense. Berkeley.\n\n1. That which comprises or concentrates in itself the essential qualities of a larger thing or of several things. Specifically: A summary or an epitome, as of a treatise or book, or of a statement; a brief. An abstract of every treatise he had read. Watts. Man, the abstract Of all perfection, which the workmanship Of Heaven hath modeled. Ford. 2. A state of separation from other things; as, to consider a subject in the abstract, or apart from other associated things. 3. An abstract term. The concretes \"father\" and \"son\" have, or might have, the abstracts \"paternity\" and \"filiety.\" J. S. Mill. 4. (Med.)  A powdered solid extract of a vegetable substance mixed with sugar of milk in such proportion that one part of the abstract represents two parts of the original substance. Abstract of title (Law), an epitome of the evidences of ownership. Syn. -- Abridgment; compendium; epitome; synopsis. See Abridgment."}