{"word":"accomplish","definition":"1. To complete, as time or distance. That He would accomplish seventy years in the desolations of Jerusalem. Dan. ix. 2. He had accomplished half a league or more. Prescott. 2. To bring to an issue of full success; to effect; to perform; to execute fully; to fulfill; as, to accomplish a design, an object, a promise. This that is written must yet be accomplished in me. Luke xxii. 37. 3. To equip or furnish thoroughly; hence, to complete in acquirements; to render accomplished; to polish. The armorers accomplishing the knights. Shak. It [the moon] is fully accomplished for all those ends to which Providence did appoint it. Wilkins. These qualities . . . go to accomplish a perfect woman. Cowden Clarke. 4. To gain; to obtain. [Obs.] Shak. Syn. -- To do; perform; fulfill; realize; effect; effectuate; complete; consummate; execute; achieve; perfect; equip; furnish. -- To Accomplish, Effect, Execute, Achieve, Perform. These words agree in the general idea of carrying out to some end proposed. To accomplish (to fill up to the measure of the intention) generally implies perseverance and skill; as, to accomplish a plan proposed by one's self, an object, a design, an undertaking. \"Thou shalt accomplish my desire.\" 1 Kings v. 9. He . . . expressed his desire to see a union accomplished between England and Scotland. Macaulay. To effect (to work out) is much like accomplish. It usually implies some degree of difficulty contended with; as, he effected or accomplished what he intended, his purpose, but little. \"What he decreed, he effected.\" Milton. To work in close design by fraud or guile What force effected not. Milton. To execute (to follow out to the end, to carry out, or into effect) implies a set mode of operation; as, to execute the laws or the orders of another; to execute a work, a purpose, design, plan, project. To perform is much like to do, though less generally applied. It conveys a notion of protracted and methodical effort; as, to perform a mission, a part, a task, a work. \"Thou canst best perform that office.\" Milton. The Saints, like stars, around his seat Perform their courses still. Keble. To achieve (to come to the end or arrive at one's purpose) usually implies some enterprise or undertaking of importance, difficulty, and excellence."}