{"word":"account","definition":"1. A reckoning; computation; calculation; enumeration; a record of some reckoning; as, the Julian account of time. A beggarly account of empty boxes. Shak. 2. A registry of pecuniary transactions; a written or printed statement of business dealings or debts and credits, and also of other things subjected to a reckoning or review; as, to keep one's account at the bank. 3. A statement in general of reasons, causes, grounds, etc., explanatory of some event; as, no satisfactory account has been given of these phenomena. Hence, the word is often used simply for reason, ground, consideration, motive, etc.; as, on no account, on every account, on all accounts. 4. A statement of facts or occurrences; recital of transactions; a relation or narrative; a report; a description; as, an account of a battle. \"A laudable account of the city of London.\" Howell. 5. A statement and explanation or vindication of one's conduct with reference to judgment thereon. Give an account of thy stewardship. Luke xvi. 2. 6. An estimate or estimation; valuation; judgment. \"To stand high in your account.\" Shak. 7. Importance; worth; value; advantage; profit. \"Men of account.\" Pope. \"To turn to account.\" Shak. Account current, a running or continued account between two or more parties, or a statement of the particulars of such an account. -- In account with, in a relation requiring an account to be kept. -- On account of, for the sake of; by reason of; because of. -- On one's own account, for one's own interest or behalf. -- To make account, to have an opinion or expectation; to reckon. [Obs.] s other part . . . makes account to find no slender arguments for this assertion out of those very scriptures which are commonly urged against it. Milton. -- To make account of, to hold in estimation; to esteem; as, he makes small account of beauty. -- To take account of, or to take into account, to take into consideration; to notice. \"Of their doings, God takes no account.\" Milton . -- A writ of account (Law), a writ which the plaintiff brings demanding that the defendant shall render his just account, or show good cause to the contrary; -- called also an action of account. Cowell. Syn. -- Narrative; narration; relation; recital; description; explanation; rehearsal. -- Account, Narrative, Narration, Recital. These words are applied to different modes of rehearsing a series of events. Account turns attention not so much to the speaker as to the fact related, and more properly applies to the report of some single event, or a group of incidents taken as whole; as, an account of a battle, of a shipwreck, etc. A narrative is a continuous story of connected incidents, such as one friend might tell to another; as, a narrative of the events of a siege, a narrative of one's life, etc. Narration is usually the same as narrative, but is sometimes used to describe the mode of relating events; as, his powers of narration are uncommonly great. Recital denotes a series of events drawn out into minute particulars, usually expressing something which peculiarly interests the feelings of the speaker; as, the recital of one's wrongs, disappointments, sufferings, etc. 1. To reckon; to compute; to count. [Obs.] The motion of . . . the sun whereby years are accounted. Sir T. Browne. 2. To place to one's account; to put to the credit of; to assign; -- with to. [R.] Clarendon. 3. To value, estimate, or hold in opinion; to judge or consider; to deem. Accounting that God was able to raise him up. Heb. xi. 19. 4. To recount; to relate. [Obs.] Chaucer.\n\n1. To render or receive an account or relation of particulars; as, an officer must account with or to the treasurer for money received. 2. To render an account; to answer in judgment; -- with for; as, we must account for the use of our opportunities. 3. To give a satisfactory reason; to tell the cause of; to explain; - - with for; as, idleness accounts for poverty. To account of, to esteem; to prize; to value. Now used only in the passive. \"I account of her beauty.\" Shak. Newer was preaching more accounted of than in the sixteenth century. Canon Robinson."}