{"word":"act","definition":"1. That which is done or doing; the exercise of power, or the effect, of which power exerted is the cause; a performance; a deed. That best portion of a good man's life, His little, nameless, unremembered acts Of kindness and of love. Wordsworth. Hence, in specific uses: (a) The result of public deliberation; the decision or determination of a legislative body, council, court of justice, etc.; a decree, edit, law, judgment, resolve, award; as, an act of Parliament, or of Congress. (b) A formal solemn writing, expressing that something has been done. Abbott. (c) A performance of part of a play; one of the principal divisions of a play or dramatic work in which a certain definite part of the action is completed. (d) A thesis maintained in public, in some English universities, by a candidate for a degree, or to show the proficiency of a student. 2. A state of reality or real existence as opposed to a possibility or possible existence. [Obs.] The seeds of plants are not at first in act, but in possibility, what they afterward grow to be. Hooker. 3. Process of doing; action. In act, in the very doing; on the point of (doing). \"In act to shoot.\" Dryden. This woman was taken . . . in the very act. John viii. 4. Act of attainder. (Law) See Attainder. -- Act of bankruptcy (Law), an act of a debtor which renders him liable to be adjudged a bankrupt. -- Act of faith. (Ch. Hist.) See Auto-da-Fé. -- Act of God (Law), an inevitable accident; such extraordinary interruption of the usual course of events as is not to be looked for in advance, and against which ordinary prudence could not guard. -- Act of grace, an expression often used to designate an act declaring pardon or amnesty to numerous offenders, as at the beginning of a new reign. -- Act of indemnity, a statute passed for the protection of those who have committed some illegal act subjecting them to penalties. Abbott. -- Act in pais, a thing done out of court (anciently, in the country), and not a matter of record. Syn. -- See Action.\n\n1. To move to action; to actuate; to animate. [Obs.] Self-love, the spring of motion, acts the soul. Pope. 2. To perform; to execute; to do. [Archaic] That we act our temporal affairs with a desire no greater than our necessity. Jer. Taylor. Industry doth beget by producing good habits, and facility of acting things expedient for us to do. Barrow. Uplifted hands that at convenient times Could act extortion and the worst of crimes. Cowper. 3. To perform, as an actor; to represent dramatically on the stage. 4. To assume the office or character of; to play; to personate; as, to act the hero. 5. To feign or counterfeit; to simulate. With acted fear the villain thus pursued. Dryden. To act a part, to sustain the part of one of the characters in a play; hence, to simulate; to dissemble. -- To act the part of, to take the character of; to fulfill the duties of.\n\n1. To exert power; to produce an effect; as, the stomach acts upon food. 2. To perform actions; to fulfill functions; to put forth energy; to move, as opposed to remaining at rest; to carry into effect a determination of the will. He hangs between, in doubt to act or rest. Pope. 3. To behave or conduct, as in morals, private duties, or public offices; to bear or deport one's self; as, we know not why he has acted so. 4. To perform on the stage; to represent a character. To show the world how Garrick did not act. Cowper. To act as or for, to do the work of; to serve as. -- To act on, to regulate one's conduct according to. -- To act up to, to equal in action; to fulfill in practice; as, he has acted up to his engagement or his advantages."}