{"word":"after","definition":"1. Next; later in time; subsequent; succeeding; as, an after period of life. Marshall. Note: In this sense the word is sometimes needlessly combined with the following noun, by means of a hyphen, as, after-ages, after-act, after-days, after-life. For the most part the words are properly kept separate when after has this meaning. 2. Hinder; nearer the rear. (Naut.)  To ward the stern of the ship; -- applied to any object in the rear part of a vessel; as the after cabin, after hatchway. Note: It is often combined with its noun; as, after-bowlines, after- braces, after-sails, after-yards, those on the mainmasts and mizzenmasts. After body (Naut.), the part of a ship abaft the dead flat, or middle part.\n\n1. Behind in place; as, men in line one after another. \"Shut doors after you.\" Shak. 2. Below in rank; next to in order. Shak. Codrus after PhDryden. 3. Later in time; subsequent; as, after supper, after three days. It often precedes a clause. Formerly that was interposed between it and the clause. After I am risen again, I will go before you into Galilee. Matt. xxvi. 32. 4. Subsequent to and in consequence of; as, after what you have said, I shall be careful. 5. Subsequent to and notwithstanding; as, after all our advice, you took that course. 6. Moving toward from behind; following, in search of; in pursuit of. Ye shall not go after other gods. Deut. vi. 14. After whom is the king of Israel come out 1 Sam. xxiv. 14. 7. Denoting the aim or object; concerning; in relation to; as, to look after workmen; to inquire after a friend; to thirst after righteousness. 8. In imitation of; in conformity with; after the manner of; as, to make a thing after a model; a picture after Rubens; the boy takes after his father. To name or call after, to name like and reference to. Our eldest son was named George after his uncle. Goldsmith. 9. According to; in accordance with; in conformity with the nature of; as, he acted after his kind. He shall not judge after the sight of his eyes. Isa. xi. 3. They that are after the flesh do mind the things of the flesh. Rom. viii. 5. 10. According to the direction and influence of; in proportion to; befitting. [Archaic] He takes greatness of kingdoms according to bulk and currency, and not after their intrinsic value. Bacon. After all, when everything has been considered; upon the whole. -- After (with the same noun preceding and following), as, wave after wave, day after day, several or many (waves, etc.) successively. -- One after another, successively. -- To be after, to be in pursuit of in order to reach or get; as, he is after money.\n\nSubsequently in time or place; behind; afterward; as, he follows after. It was about the space of three hours after. Acts. v. 7. Note: After is prefixed to many words, forming compounds, but retaining its usual signification. The prefix may be adverbial, prepositional, or adjectival; as in after- described, after-dinner, after-part. The hyphen is sometimes needlessly used to connect the adjective after with its noun. See Note under After, a., 1."}