{"word":"alarm","definition":"1. A summons to arms, as on the approach of an enemy. Arming to answer in a night alarm. Shak. 2. Any sound or information intended to give notice of approaching danger; a warming sound to arouse attention; a warning of danger. Sound an alarm in my holy mountain. Joel ii. 1. 3. A sudden attack; disturbance; broil. [R.] \"These home alarms.\" Shak. Thy palace fill with insults and alarms. Pope. 4. Sudden surprise with fear or terror excited by apprehension of danger; in the military use, commonly, sudden apprehension of being attacked by surprise. Alarm and resentment spread throughout the camp. Macaulay. 5. A mechanical contrivance for awaking persons from sleep, or rousing their attention; an alarum. Alarm bell, a bell that gives notice on danger. -- Alarm clock or watch, a clock or watch which can be so set as to ring or strike loudly at a prearranged hour, to wake from sleep, or excite attention. -- Alarm gauge, a contrivance attached to a steam boiler for showing when the pressure of steam is too high, or the water in the boiler too low. -- Alarm post, a place to which troops are to repair in case of an alarm. Syn. -- Fright; affright; terror; trepidation; apprehension; consternation; dismay; agitation; disquiet; disquietude. -- Alarm, Fright, Terror, Consternation. These words express different degrees of fear at the approach of danger. Fright is fear suddenly excited, producing confusion of the senses, and hence it is unreflecting. Alarm is the hurried agitation of feeling which springs from a sense of immediate and extreme exposure. Terror is agitating and excessive fear, which usually benumbs the faculties. Consternation is overwhelming fear, and carries a notion of powerlessness and amazement. Alarm agitates the feelings; terror disorders the understanding and affects the will; fright seizes on and confuses the sense; consternation takes possession of the soul, and subdues its faculties. See Apprehension.\n\n1. To call to arms for defense; to give notice to (any one) of approaching danger; to rouse to vigilance and action; to put on the alert. 2. To keep in excitement; to disturb. 3. To surprise with apprehension of danger; to fill with anxiety in regard to threatening evil; to excite with sudden fear. Alarmed by rumors of military preparation. Macaulay."}