{"word":"all","definition":"1. The whole quantity, extent, duration, amount, quality, or degree of; the whole; the whole number of; any whatever; every; as, all the wheat; all the land; all the year; all the strength; all happiness; all abundance; loss of all power; beyond all doubt; you will see us all (or all of us). Prove all things: hold fast that which is good. 1 Thess. v. 21. 2. Any. [Obs.] \"Without all remedy.\" Shak. Note: When the definite article \"the,\" or a possessive or a demonstrative pronoun, is joined to the noun that all qualifies, all precedes the article or the pronoun; as, all the cattle; all my labor; all his wealth; all our families; all your citizens; all their property; all other joys. Note: This word, not only in popular language, but in the Scriptures, often signifies, indefinitely, a large portion or number, or a great part. Thus, all the cattle in Egypt died, all Judea and all the region round about Jordan, all men held John as a prophet, are not to be understood in a literal sense, but as including a large part, or very great numbers. 3. Only; alone; nothing but. I was born to speak all mirth and no matter. Shak. All the whole, the whole (emphatically). [Obs.] \"All the whole army.\" Shak.\n\n1. Wholly; completely; altogether; entirely; quite; very; as, all bedewed; my friend is all for amusement. \"And cheeks all pale.\" Byron. Note: In the ancient phrases, all too dear, all too much, all so long, etc., this word retains its appropriate sense or becomes intensive. 2. Even; just. (Often a mere intensive adjunct.) [Obs. or Poet.] All as his straying flock he fed. Spenser. A damsel lay deploring All on a rock reclined. Gay. All to, or All-to. In such phrases as \"all to rent,\" \"all to break,\" \"all-to frozen,\" etc., which are of frequent occurrence in our old authors, the all and the to have commonly been regarded as forming a compound adverb, equivalent in meaning to entirely, completely, altogether. But the sense of entireness lies wholly in the word all (as it does in \"all forlorn,\" and similar expressions), and the to properly belongs to the following word, being a kind of intensive prefix (orig. meaning asunder and answering to the LG. ter-, HG. zer- ). It is frequently to be met with in old books, used without the all. Thus Wyclif says, \"The vail of the temple was to rent:\" and of Judas, \"He was hanged and to-burst the middle:\" i. e., burst in two, or asunder. -- All along. See under Along. -- All and some, individually and collectively, one and all. [Obs.] \"Displeased all and some.\" Fairfax. -- All but. (a) Scarcely; not even. [Obs.] Shak. (b) Almost; nearly. \"The fine arts were all but proscribed.\" Macaulay. -- All hollow, entirely, completely; as, to beat any one all hollow. [Low] -- All one, the same thing in effect; that is, wholly the same thing. -- All over, over the whole extent; thoroughly; wholly; as, she is her mother all over. [Colloq.] -- All the better, wholly the better; that is, better by the whole difference. -- All the same, nevertheless. \"There they [certain phenomena] remain rooted all the same, whether we recognize them or not.\" J. C. Shairp. \"But Rugby is a very nice place all the same.\" T. Arnold. -- See also under All, n.\n\nThe whole number, quantity, or amount; the entire thing; everything included or concerned; the aggregate; the whole; totality; everything or every person; as, our all is at stake. Death, as the Psalmist saith, is certain to all. Shak. All that thou seest is mine. Gen. xxxi. 43. Note: All is used with of, like a partitive; as, all of a thing, all of us. After all, after considering everything to the contrary; nevertheless. -- All in all, a phrase which signifies all things to a person, or everything desired; (also adverbially) wholly; altogether. Thou shalt be all in all, and I in thee, Forever. Milton. Trust me not at all, or all in all. Tennyson. -- All in the wind (Naut.), a phrase denoting that the sails are parallel with the course of the wind, so as to shake. -- All told, all counted; in all. -- And all, and the rest; and everything connected. \"Bring our crown and all.\" Shak. -- At all. (a) In every respect; wholly; thoroughly. [Obs.] \"She is a shrew at al(l).\" Chaucer. (b) A phrase much used by way of enforcement or emphasis, usually in negative or interrogative sentences, and signifying in any way or respect; in the least degree or to the least extent; in the least; under any circumstances; as, he has no ambition at all; has he any property at all \"Nothing at all. \" Shak. \"It thy father at all miss me.\" 1 Sam. xx. 6. -- Over all, everywhere. [Obs.] Chaucer. Note: All is much used in composition to enlarge the meaning, or add force to a word. In some instances, it is completely incorporated into words, and its final consonant is dropped, as in almighty, already, always: but, in most instances, it is an adverb prefixed to adjectives or participles, but usually with a hyphen, as, all- bountiful, all-glorious, allimportant, all-surrounding, etc. In others it is an adjective; as, allpower, all-giver. Anciently many words, as, alabout, alaground, etc., were compounded with all, which are now written separately.\n\nAlthough; albeit. [Obs.] All they were wondrous loth. Spenser."}