{"word":"angle","definition":"1. The inclosed space near the point where two lines; a corner; a nook. Into the utmost angle of the world. Spenser. To search the tenderest angles of the heart. Milton. 2. (Geom.) (a) The figure made by. two lines which meet. (b) The difference of direction of two lines. In the lines meet, the point of meeting is the vertex of the angle. 3. A projecting or sharp corner; an angular fragment. Though but an angle reached him of the stone. Dryden. 4. (Astrol.)  A name given to four of the twelve astrological \"houses.\" [Obs.] Chaucer. 5. Etym: [AS. angel.]  A fishhook; tackle for catching fish, consisting of a line, hook, and bait, with or without a rod. Give me mine angle: we 'll to the river there. Shak. A fisher next his trembling angle bears. Pope. Acute angle, one less than a right angle, or less than 90ยบ. -- Adjacent or Contiguous angles, such as have one leg common to both angles. -- Alternate angles. See Alternate. -- Angle bar. (a) (Carp.) An upright bar at the angle where two faces of a polygonal or bay window meet. Knight. (b) (Mach.) Same as Angle iron. -- Angle bead (Arch.), a bead worked on or fixed to the angle of any architectural work, esp. for protecting an angle of a wall. -- Angle brace, Angle tie (Carp.), a brace across an interior angle of a wooden frame, forming the hypothenuse and securing the two side pieces together. Knight. -- Angle iron (Mach.), a rolled bar or plate of iron having one or more angles, used for forming the corners, or connecting or sustaining the sides of an iron structure to which it is riveted. -- Angle leaf (Arch.), a detail in the form of a leaf, more or less conventionalized, used to decorate and sometimes to strengthen an angle. -- Angle meter, an instrument for measuring angles, esp. for ascertaining the dip of strata. -- Angle shaft (Arch.), an enriched angle bead, often having a capital or base, or both. -- Curvilineal angle, one formed by two curved lines. -- External angles, angles formed by the sides of any right-lined figure, when the sides are produced or lengthened. -- Facial angle. See under Facial. -- Internal angles, those which are within any right-lined figure. -- Mixtilineal angle, one formed by a right line with a curved line. -- Oblique angle, one acute or obtuse, in opposition to a right angle. -- Obtuse angle, one greater than a right angle, or more than 90ยบ. -- Optic angle. See under Optic. -- Rectilineal or Right-lined angle, one formed by two right lines. -- Right angle, one formed by a right line falling on another perpendicularly, or an angle of 90ยบ (measured by a quarter circle). -- Solid angle, the figure formed by the meeting of three or more plane angles at one point. -- Spherical angle, one made by the meeting of two arcs of great circles, which mutually cut one another on the surface of a globe or sphere. -- Visual angle, the angle formed by two rays of light, or two straight lines drawn from the extreme points of an object to the center of the eye. -- For Angles of commutation, draught, incidence, reflection, refraction, position, repose, fraction, see Commutation, Draught, Incidence, Reflection, Refraction, etc.\n\n1. To fish with an angle (fishhook), or with hook and line. 2. To use some bait or artifice; to intrigue; to scheme; as, to angle for praise. The hearts of all that he did angle for. Shak.\n\nTo try to gain by some insinuating artifice; to allure. [Obs.] \"He angled the people's hearts.\" Sir P. Sidney."}