{"word":"answer","definition":"1. To speak in defense against; to reply to in defense; as, to answer a charge; to answer an accusation. 2. To speak or write in return to, as in return to a call or question, or to a speech, declaration, argument, or the like; to reply to (a question, remark, etc.); to respond to. She answers him as if she knew his mind. Shak. So spake the apostate angel, though in pain: . . . And him thus answered soon his bold compeer. Milton. 3. To respond to satisfactorily; to meet successfully by way of explanation, argument, or justification, and the like; to refute. No man was able to answer him a word. Matt. xxii. 46. These shifts refuted, answer thine appellant. Milton. The reasoning was not and could not be answered. Macaulay. 4. To be or act in return or response to. Hence: (a) To be or act in compliance with, in fulfillment or satisfaction of, as an order, obligation, demand; as, he answered my claim upon him; the servant answered the bell. This proud king . . . studies day and night To answer all the debts he owes unto you. Shak. (b) To render account to or for. I will . . . send him to answer thee. Shak. (c) To atone; to be punished for. And grievously hath Cæzar answered it. Shak. (d) To be opposite to; to face. The windows answering each other, we could just discern the glowing horizon them. Gilpin. (e) To be or act an equivalent to, or as adequate or sufficient for; to serve for; to repay. [R.] Money answereth all things. Eccles. x. 19. (f) To be or act in accommodation, conformity, relation, or proportion to; to correspond to; to suit. Weapons must needs be dangerous things, if they answered the bulk of so prodigious a person. Swift.\n\n1. To speak or write by way of return (originally, to a charge), or in reply; to make response. There was no voice, nor any that answered. 1 Kings xviii. 26. 2. To make a satisfactory response or return. Hence: To render account, or to be responsible; to be accountable; to make amends; as, the man must answer to his employer for the money intrusted to his care. Let his neck answer for it, if there is any martial law. Shak. 3. To be or act in return. Hence: (a) To be or act by way of compliance, fulfillment, reciprocation, or satisfaction; to serve the purpose; as, gypsum answers as a manure on some soils. Do the strings answer to thy noble hand Dryden. (b) To be opposite, or to act in opposition. (c) To be or act as an equivalent, or as adequate or sufficient; as, a very few will answer. (d) To be or act in conformity, or by way of accommodation, correspondence, relation, or proportion; to conform; to correspond; to suit; -- usually with to. That the time may have all shadow and silence in it, and the place answer to convenience. Shak. If this but answer to my just belief, I 'll remember you. Shak. As in water face answereth to face, so the heart of man to man. Pro\n\n1. A reply to a change; a defense. At my first answer no man stood with me. 2 Tim. iv. 16. 2. Something said or written in reply to a question, a call, an argument, an address, or the like; a reply. A soft answer turneth away wrath. Prov. xv. 1. I called him, but he gave me no answer. Cant. v. 6. 3. Something done in return for, or in consequence of, something else; a responsive action. Great the slaughter is Here made by the Roman; great the answer be Britons must take. Shak. 4. A solution, the result of a mathematical operation; as, the answer to a problem. 5. (Law)  A counter-statement of facts in a course of pleadings; a confutation of what the other party has alleged; a responsive declaration by a witness in reply to a question. In Equity, it is the usual form of defense to the complainant's charges in his bill. Bouvier. Syn. -- Reply; rejoinder; response. See Reply."}