{"word":"appeal","definition":"1. (Law) (a) To make application for the removal of (a cause) from an inferior to a superior judge or court for a rehearing or review on account of alleged injustice or illegality in the trial below. We say, the cause was appealed from an inferior court. (b) To charge with a crime; to accuse; to institute a private criminal prosecution against for some heinous crime; as, to appeal a person of felony. 2. To summon; to challenge. [Archaic] Man to man will I appeal the Norman to the lists. Sir W. Scott. 3. To invoke. [Obs.] Milton.\n\n1. (Law)  To apply for the removal of a cause from an inferior to a superior judge or court for the purpose of reëxamination of for decision. Tomlins. I appeal unto Cæsar. Acts xxv. 11. 2. To call upon another to decide a question controverted, to corroborate a statement, to vindicate one's rights, etc.; as, I appeal to all mankind for the truth of what is alleged. Hence: To call on one for aid; to make earnest request. I appeal to the Scriptures in the original. Horsley. They appealed to the sword. Macaulay.\n\n1. (Law) (a) An application for the removal of a cause or suit from an inferior to a superior judge or court for reëxamination or review. (b) The mode of proceeding by which such removal is effected. (c) The right of appeal. (d) An accusation; a process which formerly might be instituted by one private person against another for some heinous crime demanding punishment for the particular injury suffered, rather than for the offense against the public. (e) An accusation of a felon at common law by one of his accomplices, which accomplice was then called an approver. See Approvement. Tomlins. Bouvier. 2. A summons to answer to a charge. Dryden. 3. A call upon a person or an authority for proof or decision, in one's favor; reference to another as witness; a call for help or a favor; entreaty. A kind of appeal to the Deity, the author of wonders. Bacon. 4. Resort to physical means; recourse. Every milder method is to be tried, before a nation makes an appeal to arms. Kent."}