{"word":"attend","definition":"1. To direct the attention to; to fix the mind upon; to give heed to; to regard. [Obs.] The diligent pilot in a dangerous tempest doth not attend the unskillful words of the passenger. Sir P. Sidney. 2. To care for; to look after; to take charge of; to watch over. 3. To go or stay with, as a companion, nurse, or servant; to visit professionally, as a physician; to accompany or follow in order to do service; to escort; to wait on; to serve. The fifth had charge sick persons to attend. Spenser. Attends the emperor in his royal court. Shak. With a sore heart and a gloomy brow, he prepared to attend William thither. Macaulay. 4. To be present with; to accompany; to be united or consequent to; as, a measure attended with ill effects. What cares must then attend the toiling swain. Dryden. 5. To be present at; as, to attend church, school, a concert, a business meeting. 6. To wait for; to await; to remain, abide, or be in store for. [Obs.] The state that attends all men after this. Locke. Three days I promised to attend my doom. Dryden. Syn. -- To Attend, Mind, Regard, Heed, Notice. Attend is generic, the rest are specific terms. To mind is to attend so that it may not be forgotten; to regard is to look on a thing as of importance; to heed is to ~ to a thing from a principle of caution; to notice is to think on that which strikes the senses. Crabb. See Accompany.\n\n1. To apply the mind, or pay attention, with a view to perceive, understand, or comply; to pay regard; to heed; to listen; -- usually followed by to. Attend to the voice of my supplications. Ps. lxxxvi. 6. Man can not at the same time attend to two objects. Jer. Taylor. 2. To accompany or be present or near at hand, in pursuance of duty; to be ready for service; to wait or be in waiting; -- often followed by on or upon. He was required to attend upon the committee. Clarendon. 3. (with to) To take charge of; to look after; as, to attend to a matter of business. 4. To wait; to stay; to delay. [Obs.] For this perfection she must yet attend, Till to her Maker she espoused be. Sir J. Davies. Syn. -- To Attend, Listen, Hearken. We attend with a view to hear and learn; we listen with fixed attention, in order to hear correctly, or to consider what has been said; we hearken when we listen with a willing mind, and in reference to obeying."}