{"word":"average","definition":"1. (OLd Eng. Law)  That service which a tenant owed his lord, to be done by the work beasts of the tenant, as the carriage of wheat, turf, etc. 2. Etym: [Cf. F. avarie damage to ship or cargo.] (Com.) (a) A tariff or duty on goods, etc. [Obs.] (b) Any charge in addition to the regular charge for freight of goods shipped. (c) A contribution to a loss or charge which has been imposed upon one of several for the general benefit; damage done by sea perils. (d) The equitable and proportionate distribution of loss or expense among all interested. General average, a contribution made, by all parties concerned in a sea adventure, toward a loss occasioned by the voluntary sacrifice of the property of some of the parties in interest for the benefit of all. It is called general average, because it falls upon the gross amount of ship, cargo, and freight at risk and saved by the sacrifice. Kent. -- Particular average signifies the damage or partial loss happening to the ship, or cargo, or freight, in consequence of some fortuitous or unavoidable accident; and it is borne by the individual owners of the articles damaged, or by their insurers. -- Petty averages are sundry small charges, which occur regularly, and are necessarily defrayed by the master in the usual course of a voyage; such as port charges, common pilotage, and the like, which formerly were, and in some cases still are, borne partly by the ship and partly by the cargo. In the clause commonly found in bills of lading, \"primage and average accustomed,\" average means a kind of composition established by usage for such charges, which were formerly assessed by way of average. Arnould. Abbott. Phillips. 3. A mean proportion, medial sum or quantity, made out of unequal sums or quantities; an arithmetical mean. Thus, if A loses 5 dollars, B 9, and C 16, the sum is 30, and the average 10. 4. Any medial estimate or general statement derived from a comparison of diverse specific cases; a medium or usual size, quantity, quality, rate, etc. \"The average of sensations.\" Paley. 5. pl.  In the English corn trade, the medial price of the several kinds of grain in the principal corn markets. On an average, taking the mean of unequal numbers or quantities.\n\n1. Pertaining to an average or mean; medial; containing a mean proportion; of a mean size, quality, ability, etc.; ordinary; usual; as, an average rate of profit; an average amount of rain; the average Englishman; beings of the average stamp. 2. According to the laws of averages; as, the loss must be made good by average contribution.\n\n1. To find the mean of, when sums or quantities are unequal; to reduce to a mean. 2. To divide among a number, according to a given proportion; as, to average a loss. 3. To do, accomplish, get, etc., on an average.\n\nTo form, or exist in, a mean or medial sum or quantity; to amount to, or to be, on an ~; as, the losses of the owners will average twenty five dollars each; these spars average ten feet in length."}