{"word":"bail","definition":"A bucket or scoop used in bailing water out of a boat. [Obs.] The bail of a canoe . . . made of a human skull. Capt. Cook.\n\n1. To lade; to dip and throw; -- usually with out; as, to bail water out of a boat. Buckets . . . to bail out the water. Capt. J. Smith. 2. To dip or lade water from; -- often with out to express completeness; as, to bail a boat. By the help of a small bucket and our hats we bailed her out. R. H. Dana, Jr.\n\n1. To deliver; to release. [Obs.] Ne none there was to rescue her, ne none to bail. Spenser. 2. (Law) (a) To set free, or deliver from arrest, or out of custody, on the undertaking of some other person or persons that he or they will be responsible for the appearance, at a certain day and place, of the person bailed. Note: The word is applied to the magistrate or the surety. The magistrate bails (but admits to bail is commoner) a man when he liberates him from arrest or imprisonment upon bond given with sureties. The surety bails a person when he procures his release from arrest by giving bond for his appearance. Blackstone. (b) To deliver, as goods in trust, for some special object or purpose, upon a contract, expressed or implied, that the trust shall be faithfully executed on the part of the bailee, or person intrusted; as, to bail cloth to a tailor to be made into a garment; to bail goods to a carrier. Blackstone. Kent.\n\n1. Custody; keeping. [Obs.] Silly Faunus now within their bail. Spenser. 2. (Law) (a) The person or persons who procure the release of a prisoner from the custody of the officer, or from imprisonment, by becoming surely for his appearance in court. The bail must be real, substantial bondsmen. Blackstone. A. and B. were bail to the arrest in a suit at law. Kent. (b) The security given for the appearance of a prisoner in order to obtain his release from custody of the officer; as, the man is out on bail; to go bail for any one. Excessive bail ought not to be required. Blackstone.\n\n1. The arched handle of a kettle, pail, or similar vessel, usually movable. Forby. 2. A half hoop for supporting the cover of a carrier's wagon, awning of a boat, etc.\n\n1. (Usually pl.)  A line of palisades serving as an exterior defense. [Written also bayle.] [Obs.] 2. The outer wall of a feudal castle. Hence: The space inclosed by it; the outer court. Holinshed. 3. A certain limit within a forest. [Eng.] 4. A division for the stalls of an open stable. 5. (Cricket)  The top or cross piece ( or either of the two cross pieces) of the wicket."}