{"word":"balance","definition":"1. An apparatus for weighing. Note: In its simplest form, a balance consists of a beam or lever supported exactly in the middle, having two scales or basins of equal weight suspended from its extremities. Another form is that of the Roman balance, our steelyard, consisting of a lever or beam, suspended near one of its extremities, on the longer arm of which a counterpoise slides. The name is also given to other forms of apparatus for weighing bodies, as to the combinations of levers making up platform scales; and even to devices for weighing by the elasticity of a spring. 2. Act of weighing mentally; comparison; estimate. A fair balance of the advantages on either side. Atterbury. 3. Equipoise between the weights in opposite scales. 4. The state of being in equipoise; equilibrium; even adjustment; steadiness. And hung a bottle on each side To make his balance true. Cowper. The order and balance of the country were destroyed. Buckle. English workmen completely lose their balance. J. S. Mill. 5. An equality between the sums total of the two sides of an account; as, to bring one's accounts to a balance; -- also, the excess on either side; as, the balance of an account. \" A balance at the banker's. \" Thackeray. I still think the balance of probabilities leans towards the account given in the text. J. Peile. 6. (Horol.)  A balance wheel, as of a watch, or clock. See Balance wheel (in the Vocabulary). 7. (Astron.) (a) The constellation Libra. (b) The seventh sign in the Zodiac, called Libra, which the sun enters at the equinox in September. 8. A movement in dancing. See Balance, v. i., S. Balance electrometer, a kind of balance, with a poised beam, which indicates, by weights suspended from one arm, the mutual attraction of oppositely electrified surfaces. Knight. -- Balance fish. (Zoöl) See Hammerhead. -- Balance knife, a carving or table knife the handle of which overbalances the blade, and so keeps it from contact with the table. -- Balance of power. (Politics), such an adjustment of power among sovereign states that no one state is in a position to interfere with the independence of the others; international equilibrium; also, the ability ( of a state or a third party within a state) to control the relations between sovereign states or between dominant parties in a state. -- Balance sheet (Bookkeeping), a paper showing the balances of the open accounts of a business, the debit and credit balances footing up equally, if the system of accounts be complete and the balances correctly taken. -- Balance thermometer, a thermometer mounted as a balance so that the movement of the mercurial column changes the indication of the tube. With the aid of electrical or mechanical devices adapted to it, it is used for the automatic regulation of the temperature of rooms warmed artificially, and as a fire alarm. -- Balance of torsion. See Torsion Balance. -- Balance of trade (Pol. Econ.), an equilibrium between the money values of the exports and imports of a country; or more commonly, the amount required on one side or the other to make such an equilibrium. -- Balance valve, a valve whose surfaces are so arranged that the fluid pressure tending to seat, and that tending to unseat the valve, are nearly in equilibrium; esp., a puppet valve which is made to operate easily by the admission of steam to both sides. See Puppet valve. -- Hydrostatic balance. See under Hydrostatic. -- To lay in balance, to put up as a pledge or security. [Obs.] Chaucer. -- To strike a balance, to find out the difference between the debit and credit sides of an account.\n\n1. To bring to an equipoise, as the scales of a balance by adjusting the weights; to weigh in a balance. 2. To support on a narrow base, so as to keep from falling; as, to balance a plate on the end of a cane; to balance one's self on a tight rope. 3. To equal in number, weight, force, or proportion; to counterpoise, counterbalance, counteract, or neutralize. One expression . . . must check and balance another. Kent. 4. To compare in relative force, importance, value, etc.; to estimate. Balance the good and evil of things. L'Estrange. 5. To settle and adjust, as an account; to make two accounts equal by paying the difference between them. I am very well satisfied that it is not in my power to balance accounts with my Maker. Addison. 6. To make the sums of the debits and credits of an account equal; -- said of an item; as, this payment, or credit, balances the account. 7. To arrange accounts in such a way that the sum total of the debits is equal to the sum total of the credits; as, to balance a set of books. 8. (Dancing)  To move toward, and then back from, reciprocally; as, to balance partners. 9. (Naut.)  To contract, as a sail, into a narrower compass; as, to balance the boom mainsail. Balanced valve. See Balance valve, under Balance, n. Syn. -- To poise; weigh; adjust; counteract; neutralize; equalize.\n\n1. To have equal weight on each side; to be in equipoise; as, the scales balance. 2. To fluctuate between motives which appear of equal force; to waver; to hesitate. He would not balance or err in the determination of his choice. Locke. 3. (Dancing)  To move toward a person or couple, and then back."}