{"word":"balk","definition":"1. A ridge of land left unplowed between furrows, or at the end of a field; a piece missed by the plow slipping aside. Bad plowmen made balks of such ground. Fuller. 2. A great beam, rafter, or timber; esp., the tie-beam of a house. The loft above was called \"the balks.\" Tubs hanging in the balks. Chaucer. 3. (Mil.)  One of the beams connecting the successive supports of a trestle bridge or bateau bridge. 4. A hindrance or disappointment; a check. A balk to the confidence of the bold undertaker. South. 5. A sudden and obstinate stop; a failure. 6. (Baseball)  A deceptive gesture of the pitcher, as if to deliver the ball. Balk line (Billiards), a line across a billiard table near one end, marking a limit within which the cue balls are placed in beginning a game; also, a line around the table, parallel to the sides, used in playing a particular game, called the balk line game.\n\n1. To leave or make balks in. [Obs.] Gower. 2. To leave heaped up; to heap up in piles. [Obs.] Ten thousand bold Scots, two and twenty knights, Balk'd in their own blood did Sir Walter see. Shak. 3. To omit, miss, or overlook by chance. [Obs.] 4. To miss intentionally; to avoid; to shun; to refuse; to let go by; to shirk. [Obs. or Obsolescent] By reason of the contagion then in London, we balked the Evelyn. Sick he is, and keeps his bed, and balks his meat. Bp. Hall. Nor doth he any creature balk, But lays on all he meeteth. Drayton. 5. To disappoint; to frustrate; to foil; to baffle; to as, to balk expectation. They shall not balk my entrance. Byron.\n\n1. To engage in contradiction; to be in opposition. [Obs.] In strifeful terms with him to balk. Spenser. 2. To stop abruptly and stand still obstinately; to jib; to stop short; to swerve; as, the horse balks. Note: This has been regarded as an Americanism, but it occurs in Spenser's \"Faërie Queene,\" Book IV., 10, xxv. Ne ever ought but of their true loves talkt, Ne ever for rebuke or blame of any balkt.\n\nTo indicate to fishermen, by shouts or signals from shore, the direction taken by the shoals of herring."}