{"word":"ball","definition":"1. Any round or roundish body or mass; a sphere or globe; as, a ball of twine; a ball of snow. 2. A spherical body of any substance or size used to play with, as by throwing, knocking, kicking, etc. 3. A general name for games in which a ball is thrown, kicked, or knocked. See Baseball, and Football. 4. Any solid spherical, cylindrical, or conical projectile of lead or iron, to be discharged from a firearm; as, a cannon ball; a rifball; -- often used collectively; as, powder and ball. Spherical balls for the smaller firearms are commonly called bullets. 5. (Pirotechnics & Mil.)  A flaming, roundish body shot into the air; a case filled with combustibles intended to burst and give light or set fire, or to produce smoke or stench; as, a fire ball; a stink ball. 6. (Print.)  A leather-covered cushion, fastened to a handle called a ballstock; -- formerly used by printers for inking the form, but now superseded by the roller. 7. A roundish protuberant portion of some part of the body; as, the ball of the thumb; the ball of the foot. 8. (Far.)  A large pill, a form in which medicine is commonly given to horses; a bolus. White. 9. The globe or earth. Pope. Move round the dark terrestrial ball. Addison. Ball and socket joint, a joint in which a ball moves within a socket, so as to admit of motion in every direction within certain limits. -- Ball bearings, a mechanical device for lessening the friction of axle bearings by means of small loose metal balls. -- Ball cartridge, a cartridge containing a ball, as distinguished from a blank cartridge, containing only powder. -- Ball cock, a faucet or valve which is opened or closed by the fall or rise of a ball floating in water at the end of a lever. -- Ball gudgeon, a pivot of a spherical form, which permits lateral deflection of the arbor or shaft, while retaining the pivot in its socket. Knight. -- Ball lever, the lever used in a ball cock. -- Ball of the eye, the eye itself, as distinguished from its lids and socket; -- formerly, the pupil of the eye. -- Ball valve (Mach.), a contrivance by which a ball, placed in a circular cup with a hole in its bottom, operates as a valve. -- Ball vein (Mining), a sort of iron ore, found in loose masses of a globular form, containing sparkling particles. -- Three balls, or Three golden balls, a pawnbroker's sign or shop. Syn. -- See Globe.\n\nTo gather balls which cling to the feet, as of damp snow or clay; to gather into balls; as, the horse balls; the snow balls.\n\n1. (Metal.)  To heat in a furnace and form into balls for rolling. 2. To form or wind into a ball; as, to ball cotton.\n\nA social assembly for the purpose of dancing."}