{"word":"balsam","definition":"1. A resin containing more or less of an essential or volatile oil. Note: The balsams are aromatic resinous substances, flowing spontaneously or by incision from certain plants. A great variety of substances pass under this name, but the term is now usually restricted to resins which, in addition to a volatile oil, contain benzoic and cinnamic acid. Among the true balsams are the balm of Gilead, and the balsams of copaiba, Peru, and Tolu. There are also many pharmaceutical preparations and resinous substances, possessed of a balsamic smell, to which the name balsam has been given. 2. (Bot.) (a) A species of tree (Abies balsamea). (b) An annual garden plant (Impatiens balsamina) with beautiful flowers; balsamine. 3. Anything that heals, soothes, or restores. Was not the people's blessing a balsam to thy blood Tennyson. Balsam apple (Bot.), an East Indian plant ( Momordica balsamina), of the gourd family, with red or orange-yellow cucumber-shaped fruit of the size of a walnut, used as a vulnerary, and in liniments and poultices. -- Balsam fir (Bot.), the American coniferous tree, Abies balsamea, from which the useful Canada balsam is derived. -- Balsam of copaiba. See Copaiba. -- Balsam of Mecca, balm of Gilead. -- Balsam of Peru, a reddish brown, syrupy balsam, obtained from a Central American tree ( Myroxylon Pereiræ and used as a stomachic and expectorant, and in the treatment of ulcers, etc. It was long supposed to be a product of Peru. -- Balsam of Tolu, a reddish or yellowish brown semisolid or solid balsam, obtained from a South American tree ( Myxoxylon toluiferum.). It is highly fragrant, and is used as a stomachic and expectorant. -- Balsam tree, any tree from which balsam is obtained, esp. the Abies balsamea. -- Canada balsam, Balsam of fir, Canada turpentine, a yellowish, viscid liquid, which, by time and exposure, becomes a transparent solid mass. It is obtained from the balm of Gilead (or balsam) fir (Abies balsamea) by breaking the vesicles upon the trunk and branches. See Balm.\n\nTo treat or anoint with balsam; to relieve, as with balsam; to render balsamic."}