{"word":"be","definition":"1. To exist actually, or in the world of fact; to have ex To be contents his natural desire. Pope. To be, or not to be: that is the question. Shak. 2. To exist in a certain manner or relation, -- whether as a reality or as a product of thought; to exist as the subject of a certain predicate, that is, as having a certain attribute, or as belonging to a certain sort, or as identical with what is specified, -- a word or words for the predicate being annexed; as, to be happy; to be here; to be large, or strong; to be an animal; to be a hero; to be a nonentity; three and two are five; annihilation is the cessation of existence; that is the man. 3. To take place; to happen; as, the meeting was on Thursday. 4. To signify; to represent or symbolize; to answer to. The field is the world. Matt. xiii. 38. The seven candlesticks which thou sawest are the seven churches. Rev. i. 20. Note: The verb to be (including the forms is, was, etc.) is used in forming the passive voice of other verbs; as, John has been struck by James. It is also used with the past participle of many intransitive verbs to express a state of the subject. But have is now more commonly used as the auxiliary, though expressing a different sense; as, \"Ye have come too late -- but ye are come. \" \"The minstrel boy to the war is gone.\" The present and imperfect tenses form, with the infinitive, a particular future tense, which expresses necessity, duty, or purpose; as, government is to be supported; we are to pay our just debts; the deed is to be signed to-morrow. Note: Have or had been, followed by to, implies movement. \"I have been to Paris.\" Sydney Smith. \"Have you been to Franchard \" R. L. Stevenson. Note: Been, or ben, was anciently the plural of the indicative present. \"Ye ben light of the world.\" Wyclif, Matt. v. 14. Afterwards be was used, as in our Bible: \"They that be with us are more than they that be with them.\" 2 Kings vi. 16. Ben was also the old infinitive: \"To ben of such power.\" R. of Gloucester. Be is used as a form of the present subjunctive: \"But if it be a question of words and names.\" Acts xviii. 15. But the indicative forms, is and are, with if, are more commonly used. Be it so, a phrase of supposition, equivalent to suppose it to be so; or of permission, signifying let it be so. Shak. -- If so be, in case. -- To be from, to have come from; as, from what place are you I am from Chicago. -- To let be, to omit, or leave untouched; to let alone. \"Let be, therefore, my vengeance to dissuade.\" Spenser. Syn. -- To be, Exist. The verb to be, except in a few rare case, like that of Shakespeare's \"To be, or not to be\", is used simply as a copula, to connect a subject with its predicate; as, man is mortal; the soul is immortal. The verb to exist is never properly used as a mere copula, but points to things that stand forth, or have a substantive being; as, when the soul is freed from all corporeal alliance, then it truly exists. It is not, therefore, properly synonymous with to be when used as a copula, though occasionally made so by some writers for the sake of variety; as in the phrase \"there exists [is] no reason for laying new taxes.\" We may, indeed, say, \"a friendship has long existed between them,\" instead of saying, \"there has long been a friendship between them;\" but in this case, exist is not a mere copula. It is used in its appropriate sense to mark the friendship as having been long in existence.\n\nA prefix, originally the same word as by; joined with verbs, it serves: (a) To intensify the meaning; as, bespatter, bestir. (b) To render an intransitive verb transitive; as, befall (to fall upon); bespeak (to speak for). (c) To make the action of a verb particular or definite; as, beget (to get as offspring); beset (to set around). Note: It is joined with certain substantives, and a few adjectives, to form verbs; as, bedew, befriend, benight, besot; belate (to make late); belittle (to make little). It also occurs in certain nouns, adverbs, and prepositions, often with something of the force of the preposition by, or about; as, belief (believe), behalf, bequest (bequeath); because, before, beneath, beside, between. In some words the original force of be is obscured or lost; as, in become, begin, behave, behoove, belong."}