{"word":"beam","definition":"1. Any large piece of timber or iron long in proportion to its thickness, and prepared for use. 2. One of the principal horizontal timbers of a building or ship. The beams of a vessel are strong pieces of timber stretching across from side to side to support the decks. Totten. 3. The width of a vessel; as, one vessel is said to have more beam than another. 4. The bar of a balance, from the ends of which the scales are suspended. The doubtful beam long nods from side to side. Pope. 5. The principal stem or horn of a stag or other deer, which bears the antlers, or branches. 6. The pole of a carriage. [Poetic] Dryden. 7. A cylinder of wood, making part of a loom, on which weavers wind the warp before weaving; also, the cylinder on which the cloth is rolled, as it is woven; one being called the fore beam, the other the back beam. 8. The straight part or shank of an anchor. 9. The main part of a plow, to which the handles and colter are secured, and to the end of which are attached the oxen or horses that draw it. 10. (Steam Engine)  A heavy iron lever having an oscillating motion on a central axis, one end of which is connected with the piston rod from which it receives motion, and the other with the crank of the wheel shaft; -- called also working beam or walking beam. 11. A ray or collection of parallel rays emitted from the sun or other luminous body; as, a beam of light, or of heat. How far that little candle throws his beams ! Shak. 12. Fig.: A ray; a gleam; as, a beam of comfort. Mercy with her genial beam. Keble. 13. One of the long feathers in the wing of a hawk; -- called also beam feather. Abaft the beam (Naut.), in an arc of the horizon between a line that crosses the ship at right angles, or in the direction of her beams, and that point of the compass toward which her stern is directed. -- Beam center (Mach.), the fulcrum or pin on which the working beam of an engine vibrates. -- Beam compass, an instrument consisting of a rod or beam, having sliding sockets that carry steel or pencil points; -- used for drawing or describing large circles. -- Beam engine, a steam engine having a working beam to transmit power, in distinction from one which has its piston rod attached directly to the crank of the wheel shaft. -- Before the beam (Naut.), in an arc of the horizon included between a line that crosses the ship at right angles and that point of the compass toward which the ship steers. -- On the beam , in a line with the beams, or at right angled with the keel. -- On the weather beam, on the side of a ship which faces the wind. -- To be on her beam ends, to incline, as a vessel, so much on one side that her beams approach a vertical position.\n\nTo send forth; to emit; -- followed ordinarily by forth; as, to beam forth light.\n\nTo emit beams of light. He beamed, the daystar of the rising age. Trumbull."}