{"word":"beat","definition":"1. To strike repeatedly; to lay repeated blows upon; as, to beat one's breast; to beat iron so as to shape it; to beat grain, in order to force out the seeds; to beat eggs and sugar; to beat a drum. Thou shalt beat some of it [spices] very small. Ex. xxx. 36. They did beat the gold into thin plates. Ex. xxxix. 3. 2. To punish by blows; to thrash. 3. To scour or range over in hunting, accompanied with the noise made by striking bushes, etc., for the purpose of rousing game. To beat the woods, and rouse the bounding prey. Prior. 4. To dash against, or strike, as with water or wind. A frozen continent . . . beat with perpetual storms. Milton. 5. To tread, as a path. Pass awful gulfs, and beat my painful way. Blackmore. 6. To overcome in a battle, contest, strife, race, game, etc.; to vanquish or conquer; to surpass. He beat them in a bloody battle. Prescott. For loveliness, it would be hard to beat that. M. Arnold. 7. To cheat; to chouse; to swindle; to defraud; -- often with out. [Colloq.] 8. To exercise severely; to perplex; to trouble. Why should any one . . . beat his head about the Latin grammar who does not intend to be a critic Locke. 9. (Mil.)  To give the signal for, by beat of drum; to sound by beat of drum; as, to beat an alarm, a charge, a parley, a retreat; to beat the general, the reveille, the tattoo. See Alarm, Charge, Parley, etc. To beat down, to haggle with (any one) to secure a lower price; to force down. [Colloq.] -- To beat into, to teach or instill, by repetition. -- To beat off, to repel or drive back. -- To beat out, to extend by hammering. -- To beat out of a thing, to cause to relinquish it, or give it up. \"Nor can anything beat their posterity out of it to this day.\" South. -- To beat the dust. (Man.) (a) To take in too little ground with the fore legs, as a horse. (b) To perform curvets too precipitately or too low. -- To beat the hoof, to walk; to go on foot. -- To beat the wing, to flutter; to move with fluttering agitation. -- To beat time, to measure or regulate time in music by the motion of the hand or foot. -- To beat up, to attack suddenly; to alarm or disturb; as, to beat up an enemy's quarters. Syn. -- To strike; pound; bang; buffet; maul; drub; thump; baste; thwack; thrash; pommel; cudgel; belabor; conquer; defeat; vanquish; overcome.\n\n1. To strike repeatedly; to inflict repeated blaows; to knock vigorously or loudly. The men of the city . . . beat at the door. Judges. xix. 22. 2. To move with pulsation or throbbing. A thousand hearts beat happily. Byron. 3. To come or act with violence; to dash or fall with force; to strike anything, as, rain, wind, and waves do. Sees rolling tempests vainly beat below. Dryden. They [winds] beat at the crazy casement. Longfellow. The sun beat upon the head of Jonah, that he fainted, and wisbed in himself to die. Jonah iv. 8. Public envy seemeth to beat chiefly upon ministers. Bacon. 4. To be in agitation or doubt. [Poetic] To still my beating mind. Shak . 5. (Naut.)  To make progress against the wind, by sailing in a zigzag line or traverse. 6. To make a sound when struck; as, the drums beat. 7. (Mil.)  To make a succession of strokes on a drum; as, the drummers beat to call soldiers to their quarters. 8. (Acoustics & Mus.)  To sound with more or less rapid alternations of greater and less intensity, so as to produce a pulsating effect; -- said of instruments, tones, or vibrations, not perfectly in unison. A beating wind (Naut.), a wind which necessitates tacking in order to make progress. -- To beat about, to try to find; to search by various means or ways. Addison. -- To beat about the bush, to approach a subject circuitously. -- To beat up and down (Hunting), to run first one way and then another; -- said of a stag. -- To beat up for recruits, to go diligently about in order to get helpers or participators in an enterprise.\n\n1. A stroke; a blow. He, with a careless beat, Struck out the mute creation at a heat. Dryden. 2. A recurring stroke; a throb; a pulsation; as, a beat of the heart; the beat of the pulse. 3. (Mus.) (a) The rise or fall of the hand or foot, marking the divisions of time; a division of the measure so marked. In the rhythm of music the beat is the unit. (b) A transient grace note, struck immediately before the one it is intended to ornament. 4. (Acoustics & Mus.)  A sudden swelling or reënforcement of a sound, recurring at regular intervals, and produced by the interference of sound waves of slightly different periods of vibrations; applied also, by analogy, to other kinds of wave motions; the pulsation or throbbing produced by the vibrating together of two tones not quite in unison. See Beat, v. i., 8. 5. A round or course which is frequently gone over; as, a watchman's beat. 6. A place of habitual or frequent resort. 7. A cheat or swindler of the lowest grade; -- often emphasized by dead; as, a dead beat. [Low] Beat of drum (Mil.), a succession of strokes varied, in different ways, for particular purposes, as to regulate a march, to call soldiers to their arms or quarters, to direct an attack, or retreat, etc. -- Beat of a watch, or clock, the stroke or sound made by the action of the escapement. A clock is in beat or out of beat, according as the strokes is at equal or unequal intervals.\n\nWeary; tired; fatigued; exhausted. [Colloq.] Quite beat, and very much vexed and disappointed. Dickens."}