{"word":"bee","definition":"p. p. of Be; -- used for been. [Obs.] Spenser.\n\n1. (Zoöl.)  An insect of the order Hymenoptera, and family Apidæ (the honeybees), or family Andrenidæ (the solitary bees.) See Honeybee. Note: There are many genera and species. The common honeybee (Apis mellifica) lives in swarms, each of which has its own queen, its males or drones, and its very numerous workers, which are barren females. Besides the A. mellifica there are other species and varieties of honeybees, as the A. ligustica of Spain and Italy; the A. Indica of India; the A. fasciata of Egypt. The bumblebee is a species of Bombus. The tropical honeybees belong mostly to Melipoma and Trigona. 2. A neighborly gathering of people who engage in united labor for the benefit of an individual or family; as, a quilting bee; a husking bee; a raising bee. [U. S.] The cellar . . . was dug by a bee in a single day. S. G. Goodrich. 3. pl. Etym: [Prob. fr. AS. beáh ring, fr. b to bend. See 1st Bow.] (Naut.)  Pieces of hard wood bolted to the sides of the bowsprit, to reeve the fore-topmast stays through; -- called also bee blocks. Bee beetle (Zoöl.), a beetle (Trichodes apiarius) parasitic in beehives. -- Bee bird (Zoöl.), a bird that eats the honeybee, as the European flycatcher, and the American kingbird. -- Bee flower (Bot.), an orchidaceous plant of the genus Ophrys (O. apifera), whose flowers have some resemblance to bees, flies, and other insects. -- Bee fly (Zoöl.), a two winged fly of the family Bombyliidæ. Some species, in the larval state, are parasitic upon bees. -- Bee garden, a garden or inclosure to set beehives in ; an apiary. Mortimer. -- Bee glue, a soft, unctuous matter, with which bees cement the combs to the hives, and close up the cells; -- called also propolis. -- Bee hawk (Zoöl.), the honey buzzard. -- Bee killer (Zoöl.), a large two-winged fly of the family Asilidæ (esp. Trupanea apivora) which feeds upon the honeybee. See Robber fly. -- Bee louse (Zoöl.), a minute, wingless, dipterous insect (Braula cæca) parasitic on hive bees. -- Bee martin (Zoöl.), the kingbird (Tyrannus Carolinensis) which occasionally feeds on bees. -- Bee moth (Zoöl.), a moth (Galleria cereana) whose larvæ feed on honeycomb, occasioning great damage in beehives. -- Bee wolf (Zoöl.), the larva of the bee beetle. See Illust. of Bee beetle. -- To have a bee in the head or in the bonnet. (a) To be choleric. [Obs.] (b) To be restless or uneasy. B. Jonson. (c) To be full of fancies; to be a little crazy. \"She's whiles crack-brained, and has a bee in her head.\" Sir W. Scott."}