{"word":"beg","definition":"A title of honor in Turkey and in some other parts of the East; a bey.\n\n1. To ask earnestly for; to entreat or supplicate for; to beseech. I do beg your good will in this case. Shak. [Joseph] begged the body of Jesus. Matt. xxvii. 58. Note: Sometimes implying deferential and respectful, rather than earnest, asking; as, I beg your pardon; I beg leave to disagree with you. 2. To ask for as a charity, esp. to ask for habitually or from house to house. Yet have I not seen the righteous forsaken, nor his seed begging bread. Ps. xxxvii. 25. 3. To make petition to; to entreat; as, to beg a person to grant a favor. 4. To take for granted; to assume without proof. 5. (Old Law)  To ask to be appointed guardian for, or to ask to have a guardian appointed for. Else some will beg thee, in the court of wards. Harrington. Hence: To beg (one) for a fool, to take him for a fool. I beg to, is an elliptical expression for I beg leave to; as, I beg to inform you. -- To bag the question, to assume that which was to be proved in a discussion, instead of adducing the proof or sustaining the point by argument. -- To go a-begging, a figurative phrase to express the absence of demand for something which elsewhere brings a price; as, grapes are so plentiful there that they go a-begging. Syn. -- To Beg, Ask, Request. To ask (not in the sense of inquiring) is the generic term which embraces all these words. To request is only a polite mode of asking. To beg, in its original sense, was to ask with earnestness, and implied submission, or at least deference. At present, however, in polite life, beg has dropped its original meaning, and has taken the place of both ask and request, on the ground of its expressing more of deference and respect. Thus, we beg a person's acceptance of a present; we beg him to favor us with his company; a tradesman begs to announce the arrival of new goods, etc. Crabb remarks that, according to present usage, \"we can never talk of asking a person's acceptance of a thing, or of asking him to do us a favor.\" This can be more truly said of usage in England than in America.\n\nTo ask alms or charity, especially to ask habitually by the wayside or from house to house; to live by asking alms. I can not dig; to beg I am ashamed. Luke xvi. 3."}