{"word":"bill","definition":"A beak, as of a bird, or sometimes of a turtle or other animal. Milton.\n\n1. To strike; to peck. [Obs.] 2. To join bills, as doves; to caress in fondness. \"As pigeons bill.\" Shak. To bill and coo, to interchange caresses; -- said of doves; also of demonstrative lovers. Thackeray.\n\nThe bell, or boom, of the bittern The bittern's hollow bill was heard. Wordsworth.\n\n1. A cutting instrument, with hook-shaped point, and fitted with a handle; -- used in pruning, etc.; a billhook. When short, called a hand bill, when long, a hedge bill. 2. A weapon of infantry, in the 14th and 15th centuries. A common form of bill consisted of a broad, heavy, double-edged, hook-shaped blade, having a short pike at the back and another at the top, and attached to the end of a long staff. France had no infantry that dared to face the English bows end bills. Macaulay. 3. One who wields a bill; a billman. Strype. 4. A pickax, or mattock. [Obs.] 5. (Naut.)  The extremity of the arm of an anchor; the point of or beyond the fluke.\n\nTo work upon ( as to dig, hoe, hack, or chop anything) with a bill.\n\n1. (Law)  A declaration made in writing, stating some wrong the complainant has suffered from the defendant, or a fault committed by some person against a law. 2. A writing binding the signer or signers to pay a certain sum at a future day or on demand, with or without interest, as may be stated in the document. [Eng.] Note: In the United States, it is usually called a note, a note of hand, or a promissory note. 3. A form or draft of a law, presented to a legislature for enactment; a proposed or projected law. 4. A paper, written or printed, and posted up or given away, to advertise something, as a lecture, a play, or the sale of goods; a placard; a poster; a handbill. She put up the bill in her parlor window. Dickens. 5. An account of goods sold, services rendered, or work done, with the price or charge; a statement of a creditor's claim, in gross or by items; as, a grocer's bill. 6. Any paper, containing a statement of particulars; as, a bill of charges or expenditures; a weekly bill of mortality; a bill of fare, etc. Bill of adventure. See under Adventure. -- Bill of costs, a statement of the items which form the total amount of the costs of a party to a suit or action. -- Bill of credit. (a) Within the constitution of the United States, a paper issued by a State, on the mere faith and credit of the State, and designed to circulate as money. No State shall \"emit bills of credit.\" U. S. Const. Peters. Wharton. Bouvier (b) Among merchants, a letter sent by an agent or other person to a merchant, desiring him to give credit to the bearer for goods or money. -- Bill of divorce, in the Jewish law, a writing given by the husband to the wife, by which the marriage relation was dissolved. Jer. iii. 8. -- Bill of entry, a written account of goods entered at the customhouse, whether imported or intended for exportation. -- Bill of exceptions. See under Exception. -- Bill of exchange (Com.), a written order or request from one person or house to another, desiring the latter to pay to some person designated a certain sum of money therein generally is, and, to be negotiable, must be, made payable to order or to bearer. So also the order generally expresses a specified time of payment, and that it is drawn for value. The person who draws the bil is called the drawer, the person on whom it is drawn is, before acceptance, called the drawee, -- after acceptance, the acceptor; the person to whom the money is directed to be paid is called the payee. The person making the order may himself be the payee. The bill itself is frequently called a draft. See Exchange. Chitty. -- Bill of fare, a written or printed enumeration of the dishes served at a public table, or of the dishes (with prices annexed) which may be ordered at a restaurant, etc. -- Bill of health, a certificate from the proper authorities as to the state of health of a ship's company at the time of her leaving port. -- Bill of indictment, a written accusation lawfully presented to a grand jury. If the jury consider the evidence sufficient to support the accusation, they indorse it \"A true bill,\" or \"Not found,\" or \"Ignoramus\", or \"Ignored.\" -- Bill of lading, a written account of goods shipped by any person, signed by the agent of the owner of the vessel, or by its master, acknowledging the receipt of the goods, and promising to deliver them safe at the place directed, dangers of the sea excepted. It is usual for the master to sign two, three, or four copies of the bill; one of which he keeps in possession, one is kept by the shipper, and one is sent to the consignee of the goods. -- Bill of mortality, an official statement of the number of deaths in a place or district within a given time; also, a district required to be covered by such statement; as, a place within the bills of mortality of London. -- Bill of pains and penalties, a special act of a legislature which inflicts a punishment less than death upon persons supposed to be guilty of treason or felony, without any conviction in the ordinary course of judicial proceedings. Bouvier. Wharton. -- Bill of parcels, an account given by the seller to the buyer of the several articles purchased, with the price of each. -- Bill of particulars (Law), a detailed statement of the items of a plaintiff's demand in an action, or of the defendant's set-off. -- Bill of rights, a summary of rights and privileges claimed by a people. Such was the declaration presented by the Lords and Commons of England to the Prince and Princess of Orange in 1688, and enacted in Parliament after they became king and queen. In America, a bill or declaration of rights is prefixed to most of the constitutions of the several States. -- Bill of sale, a formal instrument for the conveyance or transfer of goods and chattels. -- Bill of sight, a form of entry at the customhouse, by which goods, respecting which the importer is not possessed of full information, may be provisionally landed for examination. -- Bill of store, a license granted at the customhouse to merchants, to carry such stores and provisions as are necessary for a voyage, custom free. Wharton. -- Bills payable (pl.), the outstanding unpaid notes or acceptances made and issued by an individual or firm. -- Bills receivable (pl.), the unpaid promissory notes or acceptances held by an individual or firm. McElrath. -- A true bill, a bill of indictment sanctioned by a grand jury.\n\n1. To advertise by a bill or public notice. 2. To charge or enter in a bill; as, to bill goods."}