{"word":"bite","definition":"1. To seize with the teeth, so that they enter or nip the thing seized; to lacerate, crush, or wound with the teeth; as, to bite an apple; to bite a crust; the dog bit a man. Such smiling rogues as these, Like rats, oft bite the holy cords atwain. Shak. 2. To puncture, abrade, or sting with an organ (of some insects) used in taking food. 3. To cause sharp pain, or smarting, to; to hurt or injure, in a literal or a figurative sense; as, pepper bites the mouth. \"Frosts do bite the meads.\" Shak. 4. To cheat; to trick; to take in. [Colloq.] Pope. 5. To take hold of; to hold fast; to adhere to; as, the anchor bites the ground. The last screw of the rack having been turned so often that its purchase crumbled, . . . it turned and turned with nothing to bite. Dickens. To bite the dust, To bite the ground, to fall in the agonies of death; as, he made his enemy bite the dust. -- To bite in (Etching), to corrode or eat into metallic plates by means of an acid. -- To bite the thumb at (any one), formerly a mark of contempt, designed to provoke a quarrel; to defy. \"Do you bite your thumb at us \" Shak. -- To bite the tongue, to keep silence. Shak.\n\n1. To seize something forcibly with the teeth; to wound with the teeth; to have the habit of so doing; as, does the dog bite 2. To cause a smarting sensation; to have a property which causes such a sensation; to be pungent; as, it bites like pepper or mustard. 3. To cause sharp pain; to produce anguish; to hurt or injure; to have the property of so doing. At the last it [wine] biteth like serpent, and stingeth like an adder. Prov. xxiii. 32. 4. To take a bait into the mouth, as a fish does; hence, to take a tempting offer. 5. To take or keep a firm hold; as, the anchor bites.\n\n1. The act of seizing with the teeth or mouth; the act of wounding or separating with the teeth or mouth; a seizure with the teeth or mouth, as of a bait; as, to give anything a hard bite. I have known a very good fisher angle diligently four or six hours for a river carp, and not have a bite. Walton. 2. The act of puncturing or abrading with an organ for taking food, as is done by some insects. 3. The wound made by biting; as, the pain of a dog's or snake's bite; the bite of a mosquito. 4. A morsel; as much as is taken at once by biting. 5. The hold which the short end of a lever has upon the thing to be lifted, or the hold which one part of a machine has upon another. 6. A cheat; a trick; a fraud. [Colloq.] The baser methods of getting money by fraud and bite, by deceiving and overreaching. Humorist. 7. A sharper; one who cheats. [Slang] Johnson. 8. (Print.)  A blank on the edge or corner of a page, owing to a portion of the frisket, or something else, intervening between the type and paper."}