{"word":"blank","definition":"1. Of a white or pale color; without color. To the blank moon Her office they prescribed. Milton. 2. Free from writing, printing, or marks; having an empty space to be filled in with some special writing; -- said of checks, official documents, etc.; as, blank paper; a blank check; a blank ballot. 3. Utterly confounded or discomfited. Adam . . . astonied stood, and blank. Milton. 4. Empty; void; without result; fruitless; as, a blank space; a blank day. 5. Lacking characteristics which give variety; as, a blank desert; a blank wall; destitute of interests, affections, hopes, etc.; as, to live a blank existence; destitute of sensations; as, blank unconsciousness. 6. Lacking animation and intelligence, or their associated characteristics, as expression of face, look, etc.; expressionless; vacant. \"Blank and horror-stricken faces.\" C. Kingsley. The blank . . . glance of a half returned consciousness. G. Eliot. 7. Absolute; downright; unmixed; as, blank terror. Blank bar (Law), a plea put in to oblige the plaintiff in an action of trespass to assign the certain place where the trespass was committed; -- called also common bar. -- Blank cartridge, a cartridge containing no ball. -- Blank deed. See Deed. -- Blank door, or Blank window (Arch.), a depression in a wall of the size of a door or window, either for symmetrical effect, or for the more convenient insertion of a door or window at a future time, should it be needed. -- Blank indorsement (Law), an indorsement which omits the name of the person in whose favor it is made; it is usually made by simply writing the name of the indorser on the back of the bill. -- Blank line (Print.), a vacant space of the breadth of a line, on a printed page; a line of quadrats. -- Blank tire (Mech.), a tire without a flange. -- Blank tooling. See Blind tooling, under Blind. -- Blank verse. See under Verse. -- Blank wall, a wall in which there is no opening; a dead wall.\n\n1. Any void space; a void space on paper, or in any written instrument; an interval void of consciousness, action, result, etc; a void. I can not write a paper full, I used to do; and yet I will not forgive a blank of half an inch from you. Swift. From this time there ensues a long blank in the history of French legislation. Hallam. I was ill. I can't tell how long -- it was a blank. G. Eliot. 2. A lot by which nothing is gained; a ticket in a lottery on which no prize is indicated. In Fortune's lottery lies A heap of blanks, like this, for one small prize. Dryden. 3. A paper unwritten; a paper without marks or characters a blank ballot; -- especially, a paper on which are to be inserted designated items of information, for which spaces are left vacant; a bland form. The freemen signified their approbation by an inscribed vote, and their dissent by a blank. Palfrey. 4. A paper containing the substance of a legal instrument, as a deed, release, writ, or execution, with spaces left to be filled with names, date, descriptions, etc. 5. The point aimed at in a target, marked with a white spot; hence, the object to which anything is directed. Let me still remain The true blank of thine eye. Shak. 6. Aim; shot; range. [Obs.] I have stood . . . within the blank of his displeasure For my free speech. Shak. 7. A kind of base silver money, first coined in England by Henry V., and worth about 8 pence; also, a French coin of the seventeenth century, worth about 4 pence. Nares. 8. (Mech.)  A piece of metal prepared to be made into something by a further operation, as a coin, screw, nuts. 9. (Dominoes)  A piece or division of a piece, without spots; as, the \"double blank\"; the \"six blank.\" In blank, with an essential portion to be supplied by another; as, to make out a check in blank.\n\n1. To make void; to annul. [Obs.] Spenser. 2. To blanch; to make blank; to damp the spirits of; to dispirit or confuse. [Obs.] Each opposite that blanks the face of joy. Shak."}