{"word":"blast","definition":"1. A violent gust of wind. And see where surly Winter passes off, Far to the north, and calls his ruffian blasts; His blasts obey, and quit the howling hill. Thomson. 2. A forcible stream of air from an orifice, as from a bellows, the mouth, etc. Hence: The continuous blowing to which one charge of ore or metal is subjected in a furnace; as, to melt so many tons of iron at a blast. Note: The terms hot blast and cold blast are employed to designate whether the current is heated or not heated before entering the furnace. A blast furnace is said to be in blast while it is in operation, and out of blast when not in use. 3. The exhaust steam from and engine, driving a column of air out of a boiler chimney, and thus creating an intense draught through the fire; also, any draught produced by the blast. 4. The sound made by blowing a wind instrument; strictly, the sound produces at one breath. One blast upon his bugle horn Were worth a thousand men. Sir W. Scott. The blast of triumph o'er thy grave. Bryant. 5. A sudden, pernicious effect, as if by a noxious wind, especially on animals and plants; a blight. By the blast of God they perish. Job iv. 9. Virtue preserved from fell destruction's blast. Shak. 6. The act of rending, or attempting to rend, heavy masses of rock, earth, etc., by the explosion of gunpowder, dynamite, etc.; also, the charge used for this purpose. \"Large blasts are often used.\" Tomlinson. 7. A flatulent disease of sheep. Blast furnace, a furnace, usually a shaft furnace for smelting ores, into which air is forced by pressure. -- Blast hole, a hole in the bottom of a pump stock through which water enters. -- Blast nozzle, a fixed or variable orifice in the delivery end of a blast pipe; -- called also blast orifice. -- In full blast, in complete operation; in a state of great activity. See Blast, n., 2. [Colloq.]\n\n1. To injure, as by a noxious wind; to cause to wither; to stop or check the growth of, and prevent from fruit-bearing, by some pernicious influence; to blight; to shrivel. Seven thin ears, and blasted with the east wind. Gen. xii. 6. 2. Hence, to affect with some sudden violence, plague, calamity, or blighting influence, which destroys or causes to fail; to visit with a curse; to curse; to ruin; as, to blast pride, hopes, or character. I'll cross it, though it blast me. Shak. Blasted with excess of light. T. Gray. 3. To confound by a loud blast or din. Trumpeters, With brazen din blast you the city's ear. Shak. 4. To rend open by any explosive agent, as gunpowder, dynamite, etc.; to shatter; as, to blast rocks.\n\n1. To be blighted or withered; as, the bud blasted in the blossom. 2. To blow; to blow on a trumpet. [Obs.] Toke his blake trumpe faste And gan to puffen and to blaste. Chaucer."}