{"word":"blind","definition":"1. Destitute of the sense of seeing, either by natural defect or by deprivation; without sight. He that is strucken blind can not forget The precious treasure of his eyesight lost. Shak. 2. Not having the faculty of discernment; destitute of intellectual light; unable or unwilling to understand or judge; as, authors are blind to their own defects. But hard be hardened, blind be blinded more, That they may stumble on, and deeper fall. Milton. 3. Undiscerning; undiscriminating; inconsiderate. This plan is recommended neither to blind approbation nor to blind reprobation. Jay. 4. Having such a state or condition as a thing would have to a person who is blind; not well marked or easily discernible; hidden; unseen; concealed; as, a blind path; a blind ditch. 5. Involved; intricate; not easily followed or traced. The blind mazes of this tangled wood. Milton. 6. Having no openings for light or passage; as, a blind wall; open only at one end; as, a blind alley; a blind gut. 7. Unintelligible, or not easily intelligible; as, a blind passage in a book; illegible; as, blind writing. 8. (Hort.)  Abortive; failing to produce flowers or fruit; as, blind buds; blind flowers. Blind alley, an alley closed at one end; a cul-de-sac. -- Blind axle, an axle which turns but does not communicate motion. Knight. -- Blind beetle, one of the insects apt to fly against people, esp. at night. -- Blind cat (Zoöl.), a species of catfish (Gronias nigrolabris), nearly destitute of eyes, living in caverns in Pennsylvania. -- Blind coal, coal that burns without flame; anthracite coal. Simmonds. -- Blind door, Blind window, an imitation of a door or window, without an opening for passage or light. See Blank door or window, under Blank, a. -- Blind level (Mining), a level or drainage gallery which has a vertical shaft at each end, and acts as an inverted siphon. Knight. -- Blind nettle (Bot.), dead nettle. See Dead nettle, under Dead. -- Blind shell (Gunnery), a shell containing no charge, or one that does not explode. -- Blind side, the side which is most easily assailed; a weak or unguarded side; the side on which one is least able or disposed to see danger. Swift. -- Blind snake (Zoöl.), a small, harmless, burrowing snake, of the family Typhlopidæ, with rudimentary eyes. -- Blind spot (Anat.), the point in the retina of the eye where the optic nerve enters, and which is insensible to light. -- Blind tooling, in bookbinding and leather work, the indented impression of heated tools, without gilding; -- called also blank tooling, and blind blocking. -- Blind wall, a wall without an opening; a blank wall.\n\n1. To make blind; to deprive of sight or discernment. \"To blind the truth and me.\" Tennyson. A blind guide is certainly a great mischief; but a guide that blinds those whom he should lead is . . . a much greater. South. 2. To deprive partially of vision; to make vision difficult for and painful to; to dazzle. Her beauty all the rest did blind. P. Fletcher. 3. To darken; to obscure to the eye or understanding; to conceal; to deceive. Such darkness blinds the sky. Dryden. The state of the controversy between us he endeavored, with all his art, to blind and confound. Stillingfleet. 4. To cover with a thin coating of sand and fine gravel; as a road newly paved, in order that the joints between the stones may be filled.\n\n1. Something to hinder sight or keep out light; a screen; a cover; esp. a hinged screen or shutter for a window; a blinder for a horse. 2. Something to mislead the eye or the understanding, or to conceal some covert deed or design; a subterfuge. 3. Etym: [Cf. F. blindes, pblende, fr. blenden to blind, fr. blind blind.] (Mil.)  A blindage. See Blindage. 4. A halting place. [Obs.] Dryden.\n\nSee Blende."}