{"word":"blood","definition":"1. The fluid which circulates in the principal vascular system of animals, carrying nourishment to all parts of the body, and bringing away waste products to be excreted. See under Arterial. Note: The blood consists of a liquid, the plasma, containing minute particles, the blood corpuscles. In the invertebrate animals it is usually nearly colorless, and contains only one kind of corpuscles; but in all vertebrates, except Amphioxus, it contains some colorless corpuscles, with many more which are red and give the blood its uniformly red color. See Corpuscle, Plasma. 2. Relationship by descent from a common ancestor; consanguinity; kinship. To share the blood of Saxon royalty. Sir W. Scott. A friend of our own blood. Waller. Half blood (Law), relationship through only one parent. -- Whole blood, relationship through both father and mother. In American Law, blood includes both half blood, and whole blood. Bouvier. Peters. 3. Descent; lineage; especially, honorable birth; the highest royal lineage. Give us a prince of blood, a son of Priam. Shak. I am a gentleman of blood and breeding. Shak. 4. (Stock Breeding)  Descent from parents of recognized breed; excellence or purity of breed. Note: In stock breeding half blood is descent showing one half only of pure breed. Blue blood, full blood, or warm blood, is the same as blood. 5. The fleshy nature of man. Nor gives it satisfaction to our blood. Shak. 6. The shedding of blood; the taking of life, murder; manslaughter; destruction. So wills the fierce, avenging sprite, Till blood for blood atones. Hood. 7. A bloodthirsty or murderous disposition. [R.] He was a thing of blood, whose every motion Was timed with dying cries. Shak. 8. Temper of mind; disposition; state of the passions; -- as if the blood were the seat of emotions. When you perceive his blood inclined to mirth. Shak. Note: Often, in this sense, accompanied with bad, cold, warm, or other qualifying word. Thus, to commit an act in cold blood, is to do it deliberately, and without sudden passion; to do it in bad blood, is to do it in anger. Warm blood denotes a temper inflamed or irritated. To warm or heat the blood is to excite the passions. Qualified by up, excited feeling or passion is signified; as, my blood was up. 9. A man of fire or spirit; a fiery spark; a gay, showy man; a rake. Seest thou not . . . how giddily 'a turns about all the hot bloods between fourteen and five and thirty Shak. It was the morning costume of a dandy or blood. Thackeray. 10. The juice of anything, especially if red. He washed . . . his clothes in the blood of grapes. Gen. xiix. 11. Note: Blood is often used as an adjective, and as the first part of self-explaining compound words; as, blood-bespotted, blood-bought, blood-curdling, blood-dyed, blood-red, blood-spilling, blood-stained, blood-warm, blood-won. Blood baptism (Eccl. Hist.), the martyrdom of those who had not been baptized. They were considered as baptized in blood, and this was regarded as a full substitute for literal baptism. -- Blood blister, a blister or bleb containing blood or bloody serum, usually caused by an injury. -- Blood brother, brother by blood or birth. -- Blood clam (Zoöl.), a bivalve mollusk of the genus Arca and allied genera, esp. Argina pexata of the American coast. So named from the color of its flesh. -- Blood corpuscle. See Corpuscle. -- Blood crystal (Physiol.), one of the crystals formed by the separation in a crystalline form of the hæmoglobin of the red blood corpuscles; hæmatocrystallin. All blood does not yield blood crystals. -- Blood heat, heat equal to the temperature of human blood, or about 98½ º Fahr. -- Blood horse, a horse whose blood or lineage is derived from the purest and most highly prized origin or stock. -- Blood money. See in the Vocabulary. -- Blood orange, an orange with dark red pulp. -- Blood poisoning (Med.), a morbid state of the blood caused by the introduction of poisonous or infective matters from without, or the absorption or retention of such as are produced in the body itself; toxæmia. -- Blood pudding, a pudding made of blood and other materials. -- Blood relation, one connected by blood or descent. -- Blood spavin. See under Spavin. -- Blood vessel. See in the Vocabulary. -- Blue blood, the blood of noble or aristocratic families, which, according to a Spanish prover , has in it a tinge of blue; -- hence, a member of an old and aristocratic family. -- Flesh and blood. (a) A blood relation, esp. a child. (b) Human nature. -- In blood (Hunting), in a state of perfect health and vigor. Shak. -- To let blood. See under Let. -- Prince of the blood, the son of a sovereign, or the issue of a royal family. The sons, brothers, and uncles of the sovereign are styled princes of the blood royal; and the daughters, sisters, and aunts are princesses of the blood royal.\n\n1. To bleed. [Obs.] Cowper. 2. To stain, smear or wet, with blood. [Archaic] Reach out their spears afar, And blood their points. Dryden. 3. To give (hounds or soldiers) a first taste or sight of blood, as in hunting or war. It was most important too that his troops should be blooded. Macaulay. 4. To heat the blood of; to exasperate. [Obs.] The auxiliary forces of the French and English were much blooded one against another. Bacon."}