{"word":"bob","definition":"1. Anything that hangs so as to play loosely, or with a short abrupt motion, as at the end of a string; a pendant; as, the bob at the end of a kite's tail. In jewels dressed and at each ear a bob. Dryden. 2. A knot of worms, or of rags, on a string, used in angling, as for eels; formerly, a worm suitable for bait. Or yellow bobs, turned up before the plow, Are chiefest baits, with cork and lead enow. Lauson. 3. A small piece of cork or light wood attached to a fishing line to show when a fish is biting; a float. 4. The ball or heavy part of a pendulum; also, the ball or weight at the end of a plumb line. 5. A small wheel, made of leather, with rounded edges, used in polishing spoons, etc. 6. A short, jerking motion; act of bobbing; as, a bob of the head. 7. (Steam Engine)  A working beam. 8. A knot or short curl of hair; also, a bob wig. A plain brown bob he wore. Shenstone. 9. A peculiar mode of ringing changes on bells. 10. The refrain of a song. To bed, to bed, will be the bob of the song. L'Estrange. 11. A blow; a shake or jog; a rap, as with the fist. 12. A jeer or flout; a sharp jest or taunt; a trick. He that a fool doth very wisely hit, Doth very foolishly, although he smart, Not to seem senseless of the bob. Shak. 13. A shilling. [Slang, Eng.] Dickens.\n\n1. To cause to move in a short, jerking manner; to move (a thing) with a bob. \"He bobbed his head.\" W. Irving. 2. To strike with a quick, light blow; to tap. If any man happened by long sitting to sleep . . . he was suddenly bobbed on the face by the servants. Elyot. 3. To cheat; to gain by fraud or cheating; to filch. Gold and jewels that I bobbed from him. Shak. 4. To mock or delude; to cheat. To play her pranks, and bob the fool, The shrewish wife began. Turbervile. 5. To cut short; as, to bob the hair, or a horse's tail.\n\n1. To have a short, jerking motion; to play to and fro, or up and down; to play loosely against anything. \"Bobbing and courtesying.\" Thackeray. 2. To angle with a bob. See Bob, n., 2 & 3. He ne'er had learned the art to bob For anything but eels. Saxe. To bob at an apple, cherry, etc. to attempt to bite or seize with the mouth an apple, cherry, or other round fruit, while it is swinging from a string or floating in a tug of water."}