{"word":"bolster","definition":"1. A long pillow or cushion, used to support the head of a person lying on a bed; -- generally laid under the pillows. And here I'll fling the pillow, there the bolster, This way the coverlet, another way the sheets. Shak. 2. A pad, quilt, or anything used to hinder pressure, support any part of the body, or make a bandage sit easy upon a wounded part; a compress. This arm shall be a bolster for thy head. Gay. 3. Anything arranged to act as a support, as in various forms of mechanism, etc. 4. (Saddlery)  A cushioned or a piece part of a saddle. 5. (Naut.) (a) A cushioned or a piece of soft wood covered with tarred canvas, placed on the trestletrees and against the mast, for the collars of the shrouds to rest on, to prevent chafing. (b) Anything used to prevent chafing. 6. A plate of iron or a mass of wood under the end of a bridge girder, to keep the girder from resting directly on the abutment. 7. A transverse bar above the axle of a wagon, on which the bed or body rests. 8. The crossbeam forming the bearing piece of the body of a railway car; the central and principal cross beam of a car truck. 9. (Mech.)  the perforated plate in a punching machine on which anything rests when being punched. 10. (Cutlery) (a) That part of a knife blade which abuts upon the end of the handle. (b) The metallic end of a pocketknife handle. G. Francis. 11. (Arch.)  The rolls forming the ends or sides of the Ionic capital. G. Francis. 12. (Mil.)  A block of wood on the carriage of a siege gun, upon which the breech of the gun rests when arranged for transportation. Note: [See Illust. of Gun carriage.] Bolster work (Arch.), members which are bellied or curved outward like cushions, as in friezes of certain classical styles.\n\n1. To support with a bolster or pillow. S. Sharp. 2. To support, hold up, or maintain with difficulty or unusual effort; -- often with up. To bolster baseness. Drayton. Shoddy inventions designed to bolster up a factitious pride. Compton Reade."}