{"word":"boom","definition":"1. (Naut.)  A long pole or spar, run out for the purpose of extending the bottom of a particular sail; as, the jib boom, the studding-sail boom, etc. 2. (Mech.)  A long spar or beam, projecting from the mast of a derrick, from the outer end of which the body to be lifted is suspended. 3. A pole with a conspicuous top, set up to mark the channel in a river or harbor. [Obs.] 4. (Mil. & Naval)  A strong chain cable, or line of spars bound together, extended across a river or the mouth of a harbor, to obstruct navigation or passage. 5. (Lumbering)  A line of connected floating timbers stretched across a river, or inclosing an area of water, to keep saw logs, etc., from floating away. Boom iron, one of the iron rings on the yards through which the studding-sail booms traverse. -- The booms, that space on the upper deck of a ship between the foremast and mainmast, where the boats, spare spars, etc., are stowed. Totten.\n\nTo extend, or push, with a boom or pole; as, to boom out a sail; to boom off a boat.\n\n1. To cry with a hollow note; to make a hollow sound, as the bittern, and some insects. At eve the beetle boometh Athwart the thicket lone. Tennyson. 2. To make a hollow sound, as of waves or cannon. Alarm guns booming through the night air. W. Irving. 3. To rush with violence and noise, as a ship under a press of sail, before a free wind. She comes booming down before it. Totten. 4. To have a rapid growth in market value or in popular favor; to go on rushingly.\n\n1. A hollow roar, as of waves or cannon; also, the hollow cry of the bittern; a booming. 2. A strong and extensive advance, with more or less noisy excitement; -- applied colloquially or humorously to market prices, the demand for stocks or commodities and to political chances of aspirants to office; as, a boom in the stock market; a boom in coffee. [Colloq. U. S.]\n\nTo cause to advance rapidly in price; as, to boom railroad or mining shares; to create a \"boom\" for; as to boom Mr. C. for senator. [Colloq. U. S.]"}