{"word":"bore","definition":"1. To perforate or penetrate, as a solid body, by turning an auger, gimlet, drill, or other instrument; to make a round hole in or through; to pierce; as, to bore a plank. I'll believe as soon this whole earth may be bored. Shak. 2. To form or enlarge by means of a boring instrument or apparatus; as, to bore a steam cylinder or a gun barrel; to bore a hole. Short but very powerful jaws, by means whereof the insect can bore, as with a centerbit, a cylindrical passage through the most solid wood. T. W. Harris. 3. To make (a passage) by laborious effort, as in boring; as, to bore one's way through a crowd; to force a narrow and difficult passage through. \"What bustling crowds I bored.\" Gay. 4. To weary by tedious iteration or by dullness; to tire; to trouble; to vex; to annoy; to pester. He bores me with some trick. Shak. Used to come and bore me at rare intervals. Carlyle. 5. To befool; to trick. [Obs.] I am abused, betrayed; I am laughed at, scorned, Baffled and bored, it seems. Beau. & Fl.\n\n1. To make a hole or perforation with, or as with, a boring instrument; to cut a circular hole by the rotary motion of a tool; as, to bore for water or oil (i. e., to sink a well by boring for water or oil); to bore with a gimlet; to bore into a tree (as insects). 2. To be pierced or penetrated by an instrument that cuts as it turns; as, this timber does not bore well, or is hard to bore. 3. To push forward in a certain direction with laborious effort. They take their flight . . . boring to the west. Dryden. 4. (Ma  To shoot out the nose or toss it in the air; Crabb.\n\n1. A hole made by boring; a perforation. 2. The internal cylindrical cavity of a gun, cannon, pistol, or other firearm, or of a pipe or tube. The bores of wind instruments. Bacon. Love's counselor should fill the bores of hearing. Shak. 3. The size of a hole; the interior diameter of a tube or gun barrel; the caliber. 4. A tool for making a hole by boring, as an auger. 5. Caliber; importance. [Obs.] Yet are they much too light for the bore of the matter. Shak. 6. A person or thing that wearies by prolixity or dullness; a tiresome person or affair; any person or thing which causes ennui. It is as great a bore as to hear a poet read his own verses. Hawthorne.\n\n(a) A tidal flood which regularly or occasionally rushes into certain rivers of peculiar configuration or location, in one or more waves which present a very abrupt front of considerable height, dangerous to shipping, as at the mouth of the Amazon, in South America, the Hoogly and Indus, in India, and the Tsien-tang, in China. (b) Less properly, a very high and rapid tidal flow, when not so abrupt, such as occurs at the Bay of Fundy and in the British Channel.\n\nimp. of 1st & 2d Bear."}