{"word":"bow","definition":"1. To cause to deviate from straightness; to bend; to inflect; to make crooked or curved. We bow things the contrary way, to make them come to their natural straightness. Milton. The whole nation bowed their necks to the worst kind of tyranny. Prescott. 2. To exercise powerful or controlling influence over; to bend, figuratively; to turn; to incline. Adversities do more bow men's minds to religion. Bacon. Not to bow and bias their opinions. Fuller. 3. To bend or incline, as the head or body, in token of respect, gratitude, assent, homage, or condescension. They came to meet him, and bowed themselves to the ground before him. 2 Kings ii. 15. 4. To cause to bend down; to prostrate; to depress,; Whose heavy hand hath bowed you to the grave. Shak. 5. To express by bowing; as, to bow one's thanks.\n\n1. To bend; to curve. [Obs.] 2. To stop. [Archaic] They stoop, they bow down together. Is. xlvi. 2 3. To bend the head, knee, or body, in token of reverence or submission; -- often with down. O come, let us worship and bow down: let us kneel before the Lord our maker. Ps. xcv. 6. 4. To incline the head in token of salutation, civility, or assent; to make bow. Admired, adored by all circling crowd, For wheresoe'er she turned her face, they bowed. Dryden.\n\nAn inclination of the head, or a bending of the body, in token of reverence, respect, civility, or submission; an obeisance; as, a bow of deep humility.\n\n1. Anything bent, or in the form of a curve, as the rainbow. I do set my bow in the cloud. Gen. ix. 13. 2. A weapon made of a strip of wood, or other elastic material, with a cord connecting the two ends, by means of which an arrow is propelled. 3. An ornamental knot, with projecting lops, formed by doubling a ribbon or string. 4. The U-shaped piece which embraces the neck of an ox and fastens it to the yoke. 5. (Mus.)  An appliance consisting of an elastic rod, with a number of horse hairs stretched from end to end of it, used in playing on a stringed instrument. 6. An acrograph. 7. (Mech. & Manuf.)  Any instrument consisting of an elastic rod, with ends connected by a string, employed for giving reciprocating motion to a drill, or for preparing and arranging the hair, fur, etc., used by hatters. 8. (Naut.)  A rude sort of quadrant formerly used for taking the sun's altitude at sea. 9. (Saddlery) sing. or pl.  Two pieces of wood which form the arched forward part of a saddletree. Bow bearer (O. Eng. Law), an under officer of the forest who looked after trespassers. -- Bow drill, a drill worked by a bow and string. -- Bow instrument (Mus.), any stringed instrument from which the tones are produced by the bow. -- Bow window (Arch.) See Bay window. -- To draw a long bow, to lie; to exaggerate. [Colloq.]\n\nTo play (music) with a bow. -- v. i.  To manage the bow.\n\n1. (Naut.)  The bending or rounded part of a ship forward; the stream or prow. 2. (Naut.)  One who rows in the forward part of a boat; the bow oar. Bow chaser (Naut.), a gun in the bow for firing while chasing another vessel. Totten. - Bow piece, a piece of ordnance carried at the bow of a ship. -- On the bow (Naut.), on that part of the horizon within 45ยบ on either side of the line ahead. Totten."}