{"word":"brace","definition":"1. That which holds anything tightly or supports it firmly; a bandage or a prop. 2. A cord, ligament, or rod, for producing or maintaining tension, as a cord on the side of a drum. The little bones of the ear drum do in straining and relaxing it as the braces of the war drum do in that. Derham. 3. The state of being braced or tight; tension. The laxness of the tympanum, when it has lost its brace or tension. Holder. 4. (Arch. & Engin.)  A piece of material used to transmit, or change the direction of, weight or pressure; any one of the pieces, in a frame or truss, which divide the structure into triangular parts. It may act as a tie, or as a strut, and serves to prevent distortion of the structure, and transverse strains in its members. A boiler brace is a diagonal stay, connecting the head with the shell. 5. (Print.)  A vertical curved line connecting two or more words or lines, which are to be taken together; thus, boll, bowl; or, in music, used to connect staves. 6. (Naut.)  A rope reeved through a block at the end of a yard, by which the yard is moved horizontally; also, a rudder gudgeon. 7. (Mech.)  A curved instrument or handle of iron or wood, for holding and turning bits, etc.; a bitstock. 8. A pair; a couple; as, a brace of ducks; now rarely applied to persons, except familiarly or with some contempt. \"A brace of greyhounds.\" Shak. He is said to have shot . . . fifty brace of pheasants. Addison. A brace of brethren, both bishops, both eminent for learning and religion, now appeared in the church. Fuller. But you, my brace of lords. Shak. 9. pl.  Straps or bands to sustain trousers; suspenders. I embroidered for you a beautiful pair of braces. Thackeray. 10. Harness; warlike preparation. [Obs.] For that it stands not in such warlike brace. Shak. 11. Armor for the arm; vantbrace. 12. (Mining)  The mouth of a shaft. [Cornwall] Angle brace. See under Angle.\n\n1. To furnish with braces; to support; to prop; as, to brace a beam in a building. 2. To draw tight; to tighten; to put in a state of tension; to strain; to strengthen; as, to brace the nerves. And welcome war to brace her drums. Campbell. 3. To bind or tie closely; to fasten tightly. The women of China, by bracing and binding them from their infancy, have very little feet. Locke. Some who spurs had first braced on. Sir W. Scott. 4. To place in a position for resisting pressure; to hold firmly; as, he braced himself against the crowd. A sturdy lance in his right hand he braced. Fairfax. 5. (Naut.)  To move around by means of braces; as, to brace the yards. To brace about (Naut.), to turn (a yard) round for the contrary tack. -- To brace a yard (Naut.), to move it horizontally by means of a brace. -- To brace in (Naut.), to turn (a yard) by hauling in the weather brace. -- To brace one's self, to call up one's energies. \"He braced himself for an effort which he was little able to make.\" J. D. Forbes. - To brace to (Naut.), to turn (a yard) by checking or easing off the lee brace, and hauling in the weather one, to assist in tacking. -- To brace up (Naut.), to bring (a yard) nearer the direction of the keel by hauling in the lee brace. -- To brace up sharp (Naut.), to turn (a yard) as far forward as the rigging will permit.\n\nTo get tone or vigor; to rouse one's energies; -with up. [Colloq.]"}