{"word":"brain","definition":"1. (Anat.)  The whitish mass of soft matter (the center of the nervous system, and the seat of consciousness and volition) which is inclosed in the cartilaginous or bony cranium of vertebrate animals. It is simply the anterior termination of the spinal cord, and is developed from three embryonic vesicles, whose cavities are connected with the central canal of the cord; the cavities of the vesicles become the central cavities, or ventricles, and the walls thicken unequally and become the three segments, the fore-, mid-, and hind-brain. Note: In the brain of man the cerebral lobes, or largest part of the forebrain, are enormously developed so as to overhang the cerebellum, the great lobe of the hindbrain, and completely cover the lobes of the midbrain. The surface of the cerebrum is divided into irregular ridges, or convolutions, separated by grooves (the so-called fissures and sulci), and the two hemispheres are connected at the bottom of the longitudinal fissure by a great transverse band of nervous matter, the corpus callosum, while the two halves of the cerebellum are connected on the under side of the brain by the bridge, or pons Varolii. 2. (Zoöl.)  The anterior or cephalic ganglion in insects and other invertebrates. 3. The organ or seat of intellect; hence, the understanding. \" My brain is too dull.\" Sir W. Scott. Note: In this sense, often used in the plural. 4. The affections; fancy; imagination. [R.] Shak. To have on the brain, to have constantly in one's thoughts, as a sort of monomania. [Low] Brain box or case, the bony on cartilaginous case inclosing the brain. -- Brain coral, Brain stone coral (Zoöl), a massive reef-building coral having the surface covered by ridges separated by furrows so as to resemble somewhat the surface of the brain, esp. such corals of the genera Mæandrina and Diploria. -- Brain fag (Med.), brain weariness. See Cerebropathy. -- Brain fever (Med.), fever in which the brain is specially affected; any acute cerebral affection attended by fever. -- Brain sand, calcareous matter found in the pineal gland.\n\n1. To dash out the brains of; to kill by beating out the brains. Hence, Fig.: To destroy; to put an end to; to defeat. There thou mayst brain him. Shak. It was the swift celerity of the death . . . That brained my purpose. Shak. 2. To conceive; to understand. [Obs.] brain not. Shak."}