{"word":"brake","definition":"of Break. [Arhaic] Tennyson.\n\n1. (Bot.)  A fern of the genus Pteris, esp. the P. aquilina, common in almost all countries. It has solitary stems dividing into three principal branches. Less properly: Any fern. 2. A thicket; a place overgrown with shrubs and brambles, with undergrowth and ferns, or with canes. Rounds rising hillocks, brakes obscure and rough, To shelter thee from tempest and from rain. Shak. He stayed not for brake, and he stopped not for stone. Sir W. Scott. Cane brake, a thicket of canes. See Canebrake.\n\n1. An instrument or machine to break or bruise the woody part of flax or hemp so that it may be separated from the fiber. 2. An extended handle by means of which a number of men can unite in working a pump, as in a fire engine. 3. A baker's kneading though. Johnson. 4. A sharp bit or snaffle. Pampered jades . . . which need nor break nor bit. Gascoigne. 5. A frame for confining a refractory horse while the smith is shoeing him; also, an inclosure to restrain cattle, horses, etc. A horse . . . which Philip had bought . . . and because of his fierceness kept him within a brake of iron bars. J. Brende. 6. That part of a carriage, as of a movable battery, or engine, which enables it to turn. 7. (Mil.)  An ancient engine of war analogous to the crossbow and ballista. 8. (Agric.)  A large, heavy harrow for breaking clods after plowing; a drag. 9. A piece of mechanism for retarding or stopping motion by friction, as of a carriage or railway car, by the pressure of rubbers against the wheels, or of clogs or ratchets against the track or roadway, or of a pivoted lever against a wheel or drum in a machine. 10. (Engin.)  An apparatus for testing the power of a steam engine, or other motor, by weighing the amount of friction that the motor will overcome; a friction brake. 11. A cart or carriage without a body, used in breaking in horses. 12. An ancient instrument of torture. Holinshed. Air brake. See Air brake, in the Vocabulary. -- Brake beam or Brake bar, the beam that connects the brake blocks of opposite wheels. -- Brake block. (a) The part of a brake holding the brake shoe. (b) A brake shoe. -- Brake shoe or Brake rubber, the part of a brake against which the wheel rubs. -- Brake wheel, a wheel on the platform or top of a car by which brakes are operated. -- Continuous brake . See under Continuous."}