{"word":"breach","definition":"1. The act of breaking, in a figurative sense. 2. Specifically: A breaking or infraction of a law, or of any obligation or tie; violation; non-fulfillment; as, a breach of contract; a breach of promise. 3. A gap or opening made made by breaking or battering, as in a wall or fortification; the space between the parts of a solid body rent by violence; a break; a rupture. Once more unto the breach, dear friends, once more; Or close the wall up with our English dead. Shak. 4. A breaking of waters, as over a vessel; the waters themselves; surge; surf. The Lord hath broken forth upon mine enemies before me, as the breach of waters. 2 Sam. v. 20 A clear breach implies that the waves roll over the vessel without breaking. -- A clean breach implies that everything on deck is swept away. Ham. Nav. Encyc. 5. A breaking up of amicable relations; rupture. There's fallen between him and my lord An unkind breach. Shak. 6. A bruise; a wound. Breach for breach, eye for eye. Lev. xxiv. 20 7. (Med.)  A hernia; a rupture. 8. A breaking out upon; an assault. The Lord had made a breach upon Uzza. 1. Chron. xiii. 11 Breach of falth, a breaking, or a failure to keep, an expressed or implied promise; a betrayal of confidence or trust. -- Breach of peace, disorderly conduct, disturbing the public peace. -- Breach of privilege, an act or default in violation of the privilege or either house of Parliament, of Congress, or of a State legislature, as, for instance, by false swearing before a committee. Mozley. Abbott. - Breach of promise, violation of one's plighted word, esp. of a promise to marry. -- Breach of trust, violation of one's duty or faith in a matter entrusted to one. Syn. -- Rent; cleft; chasm; rift; aperture; gap; break; disruption; fracture; rupture; infraction; infringement; violation; quarrel; dispute; contention; difference; misunderstanding.\n\nTo make a breach or opening in; as, to breach the walls of a city.\n\nTo break the water, as by leaping out; -- said of a whale."}