{"word":"break","definition":"1. To strain apart; to sever by fracture; to divide with violence; as, to break a rope or chain; to break a seal; to break an axle; to break rocks or coal; to break a lock. Shak. 2. To lay open as by breaking; to divide; as, to break a package of goods. 3. To lay open, as a purpose; to disclose, divulge, or communicate. Katharine, break thy mind to me. Shak. 4. To infringe or violate, as an obligation, law, or promise. Out, out, hyena! these are thy wonted arts . . . To break all faith, all vows, deceive, betray. Milton 5. To interrupt; to destroy the continuity of; to dissolve or terminate; as, to break silence; to break one's sleep; to break one's journey. Go, release them, Ariel; My charms I'll break, their senses I'll restore. Shak. 6. To destroy the completeness of; to remove a part from; as, to break a set. 7. To destroy the arrangement of; to throw into disorder; to pierce; as, the cavalry were not able to break the British squares. 8. To shatter to pieces; to reduce to fragments. The victim broke in pieces the musical instruments with which he had solaced the hours of captivity. Prescott. 9. To exchange for other money or currency of smaller denomination; as, to break a five dollar bill. 10. To destroy the strength, firmness, or consistency of; as, to break flax. 11. To weaken or impair, as health, spirit, or mind. An old man, broken with the storms of state. Shak. 12. To diminish the force of; to lessen the shock of, as a fall or blow. I'll rather leap down first, and break your fall. Dryden. 13. To impart, as news or information; to broach; -- with to, and often with a modified word implying some reserve; as, to break the news gently to the widow; to break a purpose cautiously to a friend. 14. To tame; to reduce to subjection; to make tractable; to discipline; as, to break a horse to the harness or saddle. \"To break a colt.\" Spenser. Why, then thou canst not break her to the lute Shak. 15. To destroy the financial credit of; to make bankrupt; to ruin. With arts like these rich Matho, when he speaks, Attracts all fees, and little lawyers breaks. Dryden. 16. To destroy the official character and standing of; to cashier; to dismiss. I see a great officer broken. Swift. Note: With prepositions or adverbs: --To break down. (a) To crush; to overwhelm; as, to break down one's strength; to break down opposition. (b) To remove, or open a way through, by breaking; as, to break down a door or wall. -- To break in. (a) To force in; as, to break in a door. (b) To train; to discipline; as, a horse well broken in. -- To break of, to rid of; to cause to abandon; as, to break one of a habit. -- To break off. (a) To separate by breaking; as, to break off a twig. (b) To stop suddenly; to abandon. \"Break off thy sins by righteousness.\" Dan. iv. 27. -- To break open, to open by breaking. \"Open the door, or I will break it open.\" Shak. -- To break out, to take or force out by breaking; as, to break out a pane of glass. -- To break out a cargo, to unstow a cargo, so as to unload it easily. -- To break through. (a) To make an opening through, as, as by violence or the force of gravity; to pass violently through; as, to break through the enemy's lines; to break through the ice. (b) To disregard; as, to break through the ceremony. -- To break up. (a) To separate into parts; to plow (new or fallow ground). \"Break up this capon.\" Shak. \"Break up your fallow ground.\" Jer. iv. 3. (b) To dissolve; to put an end to. \"Break up the court.\" Shak. -- To break (one) all up, to unsettle or disconcert completely; to upset. [Colloq.] Note: With an immediate object: -To break the back. (a) To dislocate the backbone; hence, to disable totally. (b) To get through the worst part of; as, to break the back of a difficult undertaking. -- To break bulk, to destroy the entirety of a load by removing a portion of it; to begin to unload; also, to transfer in detail, as from boats to cars. -- To break cover, to burst forth from a protecting concealment, as game when hunted. -- To break a deer or stag, to cut it up and apportion the parts among those entitled to a share. -- To break fast, to partake of food after abstinence. See Breakfast. -- To break ground. (a) To open the earth as for planting; to commence excavation, as for building, siege operations, and the like; as, to break ground for a foundation, a canal, or a railroad. (b) Fig.: To begin to execute any plan. (c) (Naut.) To release the anchor from the bottom. -- To break the heart, to crush or overwhelm (one) with grief. -- To break a house (Law), to remove or set aside with violence and a felonious intent any part of a house or of the fastenings provided to secure it. -- To break the ice, to get through first difficulties; to overcome obstacles and make a beginning; to introduce a subject. -- To break jail, to escape from confinement in jail, usually by forcible means. -- To break a jest, to utter a jest. \"Patroclus . . . the livelong day break scurril jests.\" Shak. -- To break joints, to lay or arrange bricks, shingles, etc., so that the joints in one course shall not coincide with those in the preceding course. -- To break a lance, to engage in a tilt or contest. -- To break the neck, to dislocate the joints of the neck. -- To break no squares, to create no trouble. [Obs.] -- To break a path, road, etc., to open a way through obstacles by force or labor. -- To break upon a wheel, to execute or torture, as a criminal by stretching him upon a wheel, and breaking his limbs with an iron bar; -- a mode of punishment formerly employed in some countries. -- To break wind, to give vent to wind from the anus. Syn. -- To dispart; rend; tear; shatter; batter; violate; infringe; demolish; destroy; burst; dislocate.\n\n1. To come apart or divide into two or more pieces, usually with suddenness and violence; to part; to burst asunder. 2. To open spontaneously, or by pressure from within, as a bubble, a tumor, a seed vessel, a bag. Else the bottle break, and the wine runneth out. Math. ix. 17. 3. To burst forth; to make its way; to come to view; to appear; to dawn. The day begins to break, and night is fied. Shak. And from the turf a fountain broke, and gurgled at our feet. Wordswoorth. 4. To burst forth violently, as a storm. The clouds are still above; and, while I speak, A second deluge o'er our head may break. Shak. 5. To open up. to be scattered; t be dissipated; as, the clouds are breaking. At length the darkness begins to break. Macawlay. 6. To become weakened in constitution or faculties; to lose health or strength. See how the dean begins to break; Poor gentleman . Swift. 7. To be crushed, or overwhelmed with sorrow or grief; as, my heart is breaking. 8. To fall in business; to become bankrupt. He that puts all upon adventures doth oftentimes break, and come to poverty. Bacn. 9. To make an abrupt or sudden change; to change the gait; as, to break into a run or gallop. 10. To fail in musical quality; as, a singer's voice breaks when it is strained beyond its compass and a tone or note is not completed, but degenerates into an unmusical sound instead. Also, to change in tone, as a boy's voice at puberty. 11. To fall out; to terminate friendship. To break upon the score of danger or expense is to be mean and narrow-spirited. Collier. Note: With prepositions or adverbs: -To break away, to disengage one's self abruptly; to come or go away against resistance. Fear me not, man; I will not break away. Shak. To break down. (a) To come down by breaking; as, the coach broke down. (b) To fail in any undertaking. He had broken down almost at the outset. Thackeray. -- To break forth, to issue; to come out suddenly, as sound, light, etc. \"Then shall thy light break forth as the morning.\" Isa. lviii. 8; Note: often with into in expressing or giving vent to one's feelings. \"Break forth into singing, ye mountains.\" Isa. xliv. 23. To break from, to go away from abruptly. This radiant from the circling crowd he broke. Dryden. -- To break into, to enter by breaking; as, a house. -- To break in upon, to enter or approach violently or unexpectedly. \"This, this is he; softly awhile; let us not break in upon him.\" Milton. -- To break loose. (a) To extricate one's self forcibly. \"Who would not, finding way, break loose from hell\" Milton. (b) To cast off restraint, as of morals or propriety. -- To break off. (a) To become separated by rupture, or with suddenness and violence. (b) To desist or cease suddenly. \"Nay, forward, old man; do not break off so.\" Shak. -- To break off from, to desist from; to abandon, as a habit. -- To break out. (a) To burst forth; to escape from restraint; to appear suddenly, as a fire or an epidemic. \"For in the wilderness shall waters break out, and stream in the desert.\" Isa. xxxv. 6 (b) To show itself in cutaneous eruptions; -- said of a disease. (c) To have a rash or eruption on the akin; -- said of a patient. -- To break over, to overflow; to go beyond limits. -- To break up. (a) To become separated into parts or fragments; as, the ice break up in the rivers; the wreck will break up in the next storm. (b) To disperse. \"The company breaks up.\" I. Watts. -- To break upon, to discover itself suddenly to; to dawn upon. -- To break with. (a) To fall out; to sever one's relations with; to part friendship. \"It can not be the Volsces dare break with us.\" Shak. \"If she did not intend to marry Clive, she should have broken with him altogether.\" Thackeray. (b) To come to an explanation; to enter into conference; to speak. [Obs.] \"I will break with her and with her father.\" Shak.\n\n1. An opening made by fracture or disruption. 2. An interruption of continuity; change of direction; as, a break in a wall; a break in the deck of a ship. Specifically: (a) (Arch.) A projection or recess from the face of a displacement in the circuit, interrupting the electrical current. 3. An interruption; a pause; as, a break in friendship; a break in the conversation. 4. An interruption in continuity in writing or printing, as where there is an omission, an unfilled line, etc. All modern trash is Set forth with numerous breaks and dashes. Swift. 5. The first appearing, as of light in the morning; the dawn; as, the break of day; the break of dawn. 6. A large four-wheeled carriage, having a straight body and calash top, with the driver's seat in front and the footman's behind. 7. A device for checking motion, or for measuring friction. See Brake, n. 9 & 10. 8. (Teleg.)  See Commutator."}