{"word":"bring","definition":"1. To convey to the place where the speaker is or is to be; to bear from a more distant to a nearer place; to fetch. And as she was going to fetch it, he called to her, and said, Bring me, I pray thee, a morsel of bread. 1 Kings xvii. 11. To France shall we convey you safe, And bring you back. Shak. 2. To cause the accession or obtaining of; to procure; to make to come; to produce; to draw to. There is nothing will bring you more honor . . . than to do what right in justice you may. Bacon. 3. To convey; to move; to carry or conduct. In distillation, the water . . . brings over with it some part of the oil of vitriol. Sir I. Newton. 4. To persuade; to induce; to draw; to lead; to guide. It seems so preposterous a thing . . . that they do not easily bring themselves to it. Locke. The nature of the things . . . would not suffer him to think otherwise, how, or whensoever, he is brought to reflect on them. Locke. 5. To produce in exchange; to sell for; to fetch; as, what does coal bring per ton To bring about, to bring to pass; to effect; to accomplish. -- To bring back. (a) To recall. (b) To restore, as something borrowed, to its owner. -- To bring by the lee (Naut.), to incline so rapidly to leeward of the course, when a ship sails large, as to bring the lee side suddenly to the windward, any by laying the sails aback, expose her to danger of upsetting. -- To bring down. (a) To cause to come down. (b) To humble or abase; as, to bring down high looks. -- To bring down the house, to cause tremendous applause. [Colloq.] -- To bring forth. (a) To produce, as young fruit. (b) To bring to light; to make manifest. -- To bring forward (a) To exhibit; to introduce; to produce to view. (b) To hasten; to promote; to forward. (c) To propose; to adduce; as, to bring forward arguments. -- To bring home. (a) To bring to one's house. (b) To prove conclusively; as, to bring home a charge of treason. (c) To cause one to feel or appreciate by personal experience. (d) (Naut.) To lift of its place, as an anchor. -- To bring in. (a) To fetch from without; to import. (b) To introduce, as a bill in a deliberative assembly. (c) To return or repot to, or lay before, a court or other body; to render; as, to bring in a verdict or a report. (d) To take to an appointed place of deposit or collection; as, to bring in provisions or money for a specified object. (e) To produce, as income. (f) To induce to join. -- To bring off, to bear or convey away; to clear from condemnation; to cause to escape. -- To bring on. (a) To cause to begin. (b) To originate or cause to exist; as, to bring on a disease. -- To bring one on one's way, to accompany, guide, or attend one. -- To bring out, to expose; to detect; to bring to light from concealment. -- To bring over. (a) To fetch or bear across. (b) To convert by persuasion or other means; to cause to change sides or an opinion. -- To bring to. (a) To resuscitate; to bring back to consciousness or life, as a fainting person. (b) (Naut.) To check the course of, as of a ship, by dropping the anchor, or by counterbracing the sails so as to keep her nearly stationary (she is then said to lie to). (c) To cause (a vessel) to lie to, as by firing across her course. (d) To apply a rope to the capstan. -- To bring to light, to disclose; to discover; to make clear; to reveal. -- To bring a sail to (Naut.), to bend it to the yard. -- To bring to pass, to accomplish to effect. \"Trust also in Him; and He shall bring it to pass.\" Ps. xxxvii. 5. -- To bring under, to subdue; to restrain; to reduce to obedience. -- To bring up. (a) To carry upward; to nurse; to rear; to educate. (b) To cause to stop suddenly. (c) Note: [v. i. by dropping the reflexive pronoun] To stop suddenly; to come to a standstill. [Colloq.] -- To bring up (any one) with a round turn, to cause (any one) to stop abruptly. [Colloq.] -- To be brought to bed. See under Bed. Syn. -- To fetch; bear; carry; convey; transport; import; procure; produce; cause; adduce; induce."}