{"word":"brush","definition":"1. An instrument composed of bristles, or other like material, set in a suitable back or handle, as of wood, bone, or ivory, and used for various purposes, as in removing dust from clothes, laying on colors, etc. Brushes have different shapes and names according to their use; as, clothes brush, paint brush, tooth brush, etc. 2. The bushy tail of a fox. 3. (Zoöl.)  A tuft of hair on the mandibles. 4. Branches of trees lopped off; brushwood. 5. A thicket of shrubs or small trees; the shrubs and small trees in a wood; underbrush. 6. (Elec.)  A bundle of flexible wires or thin plates of metal, used to conduct an electrical current to or from the commutator of a dynamo, electric motor, or similar apparatus. 7. The act of brushing; as, to give one's clothes a brush; a rubbing or grazing with a quick motion; a light touch; as, we got a brush from the wheel as it passed. [As leaves] have with one winter's brush Fell from their boughts. Shak. 8. A skirmish; a slight encounter; a shock or collision; as, to have a brush with an enemy. Let grow thy sinews till their knots be strong, And tempt not yet the brushes of the war. Shak. 9. A short contest, or trial, of speed. Let us enjoy a brush across the country. Cornhill Mag. Electrical brush, a form of the electric discharge characterized by a brushlike appearance of luminous rays diverging from an electrified body.\n\n1. To apply a brush to, according to its particular use; to rub, smooth, clean, paint, etc., with a brush. \"A' brushes his hat o' mornings.\" Shak. 2. To touch in passing, or to pass lightly over, as with a brush. Some spread their sailes, some with strong oars sweep The waters smooth, and brush the buxom wave. Fairfax. Brushed with the kiss of rustling wings. Milton. 3. To remove or gather by brushing, or by an act like that of brushing, or by passing lightly over, as wind; -- commonly with off. As wicked dew as e'er my mother brushed With raven's feather from unwholesome fen. Shak. And from the boughts brush off the evil dew. Milton. To brush aside, to remove from one's way, as with a brush. -- To brush away, to remove, as with a brush or brushing motion. -- To brush up, to paint, or make clean or bright with a brush; to cleanse or improve; to renew. You have commissioned me to paint your shop, and I have done my best to brush you up like your neighbors. Pope.\n\nTo move nimbly in haste; to move so lightly as scarcely to be perceived; as, to brush by. Snatching his hat, he brushed off like the wind. Goldsmith."}