{"word":"bull","definition":"1. (Zoöl.)  The male of any species of cattle (Bovidæ); hence, the male of any large quadruped, as the elephant; also, the male of the whale. Note: The wild bull of the Old Testament is thought to be the oryx, a large species of antelope. 2. One who, or that which, resembles a bull in character or action. Ps. xxii. 12. 3. (Astron.) (a) Taurus, the second of the twelve signs of the zodiac. (b) A constellation of the zodiac between Aries and Gemini. It contains the Pleiades. At last from Aries rolls the bounteous sun, And the bright Bull receives him. Thomson. 4. (Stock Exchange)  One who operates in expectation of a rise in the price of stocks, or in order to effect such a rise. See 4th Bear, n., 5. Bull baiting, the practice of baiting bulls, or rendering them furious, as by setting dogs to attack them. -- John Bull, a humorous name for the English, collectively; also, an Englishman. \"Good-looking young John Bull.\" W. D.Howells. -- To take the bull by the horns, to grapple with a difficulty instead of avoiding it.\n\nOf or pertaining to a bull; resembling a bull; male; large; fierce. Bull bat (Zoöl.), the night hawk; -- so called from the loud noise it makes while feeding on the wing, in the evening. -- Bull calf. (a) A stupid fellow. -- Bull mackerel (Zoöl.), the chub mackerel. -- Bull pump (Mining), a direct single-acting pumping engine, in which the steam cylinder is placed above the pump. -- Bull snake (Zoöl.), the pine snake of the United States. -- Bull stag, a castrated bull. See Stag. -- Bull wheel, a wheel, or drum, on which a rope is wound for lifting heavy articles, as logs, the tools in well boring, etc.\n\nTo be in heat; to manifest sexual desire as cows do. [Colloq.]\n\nTo endeavor to raise the market price of; as, to bull railroad bonds; to bull stocks; to bull Lake Shore; to endeavor to raise prices in; as, to bull the market. See 1st Bull, n., 4.\n\n1. A seal. See Bulla. 2. A letter, edict, or respect, of the pope, written in Gothic characters on rough parchment, sealed with a bulla, and dated \"a die Incarnationis,\" i. e., \"from the day of the Incarnation.\" See Apostolical brief, under Brief. A fresh bull of Leo's had declared how inflexible the court of Rome was in the point of abuses. Atterbury. 3. A grotesque blunder in language; an apparent congruity, but real incongruity, of ideas, contained in a form of expression; so called, perhaps, from the apparent incongruity between the dictatorial nature of the pope's bulls and his professions of humility. And whereas the papist boasts himself to be a Roman Catholic, it is a mere contradiction, one of the pope's bulls, as if he should say universal particular; a Catholic schimatic. Milton. The Golden Bull, an edict or imperial constitution made by the emperor Charles IV. (1356), containing what became the fundamental law of the German empire; -- so called from its golden seal. Syn. -- See Blunder."}