{"word":"burden","definition":"1. That which is borne or carried; a load. Plants with goodly burden bowing. Shak. 2. That which is borne with labor or difficulty; that which is grievous, wearisome, or oppressive. Deaf, giddy, helpless, left alone, To all my friends a burden grown. Swift. 3. The capacity of a vessel, or the weight of cargo that she will carry; as, a ship of a hundred tons burden. 4. (Mining)  The tops or heads of stream-work which lie over the stream of tin. 5. (Metal.)  The proportion of ore and flux to fuel, in the charge of a blast furnace. Raymond. 6. A fixed quantity of certain commodities; as, a burden of gad steel, 120 pounds. 7. A birth. [Obs. & R.] Shak. Beast of burden, an animal employed in carrying burdens. -- Burden of proof Etym: [L. onus probandi] (Law), the duty of proving a particular position in a court of law, a failure in the performance of which duty calls for judgment against the party on whom the duty is imposed. Syn. -- Burden, Load. A burden is, in the literal sense, a weight to be borne; a load is something laid upon us to be carried. Hence, when used figuratively, there is usually a difference between the two words. Our burdens may be of such a nature that we feel bound to bear them cheerfully or without complaint. They may arise from the nature of our situation; they may be allotments of Providence; they may be the consequences of our errors. What is upon us, as a load, we commonly carry with greater reluctance or sense of oppression. Men often find the charge of their own families to be a burden; but if to this be added a load of care for others, the pressure is usually serve and irksome.\n\n1. To encumber with weight (literal or figurative); to lay a heavy load upon; to load. I mean not that other men be eased, and ye burdened. 2 Cor. viii. 13. 2. To oppress with anything grievous or trying; to overload; as, to burden a nation with taxes. My burdened heart would break. Shak. 3. To impose, as a load or burden; to lay or place as a burden (something heavy or objectionable). [R.] It is absurd to burden this act on Cromwell. Coleridge. Syn. -- To load; encumber; overload; oppress.\n\n1. The verse repeated in a song, or the return of the theme at the end of each stanza; the chorus; refrain. Hence: That which is often repeated or which is dwelt upon; the main topic; as, the burden of a prayer. I would sing my song without a burden. Shak. 2. The drone of a bagpipe. Ruddiman.\n\nA club. [Obs.] Spenser."}