{"word":"can","definition":"an obs. form of began, imp. & p. p. of Begin, sometimes used in old poetry. Note: [See Gan.] With gentle words he can faile gree. Spenser.\n\n1. A drinking cup; a vessel for holding liquids. [Shak. ] Fill the cup and fill can, Have a rouse before the morn. Tennyson. 2. A vessel or case of tinned iron or of sheet metal, of various forms, but usually cylindrical; as, a can of tomatoes; an oil can; a milk can. Note: A can may be a cylinder open at the top, as for receiving the sliver from a carding machine, or with a removable cover or stopper, as for holding tea, spices, milk, oysters, etc., or with handle and spout, as for holding oil, or hermetically sealed, in canning meats, fruits, etc. The name is also sometimes given to the small glass or earthenware jar used in canning.\n\nTo preserve by putting in sealed cans [U. S.] \"Canned meats\" W. D. Howells. Canned goods, a general name for fruit, vegetables, meat, or fish, preserved in hermetically sealed cans.\n\n1. To know; to understand. [Obs.] I can rimes of Rodin Hood. Piers Plowman. I can no Latin, quod she. Piers Plowman. Let the priest in surplice white, That defunctive music can. Shak. 2. To be able to do; to have power or influence. [Obs.] The will of Him who all things can. Milton. For what, alas, can these my single arms Shak. Mæcænas and Agrippa, who can most with Cæsar. Beau. & Fl. 3. To be able; -- followed by an infinitive without to; as, I can go, but do not wish to. Syn. -- Can but, Can not but. It is an error to use the former of these phrases where the sens requires the latter. If we say, \"I can but perish if I go,\" \"But\" means only, and denotes that this is all or the worst that can happen. When the apostle Peter said. \"We can not but speak of the things which we have seen and heard.\" he referred to a moral constraint or necessety which rested upon him and his associates; and the meaning was, We cannot help speaking, We cannot refrain from speaking. This idea of a moral necessity or constraint is of frequent occurrence, and is also expressed in the phrase, \"I can not help it.\" Thus we say. \"I can not but hope,\" \"I can not but believe,\" \"I can not but think,\" \"I can not but remark,\" etc., in cases in which it would be an error to use the phrase can but. Yet he could not but acknowledge to himself that there was something calculated to impress awe, . . . in the sudden appearances and vanishings . . . of the masque De Quincey. Tom felt that this was a rebuff for him, and could not but understand it as a left-handed hit at his employer. Dickens."}