{"word":"cant","definition":"1. A corner; angle; niche. [Obs.] The first and principal person in the temple was Irene, or Peace; she was placed aloft in a cant. B. Jonson. 2. An outer or external angle. 3. An inclination from a horizontal or vertical line; a slope or bevel; a titl. Totten. 4. A sudden thrust, push, kick, or other impulse, producing a bias or change of direction; also, the bias or turn so give; as, to give a ball a cant. 5. (Coopering)  A segment forming a side piece in the head of a cask. Knight. 6. (Mech.)  A segment of he rim of a wooden cogwheel. Knight. 7. (Naut.)  A piece of wood laid upon athe deck of a vessel to support the bulkneads. Cant frames, Cant timbers (Naut.), timber at the two ends of a ship, rising obliquely from the keel.\n\n1. To incline; to set at an angle; to titl over; to tip upon the edge; as, to cant a cask; to cant a ship. 2. To give a sudden turn or new direction to; as, to cant round a stick of timber; to cant a football. 3. To cut off an angle from, as from a square piece of timber, or from the head of a bolt.\n\n1. An affected, singsong mode of speaking. 2. The idioms and peculiarities of speech in any sect, class, or occupation. Goldsmith. The cant of any profession. Dryden. 3. The use of religious phraseology without understanding or sincerity; empty, solemn speech, implying what is not felt; hypocrisy. They shall hear no cant fromF. W. Robertson 4. Vulgar jargon; slang; the secret language spoker by gipsies, thieves. tramps, or beggars.\n\nOf the nature of cant; affected; vulgar. To introduce and multiply cant words in the most ruinous corruption in any language. Swift.\n\n1. To speak in a whining voice, or an affected, sinsong tone. 2. To make whining pretensions to goodness; to talk with an affectation of religion, philanthropy, etc.; to practice hypocrisy; as, a canting fanatic. The rankest rogue that ever canted. Beau. & Fl. 3. To use pretentious language, barbarous jargon, or technical termes; to talk with an affectation of learning. The doctor here, When he discqurseth of dissection, Of vena cava and of vena porta, The meseræum and the mesentericum, What does he else but cant. B. Jonson That uncouth affected garb of speech, or canting hanguage, if I may so call it. Bp. Sanderson.\n\nA all for bidders at a public sale; an auction. \"To sell their leases by cant.\" Swift.\n\nto sell by auction, or bid a price at a sale by auction. [Archaic] Swift. CAN'T Can't.  A colloquial contraction for can not."}