{"word":"cap","definition":"1. A covering for the head; esp. (a) One usually with a visor but without a brim, for men and boys; (b) One of lace, muslin, etc., for women, or infants; (c) One used as the mark or ensign of some rank, office, or dignity, as that of a cardinal. 2. The top, or uppermost part; the chief. Thou art the cap of all the fools alive. Shak. 3. A respectful uncovering of the head. He that will give a cap and make a leg in thanks. Fuller. 4. (Zoöl.)  The whole top of the head of a bird from the base of the bill to the nape of the neck. 5. Anything resembling a cap in form, position, or use; as: (a) (Arch.) The uppermost of any assemblage of parts; as, the cap of column, door, etc.; a capital, coping, cornice, lintel, or plate. (b) Something covering the top or end of a thing for protection or ornament. (c) (Naut.) A collar of iron or wood used in joining spars, as the mast and the topmast, the bowsprit and the jib boom; also, a covering of tarred canvas at the end of a rope. (d) A percussion cap. See under Percussion. (e) (Mech.) The removable cover of a journal box. (f) (Geom.) A portion of a spherical or other convex surface. 6. A large size of writing paper; as, flat cap; foolscap; legal cap. Cap of a cannon, a piece of lead laid over the vent to keep the priming dry; -- now called an apron. -- Cap in hand, obsequiously; submissively. -- Cap of liberty. See Liberty cap, under Liberty. -- Cap of maintenance, a cap of state carried before the kings of England at the coronation. It is also carried before the mayors of some cities. -- Cap money, money collected in a cap for the huntsman at the death of the fox. -- Cap paper. (a) A kind of writing paper including flat cap, foolsap, and legal cap. (b) A coarse wrapping paper used for making caps to hold commodities. Cap rock (Mining), The layer of rock next overlying ore, generally of barren vein material. -- Flat cap, cap See Foolscap. -- Forage cap, the cloth undress head covering of an officer of soldier. -- Legal cap, a kind of folio writing paper, made for the use of lawyers, in long narrow sheets which have the fold at the top or \"narrow edge.\" -- To set one's cap, to make a fool of one. (Obs.) Chaucer. -- To set one's cap for, to try to win the favor of a man with a view to marriage. [Colloq.]\n\n1. To cover with a cap, or as with a cap; to provide with a cap or cover; to cover the top or end of; to place a cap upon the proper part of; as, to cap a post; to cap a gun. The bones next the joint are capped with a smooth cartilaginous substance. Derham. 2. To deprive of cap. [Obs.] Spenser. 3. To complete; to crown; to bring to the highest point or consummation; as, to cap the climax of absurdity. 4. To salute by removing the cap. [Slang. Eng.] Tom . . . capped the proctor with the profoundest of bows. Thackeray. 5. To match; to mate in contest; to furnish a complement to; as, to cap text; to cap proverbs. Shak. Now I have him under girdle I'll cap verses with him to the end of the chapter. Dryden. Note: In capping verses, when one quotes a verse another must cap it by quoting one beginning with the last letter of the first letter, or with the first letter of the last word, or ending with a rhyming word, or by applying any other arbitrary rule may be agreed upon.\n\nTo uncover the head respectfully. Shak."}