{"word":"cardinal","definition":"Of fundamental importance; preëminet; superior; chief; principal. The cardinal intersections of the zodiac. Sir T. Browne. Impudence is now a cardinal virtue. Drayton. But cardinal sins, and hollow hearts, I fear ye. Shak. Cardinal numbers, the numbers one, two, three, etc., in distinction from first, second, third, etc., which are called ordinal numbers. -- Cardinal points (a) (Geol.) The four principal points of the compass, or intersections of the horizon with the meridian and the prime vertical circle, north, south east, and west. (b) (Astrol.) The rising and setting of the sun, the zenith and nadir. -- Cardinal signs (Astron.) Aries, Lidra, Cancer, and Capricorn. -- Cardinal teeth (Zoöl.), the central teeth of bivalve shell. See Bivalve. -- Cardinal veins (Anat.), the veins in vertebrate embryos, which run each side of the vertebral column and returm the blood to the heart. They remain through life in some fishes. -- Cardinal virtues, preëminent virtues; among the ancients, prudence, justice, temperance, and fortitude. -- Cardinal winds, winds which blow from the cardinal points due north, south, east, or west.\n\n1. (R.C.Ch.) One of the ecclesiastical prince who constitute the pope's council, or the sacred college. The clerics of the supreme Chair are called Cardinals, as undoubtedly adhering more nearly to the hinge by which all things are moved. Pope Leo IX. Note: The cardinals are appointed by the pope. Since the time of Sixtus V., their number can never exceed seventy (six of episcopal rank, fifty priests, fourteen deacons), and the number of cardinal priests and deacons is seldom full. When the papel chair is vacant a pope is elected by the college of cardinals from among themselves. The cardinals take procedence of all dignitaries except the pope. The principal parts of a cardinal's costume are a red cassock, a rochet, a short purple mantle, and a red hat with a small crown and broad, brim, with cards and tessels of a special pattern hanging from it. 2. A woman's short cloak with a hood. Where's your cardinal! Make haste. Lloyd. 3. Mulled red wine. Hotten. Cardinal bird, or Cardinal grosbeak (Zoöl.), an American song bird (Cardinalis cardinalis, or C. Virginianus), of the family Fringillidæ, or finches having a bright red plumage, and a high, pointed crest on its head. The males have loud and musical notes resembling those of a fife. Other related species are also called cardinal birds. -- Cardinal flower (Bot.), an herbaceous plant (Lobelia cardinalis) bearing brilliant red flowers of much beauty. -- Cardinal red, color like that of a cardinal's cassock, hat, etc.; a bright red, darket than scarlet, and between scarlet and crimson."}