{"word":"carry","definition":"1. To convey or transport in any manner from one place to another; to bear; -- often with away or off. When he dieth he small carry nothing away. Ps. xiix. 17. Devout men carried Stephen to his burial. Acts viii, 2. Another carried the intelligence to Russell. Macaulay. The sound will be carried, at the least, twenty miles. Bacon. 2. To have or hold as a burden, while moving from place to place; to have upon or about one's person; to bear; as, to carry a wound; to carry an unborn child. If the ideas . . . were carried along with us in our minds. Locke. 3. To move; to convey by force; to impel; to conduct; to lead or guide. Go, carry Sir John Falstaff to the Fleet. Shak. He carried away all his cattle. Gen. xxxi. 18. Passion and revenge will carry them too far. Locke. 4. To transfer from one place (as a country, book, or column) to another; as, to carry the war from Greece into Asia; to carry an account to the ledger; to carry a number in adding figures. 5. To convey by extension or continuance; to extend; as, to carry the chimney through the roof; to carry a road ten miles farther. 6. To bear or uphold successfully through conflict, as a leader or principle; hence, to succeed in, as in a contest; to bring to a successful issue; to win; as, to carry an election. \"The greater part carries it.\" Shak. The carrying of our main point. Addison. 7. To get possession of by force; to capture. The town would have been carried in the end. Bacon. 8. To contain; to comprise; to bear the aspect of ; to show or exhibit; to imply. He thought it carried something of argument in it. Watts. It carries too great an imputation of ignorance. Lacke. 9. To bear (one's self); to behave, to conduct or demean; -- with the refexive pronouns. He carried himself so insolently in the house, and out of the house, to all persons, that he became odious. Clarendon. 10. To bear the charges or burden of holding or having, as stocks, merchandise, etc., from one time to another; as, a merchant is carrying a large stock; a farm carries a mortgage; a broker carries stock for a customer; to carry a life insurance. Carry arms (Mil. Drill), a command of the Manual of Arms directing the soldier to hold his piece in the right hand, the barrel resting against the hollow of the shoulder in a nearly perpendicular position. In this position the soldier is said to stand, and the musket to be held, at carry. -- To carry all before one, to overcome all obstacles; to have uninterrupted success. -- To carry arms (a) To bear weapons. (b) To serve as a soldier. -- To carry away. (a) (Naut.) to break off; to lose; as, to carry away a fore-topmast. (b) To take possession of the mind; to charm; to delude; as, to be carried by music, or by temptation. -- To carry coals, to bear indignities tamely, a phrase used by early dramatists, perhaps from the mean nature of the occupation. Halliwell. -- To carry coals to Newcastle, to take things to a place where they already abound; to lose one's labor. -- To carry off (a) To remove to a distance. (b) To bear away as from the power or grasp of others. (c) To remove from life; as, the plague carried off thousands. -- To carry on (a) To carry farther; to advance, or help forward; to continue; as, to carry on a design. (b) To manage, conduct, or prosecute; as, to carry on husbandry or trade. -- To carry out. (a) To bear from within. (b) To put into execution; to bring to a successful issue. (c) To sustain to the end; to continue to the end. -- To carry through. (a) To convey through the midst of. (b) To support to the end; to sustain, or keep from falling, or being subdued. \"Grace will carry us . . . through all difficulties.\" Hammond. (c) To complete; to bring to a succesful issue; to succeed. -- To carry up, to convey or extend in an upward course or direction; to build. -- To carry weight. (a) To be handicapped; to have an extra burden, as when one rides or runs. \"He carries weight, he rides a race\" Cowper. (b) To have influence.\n\n1. To act as a bearer; to convey anything; as, to fetch and carry. 2. To have propulsive power; to propel; as, a gun or mortar carries well. 3. To hold the head; -- said of a horse; as, to carry well i. e., to hold the head high, with arching neck. 4. (Hunting)  To have earth or frost stick to the feet when running, as a hare. Johnson. To carry on, to behave in a wild, rude, or romping manner. [Colloq.]\n\nA tract of land, over which boats or goods are carried between two bodies of navigable water; a carrying place; a portage. Etym: [U.S.]"}