{"word":"cast","definition":"1. To send or drive by force; to throw; to fling; to hurl; to impel. Uzziash prepared . . . slings to cast stones. 2 Chron. xxvi. 14 Cast thy garment about thee, and follow me. Acts. xii. 8 We must be cast upon a certain island. Acts. xxvii. 26. 2. To direct or turn, as the eyes. How earnestly he cast his eyes upon me! Shak. 3. To drop; to deposit; as, to cast a ballot. 4. To throw down, as in wrestling. Shak. 5. To throw up, as a mound, or rampart. Thine enemies shall cast a trench [bank] about thee. Luke xix. 48. 6. To throw off; to eject; to shed; to lose. His filth within being cast. Shak. Neither shall your vine cast her fruit. Mal. iii. 11 The creatures that cast the skin are the snake, the viper, etc. Bacon. 7. To bring forth prematurely; to slink. Thy she-goats have not cast their young. Gen. xxi. 38. 8. To throw out or emit; to exhale. [Obs.] This . . . casts a sulphureous smell. Woodward. 9. To cause to fall; to shed; to reflect; to throw; as, to cast a ray upon a screen; to cast light upon a subject. 10. To impose; to bestow; to rest. The government I cast upon my brother. Shak. Cast thy burden upon the Lord. Ps. iv. 22. 11. To dismiss; to discard; to cashier. [Obs.] The state can not with safety casthim. 12. To compute; to reckon; to calculate; as, to cast a horoscope. \"Let it be cast and paid.\" Shak. You cast the event of war my noble lord. Shak. 13. To contrive; to plan. [Archaic] The cloister . . . had, I doubt not, been cast for [an orange- house]. Sir W. Temple. 14. To defeat in a lawsuit; to decide against; to convict; as, to be cast in damages. She was cast to be hanged. Jeffrey. Were the case referred to any competent judge, they would inevitably be cast. Dr. H. More. 15. To turn (the balance or scale); to overbalance; hence, to make preponderate; to decide; as, a casting voice. How much interest casts the balance in cases dubious! South. 16. To form into a particular shape, by pouring liquid metal or other material into a mold; to fashion; to found; as, to cast bells, stoves, bullets. 17. (Print.)  To stereotype or electrotype. 18. To fix, distribute, or allot, as the parts of a play among actors; also to assign (an actor) for a part. Our parts in the other world will be new cast. Addison. To cast anchor (Naut.) Se under Anchor. -- To cast a horoscope, to calculate it. -- To cast a horse, sheep, or other animal, to throw with the feet upwards, in such a manner as to prevent its rising again. -- To cast a shoe, to throw off or lose a shoe, said of a horse or ox. -- To cast aside, to throw or push aside; to neglect; to reject as useless or inconvenient. -- To cast away. (a) To throw away; to lavish; to waste. \"Cast away a life\" Addison. (b) To reject; to let perish. \"Cast away his people.\" Rom. xi. 1. \"Cast one away.\" Shak. (c) To wreck. \"Cast away and sunk.\" Shak. -- To cast by, to reject; to dismiss or discard; to throw away. -- To cast down, to throw down; to destroy; to deject or depress, as the mind. \"Why art thou cast down. O my soul\" Ps. xiii. 5. -- To cast forth, to throw out, or eject, as from an inclosed place; to emit; to send out. -- To cast in one's lot with, to share the fortunes of. -- To cast in one's teeth, to upbraid or abuse one for; to twin. -- To cast lots. See under Lot. -- To cast off. (a) To discard or reject; to drive away; to put off; to free one's self from. (b) (Hunting) To leave behind, as dogs; also, to set loose, or free, as dogs. Crabb. (c) (Naut.) To untie, throw off, or let go, as a rope. -- To cast off copy, (Print.), to estimate how much printed matter a given amount of copy will make, or how large the page must be in order that the copy may make a given number of pages. -- To cast one's self on or upon to yield or submit one's self unreservedly to. as to the mercy of another. -- To cast out, to throy out; to eject, as from a house; to cast forth; to expel; to utter. -- To cast the lead (Naut.), to sound by dropping the lead to the botton. -- To cast the water (Med.), to examine the urine for signs of disease. [Obs.]. -- To cast up. (a) To throw up; to raise. (b) To compute; to reckon, as the cost. (c) To vomit. (d) To twit with; to throw in one's teeth.\n\n1. To throw, as a line in angling, esp, with a fly hook. 2. (Naut.)  To turn the head of a vessel around from the wind in getting under weigh. Weigh anchor, cast to starboard. Totten. 3. To consider; to turn or revolve in the mind; to plan; as, to cast about for reasons. She . . . cast in her mind what manner of salution this should be. Luke. i. 29. 4. To calculate; to compute. [R.] Who would cast and balance at a desk. Tennyson. 5. To receive form or shape in a mold. It will not run thin, so as to cast and mold. Woodward. 6. To warp; to become twisted out of shape. Stuff is said to cast or warp when . . . it alters its flatness or straightness. Moxon. 7. To vomit. These verses . . . make me ready to cast. B. Jonson.\n\n3d pres. of Cast, for Casteth. [Obs.] Chaucer.\n\n1. The act of casting or throwing; a throw. 2. The thing thrown. A cast of dreadful dust. Dryden. 3. The distance to which a thing is or can be thrown. \"About a stone's cast.\" Luke xxii. 41. 4. A throw of dice; hence, a chance or venture. An even cast whether the army should march this way or that way. Sowth. I have set my life upon a cast, And I will stand the hazard of the die. Shak. 5. That which is throw out or off, shed, or ejected; as, the skin of an insect, the refuse from a hawk's stomach, the excrement of a earthworm. 6. The act of casting in a mold. And why such daily cast of brazen cannon. Shak. 7. An impression or mold, taken from a thing or person; amold; a pattern. 8. That which is formed in a mild; esp. a reproduction or copy, as of a work of art, in bronze or plaster, etc.; a casting. 9. Form; appearence; mien; air; style; as, a pecullar cast of countenance. \"A neat cast of verse.\" Pope. An heroic poem, but in another cast and figure. Prior. And thus the native hue of resolution Is sicklied o'er with the pale cast of thought. Shak. 10. A tendency to any color; a tinge; a shade. Gray with a cast of green. Woodward. 11. A chance, opportunity, privilege, or advantage; specifically, an opportunity of riding; a lift. [Scotch] We bargained with the driver to give us a cast to the next stage. Smollett. If we had the cast o' a cart to bring it. Sir W. Scott. 12. The assignment of parts in a play to the actors. 13. (Falconary)  A flight or a couple or set of hawks let go at one time from the hand. Grabb. As when a cast of falcons make their flight. Spenser. 14. A stoke, touch, or trick. [Obs.] This was a cast of Wood's politics; for his information was wholly false. Swift. 15. A motion or turn, as of the eye; direction; look; glance; squint. The cast of the eye is a gesture of aversion. Bacon. And let you see with one cast of an eye. Addison. This freakish, elvish cast came into the child's eye. Hawthorne. 16. A tube or funnel for conveying metal into a mold. 17. Four; that is, as many as are thrown into a vessel at once in counting herrings, etc; a warp. 18. Contrivance; plot, design. [Obs.] Chaucer. A cast of the eye, a slight squint or strabismus. -- Renal cast (Med.), microscopic bodies found in the urine of persons affected with disease of the kidneys; -- so called because they are formed of matter deposited in, and preserving the outline of, the renal tubes. -- The last cast, the last throw of the dice or last effort, on which every thing is ventured; the last chance."}