{"word":"castle","definition":"1. A fortified residence, especially that of a prince or nobleman; a fortress. The house of every one is to him castle and fortress, as well for his defense againts injury and violence, as for his repose. Coke. Our castle's strength Will laugh a siege to scorn. Shak. Note: Originally the mediæval castle was a single strong tower or keep, with a palisaded inclosure around it and inferior buidings, such as stables and the like, and surrounded by a moat; then such a keep or donjon, with courtyards or baileys and accessory buildings of greater elaboration a great hall and a chapel, all surrounded by defensive walls and a moat, with a drawbridge, etc. Afterwards the name was retained by large dwellings that had formerly been fortresses, or by those which replaced ancient fortresses. A Donjon or Keep, an irregular building containing the dwelling of the lord and his family; B C Large round towers ferming part of the donjon and of the exterior; D Square tower, separating the two inner courts and forming part of the donjon; E Chapel, whose apse forms a half-round tower, F, on the exterior walls; G H Round towers on the exterior walls; K Postern gate, reached from outside by a removable fight of steps or inclined plane for hoisting in stores, and leading to a court, L (see small digagram) whose pavement is on a level with the sill of the postern, but below the level of the larger court, with which it communicates by a separately fortified gateway; M Turret, containing spiral stairway to all the stories of the great tower, B, and serving also as a station for signal fire, banner, etc.; N Turret with stairway for tower, C; O Echauguettes; P P P Battlemants consisting of merlons and crenels alternately, the merlons being pierced by loopholes; Q Q Machicolations (those at Q defend the postern K); R Outwork defending the approach, which is a road ascending the hill and passing under all four faces of the castle; S S Wall of the outer bailey. The road of approach enters the bailey at T and passes thence into the castle by the main entrance gateway (which is in the wall between, and defended by the towers, C H) and over two drawbridges and through fortified passages to the inner court. 2. Any strong, imposing, and stately mansion. 3. A small tower, as on a ship, or an elephant's back. 4. A piece, made to represent a castle, used in the game of chess; a rook. Castle in the air, a visionary project; a baseless scheme; an air castle; -- sometimes called a castle in Spain (F. Château en Espagne). Syn. -- Fortress; fortification; citadel; stronghold. See Fortress.\n\nTo move the castle to the square next to king, and then the king around the castle to the square next beyond it, for the purpose of covering the king."}