{"word":"catch","definition":"1. To lay hold on; to seize, especially with the hand; to grasp (anything) in motion, with the effect of holding; as, to catch a ball. 2. To seize after pursuing; to arrest; as, to catch a thief. \"They pursued . . . and caught him.\" Judg. i. 6. 3. To take captive, as in a snare or net, or on a hook; as, to catch a bird or fish. 4. Hence: To insnare; to entangle. \"To catch him in his words\". Mark xii. 13. 5. To seize with the senses or the mind; to apprehend; as, to catch a melody. \"Fiery thoughts . . . whereof I catch the issue.\" Tennyson. 6. To communicate to; to fasten upon; as, the fire caught the adjoining building. 7. To engage and attach; to please; to charm. The soothing arts that catch the fair. Dryden. 8. To get possession of; to attain. Torment myself to catch the English throne. Shak. 9. To take or receive; esp. to take by sympathy, contagion, infection, or exposure; as, to catch the spirit of an occasion; to catch the measles or smallpox; to catch cold; the house caught fire. 10. To come upon unexpectedly or by surprise; to find; as, to catch one in the act of stealing. 11. To reach in time; to come up with; as, to catch a train. To catch fire, to become inflamed or ignited. -- to catch it to get a scolding or beating; to suffer punishment. [Colloq.] -- To catch one's eye, to interrupt captiously while speaking. [Colloq.] \"You catch me up so very short.\" Dickens. -- To catch up, to snatch; to take up suddenly.\n\n1. To attain possession. [Obs.] Have is have, however men do catch. Shak. 2. To be held or impeded by entanglement or a light obstruction; as, a kite catches in a tree; a door catches so as not to open. 3. To take hold; as, the bolt does not catch. 4. To spread by, or as by, infecting; to communicate. Does the sedition catch from man to man Addison. To catch at, to attempt to seize; to be egger to get or use. \"[To] catch at all opportunities of subverting the state.\" Addison. -- To catch up with, to come up with; to overtake.\n\n1. Act of seizing; a grasp. Sir P. Sidney. 2. That by which anything is caught or temporarily fastened; as, the catch of a gate. 3. The posture of seizing; a state of preparation to lay hold of, or of watching he opportunity to seize; as, to lie on the catch. [Archaic] Addison. The common and the canon law . . . lie at catch, and wait advantages one againt another. T. Fuller. 4. That which is caught or taken; profit; gain; especially, the whole quantity caught or taken at one time; as, a good catch of fish. Hector shall have a great catch if he knock out either of your brains. Shak. 5. Something desirable to be caught, esp. a husband or wife in matrimony. [Colloq.] Marryat. 6. pl.  Passing opportunities seized; snatches. It has been writ by catches with many intervals. Locke. 7. A slight remembrance; a trace. We retain a catch of those pretty stories. Glanvill. 8. (Mus.)  A humorous canon or round, so contrived that the singers catch up each other's words."}