{"word":"chamber","definition":"1. A retired room, esp. an upper room used for sleeping; a bedroom; as, the house had four chambers. 2. pl.  Apartments in a lodging house. \"A bachelor's life in chambers.\" Thackeray. 3. A hall, as where a king gives audience, or a deliberative body or assembly meets; as, presence chamber; senate chamber. 4. A legislative or judicial body; an assembly; a society or association; as, the Chamber of Deputies; the Chamber of Commerce. 5. A compartment or cell; an inclosed space or cavity; as, the chamber of a canal lock; the chamber of a furnace; the chamber of the eye. 6. pl. (Law.)  A room or rooms where a lawyer transacts business; a room or rooms where a judge transacts such official business as may be done out of court. 7. A chamber pot. [Colloq.] 8. (Mil.) (a) That part of the bore of a piece of ordnance which holds the charge, esp. when of different diameter from the rest of the bore; -- formerly, in guns, made smaller than the bore, but now larger, esp. in breech-loading guns. (b) A cavity in a mine, usually of a cubical form, to contain the powder. (c) A short piece of ornance or cannon, which stood on its breech, without any carriage, formerly used chiefly for rejoicings and theatrical cannonades. Air chamber. See Air chamber, in the Vocabulary. -- Chamber of commerce, a board or association to protect the interests of commerce, chosen from among the merchants and traders of a city. -- Chamber council, a secret council. Shak. -- Chamber counsel or counselor, a counselor who gives his opinion in private, or at his chambers, but does not advocate causes in court. -- Chamber fellow, a chamber companion; a roommate; a chum. -- Chamber hangings, tapestry or hangings for a chamber. -- Chamber lye, urine. Shak. -- Chamber music, vocal or instrumental music adapted to performance in a chamber or small apartment or audience room, instead of a theater, concert hall, or chuch. -- Chamber practice (Law.), the practice of counselors at law, who give their opinions in private, but do not appear in court. -- To sit at chambers, to do business in chambers, as a judge.\n\n1. To reside in or occupy a chamber or chambers. 2. To be lascivious. [Obs.]\n\n1. To shut up, as inn a chamber. Shak. 2. To furnish with a chamber; as, to chamber a gun."}