{"word":"charter","definition":"1. A written evidence in due form of things done or granted, contracts made, etc., between man and man; a deed, or conveyance. [Archaic] 2. An instrument in writing, from the sovereign power of a state or country, executed in due form, bestowing rights, franchises, or privileges. The king [John, a.d. 1215], with a facility somewhat suspicious, signed and sealed the charter which was required of him. This famous deed, commonly called the \"Great Charter,\" either granted or secured very important liberties and privileges to every order of men in the kingdom. Hume. 3. An act of a legislative body creating a municipal or other corporation and defining its powers and privileges. Also, an instrument in writing from the constituted authorities of an order or society (as the Freemasons), creating a lodge and defining its powers. 4. A special privilege, immunity, or exemption. My mother, Who has a charter to extol her blood, When she does praise me, grieves me. Shak. 5. (Com.)  The letting or hiring a vessel by special contract, or the contract or instrument whereby a vessel is hired or let; as, a ship is offered for sale or charter. See Charter party, below. Charter land (O. Eng. Law), land held by charter, or in socage; bookland. -- Charter member, one of the original members of a society or corporation, esp. one named in a charter, or taking part in the first proceedings under it. -- Charter party Etym: [F. chartre partie, or charte partie, a divided charter; from the practice of cutting the instrument of contract in two, and giving one part to each of the contractors] (Com.), a mercantile lease of a vessel; a specific contract by which the owners of a vessel let the entire vessel, or some principal part of the vessel, to another person, to be used by the latter in transportation for his own account, either under their charge or his. -- People's Charter (Eng. Hist.), the document which embodied the demands made by the Chartists, so called, upon the English government in 1838.\n\n1. To establish by charter. 2. To hire or let by charter, as a ship. See Charter party, under Charter, n."}