{"word":"chase","definition":"1. To pursue for the purpose of killing or taking, as an enemy, or game; to hunt. We are those which chased you from the field. Shak. Philologists, who chase A panting syllable through time and place. Cowper. 2. To follow as if to catch; to pursue; to compel to move on; to drive by following; to cause to fly; -- often with away or off; as, to chase the hens away. Chased by their brother's endless malice from prince to prince and from place to place. Knolles. 3. To pursue eagerly, as hunters pursue game. Chasing each other merrily. Tennyson.\n\nTo give chase; to hunt; as, to chase around after a doctor. [Colloq.]\n\n1. Vehement pursuit for the purpose of killing or capturing, as of an enemy, or game; an earnest seeking after any object greatly desired; the act or habit of hunting; a hunt. \"This mad chase of fame.\" Dryden. You see this chase is hotly followed. Shak. 2. That which is pursued or hunted. Nay, Warwick, seek thee out some other chase, For I myself must hunt this deer to death. Shak. 3. An open hunting ground to which game resorts, and which is private properly, thus differing from a forest, which is not private property, and from a park, which is inclosed. Sometimes written chace. [Eng.] 4. (Court Tennis)  A division of the floor of a gallery, marked by a figure or otherwise; the spot where a ball falls, and between which and the dedans the adversary must drive his ball in order to gain a point. Chase gun (Naut.), a cannon placed at the bow or stern of an armed vessel, and used when pursuing an enemy, or in defending the vessel when pursued. -- Chase port (Naut.), a porthole from which a chase gun is fired. -- Stern chase (Naut.), a chase in which the pursuing vessel follows directly in the wake of the vessel pursued.\n\n1. A rectangular iron frame in which pages or columns of type are imposed. 2. (Mil.)  The part of a cannon from the reënforce or the trunnions to the swell of the muzzle. See Cannon. 3. A groove, or channel, as in the face of a wall; a trench, as for the reception of drain tile. 4. (Shipbuilding)  A kind of joint by which an overlap joint is changed to a flush joint, by means of a gradually deepening rabbet, as at the ends of clinker-built boats.\n\n1. To ornament (a surface of metal) by embossing, cutting away parts, and the like. 2. To cut, so as to make a screw thread."}