{"word":"clear","definition":"1. Free from opaqueness; transparent; bright; light; luminous; unclouded. The stream is so transparent, pure, and clear. Denham. Fair as the moon, clear as the sun. Canticles vi. 10. 2. Free from ambiquity or indistinctness; lucid; perspicuous; plain; evident; manifest; indubitable. One truth is clear; whatever is, is right. Pop 3. Able to perceive clearly; keen; acute; penetrating; discriminating; as, a clear intellect; a clear head. Mother of science! now I feel thy power Within me clear, not only to discern Things in their causes, but to trace the ways Of highest agents. Milton. 4. Not clouded with passion; serene; cheerful. With a countenance as clear As friendship wears at feasts. Shak. 5. Easily or distinctly heard; audible; canorous. Hark! the numbers soft and clear Gently steal upon the ear. Pope. 6. Without mixture; entirely pure; as, clear sand. 7. Without defect or blemish, such as freckles or knots; as, a clear complexion; clear lumber. 8. Free from guilt or stain; unblemished. Statesman, yet friend to truth! in soul sincere, In action faithful, and in honor clear. Pope. 9. Without diminution; in full; net; as, clear profit. I often wished that I had clear, For life, six hundred pounds a-year. Swift . 10. Free from impediment or obstruction; unobstructed; as, a clear view; to keep clear of debt. My companion . . . left the way clear for him. Addison. 11. Free from embarrassment; detention, etc. The cruel corporal whispered in my ear, Five pounds, if rightly tipped, would set me clear. Gay. Clear breach. See under Breach, n., 4. -- Clear days (Law.), days reckoned from one day to another, excluding both the first and last day; as, from Sunday to Sunday there are six clear days. -- Clear stuff, boards, planks, etc., free from knots. Syn. -- Manifest; pure; unmixed; pellucid; transparent; luminous; obvious; visible; plain; evident; apparent; distinct; perspicuous. See Manifest.\n\nFull extent; distance between extreme limits; especially; the distance between the nearest surfaces of two bodies, or the space between walls; as, a room ten feet square in the clear.\n\n1. In a clear manner; plainly. Now clear I understand What oft . . . thoughts have searched in vain. Milton. 2. Without limitation; wholly; quite; entirely; as, to cut a piece clear off.\n\n1. To render bright, transparent, or undimmed; to free from clouds. He sweeps the skies and clears the cloudy north. Dryden. 2. To free from impurities; to clarify; to cleanse. 3. To free from obscurity or ambiguity; to relive of perplexity; to make perspicuous. Many knotty points there are Which all discuss, but few can clear. Prior. 4. To render more quick or acute, as the understanding; to make perspicacious. Our common prints would clear up their understandings. Addison 5. To free from impediment or incumbrance, from defilement, or from anything injurious, useless, or offensive; as, to clear land of trees or brushwood, or from stones; to clear the sight or the voice; to clear one's self from debt; -- often used with of, off, away, or out. Clear your mind of cant. Dr. Johnson. A statue lies hid in a block of marble; and the art of the statuary only clears away the superfluous matter. Addison. 6. To free from the imputation of guilt; to justify, vindicate, or acquit; -- often used with from before the thing imputed. I . . . am sure he will clear me from partiality. Dryden. How! wouldst thou clear rebellion Addison. 7. To leap or pass by, or over, without touching or fallure; as, to clear a hedge; to clear a reef. 8. To gain without deduction; to net. The profit which she cleared on the cargo. Macaulay. To clear a ship at the customhouse, to exhibit the documents required by law, give bonds, or perform other acts requisite, and procure a permission to sail, and such papers as the law requires. -- To clear a ship for action, or To clear for action (Naut.), to remove incumbrances from the decks, and prepare for an engagement. -- To clear the land (Naut.), to gain such a distance from shore as to have sea room, and be out of danger from the land. -- To clear hawse (Naut.), to disentangle the cables when twisted. -- To clear up, to explain; to dispel, as doubts, cares or fears.\n\n1. To become free from clouds or fog; to become fair; -- often fallowed by up, off, or away. So foul a sky clears without a strom. Shak. Advise him to stay till the weather clears up. Swift. 2. To disengage one's self frpm incumbrances, distress, or entanglements; to become free. [He that clears at once will relapse; for finding himself out of straits, he will revert to the customs; but he that cleareth by degrees induceth a habit of frugality. Bacon. 3. (Banking)  To make exchanges of checks and bills, and settle balances, as is done in a clearing house. 4. To obtain a clearance; as, the steamer cleared for Liverpool to- day. To clear out, to go or run away; to depart. [Colloq.]"}