{"word":"club","definition":"1. A heavy staff of wood, usually tapering, and wielded the hand; a weapon; a cudgel. But make you ready your stiff bats and clubs; Rome and her rats are at the point of battle. Shak. 2. Etym: [Cf. the Spanish name bastos, and Sp. baston staff, club.]  Any card of the suit of cards having a figure like the trefoil or clover leaf. (pl.) The suit of cards having such figure. 3. An association of persons for the promotion of some common object, as literature, science, politics, good fellowship, etc.; esp. an association supported by equal assessments or contributions of the members. They talked At wine, in clubs, of art, of politics. Tennyson. He [Goldsmith] was one of the nine original members of that celebrated fraternity which has sometimes been called the Literary Club, but which has always disclaimed that epithet, and still glories in the simple name of the Club. Macaulay. 4. A joint charge of expense, or any person's share of it; a contribution to a common fund. They laid down the club. L'Estrange. We dined at a French house, but paid ten shillings for our part of the club. Pepys. Club law, government by violence; lynch law; anarchy. Addison. -Club moss (Bot.), an evergreen mosslike plant, much used in winter decoration. The best know species is Lycopodium clavatum, but other Lycopodia are often called by this name. The spores form a highly inflammable powder. -- Club root (Bot.), a disease of cabbages, by which the roots become distorted and the heads spoiled. -- Club topsail (Naut.), a kind of gaff topsail, used mostly by yachts having a fore-and-aft rig. It has a short \"club\" or \"jack yard\" to increase its spread.\n\n1. To beat with a club. 2. (Mil.)  To throw, or allow to fall, into confusion. To club a battalion implies a temporary inability in the commanding officer to restore any given body of men to their natural front in line or column. Farrow. 3. To unite, or contribute, for the accomplishment of a common end; as, to club exertions. 4. To raise, or defray, by a proportional assesment; as, to club the expense. To club a musket (Mil.), to turn the breach uppermost, so as to use it as a club.\n\n1. To form a club; to combine for the promotion of some common object; to unite. Till grosser atoms, tumbling in the stream Of fancy, madly met, and clubbed into a dream. Dryden. 2. To pay on equal or proportionate share of a common charge or expense; to pay for something by contribution. The owl, the raven, and the bat, Clubbed for a feather to his hat. Swift. 3. (Naut.)  To drift in a current with an anchor out."}