{"word":"collateral","definition":"1. Coming from, being on, or directed toward, the side; as, collateral pressure. \"Collateral light.\" Shak. 2. Acting in an indirect way. If by direct or by collateral hand They find us touched, we will our kingdom give . . . To you in satisfaction. Shak. 3. Related to, but not strictly a part of, the main thing or matter under consideration; hence, subordinate; not chief or principal; as, collateral interest; collateral issues. That he [Attebury] was altogether in the wrong on the main question, and on all the collateral questions springing out of it, . . . is true. Macaulay. 4. Tending toward the same conclusion or result as something else; additional; as, collateral evidence. Yet the attempt may give Collateral interest to this homely tale. Wordsworth. 5. (Genealogy)  Descending from the same stock or ancestor, but not in the same line or branch or one from the other; -- opposed to lineal. Note: Lineal descendants proceed one from another in a direct line; collateral relations spring from a common ancestor, but from different branches of that common stirps or stock. Thus the children of brothers are collateral relations, having different fathers, but a common grandfather. Blackstone. Collateral assurance, that which is made, over and above the deed itself. -- Collateral circulation (Med. & Physiol.), circulation established through indirect or subordinate branches when the supply through the main vessel is obstructed. -- Collateral issue. (Law) (a) An issue taken upon a matter aside from the merits of the case. (b) An issue raised by a criminal convict who pleads any matter allowed by law in bar of execution, as pardon, diversity of person, etc. (c) A point raised, on cross- examination, aside from the issue fixed by the pleadings, as to which the answer of the witness, when given, cannot subsequently be contradicted by the party asking the question. -- Collateral security, security for the performance of covenants, or the payment of money, besides the principal security,\n\n1. A collateral relative. Ayliffe. 2. Collateral security; that which is pledged or deposited as collateral security."}