{"word":"comfort","definition":"1. To make strong; to invigorate; to fortify; to corroborate. [Obs.] Wyclif. God's own testimony . . . doth not a little comfort and confirm the same. Hooker. 2. To assist or help; to aid. [Obs.] I . . . can not help the noble chevalier: God comfort him in this necessity! Shak. 3. To impart strength and hope to; to encourage; to relieve; to console; to cheer, Light excelleth in comforting the spirits of men. Bacon. That we may be adle to comfort them that are in any affliction. 2 Cor. i. 4. (Rev. Ver. ). A perfect woman, nobly planned, To warn, to comfort, and command. Wordsworth. Syn. -- To cheer; solace; console; revive; encourage; enliven; invigorate; inspirit, gladden; recreate; exhilarate; refresh; animate; confirm; strengthen. -- To Comfort, Console, Solace. These verbs all suppose some antecedent state of suffering or sorrow. Console in confined to the act giving sympathetic relief to the mind under affliction or sorrow, and points to some definite source of that relief; as, the presence of his friend consoled him; he was much consoled by this intelligence. The act of consoling commonly implies the inculcation of resignation. Comfort points to relief afforded by the communication of positive pleasure, hope, and strength, as well as by the diminution of pain; as, \"They brought the young man alive, and were not a little comforted.\" Acts xx. 12. Note: Solace is from L. solacium, which means according to Dumesnil, consolation inwardly felt or applied to the case of the sufferer. Hence, the verb to solace denotes the using of things for the purpose of affording relief under sorrow or suffering; as, to solace one's self with reflections, with books, or with active employments.\n\n1. Assistance; relief; support. [Obs. except in the phrase \"aid and comfort.\" See 5 below.] Shak. 2. Encouragement; solace; consolation in trouble; also, that which affords consolation. In comfort of her mother's fears. Shak. Cheer thy spirit with this comfort. Shak. Speaking words of endearment where words of comfort availed not. Longfellow. 3. A state of quiet enjoyment; freedom from pain, want, or anxiety; also, whatever contributes to such a condition. I had much joy and comfort in thy love. Phil. 7 (Rev. Ver. ). He had the means of living in comfort. Macaulay. 4. A wadded bedquilt; a comfortable. [U. S.] 5. (Law)  Unlawful support, countenance, or encouragement; as, to give aid and comfort to the enemy. Syn. -- Comfort, Consolation. Comfort has two meanings: 1. Strength and relief received under affliction; 2. Positive enjoyment, of a quiet, permanent nature, together with the sources thereof; as, the comfort of love; surrounded with comforts; but it is with the former only that the word consolation is brought into comparison. As thus compared, consolation points to some specific source of relief for the afflicted mind; as, the consolations of religion. Comfort supposes the relief to be afforded by imparting positive enjoyment, as well as a diminution of pain. \"Consolation, or comfort, signifies some alleviation to that pain to which it is not in our power to afford the proper and adequate remedy; they imply rather an augmentation of the power of bearing, than a diminution of the burden.\" Johnson."}