{"word":"commit","definition":"1. To give in trust; to put into charge or keeping; to intrust; to consign; -- used with to, unto. Commit thy way unto the Lord. Ps. xxxvii. 5. Bid him farewell, commit him to the grave. Shak. 2. To put in charge of a jailor; to imprison. These two were commited. Clarendon. 3. To do; to perperate, as a crime, sin, or fault. Thou shalt not commit adultery. Ex. xx. 14. 4. To join a contest; to match; -- followed by with. [R.] Dr. H. More. 5. To pledge or bind; to compromise, expose, or endanger by some decisive act or preliminary step; -- often used reflexively; as, to commit one's self to a certain course. You might have satisfied every duty of political friendship, without commiting the honor of your sovereign. Junius. Any sudden assent to the proposal . . . might possibly be considered as committing the faith of the United States. Marshall. 6. To confound. [An obsolete Latinism.] Committing short and long [quantities]. Milton. To commit a bill (Legislation), to refer or intrust it to a committee or others, to be considered and reported. -- To commit to memory, or To commit, to learn by heart; to memorize. Syn. -- To Commit, Intrust, Consign. These words have in common the idea of transferring from one's self to the care and custody of another. Commit is the widest term, and may express only the general idea of delivering into the charge of another; as, to commit a lawsuit to the care of an attorney; or it may have the special sense of intrusting with or without limitations, as to a superior power, or to a careful servant, or of consigning, as to writing or paper, to the flames, or to prison. To intrust denotes the act of committing to the exercise of confidence or trust; as, to intrust a friend with the care of a child, or with a secret. To consign is a more formal act, and regards the thing transferred as placed chiefly or wholly out of one's immediate control; as, to consign a pupil to the charge of his instructor; to consign goods to an agent for sale; to consign a work to the press.\n\nTo sin; esp., to be incontinent. [Obs.] Commit not with man's sworn spouse. Shak."}