{"word":"common","definition":"1. Belonging or relating equally, or similary, to more than one; as, you and I have a common interest in the property. Though life and sense be common to men and brutes. Sir M. Hale. 2. Belonging to or shared by, affecting or serving, all the members of a class, consired together; general; public; as, propertis common to all plants; the common schools; the Book of Common Prayer. Such actions as the common good requereth. Hocker. The common enemy of man. Shak. 3. Often met with; usual; frequent; customary. Grief more than common grief. Shak. 4. Not distinguished or exceptional; inconspicuous; ordinary; plebeian; -- often in a depreciatory sense. The honest, heart-felt enjoyment of common life. W. Irving. This fact was infamous And ill beseeming any common man, Much more a knight, a captain and a leader. Shak. Above the vulgar flight of common souls. A. Murpphy. 5. Profane; polluted. [Obs.] What God hath cleansed, that call not thou common. Acts x. 15. 6. Given to habits of lewdness; prostitute. A dame who herself was common. L'Estrange. Common bar (Law) Same as Blank bar, under Blank. -- Common barrator (Law), one who makes a business of instigating litigation. -- Common Bench, a name sometimes given to the English Court of Common Pleas. -- Common brawler (Law), one addicted to public brawling and quarreling. See Brawler. -- Common carrier (Law), one who undertakes the office of carrying (goods or persons) for hire. Such a carrier is bound to carry in all cases when he has accommodation, and when his fixed price is tendered, and he is liable for all losses and injuries to the goods, except those which happen in consequence of the act of God, or of the enemies of the country, or of the owner of the property himself. -- Common chord (Mus.), a chord consisting of the fundamental tone, with its third and fifth. -- Common council, the representative (legislative) body, or the lower branch of the representative body, of a city or other munisipal corporation. -- Common crier, the crier of a town or city. -- Common divisor (Math.), a number or quantity that divides two or more numbers or quantities without a remainder; a common measure. -- Common gender (Gram.), the gender comprising words that may be of either the masculine or the feminine gender. -- Common law, a system of jurisprudence developing under the guidance of the courts so as to apply a consistent and reasonable rule to each litigated case. It may be superseded by statute, but unless superseded it controls. Wharton. Note: It is by others defined as the unwritten law (especially of England), the law that receives its binding force from immemorial usage and universal reception, as ascertained and expressed in the judgments of the courts. This term is often used in contradistinction from statute law. Many use it to designate a law common to the whole country. It is also used to designate the whole body of English (or other) law, as distinguished from its subdivisions, local, civil, admiralty, equity, etc. See Law. -- Common lawyer, one versed in common law. -- Common lewdness (Law), the habitual performance of lewd acts in public. -- Common multiple (Arith.) See under Multiple. -- Common noun (Gram.), the name of any one of a class of objects, as distinguished from a proper noun (the name of a particular person or thing). -- Common nuisance (Law), that which is deleterious to the health or comfort or sense of decency of the community at large. -- Common pleas, one of the three superior courts of common law at Westminster, presided over by a chief justice and four puisne judges. Its jurisdiction is confined to civil matters. Courts bearing this title exist in several of the United States, having, however, in some cases, botth civil and criminal jurisdiction extending over the whole State. In other States the jurisdiction of the common pleas is limited to a county, and it is sometimes called a county court. Its powers are generally defined by statute. -- Common prayer, the liturgy of the Church of England, or of the Protestant Episcopal church of the United States, which all its clergy are enjoined use. It is contained in the Book of Common Prayer. -- Common school, a school maintained at the public expense, and open to all. -- Common scold (Law), a woman addicted to scolding indiscriminately, in public. -- Common seal, a seal adopted and used by a corporation. -- Common sense. (a) A supposed sense which was held to be the common bond of all the others. [Obs.] Trench. (b) Sound judgment. See under Sense. -- Common time (Mus.), that variety of time in which the measure consists of two or of four equal portions. -- In common, equally with another, or with others; owned, shared, or used, in community with others; affecting or affected equally. -- Out of the common, uncommon; extraordinary. -- Tenant in common, one holding real or personal property in common with others, having distinct but undivided interests. See Joint tenant, under Joint. -- To make common cause with, to join or ally one's self with. Syn. -- General; public; popular; universal; frequent; ordinary; customary; usual; familiar; habitual; vulgar; mean; trite; stale; threadbare; commonplace. See Mutual, Ordinary, General.\n\n1. The people; the community. [Obs.] \"The weal o' the common.\" Shak. 2. An inclosed or uninclosed tract of ground for pleasure, for pasturage, etc., the use of which belongs to the public; or to a number of persons. 3. (Law)  The right of taking a profit in the land of another, in common either with the owner or with other persons; -- so called from the community of interest which arises between the claimant of the right and the owner of the soil, or between the claimants and other commoners entitled to the same right. Common appendant, a right belonging to the owners or occupiers of arable land to put commonable beasts upon the waste land in the manor where they dwell. -- Common appurtenant, a similar right applying to lands in other manors, or extending to other beasts, besides those which are generally commonable, as hogs. -- Common because of vicinage or neighborhood, the right of the inhabitants of each of two townships, lying contiguous to each other, which have usually intercommoned with one another, to let their beasts stray into the other's fields. -- Common in gross or at large, a common annexed to a man's person, being granted to him and his heirs by deed; or it may be claimed by prescriptive right, as by a parson of a church or other corporation sole. Blackstone. -- Common of estovers, the right of taking wood from another's estate. -- Common of pasture, the right of feeding beasts on the land of another. Burill. -- Common of piscary, the right of fishing in waters belonging to another. -- Common of turbary, the right of digging turf upon the ground of another.\n\n1. To converse together; to discourse; to confer. [Obs.] Embassadors were sent upon both parts, and divers means of entreaty were commoned of. Grafton. 2. To participate. [Obs.] Sir T. More. 3. To have a joint right with others in common ground. Johnson. 4. To board together; to eat at a table in common."}