{"word":"compass","definition":"1. A passing round; circuit; circuitous course. They fetched a compass of seven day's journey. 2 Kings iii. 9. This day I breathed first; time is come round, And where I did begin, there shall I end; My life is run his compass. Shak. 2. An inclosing limit; boundary; circumference; as, within the compass of an encircling wall. 3. An inclosed space; an area; extent. Their wisdom . . . lies in a very narrow compass. Addison. 4. Extent; reach; sweep; capacity; sphere; as, the compass of his eye; the compass of imagination. The compass of his argument. Wodsworth. 5. Moderate bounds, limits of truth; moderation; due limits; -- used with within. In two hundred years before (I speak within compass), no such commission had been executed. Sir J. Davies. 6. (Mus.)  The range of notes, or tones, within the capacity of a voice or instument. You would sound me from my lowest note to the top of my compass. Shak. 7. An instrument for determining directions upon the carth's surface by means of a magnetized bar or needle turning freely upon a pivot and pinting in a northerly and southerly direction. He that firat discovered the use of the compass did more for the supplying and increase of useful commodities than those who built workhouses. Locke. 8. A pair of compasses. [R.] To fix one foot of their compass wherever they please. Swift. 9. A circle; a continent. [Obs.] The tryne compas [the threefold world containing earth, sea, and heaven. Skeat.] Chaucer. Azimuth compass. See under Azimuth. -- Beam compass. See under Beam. -- Compass card, the eircular card attached to the needles of a mariner's compass, on which are marked the thirty-two points or rhumbs. -- Compass dial, a small pocket compass fitted with a sundial to tell the hour of the day. -- Compass plane (Carp.), a plane, convex in the direction of its length on the under side, for smoothing the concave faces of curved woodwork. -- Compass plant, Compass flower (Bot.), a plant of the American prairies (Silphium laciniatum), not unlike a small sunflower; rosinweed. Its lower and root leaves are vertical, and on the prairies are disposed to present their edges north and south. Its leaves are turned to the north as true as the magnet: This is the compass flower. Longefellow. -- Compass saw, a saw with a narrow blade, which will cut in a curve; -- called also fret saw and keyhole saw. -- Compass timber (Shipbuilding), curved or crooked timber. -- Compass window (Arch.), a circular bay window or oriel window. It has two or more magnetic needles permanently attached to a card, which moves freely upon a pivot, and is read with reference to a mark on the box representing the ship's head. The card is divided into thirty-two points, called also rhumbs, and the glass-covered box or bowl containing it is suspended in gimbals within the binnacle, in order to preserve its horizontal position. -- Surveyor's compass, an instrument used in surveying for measuring horizontal angles. See Circumferentor. -- Variation compass, a compass of delicate construction, used in observations on the variations of the needle. -- To fetch a compass, to make a circuit.\n\n1. To go about or entirely round; to make the circuit of. Ye shall compass the city seven times. Josh. vi. 4. We the globe can compass soon. Shak. 2. To inclose on all sides; to surround; to encircle; to envior; to invest; to besiege; -- used with about, round, around, and round about. With terrors and with clamors compassed round. Milton. Now all the blessings Of a glad cast a trench about thee, and compass thee round.uke xix. 43. 3. To reach round; to circumvent; to get within one's power; to obtain; to accomplish. If I can chek my erring love, I will: If not, to compass her I'll use my skill. Shak. How can you to compass your designs Denham. 4. To curve; to bend into a circular form. [Obs. except in carpentry and shipbuilding.] Shak. 5. (Law)  To purpose; to intend; to imagine; to plot. Compassing and imagining the death of the king are synonymous terms; compassing signifying the purpose or design of the mind or will, and not, as in common speech, the carrying such design to effect. Blackstone."}