{"word":"compound","definition":"In the East Indies, an inclosure containing a house, outbuildings, etc.\n\n1. To form or make by combining different elements, ingredients, or parts; as, to compound a medicine. Incapacitating him from successfully compounding a tale of this sort. Sir W. Scott. 2. To put together, as elements, ingredients, or parts, in order to form a whole; to combine, mix, or unite. We have the power of altering and compounding those images into all the varieties of picture. Addison. 3. To modify or change by combination with some other thing or part; to mingle with something else. Only compound me with forgotten dust. Shak. 4. To compose; to constitute. [Obs.] His pomp and all what state compounds. Shak. 5. To settle amicably; to adjust by agreement; to compromise; to discharge from obligation upon terms different from those which were stipulated; as, to compound a debt. I pray, my lords, let me compound this strife. Shak. To compound a felony, to accept of a consideration for forbearing to prosecute, such compounding being an indictable offense. See Theftbote.\n\nTo effect a composition; to come to terms of agreement; to agree; to settle by a compromise; -- usually followed by with before the person participating, and for before the thing compounded or the consideration. Here's a fellow will help you to-morrow; . . . compound with him by the year. Shak. They were at last glad to compound for his bare commitment to the Tower. Clarendon. Cornwall compounded to furnish ten oxen after Michaelmas for thirty pounds. R. Carew. Compound for sins they are inclined to By damning those they have no mind to. Hudibras.\n\nComposed of two or more elements, ingredients, parts; produced by the union of several ingredients, parts, or things; composite; as, a compound word. Compound substances are made up of two or more simple substances. I. Watts. Compound addition, substraction, multiplication, division (Arith.), the addition, substraction, etc., of compound numbers. -- Compound crystal (Crystallog.), a twin crystal, or one seeming to be made up of two or more crystals combined according to regular laws of composition. -- Compound engine (Mech.), a form of steam engine in which the steam that has been used in a high-pressure cylinder is made to do further service in a larger low-pressure cylinder, sometimes in several larger cylinders, successively. -- Compound ether. (Chem.) See under Ether. -- Compound flower (Bot.), a flower head resembling a single flower, but really composed of several florets inclosed in a common calyxlike involucre, as the sunflower or dandelion. -- Compound fraction. (Math.) See Fraction. -- Compound fracture. See Fracture. -- Compound householder, a householder who compounds or arranges with his landlord that his rates shall be included in his rents. [Eng.] -- Compound interest. See Interest. -- Compound larceny. (Law) See Larceny. -- Compound leaf (Bot.), a leaf having two or more separate blades or leaflets on a common leafstalk. -- Compound microscope. See Microscope. -- Compound motion. See Motion. -- Compound number (Math.), one constructed according to a varying scale of denomination; as, 3 cwt., 1 qr., 5 lb.; -- called also denominate number. -- Compound pier (Arch.), a clustered column. -- Compound quantity (Alg.), a quantity composed of two or more simple quantities or terms, connected by the sign + (plus) or - (minus). Thus, a + b - c, and bb - b, are compound quantities. -- Compound radical. (Chem.) See Radical. -- Compound ratio (Math.), the product of two or more ratios; thus ab:cd is a ratio compounded of the simple ratios a:c and b:d. -- Compound rest (Mech.), the tool carriage of an engine lathe. -- Compound screw (Mech.), a screw having on the same axis two or more screws with different pitch (a differential screw), or running in different directions (a right and left screw). -- Compound time (Mus.), that in which two or more simple measures are combined in one; as, 6-8 time is the joining of two measures of 3-8 time. -- Compound word, a word composed of two or more words; specifically, two or more words joined together by a hyphen.\n\n1. That which is compounded or formed by the union or mixture of elements ingredients, or parts; a combination of simples; a compound word; the result of composition. Shak. Rare compound of oddity, frolic, and fun. Goldsmith. When the word \"bishopric\" was first made, it was made as a compound. Earle. 2. (Chem.)  A union of two or more ingredients in definite proportions by weight, so combined as to form a distinct substance; as, water is a compound of oxygen and hydrogen. Note: Every definite chemical compound always contains the same elements, united in the same proportions by weight, and with the same internal arrangement. Binary compound (Chem.). See under Binary. -- Carbon compounds (Chem.). See under Carbon."}