{"word":"compare","definition":"1. To examine the character or qualities of, as of two or more persons or things, for the purpose of discovering their resemblances or differences; to bring into comparison; to regard with discriminating attention. Compare dead happiness with living woe. Shak. The place he found beyond expression bright, Compared with aught on earth. Milton. Compare our faces and be judge yourself. Shak. To compare great things with small. Milton. 2. To represent as similar, for the purpose of illustration; to liken. Solon compared the people unto the sea, and orators and counselors to the winds; for that the sea would be calm and quiet if the winds did not trouble it. Bacon. 3. (Gram.)  To inflect according to the degrees of comparison; to state positive, comparative, and superlative forms of; as, most adjectives of one syllable are compared by affixing \"-er\" and \"-est\" to the positive form; as, black, blacker, blackest; those of more than one syllable are usually compared by prefixing \"more\" and \"most\", or \"less\" and \"least\", to the positive; as, beautiful, more beautiful, most beautiful. Syn. -- To Compare, Compare with, Compare to. Things are compared with each other in order to learn their relative value or excellence. Thus we compare Cicero with Demosthenes, for the sake of deciding which was the greater orator. One thing is compared to another because of a real or fanciful likeness or similarity which exists between them. Thus it has been common to compare the eloquence of Demosthenes to a thunderbolt, on account of its force, and the eloquence of Cicero to a conflagration, on account of its splendor. Burke compares the parks of London to the lungs of the human body.\n\n1. To be like or equal; to admit, or be worthy of, comparison; as, his later work does not compare with his earlier. I should compare with him in excellence. Shak. 2. To vie; to assume a likeness or equality. Shall pack horses . . . compare with Cæsars Shak.\n\n1. Comparison. [Archaic] His mighty champion, strong beyond compare. Milton. Their small galleys may not hold compare With our tall ships. Waller. 2. Illustration by comprison; simile. [Obs.] Rhymes full of protest, of oath, and big compare. Shak. Beyond compare. See Beyond comparison, under Comparison.\n\nTo get; to procure; to obtain; to acquire [Obs.] To fill his bags, and richesse to compare. Spenser."}