{"word":"composition","definition":"1. The act or art of composing, or forming a whole or integral, by placing together and uniting different things, parts, or ingredients. In specific uses: (a) The invention or combination of the parts of any literary work or discourse, or of a work of art; as, the composition of a poem or a piece of music. \"The constant habit of elaborate composition.\" Macaulay. (b) (Fine Arts) The art or practice of so combining the different parts of a work of art as to produce a harmonious whole; also, a work of art considered as such. See 4, below. (c) The act of writing for practice in a language, as English, Latin, German, etc. (d) (Print.) The setting up of type and arranging it for printing. 2. The state of being put together or composed; conjunction; combination; adjustment. View them in composition with other things. I. Watts. The elementary composition of bodies. Whewell. 3. A mass or body formed by combining two or more substances; as, a chemical composition. A omposition that looks . . . like marble. Addison. 4. A literary, musical, or artistic production, especially one showing study and care in arrangement; -- often used of an elementary essay or translation done as an educational exercise. 5. Consistency; accord; congruity. [Obs.] There is no composition in these news That gives them credit. Shak. 6. Mutual agreement to terms or conditions for the settlement of a difference or controversy; also, the terms or conditions of settlement; agreement. Thus we are agreed: I crave our composition may be written. Shak. 7. (Law)  The adjustment of a debt, or avoidance of an obligation, by some form of compensation agreed on between the parties; also, the sum or amount of compensation agreed upon in the adjustment. Compositions for not taking the order of knighthood. Hallam. Cleared by composition with their creditors. Blackstone. 8. Synthesis as opposed to analysis. The investigation of difficult things by the method of analysis ought ever to precede the method of composition. Sir I. Newton. Composition cloth, a kind of clotch covered with a preparation making it waterproof. -- Composition deed, an agreement for composition between a debtor and several creditors. -- Composition plane (Crystallog.), the plane by which the two individuals of a twin crystal are united in their reserved positions. -- Composition of forces (Mech.), the finding of a single force (called the resultant) which shall be equal in effect to two or more given forces (called the components) when acting in given directions. Herbert. -- Composition metal, an alloy resembling brass, which is sometimes used instead of copper for sheathing vessels; -- also called Muntz metal and yellow metal. -- Composition of proportion (Math.), an arrangement of four proportionals so that the sum of the arrangement of four proportionals so that the sum of the third and fourth to the fourth.COMPOSITIVE Com*pos\"i*tive, a. Etym: [L. compositivus.]  Having the quality of entering into composition; compounded. [R.]"}