{"word":"concrete","definition":"1. United in growth; hence, formed by coalition of separate particles into one mass; united in a solid form. The first concrete state, or consistent surface, of the chaos must be of the same figure as the last liquid state. Bp. Burnet. 2. (Logic) (a) Standing for an object as it exists in nature, invested with all its qualities, as distingushed from standing for an attribute of an object; -- opposed to abstract. Hence: (b) Applied to a specific object; special; particular; -- opposed to general. See Abstract, 3. Concrete is opposed to a abstract. The names of individuals are concrete, those of classes abstract. J. S. Mill. Concrete terms, while they express the quality, do also express, or imply, or refer to, some subject to which it belongs. I. Watts. Concrete number, a number associated with, or applied to, a particular object, as three men, five days, etc., as distinguished from an abstract number, or one used without reference to a particular object. -- Concrete quantity, a physical object or a collection of such objects. Davies & Peck. -- Concrete science, a physical science, one having as its subject of knowledge concrete things instead of abstract laws. -- Concrete sound or movement of the voice, one which slides continuously up or down, as distinguished from a discrete movement, in which the voice leaps at once from one line of pitch to another. Rush.\n\n1. A compound or mass formed by concretion, spontaneous union, or coalescence of separate particles of matter in one body. To divide all concretes, minerals and others, into the same number of distinct substances. Boyle. 2. A mixture of gravel, pebbles, or broken stone with cement or with tar, etc., used for sidewalks, roadways, foundations, etc., and esp. for submarine structures. 3. (Logic)  A term designating both a quality and the subject in which it exists; a concrete term. The concretes \"father\" and \"son\" have, or might have, the abstracts \"paternity\" and \"filiety\". J. S. Mill. 4. (Sugar Making)  Sugar boiled down from cane juice to a solid mass.\n\nTo unite or coalesce, as separate particles, into a mass or solid body. Note: Applied to some substances, it is equivalent to indurate; as, metallic matter concretes into a hard body; applied to others, it is equivalent to congeal, thicken, inspissate, coagulate, as in the concretion of blood. \"The blood of some who died of the plague could not be made to concrete.\" Arbuthnot.\n\n1. To form into a mass, as by the cohesion or coalescence of separate particles. There are in our inferior world divers bodies that are concreted out of others. Sir M. Hale. 2. To cover with, or form of, concrete, as a pavement."}