{"word":"confess","definition":"1. To make acknowledgment or avowal in a matter pertaining to one's self; to acknowledge, own, or admit, as a crime, a fault, a debt. And there confess Humbly our faults, and pardon beg. Milton. I must confess I was most pleased with a beautiful prospect that none of them have mentioned. Addison. 2. To acknowledge faith in; to profess belief in. Whosoever, therefore, shall confess me before men, him will I confess, also, before my Father which is in heaven. Matt. x. 32. For the Sadducees say that there is no resurrection, neither angel, nor spirit; but the Pharisees confess both. Acts xxiii. 8. 3. To admit as true; to assent to; to acknowledge, as after a previous doubt, denial, or concealment. I never gave it him. Send for him hither, And let him confess a truth. Shak. As I confess it needs must be. Tennyson. As an actor confessed without rival to shine. Goldsmith. 4. (Eccl.) (a) To make known or acknowledge, as one's sins to a priest, in order to receive absolution; -- sometimes followed by the reflexive pronoun. Our beautiful votary took an opportunity of confessing herself to this celebrated father. Addison. (b) To hear or receive such confession; -- said of a priest. He . . . heard mass, and the prince, his son, with him, and the most part of his company were confessed. Ld. Berners. 5. To disclose or reveal, as an effect discloses its cause; to prove; to attest. Tall thriving trees confessed the fruitful mold. Pope. Syn. -- Admit; grant; concede; avow; own; assent; recognize; prove; exhibit; attest. -- To Confess, Acknowledge, Avow. Acknowledge is opposed to conceal. We acknowledge what we feel must or ought to be made known. (See Acknowledge.) Avow is opposed to withhold. We avow when we make an open and public declaration, as against obloquy or opposition; as, to avow one's principles; to avow one's participation in some act. Confess is opposed to deny. We confess (in the ordinary sense of the word) what we feel to have been wrong; as, to confess one's errors or faults. We sometimes use confess and acknowledge when there is no admission of our being in the wrong; as, this, I confess, is my opinion; I acknowledge I have always thought so; but in these cases we mean simply to imply that others may perhaps think us in the wrong, and hence we use the words by way of deference to their opinions. It was in this way that the early Christians were led to use the Latin confiteor and confessio fidei to denote the public declaration of their faith in Christianity; and hence the corresponding use in English of the verb confess and the noun confession.\n\n1. To make confession; to disclose sins or faults, or the state of the conscience. Every tongue shall confess to God. Rom. xiv. 11. 2. To acknowledge; to admit; to concede. But since (And I confess with right) you think me bound. Tennyson."}