{"word":"congress","definition":"1. A meeting of individuals, whether friendly or hostile; an encounter. [Obs.] Here Pallas urges on, and Lausus there;congress in the field great Jove withstands. Dryden. 2. A sudden encounter; a collision; a shock; -- said of things. [Obs.] From these laws may be deduced the rules of the congresses and reflections of two bodies. Cheyne. 3. The coming together of a male and female in sexual commerce; the act of coition. Pennant. 4. A gathering or assembly; a conference. 5. A formal assembly, as of princes, deputies, representatives, envoys, or commissioners; esp., a meeting of the representatives of several governments or societies to consider and determine matters of common interest. The European powers strove to . . . accommodate their differences at the congress of Vienna. Alison. 6. The collective body of senators and representatives of the people of a nation, esp. of a republic, constituting the chief legislative body of the nation. Note: In the Congress of the United States (which took the place of the Federal Congress, March 4, 1789), the Senate consists of two Senators from each State, chosen by the State legislature for a term of six years, in such a way that the terms of one third of the whole number expire every year; the House of Representatives consists of members elected by the people of the several Congressional districts, for a term of two years, the term of all ending at the same time. The united body of Senators and Representatives for any term of two years for which the whole body of Representatives is chosen is called one Congress. Thus the session which began in December, 1887, was the first (or long) session, and that which began in December, 1888, was the second (or short) session, of the Fiftieth Congress. When an extra session is had before the date of the first regular meeting of a Congress, that is called the first session, and the following regular session is called the second session. 7. The lower house of the Spanish Cortes, the members of which are elected for three years. The Continental Congress, an assembly of deputies from the thirteen British colonies in America, appointed to deliberate in respect to their common interests. They first met in 1774, and from time thereafter until near the close of the Revolution. -- The Federal Congress, the assembly of representatives of the original States of the American Union, who met under the Articles of Confederation from 1781 till 1789. -- Congress boot or gaiter, a high shoe or half-boot, coming above the ankle, and having the sides made in part of some elastic material which stretches to allow the boot to be drawn on and off. [U.S.] -- Congress water, a saline mineral water from the Congress spring at Saratoga, in the State of New York. Syn. -- Assembly; meeting; convention; convocation; council; diet; conclave; parliament; legislature."}