{"word":"conquer","definition":"1. To gain or acquire by force; to take possession of by violent means; to gain dominion over; to subdue by physical means; to reduce; to overcome by force of arms; to cause to yield; to vanquish. \"If thou conquer Rome.\" Shak. If we be conquer'd, let men conquer us. Shak. We conquered France, but felt our captive's charms. Pope. 2. To subdue or overcome by mental or moral power; to surmount; as, to conquer difficulties, temptatin, etc. By winning words to conquer hearts, And make persuasion do the work of fear. Milton. 3. To gain or obtain, overcoming obstacles in the way; to win; as, to conquer freedom; to conquer a peace. Syn. -- To subdue; vanquish; overcome; overpower; overthrow; defeat; rout; discomfit; subjugate; reduce; humble; crush; surmount; subject; master. -- To Conquer, Vanquish, Subdue, Subjugate, Overcome. These words agree in the general idea expressed by overcome, -- that of bringing under one's power by the exertion of force. Conquer is wider and more general than vanquish, denoting usually a succession of conflicts. Vanquish is more individual, and refers usually to a single conflict. Thus, Alexander conquered Asia in a succession of battles, and vanquished Darius in one decisive engagement. Subdue implies a more gradual and continual pressure, but a surer and more final subjection. We speak of a nation as subdued when its spirit is at last broken, so that no further resistance is offered. Subjugate is to bring completely under the yoke of bondage. The ancient Gauls were never finally subdued by the Romans until they were completely subjugated. These words, when used figuratively, have correspondent meanings. We conquer our prejudices or aversions by a succesion of conflicts; but we sometimes vanquish our reluctance to duty by one decided effort: we endeavor to subdue our evil propensities by watchful and persevering exertions. Subjugate is more commonly taken in its primary meaning, and when used figuratively has generally a bad sense; as, his reason was completely subjugated to the sway of his passions.\n\nTo gain the victory; to overcome; to prevail. He went forth conquering and to conquer. Rev. vi. 2. The champions resolved to conquer or to die. Waller."}