{"word":"constable","definition":"1. A high officer in the monarhical establishments of the Middle Ages. Note: The constable of France was the first officer of the crown, and had the chief ommand of the army. It was also his duty to regulate all matters of chivalry. The office was suppressed in 1627. The constable, or lord high constable, of England, was one of the highest officers of the crown, commander in chief of the forces, and keeper of the peace of the nation. He also judicial cognizance of many important matters. The office was as early as the Conquest, but has been disused (except on great and solemn occasions), since the attainder of Stafford, duke of Buckingham, in the reign of Henry VIII. 2. (Law)  An officer of the peace having power as a conservator of the public peace, and bound to exeute the warrants of judicial offiers. Bouvier. Note: In England, at the present time, the constable is a conservator of the peace within his district, and is also charged by various statutes with other duties, such as serving summons, precepts, warrants, etc. In the United States, constables are town or its officers of the peace, with powers similar to those of the constables of England. In addition to their duties as conservators of the peace, they are invested with others by statute, such as to execute civil as well as criminal process in certain cases, to attend courts, keep juries, etc. In some cities, there are officers called high constables, who act as shiefs of the constabulary or police force. In other cities the title of constable, as well as the office, is merged in that of the polie officer. High constable, a constable having certain duties and powers within a hundred. [Eng.] -- Petty constable, a conservator of the peace within a parish or tithing; a tithingman. [Eng.] -- Special constable, a person appointed to act as constable of special occasions. -- To overrun, or outrun, the constable, the spend more than one's income; to get into debt. [Colloq.] Smollett."}