{"word":"contract","definition":"1. To draw together or nearer; to reduce to a less compass; to shorten, narrow, or lesen; as, to contract one's shpere of action. In all things desuetude doth contract and narrow our faculties. Dr. H. More. 2. To draw together so as to wrinkle; to knit. Thou didst contract and purse thy brow. Shak. 3. To bring on; to incur; to acquire; as, to contract a habit; to contract a debt; to contract a disease. Each from each contract new strength and light. Pope. Such behavior we contract by having much conversed with persons of high statiSwift. 4. To enter into, with mutual obligations; to make a bargain or covenant for. We have contracted an inviolable amity, peace, and lague with the aforesaid queen. Hakluyt. Many persons . . . had contracted marriage within the degrees of consanguinity . . . prohibited by law. Strype. 5. To betroth; to affiance. The truth is, she and I, long since contracted, Are now so sure, that nothing can dissolve us. Shak. 6. (Gram.)  To shorten by omitting a letter or letters or by reducing two or more vowels or syllables to one. Syn. -- To shorten; abridge; epitomize; narrow; lessen; condense; reduce; confine; incur; assume.\n\n1. To be drawn together so as to be diminished in size or extent; to shrink; to be reduced in compass or in duration; as, iron contracts in cooling; a rope contracts when wet. Years contracting to a moment. Wordsworth. 2. To make an agreement; to covenant; to agree; to bargain; as, to contract for carrying the mail.\n\nContracted: as, a contract verb. Goodwin.\n\nContracted; affianced; betrothed. [Obs.] Shak.\n\n1. (Law)  The agreement of two or more persons, upon a sufficient consideration or cause, to do, or to abstain from doing, some act; an agreement in which a party undertakes to do, or not to do, a particular thing; a formal bargain; a compact; an interchange of legal rights. Wharton. 2. A formal writing which contains the agreement of parties, with the terms and conditions, and which serves as a proof of the obligation. 3. The act of formally betrothing a man and woman. This is the the night of the contract. Longwellow. Syn. -- Covenant; agreement; compact; stipulation; bargain; arrangement; obligation. See Covenant."}