{"word":"contest","definition":"1. To make a subject of dispute, contention, litigation, or emulation; to contend for; to call in question; to controvert; to oppose; to dispute. The people . . . contested not what was done. Locke. Few philosophical aphorisms have been more frequenty repeated, few more contested than this. J. D. Morell. 2. To strive earnestly to hold or maintain; to struggle to defend; as, the troops contested every inch of ground. 3. (Law)  To make a subject of litigation; to defend, as a suit; to dispute or resist; as a claim, by course of law; to controvert. To contest an election. (Polit.) (a) To strive to be elected. (b) To dispute the declared result of an election. Syn. -- To dispute; controvert; debate; litigate; oppose; argue; contend.\n\nTo engage in contention, or emulation; to contend; to strive; to vie; to emulate; -- followed usually by with. The difficulty of an argument adds to the pleasure of contesting with in, when there are hopes of victory. Bp. Burnet. Of man, who dares in pomp with Jove contest Pope.\n\n1. Earnest dispute; strife in argument; controversy; debate; altercation. Leave all noisy contests, all immodest clamors and brawling language. I. Watts. 2. Earnest struggle for superiority, victory, defense, etc.; competition; emulation; strife in arms; conflict; combat; encounter. The late battle had, in effect, been a contest between one usurper and another. Hallam. It was fully expected that the contest there would be long and fierce. Macaulay. Syn. -- Conflict; combat; battle; encounter; shock; struggle; dispute; altercation; debate; controvesy; difference; disagreement; strife. -- Contest, Conflict, Combat, Encounter. Contest is the broadest term, and had originally no reference to actual fighting. It was, on the contrary, a legal term signifying to call witnesses, and hence came to denote first a struggle in argument, and then a struggle for some common object between opposing parties, usually one of considerable duration, and implying successive stages or acts. Conflict denotes literally a close personal engagement, in which sense it is applied to actual fighting. It is, however, more commonly used in a figurative sense to denote strenuous or direct opposition; as, a mental conflict; conflicting interests or passions; a conflict of laws. An encounter is a direct meeting face to face. Usually it is a hostile meeting, and is then very nearly coincident with conflict; as, an encounter of opposing hosts. Sometimes it is used in a looser sense; as, \"this keen encounter of our wits.\" Shak. Combat is commonly applied to actual fighting, but may be used figuratively in reference to a strife or words or a struggle of feeling."}