{"word":"content","definition":"Contained within limits; hence, having the desires limited by that which one has; not disposed to repine or grumble; satisfied; contented; at rest. Having food rainment, let us be therewith content. 1 Tim. vi. 8.\n\n1. That which is contained; the thing or things held by a receptacle or included within specified limits; as, the contents of a cask or bale or of a room; the contents of a book. I shall prove these writings . . . authentic, and the contents true, and worthy of a divine original. Grew. 2. Power of containing; capacity; extent; size. [Obs.] Strong ship's, of great content. Bacon. 3. (Geom.)  Area or quantity of space or matter contained within certain limits; as, solid contents; superficial contents. The geometrical content, figure, and situation of all the lands of a kingdom. Graunt. Table of contents, or Contents, a table or list of topics in a book, showing their order and the place where they may be found: a summary.\n\n1. To satisfy the desires of; to make easy in any situation; to appease or quiet; to gratify; to please. Do not content yourselves with obscure and confused ideas, where clearer are to be attained. I. Watts. Pilate, willing to content the people, released Barabbas unto them. Mark xv. 15. 2. To satisfy the expectations of; to pay; to requite. Come the next Sabbath, and I will content you. Shak. Syn. -- To satisfy; appease; plese. See Satiate.\n\n1. Rest or quietness of the mind in one's present condition; freedom from discontent; satisfaction; contentment; moderate happiness. Such is the fullness of my heart's content. Shak. 2. Acquiescence without examination. [Obs.] The sense they humbly take upon content. Pope. 3. That which contents or satisfies; that which if attained would make one happy. So will I in England work your grace's full content. Shak. 4. (Eng. House of Lords)  An expression of assent to a bill or motion; an affirmate vote; also, a member who votes \"Content.\". Supposing the number of \"Contents\" and \"Not contents\" strictly equal in number and consequence.Burke."}