{"word":"convert","definition":"1. To cause to turn; to turn. [Obs.] O, which way shall I first convert myself B. Jonson. 2. To change or turn from one state or condition to another; to alter in form, substance, or quality; to transform; to transmute; as, to convert water into ice. If the whole atmosphere were converted into water. T. Burnet. That still lessens The sorrow, and converts it nigh to joy. Milton. 3. To change or turn from one belief or course to another, as from one religion to another or from one party or sect to another. No attempt was made to convert the Moslems. Prescott. 4. To produce the spiritual change called conversion in (any one); to turn from a bad life to a good one; to change the heart and moral character of (any one) from the controlling power of sin to that of holiness. He which converteth the sinner from the error of his way shall save a soul from death. Lames v. 20. 5. To apply to any use by a diversion from the proper or intended use; to appropriate dishonestly or illegally. When a bystander took a coin to get it changed, and converted it, [it was] held no larceny. Cooley. 6. To exchange for some specified equivalent; as, to convert goods into money. 7. (Logic)  To change (one proposition) into another, so that what was the subject of the first becomes the predicate of the second. 8. To turn into another language; to translate. [Obs.] Which story . . . Catullus more elegantly converted. B. Jonson. Converted guns, cast-iron guns lined with wrought-iron or steel tubes. Farrow. -- Converting furnace (Steel Manuf.), a furnace in which wrought iron is converted into steel by cementation. Syn. -- To change; turn; transmute; appropriate.\n\nTo be turned or changed in character or direction; to undergo a change, physically or morally. If Nebo had had the preaching that thou hast, they [the Neboites] would have converted. Latimer. A red dust which converth into worms. Sandys. The public hope And eye to thee converting. Thomson.\n\n1. A person who is converted from one opinion or practice to another; a person who is won over to, or heartily embraces, a creed, religious system, or party, in which he has not previously believed; especially, one who turns from the controlling power of sin to that of holiness, or from unbelief to Christianity. The Jesuits did not persuade the converts to lay aside the use of images. Bp. Stillingfleet. 2. A lay friar or brother, permitted to enter a monastery for the service of the house, but without orders, and not allowed to sing in the choir. Syn. -- Proselyte; neophyte. -- Convert, Proselyte, Pervert. A convert is one who turns from what he believes to have been a decided error of faith or practice. Such a change may relate to religion, politics, or other subjects. properly considered, it is not confined to speculation alone, but affects the whole current of one's feelings and the tenor of his actions. As such a change carries with it the appearance of sincerity, the term convert is usually taken in a good sense. Proselyte is a term of more ambiguous use and application. It was first applied to an adherent of one religious system who had transferred himself externally to some other religious system; and is also applied to one who makes a similar transfer in respect to systems of philosophy or speculation. The term has little or no reference to the state of the heart. Pervert is a term of recent origin, designed to express the contrary of convert, and to stigmatize a person as drawn off perverted from the true faith. It has been more particulary applied by members of the Church of England to those who have joined the Roman Catholic Church."}