{"word":"copy","definition":"1. An abundance or plenty of anything. [Obs.] She was blessed with no more copy of wit, but to serve his humor thus. B. Jonson. 2. An imitation, transcript, or reproduction of an original work; as, a copy of a letter, an engraving, a painting, or a statue. I have not the vanity to think my copy equal to the original. Denham. 3. An individual book, or a single set of books containing the works of an author; as, a copy of the Bible; a copy of the works of Addison. 4. That which is to be imitated, transcribed, or reproduced; a pattern, model, or example; as, his virtues are an excellent copy for imitation. Let him first learn to write, after a copy, all the letters. Holder. 5. (print.)  Manuscript or printed matter to be set up in type; as, the printers are calling for more copy. 6. A writing paper Bastard. See under Paper. 7. Copyhold; tenure; lease. [Obs.] Shak. Copy book, a book in which copies are written or printed for learners to imitate. -- Examined copies (Law), those which have been compared with the originals. -- Exemplified copies, those which are attested under seal of a court. -- Certified or Office copies, those which are made or attested by officers having charge of the originals, and authorized to give copies officially. Abbot. Syn. -- Imitation; transcript; duplicate; counterfeit.\n\n1. To make a copy or copies of; to write; print, engrave, or paint after an original; to duplicate; to reproduce; to transcribe; as, to copy a manuscript, inscription, design, painting, etc.; -- often with out, sometimes with off. I like the work well; ere it be demanded (As like enough it will), I'd have it copied. Shak. Let this be copied out, And keep it safe for our remembrance. Shak. 2. To imitate; to attempt to resemble, as in manners or course of life. We copy instinctively the voices of our companions, their accents, and their modes of pronunciation. Stewart.\n\n1. To make a copy or copies; to imitate. 2. To yield a duplicate or transcript; as, the letter did not copy well. Some . . . never fail, when they copy, to follow the bad as well as the good things. Dryden."}