{"word":"coral","definition":"1. (Zoöl.)  The hard parts or skeleton of various Anthozoa, and of a few Hydrozoa. Similar structures are also formed by some Bryozoa. Note: The large stony corals forming coral reefs belong to various genera of Madreporaria, and to the hydroid genus, Millepora. The red coral, used in jewelry, is the stony axis of the stem of a gorgonian (Corallium rubrum) found chiefly in the Mediterranean. The fan corals, plume corals, and sea feathers are species of Gorgoniacea, in which the axis is horny. Organ-pipe coral is formed by the genus Tubipora, an Alcyonarian, and black coral is in part the axis of species of the genus Antipathes. See Anthozoa, Madrepora. 2. The ovaries of a cooked lobster; -- so called from their color. 3. A piece of coral, usually fitted with small bells and other appurtenances, used by children as a plaything. Brain coral, or Brain stone coral. See under Brain. -- Chain coral. See under Chain. -- Coral animal (Zoöl.), one of the polyps by which corals are formed. They are often very erroneously called coral insects. -- Coral fish. See in the Vocabulary. -- Coral reefs (Phys. Geog.), reefs, often of great extent, made up chiefly of fragments of corals, coral sands, and the solid limestone resulting from their consolidation. They are classed as fringing reefs, when they border the land; barrier reefs, when separated from the shore by a broad belt of water; atolls, when they constitute separate islands, usually inclosing a lagoon. See Atoll. -- Coral root (Bot.), a genus (Corallorhiza) of orchideous plants, of a yellowish or brownish red color, parasitic on roots of other plants, and having curious jointed or knotted roots not unlike some kinds of coral. See Illust. under Coralloid. -- Coral snake. (Zo) (a) A small, venomous, Brazilian snake (Elaps corallinus), coral-red, with black bands. (b) A small, harmless, South American snake (Tortrix scytale). -- Coral tree (Bot.), a tropical, leguminous plant, of several species, with showy, scarlet blossoms and coral-red seeds. The best known is Erythrina Corallodendron. -- Coral wood, a hard, red cabinet wood. McElrath."}