{"word":"corn","definition":"A thickening of the epidermis at some point, esp. on the toees, by friction or pressure. It is usually painful and troublesome. Welkome, gentlemen! Ladies that have their toes Unplagued with corns, will have a bout with you. Shak. Note: The substance of a corn usually resembles horn, but where moisture is present, as between the toes, it is white and sodden, and is called a soft corn.\n\n1. A single seed of certain plants, as wheat, rye, barley, and maize; a grain. 2. The various farinaceous grains of the cereal grasses used for food, as wheat, rye, barley, maize, oats. Note: In Scotland, corn is generally restricted to oats, in the United States, to maize, or Indian corn, of which there are several kinds; as, yellow corn, which grows chiefly in the Northern States, and is yellow when ripe; white or southern corn, which grows to a great height, and has long white kernels; sweet corn, comprising a number of sweet and tender varieties, grown chiefly at the North, some of which have kernels that wrinkle when ripe and dry; pop corn, any small variety, used for popping. 3. The plants which produce corn, when growing in the field; the stalks and ears, or the stalks, ears, and seeds, after reaping and before thrashing. In one night, ere glimpse of morn, His shadowy flail had thrashed the corn. Milton. 4. A small, hard particle; a grain. \"Corn of sand.\" Bp. Hall. \"A corn of powder.\" Beau & Fl. Corn ball, a ball of popped corn stuck together with soft candy from molasses or sugar. -- Corn bread, bread made of Indian meal. -- Corn cake, a kind of corn bread; johnny cake; hoecake. -- Corn cockle (Bot.), a weed (Agrostemma or Lychnis Githago), having bright flowers, common in grain fields. -- Corn flag (Bot.), a plant of the genus Gladiolus; -- called also sword lily. -- Corn fly. (Zoöl.) (a) A small fly which, in the larval state, is injurious to grain, living in the stalk, and causing the disease called \"gout,\" on account of the swelled joints. The common European species is Chlorops tæniopus. (b) A small fly (Anthomyia ze) whose larva or maggot destroys seed corn after it has been planted. -- Corn fritter, a fritter having green Indian corn mixed through its batter. [U. S.] -- Corn laws, laws regulating trade in corn, especially those in force in Great Britain till 1846, prohibiting the importation of foreign grain for home consumption, except when the price rose above a certain rate. -- Corn marigold. (Bot.) See under Marigold. -- Corn oyster, a fritter containing grated green Indian corn and butter, the combined taste resembling that of oysters. [U.S.] -- Corn parsley (Bot.), a plant of the parsley genus (Petroselinum ssegetum), a weed in parts of Europe and Asia. -- Corn popper, a utensil used in popping corn. -- Corn poppy (Bot.), the red poppy (Papaver Rhoeas), common in European cornfields; -- also called corn rose. -- Corn rent, rent paid in corn. -- Corn rose. See Corn poppy. -- Corn salad (Bot.), a name given to several species of Valerianella, annual herbs sometimes used for salad. V. olitoria is also called lamb's lettuce. -- Corn stone, red limestone. [Prov. Eng.] -- Corn violet (Bot.), a species of Campanula. -- Corn weevil. (Zoöl.) (a) A small weevil which causes great injury to grain. (b) In America, a weevil (Sphenophorus zeæ) which attacks the stalk of maize near the root, often doing great damage. See Grain weevil, under Weevil.\n\n1. To preserve and season with salt in grains; to sprinkle with salt; to cure by salting; now, specifically, to salt slightly in brine or otherwise; as, to corn beef; to corn a tongue. 2. To form into small grains; to granulate; as, to corn gunpowder. 3. To feed with corn or (in Sctland) oats; as, to corn horses. Jamieson. 4. To render intoxicated; as, ale strong enough to corn one. [Colloq.] Corning house, a house or place where powder is corned or granulated."}