{"word":"cotton","definition":"1. A soft, downy substance, resembling fine wool, consisting of the unicellular twisted hairs which grow on the seeds of the cotton plant. Long-staple cotton has a fiber sometimes almost two inches long; short-staple, from two thirds of an inch to an inch and a half. 2. The cotton plant. See Cotten plant, below. 3. Cloth made of cotton. Note: Cotton is used as an adjective before many nouns in a sense which commonly needs no explanation; as, cottton bagging; cotton clotch; cotton goods; cotton industry; cotton mill; cotton spinning; cotton tick. Cotton cambric. See Cambric, n., 2. -- Cotton flannel, the manufactures' name for a heavy cotton fabric, twilled, and with a long plush nap. In England it is called swan's- down cotton, or Canton flannel. -- Cotton gin, a machine to separate the seeds from cotton, invented by Eli Whitney. -- Cotton grass (Bot.), a genus of plants (Eriphorum) of the Sedge family, having delicate capillary bristles surrounding the fruit (seedlike achenia), which elongate at maturity and resemble tufts of cotton. -- Cotton mouse (Zool.), a field mouse (Hesperomys gossypinus), injurious to cotton crops. -- Cotton plant (Bot.), a plant of the genus Gossypium, of several species, all growing in warm climates, and bearing the cotton of commerce. The common species, originally Asiatic, is G. herbaceum. -- Cotton press, a building and machinery in which cotton bales are compressed into smaller bulk for shipment; a press for baling cotton. -- Cotton rose (Bot.), a genus of composite herbs (Filago), covered with a white substance resembling cotton. -- Cotton scale (Zoöl.), a species of bark louse (Pulvinaria innumerabilis), which does great damage to the cotton plant. -- Cotton shrub. Same as Cotton plant. -- Cotton stainer (Zoöl.), a species of hemipterous insect (Dysdercus suturellus), which seriously damages growing cotton by staining it; -- called also redbug. -- Cotton thistle (Bot.), the Scotch thistle. See under Thistle. -- Cotton velvet, velvet in which the warp and woof are both of cotton, and the pile is of silk; also, velvet made wholly of cotton. -- Cotton waste, the refuse of cotton mills. -- Cotton wool, cotton in its raw or woolly state. -- Cotton worm (Zool.), a lepidopterous insect (Aletia argillacea), which in the larval state does great damage to the cotton plant by eating the leaves. It also feeds on corn, etc., and hence is often called corn worm, and Southern army worm.\n\n1. To rise with a regular nap, as cloth does. [Obs.] It cottons well; it can not choose but bear A pretty nap. Family of Love. 2. To go on prosperously; to succeed. [Obs.] New, Hephestion, does not this matter cotton as I would Lyly. 3. To unite; to agree; to make friends; -- usually followed by with. [Colloq.] A quarrel will end in one of you being turned off, in which case it will not be easy to cotton with another. Swift. Didst see, Frank, how the old goldsmith cottoned in with his beggarly companion Sir W. Scott. 4. To take a liking to; to stick to one as cotton; -- used with to. [Slang]"}