{"word":"counsel","definition":"1. Interchange of opinions; mutual advising; consultation. All the chief priest and elders of the people took counsel against Jesus, to put him to death. Matt. xxvii. 1. 2. Examination of consequences; exercise of deliberate judgment; prudence. They all confess, therefore, in the working of that first cause, that counsel is used. Hooker. 3. Result of consultation; advice; instruction. I like thy counsel; well hast thou advised. Shak. It was ill counsel had misled the girl. Tennyson. 4. Deliberate purpose; design; intent; scheme; plan. The counsel of the Lord standeth forever. Ps. xxxiii. 11. The counsels of the wicked are deceit. Prov. xii. 5. 5. A secret opinion or purpose; a private matter. Thilke lord . . . to whom no counsel may be hid. Gower. 6. One who gives advice, especially in legal matters; one professionally engaged in the trial or management of a cause in court; also, collectively, the legal advocates united in the management of a case; as, the defendant has able counsel. The King found his counsel as refractory as his judges. Macaulay. Note: The some courts a distinction is observed between the attorney and the counsel in a cause, the former being employed in the management iof the more mechanical parts of the suit, the latter in attending to the pleadings, managing the cause at the trial, and in applying the law to the exigencies of the case during the whole progress of the suit. In other courts the same person can exercise the powers of each. See Attorney. Kent. In counsel, in secret. [Obs.] Chaucer. -- To keep counsel, or To keep one's own counsel, to keep one's thoughts, purposes, etc., undisclosed. The players can not keep counsel: they 'll tell all. Shak. Syn. -- Advice; consideration; consultation; purpose; scheme; opinion.\n\n1. To give advice to; to advice, admonish, or instruct, as a person. Good sir, I do in friendship counsel you To leave this place. Shak. 2. To advise or recommend, as an act or course. They who counsel war. Milton. Thus Belial, with words clothed in reson's garb, Counseled ignoble ease and peaceful sloth. Milton."}