{"word":"counter","definition":"A prefix meaning contrary, opposite, in opposition; as, counteract, counterbalance, countercheck. See Counter, adv. & a.\n\n1. One who counts, or reckons up; a calculator; a reckoner. 2. A piece of metal, ivory, wood, or bone, used in reckoning, in keeping account of games, etc. The old gods of our own race whose names . . . serve as counters reckon the days of the week. E. B. Tylor. What comes the wool to . . . I can not do it witthout counters. Shak. 3. Money; coin; -- used in contempt. [Obs.] To lock such rascal counters from his friends. Shak. 4. A prison; either of two prisons formerly in London. Anne Aysavugh . . . imprisoned in the Counter. Fuller. 5. A telltale; a contrivance attached to an engine, printing press, or other machine, for the purpose of counting the revolutions or the pulsations. Knight.\n\nA table or board on which money is counted and over which business is transacted; a long, narrow table or bench, on which goods are laid for examination by purchasers, or on which they are weighed or measured.\n\n1. Contrary; in opposition; in an opposite direction; contrariwise; - - used chiefly with run or go. Running counter to all the rules of virtue. Locks. 2. In the wrong way; contrary to the right course; as, a hound that runs counter. This is counter, you false Danish dogs! Shak. 3. At or against the front or face. [R.] Which [darts] they never throw counter, but at the back of the flier. Sandys.\n\nContrary; opposite; contrasted; opposed; adverse; antagonistic; as, a counter current; a counter revolution; a counter poison; a counter agent; counter fugue. \"Innumerable facts attesting the counter principle.\" I. Taylor. Counter approach (Fort.), a trench or work pushed forward from defensive works to meet the approaches of besiegers. See Approach. -- Counter bond (Law), in old practice, a bond to secure one who has given bond for another. -- Counter brace. See Counter brace, in Vocabulary. -- Counter deed (Law), a secret writing which destroys, invalidates, or alters, a public deed. -- Counter distinction, contradistinction. [Obs.] -- Counter drain, a drain at the foot of the embankment of a canal or watercourse, for carrying off the water that may soak through. -- Counter extension (Surg.), the fixation of the upper part of a limb, while extension is practiced on the lower part, as in cases of luxation or fracture. -- Counter fissure (Surg.) Same as Contrafissure. -- Counter indication. (Med.) Same as Contraindication. -- Counter irritant (Med.), an irritant to produce a blister, a pustular eruption, or other irritation in some part of the body, in order to relieve an existing irritation in some other part. \"Counter irritants are of as great use in moral as in physical diseases.\" Macaulay. -- Counter irritation (Med.), the act or the result of applying a counter irritant. -- Counter opening, an aperture or vent on the opposite side, or in a different place. -Counter parole (Mil.), a word in addition to the password, given in time of alarm as a signal. -- Counter plea (Law), a replication to a plea. Cowell. -- Counter pressure, force or pressure that acts in a contrary direction to some other opposing pressure. -- Counter project, a project, scheme, or proposal brought forward in opposition to another, as in the negotiation of a treaty. Swift. -- Counter proof, in engraving, a print taken off from another just printed, which, by being passed through the press, gives a copy in reverse, and of course in the same position as that of plate from which the first was printed, the object being to enable the engraver to inspect the state of the plate. -- Counter revolution, a revolution opposed to a former one, and restoring a former state of things. -- Counter revolutionist, one engaged in, or befriending, a counter revolution. -- Counter round (Mil.), a body of officers whose duty it is to visit and inspect the rounds and sentinels. -- Counter sea (Naut.), a sea running in an opposite direction from the wind. -- Counter sense, opposite meaning. -- Counter signal, a signal to answer or correspond to another. -- Counter signature, the name of a secretary or other officer countersigned to a writing. . Tooke. -- Counter slope, an overhanging slope; as, a wall with a counter slope. Mahan. -- Counter statement, a statement made in opposition to, or denial of, another statement. -- Counter surety, a counter bond, or a surety to secure one who has given security. -- Counter tally, a tally corresponding to another. -- Counter tide, contrary tide.\n\n1. (Naut.)  The after part of a vessel's body, from the water line to the stern, -- below and somewhat forward of the stern proper. 2. (Mus.)  Same as Contra. Formerly used to designate any under part which served for contrast to a principal part, but now used as equivalent to counter tenor. 3. (Far.)  The breast, or thet part of a horse between the shoulders and under the neck. 4. The back leather or heel part of a boot.\n\nAn encounter. [Obs.] With kindly counter under mimic shade. Spenser.\n\nTo return a blow while receiving one, as in boxing. His left hand countered provokingly. C. Kingsley."}