{"word":"course","definition":"1. The act of moving from one point to another; progress; passage. And when we had finished our course from Tyre, we came to Ptolemais. Acts xxi. 7. 2. THe ground or path traversed; track; way. The same horse also run the round course at Newmarket. Pennant. 3. Motion, considered as to its general or resultant direction or to its goal; line progress or advance. A light by which the Argive squadron steers Their silent course to Ilium's well known shore. Dennham. Westward the course of empire takes its way. Berkeley. 4. Progress from point to point without change of direction; any part of a progress from one place to another, which is in a straight line, or on one direction; as, a ship in a long voyage makes many courses; a course measured by a surveyor between two stations; also, a progress without interruption or rest; a heat; as, one course of a race. 5. Motion considered with reference to manner; or derly progress; procedure in a certain line of thought or action; as, the course of an argument. The course of true love never did run smooth. Shak. 6. Customary or established sequence of evants; re currence of events according to natural laws. By course of nature and of law. Davies. Day and night, Seedtime and harvest, heat and hoary frost, Shall hold their course. Milton. 7. Method of procedure; manner or way of conducting; conduct; behavior. My lord of York commends the plot and the general course of the action. Shak. By perseverance in the course prescribed. Wodsworth. You hold your course without remorse. Tennyson. 8. A series of motions or acts arranged in order; a succession of acts or practices connectedly followed; as, a course of medicine; a course of lectures on chemistry. 9. The succession of one to another in office or duty; order; turn. He appointed . . . the courses of the priests 2 Chron. viii. 14. 10. That part of a meal served at one time, with its accompaniments. He [Goldsmith] wore fine clothes, gave dinners of several courses, paid court to venal beauties. Macualay. 11. (Arch.)  A continuous level range of brick or stones of the same height throughout the face or faces of a building. Gwilt. 12. (Naut.)  The lowest sail on any mast of a square-rigged vessel; as, the fore course, main course, etc. 13. pl. (Physiol.)  The menses. In course, in regular succession. -- Of course, by consequence; as a matter of course; in regular or natural order. -- In the course of, at same time or times during. \"In the course of human events.\" T. Jefferson. Syn. -- Way; road; route; passage; race; series; succession; manner; method; mode; career; progress.\n\n1. To run, hunt, or chase after; to follow hard upon; to pursue. We coursed him at the heels. Shak. 2. To cause to chase after or pursue game; as, to course greyhounds after deer. 3. To run through or over. The bounding steed courses the dusty plain. Pope.\n\n1. To run as in a race, or in hunting; to pursue the sport of coursing; as, the sportsmen coursed over the flats of Lancashire. 2. To move with speed; to race; as, the blood courses through the veins. Shak."}