{"word":"court","definition":"1. An inclosed space; a courtyard; an uncovered area shut in by the walls of a building, or by different building; also, a space opening from a street and nearly surrounded by houses; a blind alley. The courts the house of our God. Ps. cxxxv. 2. And round the cool green courts there ran a row Cf cloisters. Tennyson. Goldsmith took a garret in a miserable court. Macualay. 2. The residence of a sovereign, prince, nobleman, or ether dignitary; a palace. Attends the emperor in his royal court. Shak. This our court, infected with their manners, Shows like a riotous inn. Shak. 3. The collective body of persons composing the retinue of a sovereign or person high in aithority; all the surroundings of a sovereign in his regal state. My lord, there is a nobleman of the court at door would speak with you. Shak. Love rules the court, the camp, the grove. Sir. W. Scott. 4. Any formal assembling of the retinue of a sovereign; as, to hold a court. The princesses held their court within the fortres. Macualay. 5. Attention directed to a person in power; conduct or address designed to gain favor; courtliness of manners; civility; compliment; flattery. No solace could her paramour intreat Her once to show, ne court, nor dalliance. Spenser. I went to make my court to the Dike and Duches of Newcastle. Evelyn. 6. (Law) (a) The hall, chamber, or place, where justice is administered. (b) The persons officially assembled under authority of law, at the appropriate time and place, for the administration of justice; an official assembly, legally met together for the transaction of judicial business; a judge or judges sitting for the hearing or trial of causes. (c) A tribunal established for the administration of justice. (d) The judge or judges; as distinguished from the counsel or jury, or both. Most heartily I do beseech the court To give the judgment. Shak. 7. The session of a judicial assembly. 8. Any jurisdiction, civil, military, or ecclesiastical. 9. A place arranged for playing the game of tennis; also, one of the divisions of a tennis court. Christian court, the English ecclesiastical courts in the aggregate, or any one of them. -- Court breeding, education acquired at court. -- Court card. Same as Coat card. -- Court circular, one or more paragraphs of news respecting the sovereign and the royal family, together with the proceedings or movements of the court generally, supplied to the newspapers by an officer specially charged with such duty. [Eng.] Edwards. -- Court day, a day on which a court sits to administer justice. -- Court dress, the dress prescribed for appearance at the court of a sovereign. -- Court fool, a buffoon or jester, formerly kept by princes and nobles for their amusement. -- Court guide, a directory of the names and adresses of the nobility and gentry in a town. -- Court hand, the hand or manner of writing used in records and judicial proceedings. Shak. -- Court lands (Eng. Law), lands kept in demesne, -- that is, for the use of the lord and his family. -- Court marshal, one who acts as marshal for a court. -- Court party, a party attached to the court. -- Court rolls, the records of a court. SeeRoll. -- Court in banc, or Court in bank, The full court sitting at its regular terms for the hearing of arguments upon questions of law, as distinguished from a sitting at nisi prius. -- Court of Arches, audience, etc. See under Arches, Audience, etc. -- Court of Chancery. See Chancery, n. -- Court of Common pleas. (Law) See Common pleas, under Common. -- Court of Equity. See under Equity, and Chancery. -- Court of Inquiry (Mil.) , a court appointed to inquire into and report on some military matter, as the conduct of an officer. -- Court of St. James, the usual designation of the British Court; - - so called from the old palace of St. James, which is used for the royal receptions, levees, and drawing-rooms. -- The court of the Lord, the temple at Jerusalem; hence, a church, or Christian house of worship. -- General Court, the legislature of a State; -- so called from having had, in the colonial days, judical power; as, the General Court of Massachusetts. [U.S.] -- To pay one's court, to seek to gain favor by attentions. \"Alcibiades was assiduous in paying his court to Tissaphernes.\" Jowett. -- To put out of court, to refuse further judicial hearing.\n\n1. To endeavor to gain the favor of by attention or flattery; to try to ingratiate one's self with. By one person, hovever, Portland was still assiduously courted. Macualay. 2. To endeavor to gain the affections of; to seek in marriage; to woo. If either of you both love Katharina . . . leave shall you have to court her at your pleasure. Shak. 3. To attempt to gain; to solicit; to seek. They might almost seem to have courted the crown of martyrdem. Prescott. Guilt and misery . . . court privacy and silitude. De Quincey. 4. To invite by attractions; to allure; to attract. A well-worn pathway courted us To one green wicket in a privet hedge. Tennyson.\n\n1. To play the lover; to woo; as, to go courting."}