{"word":"covenant","definition":"1. A mutual agreement of two or more persons or parties, or one of the stipulations in such an agreement. Then Jonathan and David made a covenant. 1 Sam. xviiii. 3. Let there be covenants drawn between us. Shak. If we conclude a peace, It shall be with such strict and severe covenants As little shall the Frenchmen gain thereby. Shak. 2. (Eccl. Hist.)  An agreement made by the Scottish Parliament in 1638, and by the English Parliament in 1643, to preserve the reformed religion in Scotland, and to extirpate popery and prelacy; -- usually called the \"Solemn League and Covenant.\" He [Wharton] was born in the days of the Covenant, and was the heir of a covenanted house. Macualay. 3. (Theol.)  The promises of God as revealed in the Scriptures, conditioned on certain terms on the part of man, as obedience, repentance, faith, etc. I will establish my covenant between me and thee and thy seed after thee in their generations for an everlasting covenant, to be a God unto thee, and to thy seed after thee. Gen. xvii. 7. 4. A solemn compact between members of a church to maintain its faith, discipline, etc. 5. (Law) (a) An undertaking, on sufficient consideration, in writing and under seal, to do or to refrain from some act or thing; a contract; a stipulation; also, the document or writing containing the terms of agreement. (b) A form of action for the violation of a promise or contract under seal. Syn. -- Agreement; contract; compact; bargain; arrangement; stipulation. -- Covenant, Contract, Compact, Stipulation. These words all denote a mutual agreement between two parties. Covenant is frequently used in a religious sense; as, the covenant of works or of grace; a church covenant; the Solemn League and Covenant. Contract is the word most used in the business of life. Crabb and Taylor are wrong in saying that a contract must always be in writing. There are oral and implied contracts as well as written ones, and these are equally enforced by law. In legal usage, the word covenant has an important place as connected with contracts. A compact is only a stronger and more solemn contract. The term is chiefly applied to political alliances. Thus, the old Confederation was a compact between the States. Under the present Federal Constitution, no individual State can, without consent of Congress, enter into a compact with any other State or foreign power. A stipulation is one of the articles or provisions of a contract.\n\nTo agree (with); to enter into a formal agreement; to bind one's self by contract; to make a stipulation. Jupiter covenanted with him, that it should be hot or cold, wet or dry, . . . as the tenant should direct. L'Estrange. And they covenanted with him for thyrty pieces of silver. Matt. xxvi. 15. Syn. -- To agree; contract; bargain; stipulate.\n\nTo grant or promise by covenant. My covenant of peace that I covenanted with you. Wyclif."}