{"word":"cover","definition":"1. To overspread the surface of (one thing) with another; as, to cover wood with paint or lacquer; to cover a table with a cloth. 2. To envelop; to clothe, as with a mantle or cloak. And with the majesty of darkness round Covers his throune. Milton. All that beauty than doth cover thee. Shak. 3. To invest (one's self with something); to bring upon (one's self); as, he covered himself with glory. The powers that covered themselves with everlasting infamy by the partition of Poland. Brougham. 4. To hide sight; to conceal; to cloak; as, the snemy were covered from our sight by the woods. A cloud covered the mount. Exod. xxiv. 15. In vain shou striv'st to cover shame with shame. Milton. 5. To brood or sit on; to incubate. While the hen is covering her eggs, the male . . . diverts her with his songs. Addison. 6. To overwhelm; to spread over. The waters returned and covered the chariots and the horsemen. Ex. xiv. 28. 7. To shelter, as from evil or danger; to protect; to defend; as, the cavalry covered the retreat. His calm and blameless life Does with substantial blessedness abound, And the soft wings of peace cover him round. Cowley. 8. To remove from remembrance; to put away; to remit.\"Blessed is he whose is covered.\" Ps. xxxii. 1. 9. To extend over; to be sufficient for; to comprehend, include, or embrace; to account for or solve; to counterbalance; as, a mortgage which fully covers a sum loaned on it; a law which covers all possible cases of a crime; receipts than do not cover expenses. 10. To put the usual covering or headdress on. Cover thy head . . . ; nay, prithee, be covered. Shak. 11. To copulate with (a female); to serve; as. a horse covers a mare; -- said of the male. To cover ground or distance, to pass over; as, the rider covered the ground in an hour. -- To cover one's short contracts (Stock Exchange), to buy stock when the market rises, as a dealer who has sold short does in order to protect himself. -- Covering party (Mil.), a detachment of troops sent for the protection of another detachment, as of men working in the trenches. -- To cover into, to transfer to; as, to cover into the treasury. Syn. -- To shelter; screen; shield; hide; overspread.\n\n1. Anything which is laid, set, or spread, upon, about, or over, another thing; an envelope; a lid; as, the cover of a book. 2. Anything which weils or conceals; a screen; disguise; a cloack. \"Under cover of the night.\" Macualay. A hendsome cover for imperfections. Collier. 3. Shelter; protection; as, the troops fought under cover of the batteries; the woods afforded a good cover. Being compelled to lodge in the field . . . whilst his army was under cover, they might be forced to retire. Clarendon. 4. (Huntig)  The woods, underbrush, etc., which shelter and conceal game; covert; as, to beat a cover; to ride to cover. 5. That portion of a slate, tile, or shingle, which is hidden by the overlap of the course above. Knight. 6. (Steam Engine)  The lap of a slide valve. 7. Etym: [Cf. F. couvert.]  A tablecloth, and the other table furniture; esp., the table furniture for the use of one person at a meal; as, covers were laid for fifty guests. To break cover, to start from a covert or lair; -- said of game. -- Under cover, in an envelope, or within a letter; -- said of a written message. Letters . . . dispatched under cover to her ladyship. Thackeray.\n\nTo spread a table for a meal; to prepare a banquet. [Obs.] Shak."}