{"word":"crab","definition":"1. (Zoöl.)  One of the brachyuran Crustacea. They are mostly marine, and usually have a broad, short body, covered with a strong shell or carapace. The abdomen is small and curled up beneath the body. Note: The name is applied to all the Brachyura, and to certain Anomura, as the hermit crabs. Formerly, it was sometimes applied to Crustacea in general. Many species are edible, the blue crab of the Atlantic coast being one of the most esteemed. The large European edible crab is Cancer padurus. Soft-shelled crabs are blue crabs that have recently cast their shells. See Cancer; also, Box crab, Fiddler crab, Hermit crab, Spider crab, etc., under Box, Fiddler. etc. 2. The zodiacal constellation Cancer. 3. Etym: [See Crab, a.] (Bot.)  A crab apple; -- so named from its harsh taste. When roasted crabs hiss in the bowl, Then nightly sings the staring owl. Shak. 4. A cudgel made of the wood of the crab tree; a crabstick. [Obs.] Garrick. 5. (Mech.) (a) A movable winch or windlass with powerful gearing, used with derricks, etc. (b) A form of windlass, or geared capstan, for hauling ships into dock, etc. (c) A machine used in ropewalks to stretch the yarn. (d) A claw for anchoring a portable machine. Calling crab. (Zoöl.) See Fiddler., n., 2. -- Crab apple, a small, sour apple, of several kinds; also, the tree which bears it; as, the European crab apple (Pyrus Malus var.sylvestris); the Siberian crab apple (Pyrus baccata); and the American (Pyrus coronaria). -- Crab grass. (Bot.) (a) A grass (Digitaria, or Panicum, sanguinalis); -- called also finger grass. (b) A grass of the genus Eleusine (E. Indica); -- called also dog's-tail grass, wire grass, etc. -- Crab louse (Zoöl.), a species of louse (Phthirius pubis), sometimes infesting the human body. -- Crab plover (Zoöl.), an Asiatic plover (Dromas ardeola). -- Crab's eyes, or Crab's stones, masses of calcareous matter found, at certain seasons of the year, on either side of the stomach of the European crawfishes, and formerly used in medicine for absorbent and antacid purposes; the gastroliths. -- Crab spider (Zoöl.), one of a group of spiders (Laterigradæ); -- called because they can run backwards or sideways like a crab. -- Crab tree, the tree that bears crab applies. -- Crab wood, a light cabinet wood obtained in Guiana, which takes a high polish. McElrath. -- To catch a crab (Naut.), a phrase used of a rower: (a) when he fails to raise his oar clear of the water; (b) when he misses the water altogether in making a stroke.\n\n1. To make sour or morose; to embitter. [Obs.] Sickness sours or crabs our nature. Glanvill. 2. To beat with a crabstick. [Obs.] J. Fletcher.\n\nTo drift sidewise or to leeward, as a vessel. Ham. Nav. Encyc.\n\nSour; rough; austere. The crab vintage of the neighb'ring coast. Dryden."}