{"word":"cradle","definition":"1. A bed or cot for a baby, oscillating on rockers or swinginng on pivots; hence, the place of origin, or in which anything is nurtured or protected in the earlier period of existence; as, a cradle of crime; the cradle of liberty. The cradle that received thee at thy birth. Cowper. No sooner was I crept out of my cradle But I was made a king, at nine months old. Shak. 2. Infancy, or very early life. From their cradles bred together. Shak. A form of worship in which they had been educated from their cradles. Clarendon. 3. (Agric.)  An implement consisting of a broad scythe for cutting grain, with a set of long fingers parallel to the scythe, designed to receive the grain, and to lay it eventlyin a swath. 4. (Engraving)  A tool used in mezzotint engraving, which, by a rocking motion, raises burrs on the surface of the plate, so preparing the ground. 5. A framework of timbers, or iron bars, moving upon ways or rollers, used to support, lift, or carry ships or other vessels, heavy guns, etc., as up an inclined plane, or across a strip of land, or in launching a ship. 6. (Med.) (a) A case for a broken or dislocated limb. (b) A frame to keep the bedclothes from conntact with the person. 7. (Mining) (a) A machine on rockers, used in washing out auriferous earth; -- also called a rocker. [U.S.] (b) A suspended scaffold used in shafts. 8. (Carp.)  The ribbing for vaulted ceilings and arches intended to be covered with plaster. Knight. 9. (Naut.)  The basket or apparatus in which, when a line has been made fast to a wrecked ship from the shore, the people are brought off from the wreck. Cat's cradle. See under Cat. -- Cradle hole, a sunken place in a road, caused by thawing, or by travel over a soft spot. -- Cradle scythe, a broad scythe used in a cradle for cutting grain.\n\n1. To lay to rest, or rock, as in a cradle; to lull or quiet, as by rocking. It cradles their fears to sleep. D. A. Clark. 2. To nurse or train in infancy. He that hath been cradled in majesty will not leave the throne to play with beggars. Glanvill. 3. To cut and lay with a cradle, as grain. 4. To transport a vessel by means of a cradle. In Lombardy . . . boats are cradled and transported over the grade. Knight. To cradle a picture, to put ribs across the back of a picture, to prevent the panels from warping.\n\nTo lie or lodge, as in a cradle. Withered roots and husks wherein the acorn cradled. Shak."}