{"word":"cream","definition":"1. The rich, oily, and yellowish part of milk, which, when the milk stands unagitated, rises, and collects on the surface. It is the part of milk from which butter is obtained. 2. The part of any liquor that rises, and collects on the surface. [R.] 3. A delicacy of several kinds prepared for the table from cream, etc., or so as to resemble cream. 4. A cosmetic; a creamlike medicinal preparation. In vain she tries her paste and creams, To smooth her skin or hide its seams. Goldsmith. 5. The best or choicest part of a thing; the quintessence; as. the cream of a jest or story; the cream of a collection of books or pictures. Welcome, O flower and cream of knights errant. Shelton. Bavarian cream, a preparation of gelatin, cream, sugar, and eggs, whipped; -- to be eaten cold. -- Cold cream, an ointment made of white wax, almond oil, rose water, and borax, and used as a salve for the hands and lips. -- Cream cheese, a kind of cheese made from curd from which the cream has not been taken off, or to which cream has been added. -- Cream gauge, an instrument to test milk, being usually a graduated glass tube in which the milk is placed for the cream to rise. -- Cream nut, the Brazil nut. -- Cream of lime. (a) A scum of calcium carbonate which forms on a solution of milk of lime from the carbon dioxide of the air. (b) A thick creamy emulsion of lime in water. -- Cream of tartar (Chem.), purified tartar or argol; so called because of the crust of crystals which forms on the surface of the liquor in the process of purification by recrystallization. It is a white crystalline substance, with a gritty acid taste, and is used very largely as an ingredient of baking powders; -- called also potassium bitartrate, acid potassium tartrate, etc.\n\n1. To skim, or take off by skimming, as cream. 2. To take off the best or choicest part of. 3. To furnish with, or as with, cream. Creaming the fragrant cups. Mrs. Whitney. To cream butter (Cooking), to rub, stir, or beat, butter till it is of a light creamy consistency.\n\nTo form or become covered with cream; to become thick like cream; to assume the appearance of cream; hence, to grow stiff or formal; to mantle. There are a sort of men whose visages Do cream and mantle like a standing pool. Shak."}