{"word":"cross","definition":"1. A gibbet, cosisting of two pieces of timber placed transversely upon one another, in various forms, as a T, or +, with the horizontal piece below the upper end of the upright, or as an X. It was anciently used in the execution of criminals. Nailed to the cross By his own nation. Milton. 2. The sign or mark of the cross, made with the finger, or in ink, etc., or actually represented in some material; the symbol of Christ's death; the ensign and chosen symbol of Christianity, of a Christian people, and of Christendom. The custom of making the sign of the cross with the hand or finger, as a means of conferring blessing or preserving from evil, is very old. Schaff-Herzog Encyc. Before the cross has waned the crescent's ray. Sir W. Scott. Tis where the cross is preached. Cowper. 3. Affiction regarded as a test of patience or virtue; trial; disappointment; opposition; misfortune. Heaven prepares a good man with crosses. B. Jonson. 4. A piece of money stamped with the figure of a cross, also, that side of such a piece on which the cross is stamped; hence, money in general. I should bear no cross if I did bear you; for I think you have no money in your purse. Shak. 5. An appendage or ornament or anything in the form of a cross; a badge or ornamental device of the general shape of a cross; hence, such an ornament, even when varying considerably from that form; thus, the Cross of the British Order of St. George and St. Michael consist of a central medallion with seven arms radiating from it. 6. (Arch.)  A monument in the form of a cross, or surmounted bu a cross, set up in a public place; as, a market cross; a boundary cross; Charing Cross in London. Dun-Edin's Cross, a pillared stone, Rose on a turret octagon. Sir W. Scott. 7. (Her.)  A common heraldic bearing, of which there are many varieties. See the Illustration, above. 8. The crosslike mark or symbol used instead of a signature by those unable to write. Five Kentish abbesses . . . .subscribed their names and crosses. Fuller. 9. Church lands. [Ireland] [Obs.] Sir J. Davies. 10. A line drawn across or through another line. 11. Hence: A mixing of breeds or stock, especially in cattle breeding; or the product of such intermixture; a hybrid of any kind. Toning down the ancient Viking into a sort of a cross between Paul Jones and Jeremy Diddler. Lord Dufferin. 12. (Surveying)  An instrument for laying of offsets perpendicular to the main course. 13. (Mech.)  A pipe-fitting with four branches the axes of which usually form's right angle. Cross and pile, a game with money, at which it is put to chance whether a coin shall fall with that side up which bears the cross, or the other, which is called pile, or reverse; the game called heads or tails. -- Cross bottony or bottoné. See under Bottony. -- Cross estoilé (Her.). a cross, each of whose arms is pointed like the ray of a star; that is, a star having four long points only. -- Cross of Calvary. See Calvary, 3. -- Southern cross. (Astron.) See under Southern. -- To do a thing on the cross, to act dishonestly; -- opposed to acting on the square. [Slang] -- To take up the cross, to bear troubles and afflictions with patience from love to Christ.\n\n1. Not parallel; lying or falling athwart; transverse; oblique; intersecting. The cross refraction of the second prism. Sir I. Newton. 2. Not accordant with what is wished or expected; interrupting; adverse; contrary; thwarting; perverse. \"A cross fortune.\" Jer. Taylor. The cross and unlucky issue of my design. Glanvill. The article of the resurrection seems to lie marvelously cross to the common experience of mankind. South. We are both love's captives, but with fates so cross, One must be happy by the other's loss. Dryden. 3. Characterized by, or in a state of, peevishness, fretfullness, or ill humor; as, a cross man or woman. He had received a cross answer from his mistress. Jer. Taylor. 4. Made in an opposite direction, or an inverse relation; mutually inverse; interchanged; as, cross interrogatories; cross marriages, as when a brother and sister marry persons standing in the same relation to each other. Cross action (Law), an action brought by a party who is sued against the person who has sued him, upon the same subject matter, as upon the same contract. Burrill. -- Cross aisle (Arch.), a transept; the lateral divisions of a cruciform church. -- Cross axie. (a) (Mach.) A shaft, windlass, or roller, worked by levers at opposite ends, as in the copperplate printing press. (b) A driving axle. with cranks set at an angle of 90º with each other. -- Cross bedding (Geol.), oblique lamination of horizontal beds, -- Cross bill. See in the Vocabulary. -- Cross bitt. Same as Crosspiece. -- Cross bond, a form of bricklaying, in which the joints of one stretcher course come midway between those of the stretcher courses above and below, a course of headers and stretchers intervening. See Bond, n., 8. -- Cross breed. See in the Vocabulary. -- Cross breeding. See under Breeding. -- Cross buttock, a particular throw in wrestling; hence, an unexpected defeat or repulse. Smollet. -- Cross country, across the country; not by the road. \"The cross- country ride.\" Cowper. -- Cross fertilization, the fertilization of the female products of one physiological individual by the male products of another, -- as the fertilization of the ovules of one plant by pollen from another. See Fertilization. -- Cross file, a double convex file, used in dressing out the arms or crosses of fine wheells. -- Cross fire (Mil.), lines of fire, from two or more points or places, crossing each other. -- Cross forked. (Her.) See under Forked. -- Cross frog. See under Frog. -- Cross furrow, a furrow or trench cut across other furrows to receive the water running in them and conduct it to the side of the field. -- Cross handle, a handle attached transversely to the axis of a tool, as in the augur. Knight. -- Cross lode (Mining), a vein intersecting the true or principal lode. -- Cross purpose. See Cross-purpose, in the Vocabulary. -- Cross reference, a reference made from one part of a book or register to another part, where the same or an allied subject is treated of. -- Cross sea (Naut.), a chopping sea, in which the waves run in contrary directions. -- Cross stroke, a line or stroke across something, as across the letter t. -- Cross wind, a side wind; an unfavorable wind. -- Cross wires, fine wires made to traverse the field of view in a telescope, and moved by a screw with a graduated head, used for delicate astronomical observations; spider lines. Fixed cross wires are also used in microscopes, etc. Syn. -- Fretful; peevish. See Fretful.\n\nAthwart; across. [Archaic or Colloq.] A fox was taking a walk one night cross a village. L'Estrange. To go cross lots, to go across the fields; totake a short cut. [Colloq.]\n\n1. To put across or athwart; to cause to intersect; as, to cross the arms. 2. To lay or draw something, as a line, across; as, to cross the letter t. 3. To pass from one side to the other of; to pass or move over; to traverse; as, to cross a stream. A hunted hare . . . crosses and confounds her former track. I. Watts. 4. To pass, as objects going in an opposite direction at the same time. \"Your kind letter crossed mine.\" J. D. Forbes. 5. To run counter to; to thwart; to obstruct; to hinder; to clash or interfere with. In each thing give him way; cross him in nothing. Shak. An oyster may be crossed onlove. Sheridan. 6. To interfere and cut off; to debar. [Obs.] To cross me from the golden time I look for. Shak. 7. To make the sign of the cross upon; -- followed by the reflexive pronoun; as, he crossed himself. 8. To cancel by marking crosses on or over, or drawing a line across; to erase; -- usually with out, off, or over; as, to cross out a name. 9. To cause to interbreed; -- said of different stoocks or races; to mix the breed of. To cross one's path, to oppose one's plans. Macualay.\n\n1. To lie or be athwart. 2. To move or pass from one side to the other, or from place to place; to make a transit; as, to cross from New York to Liverpool. 3. To be inconsistent. [Obs.] Men's actions do not always cross with reason. Sir P. Sidney. 4. To interbreed, as races; to mix distinct breeds. If two individuals of distinct races cross, a third is invariably produced different from either. Coleridge."}