{"word":"crown","definition":"p. p. of Crow. [Obs.]\n\n1. A wreath or garland, or any ornamental fillet encircling the head, especially as a reward of victory or mark of honorable distinction; hence, anything given on account of, or obtained by, faithful or successful effort; a reward. \"An olive branch and laurel crown.\" Shak. They do it to obtain a corruptible crown; but we an incorruptiblle. 1 Cor. ix. 25. Be thou faithful unto death, and I will give thee a crown of life. Rev. ii. 10. 2. A royal headdress or cap of sovereignty, worn by emperors, kings, princes, etc. Note: Nobles wear coronets; the triple crown of the pope is usually called a tiara. The crown of England is a circle of gold with crosses, fleurs-de-lis, and imperial arches, inclosing a crimson velvet cap, and ornamented with thousands of diamonds and precious stones. 3. The person entitled to wear a regal or imperial crown; the sovereign; -- with the definite article. Parliament may be dissolved by the demise of the crown. Blackstone. Large arrears of pay were due to the civil and military servants of the crown. Macaulay. 4. Imperial or regal power or dominion; sovereignty. There is a power behind the crown greater than the crown itself. Junius. 5. Anything which imparts beauty, splendor, honor, dignity, or finish. The hoary head is a crown of glory, if it be found in the way of righteousness. Prov. xvi. 31. A virtuous woman is a crown to her husband. Prov. xvi. 4. 6. Highest state; acme; consummation; perfection. Mutual love, the crown of all our bliss. Milton. 7. The topmost part of anything; the summit. The steepy crown of the bare mountains. Dryden. 8. The topmost part of the head (see Illust. of Bird.); that part of the head from which the hair descends toward the sides and back; also, the head or brain. From toe to crown he'll fill our skin with pinches. Shak. Twenty things which I set down: This done, I twenty more-had in my crown. Bunyan. 9. The part of a hat above the brim. 10. (Anat.)  The part of a tooth which projects above the gum; also, the top or grinding surface of a tooth. 11. (Arch.)  The vertex or top of an arch; -- applied generally to about one third of the curve, but in a pointed arch to the apex only. 12. (Bot.)  Same as Corona. 13. (Naut.) (a) That part of an anchor where the arms are joined to the shank. (b) The rounding, or rounded part, of the deck from a level line. (c) pl.  The bights formed by the several turns of a cable. Totten. 14. The upper range of facets in a rose diamond. 15. The dome of a furnace. 16. (Geom.)  The area inclosed between two concentric perimeters. 17. (Eccl.)  A round spot shaved clean on the top of the head, as a mark of the clerical state; the tonsure. 18. A size of writing paper. See under Paper. 19. A coin stamped with the image of a crown; hence,a denomination of money; as, the English crown, a silver coin of the value of five shillings sterling, or a little more than $1.20; the Danish or Norwegian crown, a money of account, etc., worth nearly twenty-seven cents. 20. An ornaments or decoration representing a crown; as, the paper is stamped with a crown. Crown of aberration (Astron.), a spurious circle around the true circle of the sun. -- Crown antler (Zoöl.), the topmost branch or tine of an antler; also, an antler having a cuplike top, with tines springing from the rim. -- Crown bar, one of the bars which support the crown sheet of steam-boiler furnace. -- Crown glass. See under Glass. -- Crown imperial. (Bot.) See in the Vocabulary. -- Crown jewels, the jewels appertaining to the sovereign while wearing the crown. [Eng.] \"She pawned and set to sale the crown jewels.\" Milton. -- Crown land, land belonging to the crown, that is, to the sovereign. -- Crown law, the law which governs criminal prosecutions. [Eng.] -- Crown lawyer, one employed by the crown, as in criminal cases. [Eng.] -- Crown octavo. See under Paper. -- Crown office. See in the Vocabulary. -- Crown paper. See under Paper. -- Crown piece. See in the Vocabulary. -- Crown Prince, the heir apparent to a crown or throne. -- Crown saw. See in the Vocabulary. -- Crown scab (Far.), a cancerous sore formed round the corners of a horse's hoof. -- Crown sheet, the flat plate which forms the top of the furnace or fire box of an internally fired steam boiler. -- Crown shell. (Zoöl.) See Acorn-shell. -- Crown side. See Crown office. -- Crown tax (Eccl. Hist.), a golden crown, or its value, which was required annually from the Jews by the king of Syria, in the time of the Maccabees. 1 Macc. x. 20. -- Crown wheel. See in the Vocabulary. -- Crown work. See in the Vocabulary. -- Pleas of the crown (Engl. law), criminal actions.\n\n1. To cover, decorate, or invest with a crown; hence, to invest with royal dignity and power. Her who fairest does appear, Crown her queen of all the year. Dryden. Crown him, and say, \"Long live our emperor.\" Shak. 2. To bestow something upon as a mark of honor, dignity, or recompense; to adorn; to dignify. Thou . . . hast crowned him with glory and honor. Ps. viii. 5. 3. To form the topmost or finishing part of; to complete; to consummate; to perfect. Amidst the grove that crowns yon tufted hill. Byron. One day shall crown the alliance. Shak. To crown the whole, came a proposition. Motley. 4. (Mech.)  To cause to round upward; to make anything higher at the middle than at the edges, as the face of a machine pulley. 5. (Mil.)  To effect a lodgment upon, as upon the crest of the glacis, or the summit of the breach. To crown a knot (Naut.), to lay the ends of the strands over and under each other."}