{"word":"cry","definition":"1. To make a loud call or cry; to call or exclaim vehemently or earnestly; to shout; to vociferate; to proclaim; to pray; to implore. And about the ninth hour, Jesus cried with a loud voice. Matt. xxvii. 46. Clapping their hands, and crying with loud voice. Shak. Hear the voice of my supplications when I cry unto thee. Ps. xxviii. 2. The voice of him that crieth in the wilderness, Prepare ye the way of the Lord. Is. xl. 3. Some cried after him to return. Bunyan. 2. To utter lamentations; to lament audibly; to express pain, grief, or distress, by weeping and sobbing; to shed tears; to bawl, as a child. Ye shall cry for sorrow of heart. Is. lxv. 14. I could find it in my heart to disgrace my man's apparel and to cry like a woman. Shak. 3. To utter inarticulate sounds, as animals. The young ravens which cry. Ps. cxlvii. 9. In a cowslip's bell I lie There I couch when owls do cry. Shak. To cry on or upon, to call upon the name of; to beseech.\"No longer on Saint Denis will we cry.\" Shak. -- To cry out. (a) To exclaim; to vociferate; to scream; to clamor. (b) To complain loudly; to lament. -- To cry out against, to complain loudly of; to censure; to blame. -- To cry out on or upon, to denounce; to censure. \"Cries out upon abuses.\" Shak. -- To cry to, to call on in prayer; to implore. -- To cry you mercy, to beg your pardon. \"I cry you mercy, madam; was it you\" Shak.\n\n1. To utter loudly; to call out; to shout; to sound abroad; to declare publicly. All, all, cry shame against ye, yet I 'll speak. Shak. The man . . . ran on,crying, Life! life! Eternal life! Bunyan. 2. To cause to do something, or bring to some state, by crying or weeping; as, to cry one's self to sleep. 3. To make oral and public proclamation of; to declare publicly; to notify or advertise by outcry, especially things lost or found, goods to be sold, ets.; as, to cry goods, etc. Love is lost, and thus she cries him. Crashaw. 4. Hence, to publish the banns of, as for marriage. I should not be surprised if they were cried in church next Sabbath. Judd. To cry aim. See under Aim. -- To cry down, to decry; to depreciate; to dispraise; to condemn. Men of dissolute lives cry down religion, because they would not be under the restraints of it. Tillotson. -- To cry out, to proclaim; to shout.\"Your gesture cries it out.\" Shak. -- To cry quits, to propose, or declare, the abandonment of a contest. -- To cry up, to enhance the value or reputation of by public and noisy praise; to extol; to laud publicly or urgently.\n\n1. A loud utterance; especially, the inarticulate sound produced by one of the lower animals; as, the cry of hounds; the cry of wolves. Milton. 2. Outcry; clamor; tumult; popular demand. Again that cry was found to have been as unreasonable as ever. Macaulay. 3. Any expression of grief, distress, etc., accompanied with tears or sobs; a loud sound, uttered in lamentation. There shall be a great cry throughout all the land. Ex. xi. 6. An infant crying in the night, An infant crying for the light; And with no language but a cry. Tennyson. 4. Loud expression of triumph or wonder or of popular acclamation or favor. Swift. The cry went once on thee. Shak. 5. Importunate supplication. O, the most piteous cry of the poor souls. Shak. 6. Public advertisement by outcry; proclamation, as by hawkers of their wares. The street cries of London. Mayhew. 7. Common report; fame. The cry goes that you shall marry her. Shak. 8. A word or phrase caught up by a party or faction and repeated for effect; as, the party cry of the Tories. All now depends upon a good cry. Beaconsfield. 9. A pack of hounds. Milton. A cry more tunable Was never hollaed to, nor cheered with horn. Shak. 10. A pack or company of persons; -- in contempt. Would not this . . . get me a fellowship in a cry of players Shak. 11. The cracklling noise made by block tin when it is bent back and forth. A far cry, a long distance; -- in allusion to the sending of criers or messengers through the territory of a Scottish clan with an announcement or summons."}