{"word":"dark","definition":"1. Destitute, or partially destitute, of light; not receiving, reflecting, or radiating light; wholly or partially black, or of some deep shade of color; not light-colored; as, a dark room; a dark day; dark cloth; dark paint; a dark complexion. O dark, dark, dark, amid the blaze of noon, Irrecoverable dark, total eclipse Without all hope of day! milton. In the dark and silent grave. Sir W. Raleigh. 2. Not clear to the understanding; not easily The dark problems of existence. Shairp. What may seem dark at the first, will afterward be found more plain. Hooker. What's your dark meaning, mouse, of this light word Shak. 3. Destitute of knowledge and culture; in moral or intellectual darkness; unrefined; ignorant. The age wherin he lived was dark, but he Cobld not want light who taught the world oto see. Denhan. The tenth century used to be reckoned by mediæval historians as the darkest part of this intellectual night. Hallam. 4. Evincing blaxk or foul traits of character; vile; wicked; atrocious; as, a dark villain; a dark deed. Left him at large to his own dark designs. Milton. 5. Foreboding evil; gloomy; jealous; suspicious. More dark and dark our woes. Shak. A deep melancholy took possesion of him, and gave a dark tinge to all his views of human nature. Macaulay. There is, in every true woman-s heart, a spark of heavenly fire, which beams and blazes in the dark hour of adversity. W. Irving. 6. Deprived of sight; blind. [Obs.] He was, I think, at this time quite dark, and so had been for some years. Evelyn. Note: Dark is sometimes used to qualify another adjective; as, dark blue, dark green, and sometimes it forms the first part of a compound; as, dark-haired, dark-eyed, dark-colored, dark-seated, dark-working. A dark horse, in racing or politics, a horse or a candidate whose chances of success are not known, and whose capabilities have not been made the subject of general comment or of wagers. [Colloq.] -- Dark house, Dark room, a house or room in which madmen were confined. [Obs.] Shak. -- Dark lantern. See Lantern. -- The Dark Ages, a period of stagnation and obscurity in literature and art, lasting, according to Hallam, nearly 1000 years, from about 500 to about 1500 A. D.. See Middle Ages, under Middle. -- The Dark and Bloody Ground, a phrase applied to the State of Kentucky, and said to be the significance of its name, in allusion to the frequent wars that were waged there between Indians. -- The dark day, a day (May 19, 1780) when a remarkable and unexplained darkness extended over all New England. -- To keep dark, to reveal nothing. [Low]\n\n1. Absence of light; darkness; obscurity; a place where there is little or no light. Here stood he in the dark, his sharp sword out. Shak. 2. The condition of ignorance; gloom; secrecy. Look, what you do, you do it still i' th' dark. Shak. Till we perceive by our own understandings, we are as mucdark, and as void of knowledge, as before. Locke. 3. (Fine Arts)  A dark shade or dark passage in a painting, engraving, or the like; as, the light and darks are well contrasted. The lights may serve for a repose to the darks, and the darks to the lights. Dryden.\n\nTo darken to obscure. [Obs.] Milton."}