{"word":"dash","definition":"1. To throw with violence or haste; to cause to strike violently or hastily; -- often used with against. If you dash a stone against a stone in the botton of the water, it maketh a sound. Bacon. 2. To break, as by throwing or by collision; to shatter; to crust; to frustrate; to ruin. Thou shalt dash them in pieces like a potter's vessel. Ps. ii. 9. A brave vessel, . . . Dashed all to pieces. Shak. To perplex and dash Maturest counsels. Milton. 3. To put to shame; to confound; to confuse; to abash; to depress. South. Dash the proud gamesPope. 4. To throw in or on in a rapid, careless manner; to mix, reduce, or adulterate, by throwing in something of an inferior quality; to overspread partially; to bespatter; to touch here and there; as, to dash wine with water; to dash paint upon a picture. I take care to dash the character with such particular circumstance as may prevent ill-natured applications. Addison. The very source and fount of day Is dashed with wandering isles of night. Tennyson. 5. To form or sketch rapidly or carelessly; to execute rapidly, or with careless haste; -- with off; as, to dash off a review or sermon. 6. To erase by a stroke; to strike out; knock out; -- with out; as, to dash out a word.\n\nTo rust with violence; to move impetuously; to strike violently; as, the waves dash upon rocks. [He] dashed through thick and thin. Dryden. On each hand the gushing waters play, And down the rough cascade all dashing fall. Thomson.\n\n1. Violent striking together of two bodies; collision; crash. 2. A sudden check; abashment; frustration; ruin; as, his hopes received a dash. 3. A slight admixture, infusion, or adulteration; a partial overspreading; as, wine with a dash of water; red with a dash of purple. Innocence when it has in it a dash of folly. Addison. 4. A rapid movement, esp. one of short duration; a quick stroke or blow; a sudden onset or rush; as, a bold dash at the enemy; a dash of rain. She takes upon her bravely at first dash. Shak. 5. Energy in style or action; animation; spirit. 6. A vain show; a blustering parade; a flourish; as, to make or cut a great dash. [Low] 7. (Punctuation)  A mark or line [--], in writing or printing, denoting a sudden break, stop, or transition in a sentence, or an abrupt change in its construction, a long or significant pause, or an unexpected or epigrammatic turn of sentiment. Dashes are also sometimes used instead of marks or parenthesis. John Wilson. 8. (Mus.) (a) The sign of staccato, a small mark [. (b) The line drawn through a figure in the thorough bass, as a direction to raise the interval a semitone. 9. (Racing)  A short, spirited effort or trial of speed upon a race course; -- used in horse racing, when a single trial constitutes the race."}