{"word":"date","definition":"The fruit of the date palm; also, the date palm itself. Note: This fruit is somewhat in the shape of an olive, containing a soft pulp, sweet, esculent, and wholesome, and inclosing a hard kernel. Date palm, or Date tree (Bot.), the genus of palms which bear dates, of which common species is Phoenix dactylifera. See Illust. -- Date plum (Bot.), the fruit of several species of Diospyros, including the American and Japanese persimmons, and the European lotus (D. Lotus). -- Date shell, or Date fish (Zoöl.), a bivalve shell, or its inhabitant, of the genus Pholas, and allied genera. See Pholas.\n\n1. That addition to a writing, inscription, coin, etc., which specifies the time (as day, month, and year) when the writing or inscription was given, or executed, or made; as, the date of a letter, of a will, of a deed, of a coin. etc. And bonds without a date, they say, are void. Dryden. 2. The point of time at which a transaction or event takes place, or is appointed to take place; a given point of time; epoch; as, the date of a battle. He at once, Down the long series of eventful time, So fixed the dates of being, so disposed To every living soul of every kind The field of motion, and the hour of rest. Akenside. 3. Assigned end; conclusion. [R.] What Time would spare, from Steel receives its date. Pope. 4. Given or assigned length of life; dyration. [Obs.] Good luck prolonged hath thy date. Spenser. Through his life's whole date. Chapman. To bear date, to have the date named on the face of it; -- said of a writing.\n\n1. To note the time of writing or executing; to express in an instrument the time of its execution; as, to date a letter, a bond, a deed, or a charter. 2. To note or fix the time of, as of an event; to give the date of; as, to date the building of the pyramids. Note: We may say dated at or from a place. The letter is dated at Philadephia. G. T. Curtis. You will be suprised, I don't question, to find among your correspondencies in foreign parts, a letter dated from Blois. Addison. In the countries of his jornal seems to have been written; parts of it are dated from them. M. Arnold.\n\nTo have beginning; to begin; to be dated or reckoned; -- with from. The Batavian republic dates from the successes of the French arms. E. Everett."}