{"word":"deal","definition":"1. A part or portion; a share; hence, an indefinite quantity, degree, or extent, degree, or extent; as, a deal of time and trouble; a deal of cold. Three tenth deals [parts of an ephah] of flour. Num. xv. 9. As an object of science it [the Celtic genius] may count for a good deal . . . as a spiritual power. M. Arnold. She was resolved to be a good deal more circumspect. W. Black. Note: It was formerly limited by some, every, never a, a thousand, etc.; as, some deal; but these are now obsolete or vulgar. In general, we now qualify the word with great or good, and often use it adverbially, by being understood; as, a great deal of time and pains; a great (or good) deal better or worse; that is, better by a great deal, or by a great part or difference. 2. The process of dealing cards to the players; also, the portion disturbed. The deal, the shuffle, and the cut. Swift. 3. Distribution; apportionment. [Colloq.] 4. An arrangement to attain a desired result by a combination of interested parties; -- applied to stock speculations and political bargains. [Slang] 5. Etym: [Prob. from D. deel a plank, threshing floor. See Thill.]  The division of a piece of timber made by sawing; a board or plank; particularly, a board or plank of fir or pine above seven inches in width, and exceeding six feet in length. If narrower than this, it is called a batten; if shorter, a deal end. Note: Whole deal is a general term for planking one and one half inches thick. 6. Wood of the pine or fir; as, a floor of deal. Deal tree, a fir tree. Dr. Prior.\n\n1. To divide; to separate in portions; hence, to give in portions; to distribute; to bestow successively; -- sometimes with out. Is not to deal thy bread to the hungry Is. lviii. 7. And Rome deals out her blessings and her gold. Tickell. The nightly mallet deals resounding blows. Gay. Hissing through the skies, the feathery deaths were dealt. Dryden. 2. Specifically: To distribute, as cards, to the players at the commencement of a game; as, to deal the cards; to deal one a jack.\n\n1. To make distribution; to share out in portions, as cards to the players. 2. To do a distributing or retailing business, as distinguished from that of a manufacturer or producer; to traffic; to trade; to do business; as, he deals in flour. They buy and sell, they deal and traffic. South. This is to drive to wholesale trade, when all other petty merchants deal but for parcels. Dr. H. More. 3. To act as an intermediary in business or any affairs; to manage; to make arrangements; -- followed by between or with. Sometimes he that deals between man and man, raiseth his own credit with both, by pretending greater interest than he hath in either. Bacon. 4. To conduct one's self; to behave or act in any affair or towards any one; to treat. If he will deal clearly and impartially, . . . he will acknowledge all this to be true. Tillotson. 5. To contend (with); to treat (with), by way of opposition, check, or correction; as, he has turbulent passions to deal with. To deal by, to treat, either well or ill; as, to deal well by servants. \"Such an one deals not fairly by his own mind.\" Locke. -- To deal in. (a) To have to do with; to be engaged in; to practice; as, they deal in political matters. (b) To buy and sell; to furnish, as a retailer or wholesaler; as, they deal in fish. -- To deal with. (a) To treat in any manner; to use, whether well or ill; to have to do with; specifically, to trade with. \"Dealing with witches.\" Shak. (b) To reprove solemnly; to expostulate with. The deacons of his church, who, to use their own phrase, \"dealt with him\" on the sin of rejecting the aid which Providence so manifestly held out. Hawthorne. Return . . . and I will deal well with thee. Gen. xxxii. 9."}