{"word":"deck","definition":"1. To cover; to overspread. To deck with clouds the uncolored sky. Milton. 2. To dress, as the person; to clothe; especially, to clothe with more than ordinary elegance; to array; to adorn; to embellish. Deck thyself now with majesty and excellency. Job xl. 10. And deck my body in gay ornaments. Shak. The dew with spangles decked the ground. Dryden. 3. To furnish with a deck, as a vessel.\n\n1. The floorlike covering of the horizontal sections, or compartments, of a ship. Small vessels have only one deck; larger ships have two or three decks. Note: The following are the more common names of the decks of vessels having more than one. Berth deck (Navy), a deck next below the gun deck, where the hammocks of the crew are swung. -- Boiler deck (River Steamers), the deck on which the boilers are placed. -- Flush deck, any continuous, unbroken deck from stem to stern. -- Gun deck (Navy), a deck below the spar deck, on which the ship's guns are carried. If there are two gun decks, the upper one is called the main deck, the lower, the lower gun deck; if there are three, one is called the middle gun deck. -- Half-deck, that portion of the deck next below the spar deck which is between the mainmast and the cabin. -- Hurricane deck (River Steamers, etc.), the upper deck, usually a light deck, erected above the frame of the hull. -- Orlop deck, the deck or part of a deck where the cables are stowed, usually below the water line. -- Poop deck, the deck forming the roof of a poop or poop cabin, built on the upper deck and extending from the mizzenmast aft. -- Quarter-deck, the part of the upper deck abaft the mainmast, including the poop deck when there is one. -- Spar deck. (a) Same as the upper deck. (b) Sometimes a light deck fitted over the upper deck. -- Upper deck, the highest deck of the hull, extending from stem to stern. 2. (arch.)  The upper part or top of a mansard roof or curb roof when made nearly flat. 3. (Railroad)  The roof of a passenger car. 4. A pack or set of playing cards. The king was slyly fingered from the deck. Shak. 5. A heap or store. [Obs.] Who . . . hath such trinkets Ready in the deck. Massinger. Between decks. See under Between. -- Deck bridge (Railroad Engineering), a bridge which carries the track upon the upper chords; -- distinguished from a through bridge, which carries the track upon the lower chords, between the girders. -- Deck curb (Arch.), a curb supporting a deck in roof construction. -- Deck floor (Arch.), a floor which serves also as a roof, as of a belfry or balcony. -- Deck hand, a sailor hired to help on the vessel's deck, but not expected to go aloft. -- Deck molding (Arch.), the molded finish of the edge of a deck, making the junction with the lower slope of the roof. -- Deck roof (Arch.), a nearly flat roof which is not surmounted by parapet walls. -- Deck transom (Shipbuilding), the transom into which the deck is framed. -- To clear the decks (Naut.), to remove every unnecessary incumbrance in preparation for battle; to prepare for action. -- To sweep the deck (Card Playing), to clear off all the stakes on the table by winning them."}