{"word":"degree","definition":"1. A step, stair, or staircase. [Obs.] By ladders, or else by degree. Rom. of R. 2. One of a series of progressive steps upward or downward, in quality, rank, acquirement, and the like; a stage in progression; grade; gradation; as, degrees of vice and virtue; to advance by slow degrees; degree of comparison. 3. The point or step of progression to which a person has arrived; rank or station in life; position. \"A dame of high degree.\" Dryden. \"A knight is your degree.\" Shak. \"Lord or lady of high degree.\" Lowell. 4. Measure of advancement; quality; extent; as, tastes differ in kind as well as in degree. The degree of excellence which proclaims genius, is different in different times and different places. Sir. J. Reynolds. 5. Grade or rank to which scholars are admitted by a college or university, in recognition of their attainments; as, the degree of bachelor of arts, master, doctor, etc. Note: In the United States diplomas are usually given as the evidence of a degree conferred. In the humanities the first degree is that of bachelor of arts (B. A. or A. B.); the second that of master of arts (M. A. or A. M.). The degree of bachelor (of arts, science, divinity, law, etc.) is conferred upon those who complete a prescribed course of undergraduate study. The first degree in medicine is that of doctor of medicine (M. D.). The degrees of master and doctor are sometimes conferred, in course, upon those who have completed certain prescribed postgraduate studies, as doctor of philosophy (Ph. D.); but more frequently the degree of doctor is conferred as a complimentary recognition of eminent services in science or letters, or for public services or distinction (as doctor of laws (LL. D.) or doctor of divinity (D. D.), when they are called honorary degrees. The youth attained his bachelor's degree, and left the university. Macaulay. 5. (Genealogy)  A certain distance or remove in the line of descent, determining the proximity of blood; one remove in the chain of relationship; as, a relation in the third or fourth degree. In the 11th century an opinion began to gain ground in Italy, that third cousins might marry, being in the seventh degree according to the civil law. Hallam. 7. (Arith.)  Three figures taken together in numeration; thus, 140 is one degree, 222,140 two degrees. 8. (Algebra)  State as indicated by sum of exponents; more particularly, the degree of a term is indicated by the sum of the exponents of its literal factors; thus, a2b2c is a term of the sixth degree. The degree of a power, or radical, is denoted by its index, that of an equation by the greatest sum of the exponents of the unknown quantities in any term; thus, ax4 + bx2 = c, and mx2y2 + nyx = p, are both equations of the fourth degree. 9. (Trig.)  A 360th part of the circumference of a circle, which part is taken as the principal unit of measure for arcs and angles. The degree is divided into 60 minutes and the minute into 60 seconds. 10. A division, space, or interval, marked on a mathematical or other instrument, as on a thermometer. 11. (Mus.)  A line or space of the staff. Note: The short lines and their spaces are added degrees. Accumulation of degrees. (Eng. Univ.) See under Accumulation. -- By degrees, step by step; by little and little; by moderate advances. \"I 'll leave by degrees.\" Shak. -- Degree of a curve or surface (Geom.), the number which expresses the degree of the equation of the curve or surface in rectilinear coördinates. A straight line will, in general, meet the curve or surface in a number of points equal to the degree of the curve or surface and no more. -- Degree of latitude (Geog.), on the earth, the distance on a meridian between two parallels of latitude whose latitudes differ from each other by one degree. This distance is not the same on different parts of a meridian, on account of the flattened figure of the earth, being 68.702 statute miles at the equator, and 69.396 at the poles. -- Degree of longitude, the distance on a parallel of latitude between two meridians that make an angle of one degree with each other at the poles -- a distance which varies as the cosine of the latitude, being at the equator 69.16 statute miles. -- To a degree, to an extreme; exceedingly; as, mendacious to a degree. It has been said that Scotsmen . . . are . . . grave to a degree on occasions when races more favored by nature are gladsome to excess. Prof. Wilson."}