{"word":"desert","definition":"That which is deserved; the reward or the punishment justly due; claim to recompense, usually in a good sense; right to reward; merit. According to their deserts will I judge them. Ezek. vii. 27. Andronicus, surnamed Pius For many good and great deserts to Rome. Shak. His reputation falls far below his desert. A. Hamilton. Syn. -- Merit; worth; excellence; due.\n\n1. A deserted or forsaken region; a barren tract incapable of supporting population, as the vast sand plains of Asia and Africa are destitute and vegetation. A dreary desert and a gloomy waste. Pope. 2. A tract, which may be capable of sustaining a population, but has been left unoccupied and uncultivated; a wilderness; a solitary place. He will make her wilderness like Eden, and her desert like the garden of the Lord. Is. li. 3. Note: Also figuratively. Before her extended Dreary and vast and silent, the desert of life. Longfellow.\n\nOf or pertaining to a desert; forsaken; without life or cultivation; unproductive; waste; barren; wild; desolate; solitary; as, they landed on a desert island. He . . . went aside privately into a desert place. Luke ix. 10. Full many a flower is born to blush unseen, And waste its sweetness on the desert air. Gray. Desert flora (Bot.), the assemblage of plants growing naturally in a desert, or in a dry and apparently unproductive place. -- Desert hare (Zoöl.), a small hare (Lepus sylvaticus, var. Arizonæ) inhabiting the deserts of the Western United States. -- Desert mouse (Zoöl.), an American mouse (Hesperomys eremicus), living in the Western deserts.\n\n1. To leave (especially something which one should stay by and support); to leave in the lurch; to abandon; to forsake; -- implying blame, except sometimes when used of localities; as, to desert a friend, a principle, a cause, one's country. \"The deserted fortress.\" Prescott. 2. (Mil.)  To abandon (the service) without leave; to forsake in violation of duty; to abscond from; as, to desert the army; to desert one's colors.\n\nTo abandon a service without leave; to quit military service without permission, before the expiration of one's term; to abscond. The soldiers . . . deserted in numbers. Bancroft. Syn. -- To abandon; forsake; leave; relinquish; renounce; quit; depart from; abdicate. See Abandon."}