{"word":"develop","definition":"1. To free from that which infolds or envelops; to unfold; to lay open by degrees or in detail; to make visible or known; to disclose; to produce or give forth; as, to develop theories; a motor that develops 100 horse power. These serve to develop its tenets. Milner. The 20th was spent in strengthening our position and developing the line of the enemy. The Century. 2. To unfold gradually, as a flower from a bud; hence, to bring through a succession of states or stages, each of which is preparatory to the next; to form or expand by a process of growth; to cause to change gradually from an embryo, or a lower state, to a higher state or form of being; as, sunshine and rain develop the bud into a flower; to develop the mind. The sound developed itself into a real compound. J. Peile. All insects . . . acquire the jointed legs before the wings are fully developed. Owen. 3. To advance; to further; to prefect; to make to increase; to promote the growth of. We must develop our own resources to the utmost. Jowett (Thucyd). 4. (Math.)  To change the form of, as of an algebraic expression, by executing certain indicated operations without changing the value. 5. (Photog.)  To cause to become visible, as an invisible or latent image upon plate, by submitting it to chemical agents; to bring to view. To develop a curved surface on a place (Geom.), to produce on the plane an equivalent surface, as if by rolling the curved surface so that all parts shall successively touch the plane. Syn. -- To uncover; unfold; evolve; promote; project; lay open; disclose; exhibit; unravel; disentangle.\n\n1. To go through a process of natural evolution or growth, by successive changes from a less perfect to a more perfect or more highly organized state; to advance from a simpler form of existence to one more complex either in structure or function; as, a blossom develops from a bud; the seed develops into a plant; the embryo develops into a well-formed animal; the mind develops year by year. Nor poets enough to understand That life develops from within. Mrs. Browning. 2. To become apparent gradually; as, a picture on sensitive paper develops on the application of heat; the plans of the conspirators develop."}