{"word":"diamond","definition":"1. A precious stone or gem excelling in brilliancy and beautiful play of prismatic colors, and remarkable for extreme hardness. Note: The diamond is native carbon in isometric crystals, often octahedrons with rounded edges. It is usually colorless, but some are yellow, green, blue, and even black. It is the hardest substance known. The diamond as found in nature (called a rough diamond) is cut, for use in jewelry, into various forms with many reflecting faces, or facets, by which its brilliancy is much increased. See Brilliant, Rose. Diamonds are said to be of the first water when very transparent, and of the second or third water as the transparency decreases. 2. A geometrical figure, consisting of four equal straight lines, and having two of the interior angles acute and two obtuse; a rhombus; a lozenge. 3. One of a suit of playing cards, stamped with the figure of a diamond. 4. (Arch.)  A pointed projection, like a four-sided pyramid, used for ornament in lines or groups. 5. (Baseball)  The infield; the square space, 90 feet on a side, having the bases at its angles. 6. (Print.)  The smallest kind of type in English printing, except that called brilliant, which is seldom seen. Note: * This line is printed in the type called Diamond. Black diamond, coal; (Min.) See Carbonado. -- Bristol diamond. See Bristol stone, under Bristol. -- Diamond beetle (Zoöl.), a large South American weevil (Entimus imperialis), remarkable for its splendid luster and colors, due to minute brilliant scales. -- Diamond bird (Zoöl.), a small Australian bird (Pardalotus punctatus, family Ampelidæ.). It is black, with white spots. -- Diamond drill (Engin.), a rod or tube the end of which is set with black diamonds; -- used for perforating hard substances, esp. for boring in rock. -- Diamond finch (Zoöl.), a small Australian sparrow, often kept in a cage. Its sides are black, with conspicuous white spots, and the rump is bright carmine. -- Diamond groove (Iron Working), a groove of V-section in a roll. -- Diamond mortar (Chem.), a small steel mortar used for pulverizing hard substances. -- Diamond-point tool, a cutting tool whose point is diamond-shaped. -- Diamond snake (Zoöl.), a harmless snake of Australia (Morelia spilotes); the carpet snake. -- Glazier's diamond, a small diamond set in a glazier's tool, for cutting glass.\n\nResembling a diamond; made of, or abounding in, diamonds; as, a diamond chain; a diamond field."}