{"word":"direct","definition":"1. Straight; not crooked, oblique, or circuitous; leading by the short or shortest way to a point or end; as, a direct line; direct means. What is direct to, what slides by, the question. Locke. 2. Straightforward; not of crooked ways, or swerving from truth and openness; sincere; outspoken. Be even and direct with me. Shak. 3. Immediate; express; plain; unambiguous. He howhere, that I know, says it in direct words. Locke. A direct and avowed interference with elections. Hallam. 4. In the line of descent; not collateral; as, a descendant in the direct line. 5. (Astron.)  In the direction of the general planetary motion, or from west to east; in the order of the signs; not retrograde; -- said of the motion of a celestial body. Direct action. (Mach.) See Direct-acting. -- Direct discourse (Gram.), the language of any one quoted without change in its form; as, he said \"I can not come;\" -- correlative to indirect discourse, in which there is change of form; as, he said that he could not come. They are often called respectively by their Latin names, oratio directa, and oratio obliqua. -- Direct evidence (Law), evidence which is positive or not inferential; -- opposed to circumstantial, or indirect, evidence. -- This distinction, however, is merely formal, since there is no direct evidence that is not circumstantial, or dependent on circumstances for its credibility. Wharton. -- Direct examination (Law), the first examination of a witness in the orderly course, upon the merits. Abbott. -- Direct fire (Mil.), fire, the direction of which is perpendicular to the line of troops or to the parapet aimed at. -- Direct process (Metal.), one which yields metal in working condition by a single process from the ore. Knight. -- Direct tax, a tax assessed directly on lands, etc., and polls, distinguished from taxes on merchandise, or customs, and from excise.\n\n1. To arrange in a direct or straight line, as against a mark, or towards a goal; to point; to aim; as, to direct an arrow or a piece of ordnance. 2. To point out or show to (any one), as the direct or right course or way; to guide, as by pointing out the way; as, he directed me to the left-hand road. The Lord direct your into the love of God. 2 Thess. iii. 5. The next points to which I will direct your attention. Lubbock. 3. To determine the direction or course of; to cause to go on in a particular manner; to order in the way to a certain end; to regulate; to govern; as, to direct the affairs of a nation or the movements of an army. I will direct their work in truth. Is. lxi. 8. 4. To point out to with authority; to instruct as a superior; to order; as, he directed them to go. I 'll first direct my men what they shall do. Shak. 5. To put a direction or address upon; to mark with the name and residence of the person to whom anything is sent; to superscribe; as, to direct a letter. Syn. -- To guide; lead; conduct; dispose; manage; regulate; order; instruct; command.\n\nTo give direction; to point out a course; to act as guide. Wisdom is profitable to direct. Eccl. x. 10.\n\nA character, thus [ Moore (Encyc. of Music)."}