{"word":"discharge","definition":"1. To relieve of a charge, load, or burden; to empty of a load or cargo; to unburden; to unload; as, to discharge a vessel. 2. To free of the missile with which anything is charged or loaded; to let go the charge of; as, to discharge a bow, catapult, etc.; especially, said of firearms, -- to fire off; to shoot off; also, to relieve from a state of tension, as a Leyden jar. The galleys also did oftentimes, out of their prows, discharge their great pieces against the city. Knolles. Feeling in other cases discharges itself in indirect muscular actions. H. Spencer. 3. To of something weighing upon or impeding over one, as a debt, claim, obligation, responsibility, accusation, etc.; to absolve; to acquit; to clear. Discharged of business, void of strife. Dryden. In one man's fault discharge another man of his duty. L'Estrange. 4. To relieve of an office or employment; to send away from service; to dismiss. Discharge the common sort With pay and thanks. Shak. Grindal . . . was discharged the government of his see. Milton. 5. To release legally from confinement; to set at liberty; as, to discharge a prisoner. 6. To put forth, or remove, as a charge or burden; to take out, as that with which anything is loaded or filled; as, to discharge a cargo. 7. To let fly, as a missile; to shoot. They do discharge their shot of courtesy. Shak. 8. To set aside; to annul; to dismiss. We say such an order was \"discharged on appeal.\" Mozley & W. The order for Daly's attendance was discharged. Macaulay. 9. To throw off the obligation of, as a duty or debt; to relieve one's self of, by fulfilling conditions, performing duty, trust, and the like; hence, to perform or ex Had I a hundred tongues, a wit so large As could their hundred offices discharge. Dryden. 10. To send away (a creditor) satisfied by payment; to pay one's debt or obligation to. [Obs.] If he had The present money to discharge the Jew. Shak. 11. To give forth; to emit or send out; as, a pipe discharges water; to let fly; to give expression to; to utter; as, to discharge a horrible oath. 12. To prohibit; to forbid. [Scot. Obs.] Sir W. Scott. Discharging arch (Arch.), an arch over a door, window, or other opening, to distribute the pressure of the wall above. See Illust. of Lintel. -- Discharging piece, Discharging strut (Arch.), a piece set to carry thrust or weight to a solid point of support. -- Discharging rod (Elec.), a bent wire, with knobs at both ends, and insulated by a glass handle. It is employed for discharging a Leyden jar or an electrical battery. See Discharger. Syn. -- See Deliver.\n\nTo throw off or deliver a load, charge, or burden; to unload; to emit or give vent to fluid or other contents; as, the water pipe discharges freely. The cloud, if it were oily or fatty, would not discharge. Bacon.\n\n1. The act of discharging; the act of relieving of a charge or load; removal of a load or burden; unloading; as, the discharge of a ship; discharge of a cargo. 2. Firing off; explosive removal of a charge; explosion; letting off; as, a discharge of arrows, of artillery. 3. Act of relieving of something which oppresses or weighs upon one, as an obligation, liability, debt, accusation, etc.; acquittance; as, the discharge of a debtor. 4. Act of removing, or getting rid of, an obligation, liability, etc.; fulfillment, as by the payment of a debt, or the performance of a trust or duty. Indefatigable in the discharge of business. Motley. Nothing can absolve us from the discharge of those duties. L'Estrange. 5. Release or dismissal from an office, employment, etc.; dismission; as, the discharge of a workman by his employer. 6. Legal release from confinement; liberation; as, the discharge of a prisoner. 7. The state of being discharged or relieved of a debt, obligation, office, and the like; acquittal. Too secure of our discharge From penalty. Milton. 8. That which discharges or releases from an obligation, liability, penalty, etc., as a price of ransom, a legal document. Death, who sets all free, Hath paid his ransom now and full discharge. Milton. 9. A flowing or issuing out; emission; vent; evacuation; also, that which is discharged or emitted; as, a rapid discharge of water from the pipe. The hemorrhage being stopped, the next occurrence is a thin serous discharge. S. Sharp. Charge and discharge. (Equity Practice) See under Charge, n. -- Paralytic discharge (Physiol.), the increased secretion from a gland resulting from the cutting of all of its nerves."}