{"word":"dispatch","definition":"1. To dispose of speedily, as business; to execute quickly; to make a speedy end of; to finish; to perform. Ere we put ourselves in arms, dispatch we The business we have talked of. Shak. [The] harvest men . . . almost in one fair day dispatcheth all the harvest work. Robynson (More's Utopia). 2. To rid; to free. [Obs.] I had clean dispatched myself of this great charge. Udall. 3. To get rid of by sending off; to send away hastily. Unless dispatched to the mansion house in the country . . . they perish among the lumber of garrets. Walpole. 4. To send off or away; -- particularly applied to sending off messengers, messages, letters, etc., on special business, and implying haste. Even with the speediest expedition I will dispatch him to the emperor's couShak. 5. To send out of the world; to put to death. The company shall stone them with stones, and dispatch them with their swords. Ezek. xxiii. 47. Syn. -- To expedite; hasten; speed; accelerate; perform; conclude; finish; slay; kill.\n\nTo make haste; to conclude an affair; to finish a matter of business. They have dispatched with Pompey. Shak.\n\n1. The act of sending a message or messenger in haste or on important business. 2. Any sending away; dismissal; riddance. To the utter dispatch of all their most beloved comforts. Milton. 3. The finishing up of a business; speedy performance, as of business; prompt execution; diligence; haste. Serious business, craving quick dispatch. Shak. To carry his scythe . . . with a sufficient dispatch through a sufficient space. Paley. 4. A message dispatched or sent with speed; especially, an important official letter sent from one public officer to another; -- often used in the plural; as, a messenger has arrived with dispatches for the American minister; naval or military dispatches. 5. A message transmitted by telegraph. [Modern] Dispatch boat, a swift vessel for conveying dispatches; an advice boat. -- Dispatch box, a box for carrying dispatches; a box for papers and other conveniences when traveling. Syn. -- Haste; hurry; promptness; celerity; speed. See Haste."}