{"word":"division","definition":"1. The act or process of diving anything into parts, or the state of being so divided; separation. I was overlooked in the division of the spoil. Gibbon. 2. That which divides or keeps apart; a partition. 3. The portion separated by the divining of a mass or body; a distinct segment or section. Communities and divisions of men. Addison. 4. Disunion; difference in opinion or feeling; discord; variance; alienation. There was a division among the people. John vii. 43. 5. Difference of condition; state of distinction; distinction; contrast. Chaucer. I will put a division between my people and thy people. Ex. viii. 23. 6. Separation of the members of a deliberative body, esp. of the Houses of Parliament, to ascertain the vote. The motion passed without a division. Macaulay. 7. (Math.)  The process of finding how many times one number or quantity is contained in another; the reverse of multiplication; also, the rule by which the operation is performed. 8. (Logic)  The separation of a genus into its constituent species. 9. (Mil.) (a) Two or more brigades under the command of a general officer. (b) Two companies of infantry maneuvering as one subdivision of a battalion. (c) One of the larger districts into which a country is divided for administering military affairs. 10. (Naut.)  One of the groups into which a fleet is divided. 11. (Mus.)  A course of notes so running into each other as to form one series or chain, to be sung in one breath to one syllable. 12. (Rhet.)  The distribution of a discourse into parts; a part so distinguished. 13. (Biol.)  A grade or rank in classification; a portion of a tribe or of a class; or, in some recent authorities, equivalent to a subkingdom. Cell division (Biol.), a method of cell increase, in which new cells are formed by the division of the parent cell. In this process, the cell nucleus undergoes peculiar differentiations and changes, as shown in the figure (see also Karyokinesis). At the same time the protoplasm of the cell becomes gradually constricted by a furrow transverse to the long axis of the nuclear spindle, followed, on the completion of the division of the nucleus, by a separation of the cell contents into two masses, called the daughter cells. -- Long division (Math.), the process of division when the operations are mostly written down. -- Short division (Math.), the process of division when the operations are mentally performed and only the results written down; -- used principally when the divisor is not greater than ten or twelve. Syn. -- compartment; section; share; allotment; distribution; separation; partition; disjunction; disconnection; difference; variance; discord; disunion."}