{"word":"divine","definition":"1. Of or belonging to God; as, divine perfections; the divine will. \"The immensity of the divine nature.\" Paley. 2. Proceeding from God; as, divine judgments. \"Divine protection.\" Bacon. 3. Appropriated to God, or celebrating his praise; religious; pious; holy; as, divine service; divine songs; divine worship. 4. Pertaining to, or proceeding from, a deity; partaking of the nature of a god or the gods. \"The divine Apollo said.\" Shak. 5. Godlike; heavenly; excellent in the highest degree; supremely admirable; apparently above what is human. In this application, the word admits of comparison; as, the divinest mind. Sir J. Davies. \"The divine Desdemona.\" Shak. A divine sentence is in the lips of the king. Prov. xvi. 10. But not to one in this benighted age Is that diviner inspiration given. Gray. 6. Presageful; foreboding; prescient. [Obs.] Yet oft his heart, divine of something ill, Misgave him. Milton. 7. Relating to divinity or theology. Church history and other divine learning. South. Syn. -- Supernatural; superhuman; godlike; heavenly; celestial; pious; holy; sacred; preëminent.\n\n1. One skilled in divinity; a theologian. \"Poets were the first divines.\" Denham. 2. A minister of the gospel; a priest; a clergyman. The first divines of New England were surpassed by none in extensive erudition. J. Woodbridge.\n\n1. To foresee or foreknow; to detect; to anticipate; to conjecture. A sagacity which divined the evil designs. Bancroft. 2. To foretell; to predict; to presage. Darest thou . . . divine his downfall Shak. 3. To render divine; to deify. [Obs.] Living on earth like angel new divined. Spenser. Syn. -- To foretell; predict; presage; prophesy; prognosticate; forebode; guess; conjecture; surmise.\n\n1. To use or practice divination; to foretell by divination; to utter prognostications. The prophets thereof divine for money. Micah iii. 11. 2. To have or feel a presage or foreboding. Suggest but truth to my divining thoughts. Shak. 3. To conjecture or guess; as, to divine rightly."}