{"word":"down","definition":"1. Fine, soft, hairy outgrowth from the skin or surface of animals or plants, not matted and fleecy like wool; esp.: (a) (Zoöl.) The soft under feathers of birds. They have short stems with soft rachis and bards and long threadlike barbules, without hooklets. (b) (Bot.) The pubescence of plants; the hairy crown or envelope of the seeds of certain plants, as of the thistle. (c) The soft hair of the face when beginning to appear. And the first down begins to shade his face. Dryden. 2. That which is made of down, as a bed or pillow; that which affords ease and repose, like a bed of down When in the down I sink my head, Sleep, Death's twin brother, times my breath. Tennyson. Thou bosom softness, down of all my cares! Southern. Down tree (Bot.), a tree of Central America (Ochroma Lagopus), the seeds of which are enveloped in vegetable wool.\n\nTo cover, ornament, line, or stuff with down. [R.] Young.\n\n1. A bank or rounded hillock of sand thrown up by the wind along or near the shore; a flattish-topped hill; -- usually in the plural. Hills afford prospects, as they must needs acknowledge who have been on the downs of Sussex. Ray. She went by dale, and she went by down. Tennyson. 2. A tract of poor, sandy, undulating or hilly land near the sea, covered with fine turf which serves chiefly for the grazing of sheep; -- usually in the plural. [Eng.] Seven thousand broad-tailed sheep grazed on his downs. Sandys. 3. pl.  A road for shipping in the English Channel or Straits of Dover, near Deal, employed as a naval rendezvous in time of war. On the 11th [June, 1771] we run up the channel . . . at noon we were abreast of Dover, and about three came to an anchor in the Downs, and went ashore at Deal. Cook (First Voyage). 4. pl. Etym: [From the adverb.]  A state of depression; low state; abasement. [Colloq.] It the downs of life too much outnumber the ups. M. Arnold.\n\n1. In the direction of gravity or toward the center of the earth; toward or in a lower place or position; below; -- the opposite of up. 2. Hence, in many derived uses, as: (a) From a higher to a lower position, literally or figuratively; in a descending direction; from the top of an ascent; from an upright position; to the ground or floor; to or into a lower or an inferior condition; as, into a state of humility, disgrace, misery, and the like; into a state of rest; -- used with verbs indicating motion. It will be rain to-night. Let it come down. Shak. I sit me down beside the hazel grove. Tennyson. And that drags down his life. Tennyson. There is not a more melancholy object in the learned world than a man who has written himself down. Addison. The French . . . shone down [i. e., outshone] the English. Shak. (b) In a low or the lowest position, literally or figuratively; at the bottom of a decent; below the horizon; of the ground; in a condition of humility, dejection, misery, and the like; in a state of quiet. I was down and out of breath. Shak. The moon is down; I have not heard the clock. Shak. He that is down needs fear no fall. Bunyan. 3. From a remoter or higher antiquity. Venerable men! you have come down to us from a former generation. D. Webster. 4. From a greater to a less bulk, or from a thinner to a thicker consistence; as, to boil down in cookery, or in making decoctions. Arbuthnot. Note: Down is sometimes used elliptically, standing for go down, come down, tear down, take down, put down, haul down, pay down, and the like, especially in command or exclamation. Down, therefore, and beg mercy of the duke. Shak. If he be hungry more than wanton, bread alone will down. Locke. Down is also used intensively; as, to be loaded down; to fall down; to hang down; to drop down; to pay down. The temple of Herè at Argos was burnt down. Jowett (Thucyd. ). Down, as well as up, is sometimes used in a conventional sense; as, down East. Persons in London say down to Scotland, etc., and those in the provinces, up to London. Stormonth. Down helm (Naut.), an order to the helmsman to put the helm to leeward. -- Down on or upon (joined with a verb indicating motion, as go, come, pounce), to attack, implying the idea of threatening power. Come down upon us with a mighty power. Shak. -- Down with, take down, throw down, put down; -- used in energetic command. \"Down with the palace; fire it.\" Dryden. -- To be down on, to dislike and treat harshly. [Slang, U.S.] -- To cry down. See under Cry, v. t. -- To cut down. See under Cut, v. t. -- Up and down, with rising and falling motion; to and fro; hither and thither; everywhere. \"Let them wander up and down.\" Ps. lix. 15.\n\n1. In a descending direction along; from a higher to a lower place upon or within; at a lower place in or on; as, down a hill; down a well. 2. Hence: Towards the mouth of a river; towards the sea; as, to sail or swim down a stream; to sail down the sound. Down the country, toward the sea, or toward the part where rivers discharge their waters into the ocean. -- Down the sound, in the direction of the ebbing tide; toward the sea.\n\nTo cause to go down; to make descend; to put down; to overthrow, as in wrestling; hence, to subdue; to bring down. [Archaic or Colloq.] \"To down proud hearts.\" Sir P. Sidney. I remember how you downed Beauclerk and Hamilton, the wits, once at our house. Madame D'Arblay.\n\nTo go down; to descend. Locke.\n\n1. Downcast; as, a down look. [R.] 2. Downright; absolute; positive; as, a down denial. [Obs.] Beau. & Fl. 3. Downward; going down; sloping; as, a down stroke; a down grade; a down train on a railway. Down draught, a downward draft, as in a flue, chimney, shaft of a mine, etc. -- Down in the mouth, chopfallen; dejected."}