{"word":"draught","definition":"1. The act of drawing or pulling; as: (a) The act of moving loads by drawing, as by beasts of burden, and the like. A general custom of using oxen for all sort of draught would be, perhaps, the greatest improvement. Sir W. Temple. (b) The drawing of a bowstring. [Obs.] She sent an arrow forth with mighty draught. Spenser. (c) Act of drawing a net; a sweeping the water for fish. Upon the draught of a pond, not one fish was left. Sir M. Hale. (d) The act of drawing liquor into the mouth and throat; the act of drinking. In his hands he took the goblet, but a while the draught forbore. Trench. (e) A sudden attack or drawing upon an enemy. [Obs.] By drawing sudden draughts upon the enemy when he looketh not for you. Spenser. (f) (Mil.)  The act of selecting or detaching soldiers; a draft (see Draft, n., 2) (g) The act of drawing up, marking out, or delineating; representation. Dryden. 2. That which is drawn; as: (a) That which is taken by sweeping with a net. Launch out into the deep, and let down your nets for a draught. Luke v. 4. He laid down his pipe, and cast his net, which brought him a very great draught. L'Estrange. (b) (Mil.)  The force drawn; a detachment; -- in this sense usually written draft. (c) The quantity drawn in at once in drinking; a potion or potation. Disguise thyself as thou wilt, still, Slavery, . . . still thou art a bitter draught. Sterne. Low lies that house where nut-brown draughts inspired. Goldsmith. (d) A sketch, outline, or representation, whether written, designed, or drawn; a delineation. A draught of a Toleration Act was offered to the Parliament by a private member. Macaulay. No picture or draught of these things from the report of the eye. South. (e) (Com.)  An order for the payment of money; -- in this sense almost always written draft. (f) A current of air moving through an inclosed place, as through a room or up a chimney. Thackeray. He preferred to go and sit upon the stairs, in . . . a strong draught of air, until he was again sent for. Dickens. 3. That which draws; as: (a) A team of oxen or horses. Blackstone. (b) A sink or drain; a privy. Shak. Matt. xv. 17. (c) pl. (Med.)  A mild vesicatory; a sinapism; as, to apply draughts to the feet. 4. Capacity of being drawn; force necessary to draw; traction. The Hertfordshire wheel plow . . . is of the easiest draught. Mortimer. 5. (Naut.)  The depth of water necessary to float a ship, or the depth a ship sinks in water, especially when laden; as, a ship of twelve feet draught. 6. (Com.)  An allowance on weighable goods. [Eng.] See Draft, 4. 7. A move, as at chess or checkers. [Obs.] Chaucer. 8. The bevel given to the pattern for a casting, in order that it may be drawn from the sand without injury to the mold. 9. (Masonry)  See Draft, n., 7. Angle of draught, the angle made with the plane over which a body is drawn by the line in which the pulling force acts, when the latter has the direction best adapted to overcome the obstacles of friction and the weight of the body. -- Black draught. See under Black, a. -- Blast draught, or Forced draught, the draught produced by a blower, as by blowing in air beneath a fire or drawing out the gases from above it. -- Natural draught, the draught produced by the atmosphere flowing, by its own weight, into a chimney wherein the air is rarefied by heat. -- On draught, so as to be drawn from the wood (as a cask, barrel, etc.) in distinction from being bottled; as, ale on draught. -- Sheer draught. See under Sheer.\n\n1. Used for drawing vehicles, loads, etc.; as, a draught beast; draught hooks. 2. Relating to, or characterized by, a draft, or current of air. 3. Used in making drawings; as, draught compasses. 4. Drawn directly from the barrel, or other receptacle, in distinction from bottled; on draught; -- said of ale, cider, and the like. Note: This word, especially in the first and second meanings, is often written draft, a spelling which is approved by many authorities. Draught box. See Draught tube, below. -- Draught engine (Mining), an engine used for pumping, raising heavy weights, and the like. -- Draught hook (Mil.), one of the hooks on a cannon carriage, used in drawing the gun backward and forward. -- Draught horse, a horse employed in drawing loads, plowing, etc., as distinguished from a saddle horse or carriage horse. -- Draught net, a seine or hauling net. -- Draught ox, an ox employed in hauling loads, plowing, etc. -- Draught tube (Water Wheels), an airtight pipe extending downward into the tailrace from a turbine wheel located above it, to make whole fall available; -- called also draught box.\n\n1. To draw out; to call forth. See Draft. Addison. 2. To diminish or exhaust by drawing. [R.] The Parliament so often draughted and drained. Sir W. Scott. 3. To draw in outline; to make a draught, sketch, or plan of, as in architectural and mechanical drawing. Draughting room, a room draughtsmen to work in, and where plans are kept."}