{"word":"draw","definition":"1. To cause to move continuously by force applied in advance of the thing moved; to pull along; to haul; to drag; to cause to follow. He cast him down to ground, and all along Drew him through dirt and mire without remorse. Spenser. He hastened to draw the stranger into a private room. Sir W. Scott. Do not rich men oppress you, and draw you before the judgment seats James ii. 6. The arrow is now drawn to the head. Atterbury. 2. To influence to move or tend toward one's self; to exercise an attracting force upon; to call towards itself; to attract; hence, to entice; to allure; to induce. The poet Did feign that Orpheus drew trees, stones, and floods. Shak. All eyes you draw, and with the eyes the heart. Dryden. 3. To cause to come out for one's use or benefit; to extract; to educe; to bring forth; as: (a) To bring or take out, or to let out, from some receptacle, as a stick or post from a hole, water from a cask or well, etc. The drew out the staves of the ark. 2 Chron. v. 9. Draw thee waters for the siege. Nahum iii. 14. I opened the tumor by the point of a lancet without drawing one drop of blood. Wiseman. (b) To pull from a sheath, as a sword. I will draw my sword, my hand shall destroy them. Ex. xv. 9. (c) To extract; to force out; to elicit; to derive. Spirits, by distillations, may be drawn out of vegetable juices, which shall flame and fume of themselves. Cheyne. Until you had drawn oaths from him. Shak. (d) To obtain from some cause or origin; to infer from evidence or reasons; to deduce from premises; to derive. We do not draw the moral lessons we might from history. Burke. (e) To take or procure from a place of deposit; to call for and receive from a fund, or the like; as, to draw money from a bank. (f) To take from a box or wheel, as a lottery ticket; to receive from a lottery by the drawing out of the numbers for prizes or blanks; hence, to obtain by good fortune; to win; to gain; as, he drew a prize. (g) To select by the drawing of lots. Provided magistracies were filled by men freely chosen or drawn. Freeman. 4. To remove the contents of; as: (a) To drain by emptying; to suck dry. Sucking and drawing the breast dischargeth the milk as fast as it can generated. Wiseman. (b) To extract the bowels of; to eviscerate; as, to draw a fowl; to hang, draw, and quarter a criminal. In private draw your poultry, clean your tripe. King. 5. To take into the lungs; to inhale; to inspire; hence, also, to utter or produce by an inhalation; to heave. \"Where I first drew air.\" Milton. Drew, or seemed to draw, a dying groan. Dryden. 6. To extend in length; to lengthen; to protract; to stretch; to extend, as a mass of metal into wire. How long her face is drawn! Shak. And the huge Offa's dike which he drew from the mouth of Wye to that of Dee. J. R. Green. 7. To run, extend, or produce, as a line on any surface; hence, also, to form by marking; to make by an instrument of delineation; to produce, as a sketch, figure, or picture. 8. To represent by lines drawn; to form a sketch or a picture of; to represent by a picture; to delineate; hence, to represent by words; to depict; to describe. A flattering painter who made it his care To draw men as they ought to be, not as they are. Goldsmith. Can I, untouched, the fair one's passions move, Or thou draw beauty and not feel its power Prior. 9. To write in due form; to prepare a draught of; as, to draw a memorial, a deed, or bill of exchange. Clerk, draw a deed of gift. Shak. 10. To require (so great a depth, as of water) for floating; -- said of a vessel; to sink so deep in (water); as, a ship draws ten feet of water. 11. To withdraw. [Obs.] Chaucer. Go wash thy face, and draw the action. Shak. 12. To trace by scent; to track; -- a hunting term. Note: Draw, in most of its uses, retains some shade of its original sense, to pull, to move forward by the application of force in advance, or to extend in length, and usually expresses an action as gradual or continuous, and leisurely. We pour liquid quickly, but we draw it in a continued stream. We force compliance by threats, but we draw it by gradual prevalence. We may write a letter with haste, but we draw a bill with slow caution and regard to a precise form. We draw a bar of metal by continued beating. To draw a bow, to bend the bow by drawing the string for discharging the arrow. -- To draw a cover, to clear a cover of the game it contains. -- To draw a curtain, to cause a curtain to slide or move, either closing or unclosing. \"Night draws the curtain, which the sun withdraws.\" Herbert. -- To draw a line, to fix a limit or boundary. -- To draw back, to receive back, as duties on goods for exportation. -- To draw breath, to breathe. Shak. -- To draw cuts or lots. See under Cut, n. -- To draw in. (a) To bring or pull in; to collect. (b) To entice; to inveigle. -- To draw interest, to produce or gain interest. -- To draw off, to withdraw; to abstract. Addison. -- To draw on, to bring on; to occasion; to cause. \"War which either his negligence drew on, or his practices procured.\" Hayward. -- To draw (one) out, to elicit cunningly the thoughts and feelings of another. -- To draw out, to stretch or extend; to protract; to spread out. -- \"Wilt thou draw out thine anger to all generations\" Ps. lxxxv. 5. \"Linked sweetness long drawn out.\" Milton. -- To draw over, to cause to come over, to induce to leave one part or side for the opposite one. -- To draw the longbow, to exaggerate; to tell preposterous tales. -- To draw (one) to or on to (something), to move, to incite, to induce. \"How many actions most ridiculous hast thou been drawn to by thy fantasy\" Shak. -- To draw up. (a) To compose in due form; to draught; to form in writing. (b) To arrange in order, as a body of troops; to array. \"Drawn up in battle to receive the charge.\" Dryden. Syn. -- To Draw, Drag. Draw differs from drag in this, that drag implies a natural inaptitude for drawing, or positive resistance; it is applied to things pulled or hauled along the ground, or moved with toil or difficulty. Draw is applied to all bodies moved by force in advance, whatever may be the degree of force; it commonly implies that some kind of aptitude or provision exists for drawing. Draw is the more general or generic term, and drag the more specific. We say, the horses draw a coach or wagon, but they drag it through mire; yet draw is properly used in both cases.\n\n1. To pull; to exert strength in drawing anything; to have force to move anything by pulling; as, a horse draws well; the sails of a ship draw well. Note: A sail is said to draw when it is filled with wind. 2. To draw a liquid from some receptacle, as water from a well. The woman saith unto him, Sir, thou hast nothing to draw with, and the well is deep. John iv. 11. 3. To exert an attractive force; to act as an inducement or enticement. Keep a watch upon the particular bias of their minds, that it may not draw too much. Addison. 4. (Med.)  To have efficiency as an epispastic; to act as a sinapism; -- said of a blister, poultice, etc. 5. To have draught, as a chimney, flue, or the like; to furnish transmission to smoke, gases, etc. 6. To unsheathe a weapon, especially a sword. So soon as ever thou seest him, draw; and as thou drawest, swear horrible. Shak. 7. To perform the act, or practice the art, of delineation; to sketch; to form figures or pictures. \"Skill in drawing.\" Locke. 8. To become contracted; to shrink. \"To draw into less room.\" Bacon. 9. To move; to come or go; literally, to draw one's self; -- with prepositions and adverbs; as, to draw away, to move off, esp. in racing, to get in front; to obtain the lead or increase it; to draw back, to retreat; to draw level, to move up even (with another); to come up to or overtake another; to draw off, to retire or retreat; to draw on, to advance; to draw up, to form in array; to draw near, nigh, or towards, to approach; to draw together, to come together, to collect. 10. To make a draft or written demand for payment of money deposited or due; -- usually with on or upon. You may draw on me for the expenses of your journey. Jay. 11. To admit the action of pulling or dragging; to undergo draught; as, a carriage draws easily. 12. To sink in water; to require a depth for floating. \"Greater hulks draw deep.\" Shak. To draw to a head. (a) (Med.) To begin to suppurate; to ripen, as a boil. (b) Fig.: To ripen, to approach the time for action; as, the plot draws to a head.\n\n1. The act of drawing; draught. 2. A lot or chance to be drawn. 3. A drawn game or battle, etc. [Colloq.] 4. That part of a bridge which may be raised, swung round, or drawn aside; the movable part of a drawbridge. See the Note under Drawbridge. [U.S.]"}