{"word":"drill","definition":"1. To pierce or bore with a drill, or a with a drill; to perforate; as, to drill a hole into a rock; to drill a piece of metal. 2. To train in the military art; to exercise diligently, as soldiers, in military evolutions and exercises; hence, to instruct thoroughly in the rudiments of any art or branch of knowledge; to discipline. He [Frederic the Great] drilled his people, as he drilled his grenadiers. Macaulay.\n\nTo practice an exercise or exercises; to train one's self.\n\n1. An instrument with an edged or pointed end used for making holes in hard substances; strictly, a tool that cuts with its end, by revolving, as in drilling metals, or by a succession of blows, as in drilling stone; also, a drill press. 2. (Mil.)  The act or exercise of training soldiers in the military art, as in the manual of arms, in the execution of evolutions, and the like; hence, diligent and strict instruction and exercise in the rudiments and methods of any business; a kind or method of military exercises; as, infantry drill; battalion drill; artillery drill. 3. Any exercise, physical or mental, enforced with regularity and by constant repetition; as, a severe drill in Latin grammar. 4. (Zoöl.)  A marine gastropod, of several species, which kills oysters and other bivalves by drilling holes through the shell. The most destructive kind is Urosalpinx cinerea. Bow drill, Breast drill. See under Bow, Breast. -- Cotter drill, or Traverse drill, a machine tool for drilling slots. -- Diamond drill. See under Diamond. -- Drill jig. See under Jig. -- Drill pin, the pin in a lock which enters the hollow stem of the key. -- Drill sergeant (Mil.), a noncommissioned officer whose office it is to instruct soldiers as to their duties, and to train them to military exercises and evolutions. -- Vertical drill, a drill press.\n\n1. To cause to flow in drills or rills or by trickling; to drain by trickling; as, waters drilled through a sandy stratum. [R.] Thomson. 2. To sow, as seeds, by dribbling them along a furrow or in a row, like a trickling rill of water. 3. To entice; to allure from step; to decoy; -- with on. [Obs.] See drilled him on to five-fifty. Addison. 4. To cause to slip or waste away by degrees. [Obs.] This accident hath drilled away the whole summer. Swift.\n\n1. To trickle. [Obs. or R.] Sandys. 2. To sow in drills.\n\n1. A small trickling stream; a rill. [Obs.] Springs through the pleasant meadows pour their drills. Sandys. 2. (Agr.) (a) An implement for making holes for sowing seed, and sometimes so formed as to contain seeds and drop them into the hole made. (b) A light furrow or channel made to put seed into sowing. (c) A row of seed sown in a furrow. Note: Drill is used adjectively, or as the first part of a compound; as, drill barrow or drill-barrow; drill husbandry; drill plow or drill-plow. Drill barrow, a wheeled implement for planting seed in drills. -- Drill bow, a small bow used for the purpose of rapidly turning a drill around which the bowstring takes a turn. -- Drill harrow, a harrow used for stirring the ground between rows, or drills. -- Drill plow, or Drill plough, a sort plow for sowing grain in drills.\n\nA large African baboon (Cynocephalus leucophæus).\n\nSame as Drilling. Imperial drill, a linen fabric having two threads in the warp and three in the filling."}