{"word":"drink","definition":"1. To swallow anything liquid, for quenching thirst or other purpose; to imbibe; to receive or partake of, as if in satisfaction of thirst; as, to drink from a spring. Gird thyself, and serve me, till have eaten and drunken; and afterward thou shalt eat and drink. Luke xvii. 8. He shall drink of the wrath the Almighty. Job xxi. 20. Drink of the cup that can not cloy. Keble. 2. To quaff exhilarating or intoxicating liquors, in merriment or feasting; to carouse; to revel; hence, to lake alcoholic liquors to excess; to be intemperate in the Pope. And they drank, and were merry with him. Gem. xliii. 34. Bolingbroke always spoke freely when he had drunk freely. Thackeray. To drink to, to salute in drinking; to wish well to, in the act of taking the cup; to pledge in drinking. I drink to the general joy of the whole table, And to our dear friend Banquo. Shak.\n\n1. To swallow (a liquid); to receive, as a fluid, into the stomach; to imbibe; as, to drink milk or water. There lies she with the blessed gods in bliss, There drinks the nectar with ambrosia mixed. Spenser. The bowl of punch which was brewed and drunk in Mrs. Betty's room. Thackeray. 2. To take in (a liquid), in any manner; to suck up; to absorb; to imbibe. And let the purple violets drink the stream. Dryden. 3. To take in; to receive within one, through the senses; to inhale; to hear; to see. To drink the cooler air, Tennyson. My ears have not yet drunk a hundred words Of that tongue's utterance. Shak. Let me . . . drink delicious poison from thy eye. Pope. 4. To smoke, as tobacco. [Obs.] And some men now live ninety years and past, Who never drank to tobacco first nor last. Taylor (1630. ) To drink down, to act on by drinking; to reduce or subdue; as, to drink down unkindness. Shak. -- To drink in, to take into one's self by drinking, or as by drinking; to receive and appropriate as in satisfaction of thirst. \"Song was the form of literature which he [Burns] had drunk in from his cradle.\" J. C. Shairp. -- To drink off or up, to drink the whole at a draught; as, to drink off a cup of cordial. -- To drink the health of, or To drink to the health of, to drink while expressing good wishes for the health or welfare of.\n\n1. Liquid to be swallowed; any fluid to be taken into the stomach for quenching thirst or for other purposes, as water, coffee, or decoctions. Give me some drink, Titinius. Shak. 2. Specifically, intoxicating liquor; as, when drink is on, wit is out. Drink money, or Drink penny, an allowance, or perquisite, given to buy drink; a gratuity. -- Drink offering (Script.), an offering of wine, etc., in the Jewish religious service. -- In drink, drunk. \"The poor monster's in drink.\" Shak. -- Strong drink, intoxicating liquor; esp., liquor containing a large proportion of alcohol. \" Wine is a mocker, strong drink is raging.\" Prov. xx. 1."}