{"word":"drive","definition":"1. To impel or urge onward by force in a direction away from one, or along before one; to push forward; to compel to move on; to communicate motion to; as, to drive cattle; to drive a nail; smoke drives persons from a room. A storm came on and drove them into Pylos. Jowett (Thucyd. ). Shield pressed on shield, and man drove man along. Pope. Go drive the deer and drag the finny prey. Pope. 2. To urge on and direct the motions of, as the beasts which draw a vehicle, or the vehicle borne by them; hence, also, to take in a carriage; to convey in a vehicle drawn by beasts; as, to drive a pair of horses or a stage; to drive a person to his own door. How . . . proud he was to drive such a brother! Thackeray. 3. To urge, impel, or hurry forward; to force; to constrain; to urge, press, or bring to a point or state; as, to drive person by necessity, by persuasion, by force of circumstances, by argument, and the like. \" Enough to drive one mad.\" Tennyson. He, driven to dismount, threatened, if I did not do the like, to do as much for my horse as fortune had done for his. Sir P. Sidney. 4. To carry or; to keep in motion; to conduct; to prosecute. [Now used only colloquially.] Bacon. The trade of life can not be driven without partners. Collier. 5. To clear, by forcing away what is contained. To drive the country, force the swains away. Dryden. 6. (Mining)  To dig Horizontally; to cut a horizontal gallery or tunnel. Tomlinson. 7. To pass away; -- said of time. [Obs.] Chaucer. Note: Drive, in all its senses, implies forcible or violent action. It is the reverse of to lead. To drive a body is to move it by applying a force behind; to lead is to cause to move by applying the force before, or in front. It takes a variety of meanings, according to the objects by which it is followed; as, to drive an engine, to direct and regulate its motions; to drive logs, to keep them in the current of a river and direct them in their course; to drive feathers or down, to place them in a machine, which, by a current of air, drives off the lightest to one end, and collects them by themselves. \"My thrice-driven bed of down.\" Shak.\n\n1. To rush and press with violence; to move furiously. Fierce Boreas drove against his flying sails. Dryden. Under cover of the night and a driving tempest. Prescott. Time driveth onward fast, And in a little while our lips are dumb. Tennyson. 2. To be forced along; to be impelled; to be moved by any physical force or agent; to be driven. The hull drives on, though mast and sail be torn. Byron. The chaise drives to Mr. Draper's chambers. Thackeray. 3. To go by carriage; to pass in a carriage; to proceed by directing or urging on a vehicle or the animals that draw it; as, the coachman drove to my door. 4. To press forward; to aim, or tend, to a point; to make an effort; to strive; -- usually with at. Let them therefore declare what carnal or secular interest he drove at. South. 5. To distrain for rent. [Obs.] To let drive, to aim a blow; to strike with force; to attack. \"Four rogues in buckram let drive at me.\" Shak.\n\nDriven. [Obs.] Chaucer.\n\n1. The act of driving; a trip or an excursion in a carriage, as for exercise or pleasure; -- distinguished from a ride taken on horseback. 2. A place suitable or agreeable for driving; a road prepared for driving. 3. Violent or rapid motion; a rushing onward or away; esp., a forced or hurried dispatch of business. The Murdstonian drive in business. M. Arnold. 4. In type founding and forging, an impression or matrix, formed by a punch drift. 5. A collection of objects that are driven; a mass of logs to be floated down a river. [Colloq.] Syn. -- See Ride."}