{"word":"drop","definition":"1. The quantity of fluid which falls in one small spherical mass; a liquid globule; a minim; hence, also, the smallest easily measured portion of a fluid; a small quantity; as, a drop of water. With minute drops from off the eaves. Milton. As dear to me as are the ruddy drops That visit my sad heart. Shak. That drop of peace divine. Keble. 2. That which resembles, or that which hangs like, a liquid drop; as a hanging diamond ornament, an earring, a glass pendant on a chandelier, a sugarplum (sometimes medicated), or a kind of shot or slug. 3. (Arch.) (a) Same as Gutta. (b) Any small pendent ornament. 4. Whatever is arranged to drop, hang, or fall from an elevated position; also, a contrivance for lowering something; as: (a) A door or platform opening downward; a trap door; that part of the gallows on which a culprit stands when he is to be hanged; hence, the gallows itself. (b) A machine for lowering heavy weights, as packages, coal wagons, etc., to a ship's deck. (c) A contrivance for temporarily lowering a gas jet. (d) A curtain which drops or falls in front of the stage of a theater, etc. (e) A drop press or drop hammer. (f) (Mach.) The distance of the axis of a shaft below the base of a hanger. 5. pl.  Any medicine the dose of which is measured by drops; as, lavender drops. 6. (Naut.)  The depth of a square sail; -- generally applied to the courses only. Ham. Nav. Encyc. 7. Act of dropping; sudden fall or descent. Ague drop, Black drop. See under Ague, Black. -- Drop by drop, in small successive quantities; in repeated portions. \"Made to taste drop by drop more than the bitterness of death.\" Burke. -- Drop curtain. See Drop, n., 4. (d). -- Drop forging. (Mech.) (a) A forging made in dies by a drop hammer. (b) The process of making drop forgings. -- Drop hammer (Mech.), a hammer for forging, striking up metal, etc., the weight being raised by a strap or similar device, and then released to drop on the metal resting on an anvil or die. -- Drop kick (Football), a kick given to the ball as it rebounds after having been dropped from the hands. -- Drop lake, a pigment obtained from Brazil wood. Mollett. -- Drop letter, a letter to be delivered from the same office where posted. -- Drop press (Mech.), a drop hammer; sometimes, a dead-stroke hammer; -- also called drop. -- Drop scene, a drop curtain on which a scene is painted. See Drop, n., 4. (d). -- Drop seed. (Bot.) See the List under Glass. -- Drop serene. (Med.) See Amaurosis.\n\n1. To pour or let fall in drops; to pour in small globules; to distill. \"The trees drop balsam.\" Creech. The recording angel, as he wrote it down, dropped a tear upon the word and blotted it out forever. Sterne. 2. To cause to fall in one portion, or by one motion, like a drop; to let fall; as, to drop a line in fishing; to drop a courtesy. 3. To let go; to dismiss; to set aside; to have done with; to discontinue; to forsake; to give up; to omit. They suddenly drop't the pursuit. S. Sharp. That astonishing ease with which fine ladies drop you and pick you up again. Thackeray. The connection had been dropped many years. Sir W. Scott. Dropping the too rough H in Hell and Heaven. Tennyson. 4. To bestow or communicate by a suggestion; to let fall in an indirect, cautious, or gentle manner; as, to drop hint, a word of counsel, etc. 5. To lower, as a curtain, or the muzzle of a gun, etc. 6. To send, as a letter; as, please drop me a line, a letter, word. 7. To give birth to; as, to drop a lamb. 8. To cover with drops; to variegate; to bedrop. Show to the sun their waved coats dropped with gold. Milton. To drop a vessel (Naut.), to leave it astern in a race or a chase; to outsail it.\n\n1. To fall in drops. The kindly dew drops from the higher tree, And wets the little plants that lowly dwell. Spenser. 2. To fall, in general, literally or figuratively; as, ripe fruit drops from a tree; wise words drop from the lips. Mutilations of which the meaning has dropped out of memory. H. Spencer. When the sound of dropping nuts is heard. Bryant. 3. To let drops fall; to discharge itself in drops. The heavens . . . dropped at the presence of God. Ps. lxviii. 8. 4. To fall dead, or to fall in death. Nothing, says Seneca, so soon reconciles us to the thoughts of our own death, as the prospect of one friend after another dropping round us. Digby. 5. To come to an end; to cease; to pass out of mind; as, the affair dropped. Pope. 6. To come unexpectedly; -- with in or into; as, my old friend dropped in a moment. Steele. Takes care to drop in when he thinks you are just seated. Spectator. 7. To fall or be depressed; to lower; as, the point of the spear dropped a little. 8. To fall short of a mark. [R.] Often it drops or overshoots by the disproportion of distance. Collier. 9. To be deep in extent; to descend perpendicularly; as, her main topsail drops seventeen yards. To drop astern (Naut.), to go astern of another vessel; to be left behind; to slacken the speed of a vessel so as to fall behind and to let another pass a head. -- To drop down (Naut.), to sail, row, or move down a river, or toward the sea. -- To drop off, to fall asleep gently; also, to die. [Colloq.]"}