{"word":"dry","definition":"1. Free from moisture; having little humidity or none; arid; not wet or moist; deficient in the natural or normal supply of moisture, as rain or fluid of any kind; -- said especially: (a) Of the weather: Free from rain or mist. The weather, we agreed, was too dry for the season. Addison. (b) Of vegetable matter: Free from juices or sap; not succulent; not green; as, dry wood or hay. (c) Of animals: Not giving milk; as, the cow is dry. (d) Of persons: Thirsty; needing drink. Give the dry fool drink. Shak (e) Of the eyes: Not shedding tears. Not a dry eye was to be seen in the assembly. Prescott. (f) (Med.)  Of certain morbid conditions, in which there is entire or comparative absence of moisture; as, dry gangrene; dry catarrh. 2. Destitute of that which interests or amuses; barren; unembellished; jejune; plain. These epistles will become less dry, more susceptible of ornament. Pope. 3. Characterized by a quality somewhat severe, grave, or hard; hence, sharp; keen; shrewd; quaint; as, a dry tone or manner; dry wit. He was rather a dry, shrewd kind of body. W. Irving. 4. (Fine Arts)  Exhibiting a sharp, frigid preciseness of execution, or the want of a delicate contour in form, and of easy transition in coloring. Dry area (Arch.), a small open space reserved outside the foundation of a building to guard it from damp. -- Dry blow. (a) (Med.) A blow which inflicts no wound, and causes no effusion of blood. (b) A quick, sharp blow. -- Dry bone (Min.), Smithsonite, or carbonate of zinc; -- a miner's term. -- Dry castor (Zoöl.) a kind of beaver; -- called also parchment beaver. -- Dry cupping. (Med.) See under Cupping. -- Dry dock. See under Dock. -- Dry fat. See Dry vat (below). -- Dry light, pure unobstructed light; hence, a clear, impartial view. Bacon. The scientific man must keep his feelings under stern control, lest they obtrude into his researches, and color the dry light in which alone science desires to see its objects. J. C. Shairp. -- Dry masonry. See Masonry. -- Dry measure, a system of measures of volume for dry or coarse articles, by the bushel, peck, etc. -- Dry pile (Physics), a form of the Voltaic pile, constructed without the use of a liquid, affording a feeble current, and chiefly useful in the construction of electroscopes of great delicacy; -- called also Zamboni's , from the names of the two earliest constructors of it. -- Dry pipe (Steam Engine), a pipe which conducts dry steam from a boiler. -- Dry plate (Photog.), a glass plate having a dry coating sensitive to light, upon which photographic negatives or pictures can be made, without moistening. -- Dry-plate process, the process of photographing with dry plates. -- Dry point. (Fine Arts) (a) An engraving made with the needle instead of the burin, in which the work is done nearly as in etching, but is finished without the use acid. (b) A print from such an engraving, usually upon paper. (c) Hence: The needle with which such an engraving is made. -- Dry rent (Eng. Law), a rent reserved by deed, without a clause of distress. Bouvier. -- Dry rot, a decay of timber, reducing its fibers to the condition of a dry powdery dust, often accompanied by the presence of a peculiar fungus (Merulius lacrymans), which is sometimes considered the cause of the decay; but it is more probable that the real cause is the decomposition of the wood itself. D. C. Eaton. Called also sap rot, and, in the United States, powder post. Hebert. -- Dry stove, a hothouse adapted to preserving the plants of arid climates. Brande & C. -- Dry vat, a vat, basket, or other receptacle for dry articles. -- Dry wine, that in which the saccharine matter and fermentation were so exactly balanced, that they have wholly neutralized each other, and no sweetness is perceptible; -- opposed to sweet wine, in which the saccharine matter is in excess.\n\nTo make dry; to free from water, or from moisture of any kind, and by any means; to exsiccate; as, to dry the eyes; to dry one's tears; the wind dries the earth; to dry a wet cloth; to dry hay. To dry up. (a) To scorch or parch with thirst; to deprive utterly of water; to consume. Their honorable men are famished, and their multitude dried up with thirst. Is. v. 13. The water of the sea, which formerly covered it, was in time exhaled and dried up by the sun. Woodward. (b) To make to cease, as a stream of talk. Their sources of revenue were dried up. Jowett (Thucyd. ) -- To dry, or dry up, a cow, to cause a cow to cease secreting milk. Tylor.\n\n1. To grow dry; to become free from wetness, moisture, or juice; as, the road dries rapidly. 2. To evaporate wholly; to be exhaled; -- said of moisture, or a liquid; -- sometimes with up; as, the stream dries, or dries up. 3. To shrivel or wither; to lose vitality. And his hand, which he put forth against him, dried up, so that he could not pull it in again to him. I Kings xiii. 4."}