{"word":"dull","definition":"1. Slow of understanding; wanting readiness of apprehension; stupid; doltish; blockish. \"Dull at classical learning.\" Thackeray. She is not bred so dull but she can learn. Shak. 2. Slow in action; sluggish; unready; awkward. This people's heart is waxed gross, and their ears are dull of hearing. Matt. xiii. 15. O, help my weak wit and sharpen my dull tongue. Spenser. 3. Insensible; unfeeling. Think me not So dull a devil to forget the loss Of such a matchless wife. Beau. & Fl. 4. Not keen in edge or point; lacking sharpness; blunt. \"Thy scythe is dull.\" Herbert. 5. Not bright or clear to the eye; wanting in liveliness of color or luster; not vivid; obscure; dim; as, a dull fire or lamp; a dull red or yellow; a dull mirror. 6. Heavy; gross; cloggy; insensible; spiritless; lifeless; inert. \"The dull earth.\" Shak. As turning the logs will make a dull fire burn, so changes of study a dull brain. Longfellow. 7. Furnishing little delight, spirit, or variety; uninteresting; tedious; cheerless; gloomy; melancholy; depressing; as, a dull story or sermon; a dull occupation or period; hence, cloudy; overcast; as, a dull day. Along life's dullest, dreariest walk. Keble. Syn. -- Lifeless; inanimate; dead; stupid; doltish; heavy; sluggish; sleepy; drowsy; gross; cheerless; tedious; irksome; dismal; dreary; clouded; tarnished; obtuse. See Lifeless.\n\n1. To deprive of sharpness of edge or point. \"This . . . dulled their swords.\" Bacon. Borrowing dulls the edge of husbandry. Shak. 2. To make dull, stupid, or sluggish; to stupefy, as the senses, the feelings, the perceptions, and the like. Those [drugs] she has Will stupefy and dull the sense a while. Shak. Use and custom have so dulled our eyes. Trench. 3. To render dim or obscure; to sully; to tarnish. \"Dulls the mirror.\" Bacon. 4. To deprive of liveliness or activity; to render heavy; to make inert; to depress; to weary; to sadden. Attention of mind . . . wasted or dulled through continuance. Hooker.\n\nTo become dull or stupid. Rom. of R."}