{"word":"earth","definition":"1. The globe or planet which we inhabit; the world, in distinction from the sun, moon, or stars. Also, this world as the dwelling place of mortals, in distinction from the dwelling place of spirits. That law preserves the earth a sphere And guides the planets in their course. S. Rogers. In heaven, or earth, or under earth, in hell. Milton. 2. The solid materials which make up the globe, in distinction from the air or water; the dry land. God called the dry land earth. Gen. i. 10. He is pure air and fire, and the dull elements of earth and water never appear in him. Shak. 3. The softer inorganic matter composing part of the surface of the globe, in distinction from the firm rock; soil of all kinds, including gravel, clay, loam, and the like; sometimes, soil favorable to the growth of plants; the visible surface of the globe; the ground; as, loose earth; rich earth. Give him a little earth for charity. Shak. 4. A part of this globe; a region; a country; land. Would I had never trod this English earth. Shak. 5. Worldly things, as opposed to spiritual things; the pursuits, interests, and allurements of this life. Our weary souls by earth beguiled. Keble. 6. The people on the globe. The whole earth was of one language. Gen. xi. 1. 7. (Chem.) (a) Any earthy-looking metallic oxide, as alumina, glucina, zirconia, yttria, and thoria. (b) A similar oxide, having a slight alkaline reaction, as lime, magnesia, strontia, baryta. 8. A hole in the ground, where an animal hides himself; as, the earth of a fox. Macaulay. They [ferrets] course the poor conies out of their earths. Holland. Note: Earth is used either adjectively or in combination to form compound words; as, earth apple or earth-apple; earth metal or earth- metal; earth closet or earth-closet. Adamic earth, Bitter earth, Bog earth, Chian earth, etc. See under Adamic, Bitter, etc. -- Alkaline earths. See under Alkaline. -- Earth apple. (Bot.) (a) A potato. (b) A cucumber. -- Earth auger, a form of auger for boring into the ground; -- called also earth borer. -- Earth bath, a bath taken by immersing the naked body in earth for healing purposes. -- Earth battery (Physics), a voltaic battery the elements of which are buried in the earth to be acted on by its moisture. -- Earth chestnut, the pignut. -- Earth closet, a privy or commode provided with dry earth or a similar substance for covering and deodorizing the fæcal discharges. -- Earth dog (Zoöl.), a dog that will dig in the earth, or enter holes of foxes, etc. -- Earth hog, Earth pig (Zoöl.), the aard-vark. -- Earth hunger, an intense desire to own land, or, in the case of nations, to extend their domain. -- Earth light (Astron.), the light reflected by the earth, as upon the moon, and corresponding to moonlight; -- called also earth shine. Sir J. Herschel. -- Earth metal. See 1st Earth, 7. (Chem.) -- Earth oil, petroleum. -- Earth pillars or pyramids (Geol.), high pillars or pyramids of earth, sometimes capped with a single stone, found in Switzerland. Lyell. -- Earth pitch (Min.), mineral tar, a kind of asphaltum. -- Earth quadrant, a fourth of the earth's circumference. -- Earth table (Arch.), the lowest course of stones visible in a building; the ground table. -- On earth, an intensive expression, oftenest used in questions and exclamations; as, What on earth shall I do Nothing on earth will satisfy him. [Colloq.]\n\n1. To hide, or cause to hide, in the earth; to chase into a burrow or den. \"The fox is earthed.\" Dryden. 2. To cover with earth or mold; to inter; to bury; -- sometimes with up. The miser earths his treasure, and the thief, Watching the mole, half beggars him ere noon. Young. Why this in earthing up a carcass R. Blair.\n\nTo burrow. Tickell.\n\nA plowing. [Obs.] Such land as ye break up for barley to sow, Two earths at the least, ere ye sow it, bestow. Tusser."}