{"word":"ease","definition":"1. Satisfaction; pleasure; hence, accommodation; entertainment. [Obs.] They him besought Of harbor and or ease as for hire penny. Chaucer. 2. Freedom from anything that pains or troubles; as: (a) Relief from labor or effort; rest; quiet; relaxation; as, ease of body. Usefulness comes by labor, wit by ease. Herbert. Give yourself ease from the fatigue of watching. Swift. (b) Freedom from care, solicitude, or anything that annoys or disquiets; tranquillity; peace; comfort; security; as, ease of mind. Among these nations shalt thou find no ease. Deut. xxviii. 65. Take thine ease, eat, drink, and be merry. Luke xii. 19. (c) Freedom from constraint, formality, difficulty, embarrassment, etc.; facility; liberty; naturalness; -- said of manner, style, etc.; as, ease of style, of behavior, of address. True ease in writing comes from art, not chance. Pope. Whate'er he did was done with so much ease, In him alone 't was natural to please. Dryden. At ease, free from pain, trouble, or anxiety. \"His soul shall dwell at ease.\" Ps. xxv. 12. -- Chapel of ease. See under Chapel. -- Ill at ease, not at ease, disquieted; suffering; anxious. -- To stand at ease (Mil.), to stand in a comfortable attitude in one's place in the ranks. -- With ease, easily; without much effort. Syn. -- Rest; quiet; repose; comfortableness; tranquility; facility; easiness; readiness.\n\n1. To free from anything that pains, disquiets, or oppresses; to relieve from toil or care; to give rest, repose, or tranquility to; - - often with of; as, to ease of pain; ease the body or mind. Eased [from] the putting off These troublesome disguises which we wear. Milton. Sing, and I 'll ease thy shoulders of thy load. Dryden. 2. To render less painful or oppressive; to mitigate; to alleviate. My couch shall ease my complaint. Job vii. 13. 3. To release from pressure or restraint; to move gently; to lift slightly; to shift a little; as, to ease a bar or nut in machinery. 4. To entertain; to furnish with accommodations. [Obs.] Chaucer. To ease off, To ease away (Naut.), to slacken a rope gradually. -- To ease a ship (Naut.), to put the helm hard, or regulate the sail, to prevent pitching when closehauled. -- To ease the helm (Naut.), to put the helm more nearly amidships, to lessen the effect on the ship, or the strain on the wheel rope. Ham. Nav. Encyc. Syn. -- To relieve; disburden; quiet; calm; tranquilize; assuage; alleviate; allay; mitigate; appease; pacify."}