{"word":"economy","definition":"1. The management of domestic affairs; the regulation and government of household matters; especially as they concern expense or disbursement; as, a careful economy. Himself busy in charge of the household economies. Froude. 2. Orderly arrangement and management of the internal affairs of a state or of any establishment kept up by production and consumption; esp., such management as directly concerns wealth; as, political economy. 3. The system of rules and regulations by which anything is managed; orderly system of regulating the distribution and uses of parts, conceived as the result of wise and economical adaptation in the author, whether human or divine; as, the animal or vegetable economy; the economy of a poem; the Jewish economy. The position which they [the verb and adjective] hold in the general economy of language. Earle. In the Greek poets, as also in Plautus, we shall see the economy . . . of poems better observed than in Terence. B. Jonson. The Jews already had a Sabbath, which, as citizens and subjects of that economy, they were obliged to keep. Paley. 4. Thrifty and frugal housekeeping; management without loss or waste; frugality in expenditure; prudence and disposition to save; as, a housekeeper accustomed to economy but not to parsimony. Political economy. See under Political. Syn. -- Economy, Frugality, Parsimony. Economy avoids all waste and extravagance, and applies money to the best advantage; frugality cuts off indulgences, and proceeds on a system of saving. The latter conveys the idea of not using or spending superfluously, and is opposed to lavishness or profusion. Frugality is usually applied to matters of consumption, and commonly points to simplicity of manners; parsimony is frugality carried to an extreme, involving meanness of spirit, and a sordid mode of living. Economy is a virtue, and parsimony a vice. I have no other notion of economy than that it is the parent to liberty and ease. Swift. The father was more given to frugality, and the son to riotousness [luxuriousness]. Golding."}