{"word":"edge","definition":"1. The thin cutting side of the blade of an instrument; as, the edge of an ax, knife, sword, or scythe. Hence, figuratively, that which cuts as an edge does, or wounds deeply, etc. He which hath the sharp sword with two edges. Rev. ii. 12. Slander, Whose edge is sharper than the sword. Shak. 2. Any sharp terminating border; a margin; a brink; extreme verge; as, the edge of a table, a precipice. Upon the edge of yonder coppice. Shak. In worst extremes, and on the perilous edge Of battle. Milton. Pursue even to the very edge of destruction. Sir W. Scott. 3. Sharpness; readiness of fitness to cut; keenness; intenseness of desire. The full edge of our indignation. Sir W. Scott. Death and persecution lose all the ill that they can have, if we do not set an edge upon them by our fears and by our vices. Jer. Taylor. 4. The border or part adjacent to the line of division; the beginning or early part; as, in the edge of evening. \"On the edge of winter.\" Milton. Edge joint (Carp.), a joint formed by two edges making a corner. -- Edge mill, a crushing or grinding mill in which stones roll around on their edges, on a level circular bed; -- used for ore, and as an oil mill. Called also Chilian mill. -- Edge molding (Arch.), a molding whose section is made up of two curves meeting in an angle. -- Edge plane. (a) (Carp.) A plane for edging boards. (b) (Shoemaking) A plane for edging soles. -- Edge play, a kind of swordplay in which backswords or cutlasses are used, and the edge, rather than the point, is employed. -- Edge rail. (Railroad) (a) A rail set on edge; -- applied to a rail of more depth than width. (b) A guard rail by the side of the main rail at a switch. Knight. -- Edge railway, a railway having the rails set on edge. -- Edge stone, a curbstone. -- Edge tool. (a) Any tool instrument having a sharp edge intended for cutting. (b) A tool for forming or dressing an edge; an edging tool. -- To be on edge, to be eager, impatient, or anxious. -- To set the teeth on edge, to cause a disagreeable tingling sensation in the teeth, as by bringing acids into contact with them. Bacon.\n\n1. To furnish with an edge as a tool or weapon; to sharpen. To edge her champion's sword. Dryden. 2. To shape or dress the edge of, as with a tool. 3. To furnish with a fringe or border; as, to edge a dress; to edge a garden with box. Hills whose tops were edged with groves. Pope. 4. To make sharp or keen, figuratively; to incite; to exasperate; to goad; to urge or egg on. [Obs.] By such reasonings, the simple were blinded, and the malicious edged. Hayward. 5. To move by little and little or cautiously, as by pressing forward edgewise; as, edging their chairs forwards. Locke.\n\n1. To move sideways; to move gradually; as, edge along this way. 2. To sail close to the wind. I must edge up on a point of wind. Dryden. To edge away or off (Naut.), to increase the distance gradually from the shore, vessel, or other object. -- To edge down (Naut.), to approach by slow degrees, as when a sailing vessel approaches an object in an oblique direction from the windward. -- To edge in, to get in edgewise; to get in by degrees. -- To edge in with, as with a coast or vessel (Naut.), to advance gradually, but not directly, toward it."}