{"word":"electricity","definition":"1. A power in nature, a manifestation of energy, exhibiting itself when in disturbed equilibrium or in activity by a circuit movement, the fact of direction in which involves polarity, or opposition of properties in opposite directions; also, by attraction for many substances, by a law involving attraction between surfaces of unlike polarity, and repulsion between those of like; by exhibiting accumulated polar tension when the circuit is broken; and by producing heat, light, concussion, and often chemical changes when the circuit passes between the poles or through any imperfectly conducting substance or space. It is generally brought into action by any disturbance of molecular equilibrium, whether from a chemical, physical, or mechanical, cause. Note: Electricity is manifested under following different forms: (a) Statical electricity, called also Frictional or Common, electricity, electricity in the condition of a stationary charge, in which the disturbance is produced by friction, as of glass, amber, etc., or by induction. (b) Dynamical electricity, called also Voltaic electricity, electricity in motion, or as a current produced by chemical decomposition, as by means of a voltaic battery, or by mechanical action, as by dynamo-electric machines. (c) Thermoelectricity, in which the disturbing cause is heat (attended possibly with some chemical action). It is developed by uniting two pieces of unlike metals in a bar, and then heating the bar unequally. (d) Atmospheric electricity, any condition of electrical disturbance in the atmosphere or clouds, due to some or all of the above mentioned causes. (e) Magnetic electricity, electricity developed by the action of magnets. (f) Positive electricity, the electricity that appears at the positive pole or anode of a battery, or that is produced by friction of glass; -- called also vitreous electricity. (g) Negative electricity, the electricity that appears at the negative pole or cathode, or is produced by the friction of resinous substance; -- called also resinous electricity. (h) Organic electricity, that which is developed in organic structures, either animal or vegetable, the phrase animal electricity being much more common. 2. The science which unfolds the phenomena and laws of electricity; electrical science. 3. Fig.: Electrifying energy or characteristic."}