{"word":"emblem","definition":"1. Inlay; inlaid or mosaic work; something ornamental inserted in a surface. [Obs.] Milton. 2. A visible sign of an idea; an object, or the figure of an object, symbolizing and suggesting another object, or an idea, by natural aptness or by association; a figurative representation; a typical designation; a symbol; as, a balance is an emblem of justice; a scepter, the emblem of sovereignty or power; a circle, the emblem of eternity. \"His cicatrice, an emblem of war, here on his sinister cheek.\" Shak. 3. A picture accompanied with a motto, a set of verse, or the like, intended as a moral lesson or meditation. Note: Writers and artists of the 17th century gave much attention and study to the composition of such emblems, and many collections of them were published. Syn. -- Sign; symbol; type; device; signal; token. -- Sign, Emblem, Symbol, Type. Sign is the generic word comprehending all significant representations. An emblem is a visible object representing another by a natural suggestion of characteristic qualities, or an habitual and recognized association; as, a circle, having no apparent beginning or end, is an emblem of eternity; a particular flag is the emblem of the country or ship which has adopted it for a sign and with which it is habitually associated. Between emblem and symbol the distinction is slight, and often one may be substituted for the other without impropriety. See Symbol. Thus, a circle is either an emblem or a symbol of eternity; a scepter, either an emblem or a symbol of authority; a lamb, either an emblem or a symbol of meekness. \"An emblem is always of something simple; a symbol may be of something complex, as of a transaction . . . In consequence we do not speak of actions emblematic.\" C. J. Smith. A type is a representative example, or model, exhibiting the qualities common to all individuals of the class to which it belongs; as, the Monitor is a type of a class of war vessels.\n\nTo represent by an emblem; to symbolize. [R.] Emblemed by the cozening fig tree. Feltham."}