{"word":"end","definition":"1. The extreme or last point or part of any material thing considered lengthwise (the extremity of breadth being side); hence, extremity, in general; the concluding part; termination; close; limit; as, the end of a field, line, pole, road; the end of a year, of a discourse; put an end to pain; -- opposed to Ant: beginning, when used of anything having a first part. Better is the end of a thing than the beginning thereof. Eccl. vii. 8. 2. Point beyond which no procession can be made; conclusion; issue; result, whether successful or otherwise; conclusive event; consequence. My guilt be on my head, and there an end. Shak. O that a man might know The end of this day's business ere it come! Shak. 3. Termination of being; death; destruction; extermination; also, cause of death or destruction. Unblamed through life, lamented in thy end. Pope. Confound your hidden falsehood, and award Either of you to be the other's end. Shak. I shall see an end of him. Shak. 4. The object aimed at in any effort considered as the close and effect of exertion; ppurpose; intention; aim; as, to labor for private or public ends. Losing her, the end of living lose. Dryden. When every man is his own end, all things will come to a bad end. Coleridge. 5. That which is left; a remnant; a fragment; a scrap; as, odds and ends. I clothe my naked villainy With old odd ends stolen out of holy writ, And seem a saint, when most I play the devil. Shak. 6. (Carpet Manuf.)  One of the yarns of the worsted warp in a Brussels carpet. An end. (a) On end; upright; erect; endways. Spenser (b) To the end; continuously. [Obs.] Richardson. -- End bulb (Anat.), one of the bulblike bodies in which some sensory nerve fibers end in certain parts of the skin and mucous membranes; -- also called end corpuscles. -- End fly, a bobfly. -- End for end, one end for the other; in reversed order. -- End man, the last man in a row; one of the two men at the extremities of a line of minstrels. -- End on (Naut.), bow foremost. -- End organ (Anat.), the structure in which a nerve fiber ends, either peripherally or centrally. -- End plate (Anat.), one of the flat expansions in which motor nerve fibers terminate on muscular fibers. -- End play (Mach.), movement endwise, or room for such movement. -- End stone (Horol.), one of the two plates of a jewel in a timepiece; the part that limits the pivot's end play. -- Ends of the earth, the remotest regions of the earth. -- In the end, finally. Shak. -- On end, upright; erect. -- To the end, in order. Bacon. -- To make both ends meet, to live within one's income. Fuller. -- To put an end to, to destroy.\n\n1. To bring to an end or conclusion; to finish; to close; to terminate; as, to end a speech. \"I shall end this strife.\" Shak. On the seventh day God ended his work. Gen. ii. 2. 2. To form or be at the end of; as, the letter k ends the word back. 3. To destroy; to put to death. \"This sword hath ended him.\" Shak. To end up, to lift or tilt, so as to set on end; as, to end up a hogshead.\n\nTo come to the ultimate point; to be finished; to come to a close; to cease; to terminate; as, a voyage ends; life ends; winter ends."}