{"word":"english","definition":"Of or pertaining to England, or to its inhabitants, or to the present so-called Anglo-Saxon race. English bond (Arch.)  See 1st Bond, n., 8. -- English breakfast tea. See Congou. -- English horn. (Mus.) See Corno Inglese. -- English walnut. (Bot.) See under Walnut.\n\n1. Collectively, the people of England; English people or persons. 2. The language of England or of the English nation, and of their descendants in America, India, and other countries. Note: The English language has been variously divided into periods by different writers. In the division most commonly recognized, the first period dates from about 450 to 1150. This is the period of full inflection, and is called Anglo-Saxon, or, by many recent writers, Old English. The second period dates from about 1150 to 1550 (or, if four periods be recognized, from about 1150 to 1350), and is called Early English, Middle English, or more commonly (as in the usage of this book), Old English. During this period most of the inflections were dropped, and there was a great addition of French words to the language. The third period extends from about 1350 to 1550, and is Middle English. During this period orthography became comparatively fixed. The last period, from about 1550, is called Modern English. 3. A kind of printing type, in size between Pica and Great Primer. See Type. Note: The type called English. 4. (Billiards)  A twist or spinning motion given to a ball in striking it that influences the direction it will take after touching a cushion or another ball. The King's, or Queen's, English. See under King.\n\n1. To translate into the English language; to Anglicize; hence, to interpret; to explain. Those gracious acts . . . may be Englished more properly, acts of fear and dissimulation. Milton. Caxton does not care to alter the French forms and words in the book which he was Englishing. T. L. K. Oliphant. 2. (Billiards)  To strike (the cue ball) in such a manner as to give it in addition to its forward motion a spinning motion, that influences its direction after impact on another ball or the cushion. [U.S.]"}