{"word":"equal","definition":"1. Agreeing in quantity, size, quality, degree, value, etc.; having the same magnitude, the same value, the same degree, etc.; -- applied to number, degree, quantity, and intensity, and to any subject which admits of them; neither inferior nor superior, greater nor less, better nor worse; corresponding; alike; as, equal quantities of land, water, etc. ; houses of equal size; persons of equal stature or talents; commodities of equal value. 2. Bearing a suitable relation; of just proportion; having competent power, abilities, or means; adequate; as, he is not equal to the task. The Scots trusted not their own numbers as equal to fight with the English. Clarendon. It is not permitted to me to make my commendations equal to your merit. Dryden. Whose voice an equal messenger Conveyed thy meaning mild. Emerson. 3. Not variable; equable; uniform; even; as, an equal movement. \"An equal temper.\" Dryden. 4. Evenly balanced; not unduly inclining to either side; characterized by fairness; unbiased; impartial; equitable; just. Are not my ways equal Ezek. xviii. 29. Thee, O Jove, no equal judge I deem. Spenser. Nor think it equal to answer deliberate reason with sudden heat and noise. Milton. 5. Of the same interest or concern; indifferent. They who are not disposed to receive them may let them alone or reject them; it is equal to me. Cheyne. 6. (Mus.)  Intended for voices of one kind only, either all male or all female; -- opposed to mixed. [R.] 7. (Math.)  Exactly agreeing with respect to quantity. Equal temperament. (Mus.) See Temperament. Syn. -- Even; equable; uniform; adequate; proportionate; commensurate; fair; just; equitable.\n\n1. One not inferior or superior to another; one having the same or a similar age, rank, station, office, talents, strength, or other quality or condition; an equal quantity or number; as, \"If equals be taken from equals the remainders are equal.\" Those who were once his equals envy and defame him. Addison. 2. State of being equal; equality. [Obs.] Spenser.\n\n1. To be or become equal to; to have the same quantity, the same value, the same degree or rank, or the like, with; to be commen On me whose all not equals Edward's moiety. Shak. 2. To make equal return to; to recompense fully. Who answered all her cares, and equaled all her love. Dryden. 3. To make equal or equal to; to equalize; hence, to compare or regard as equals; to put on equality. He would not equal the mind that he found in himself to the infinite and incomprehensible. Berkeley."}