{"word":"equivalent","definition":"1. Equal in wortir or value, force, power, effect, import, and the like; alike in significance and value; of the same import or meaning. For now to serve and to minister, servile and ministerial, are terms equivalent. South. 2. (Geom.)  Equal in measure but not admitting of superposition; -- applied to magnitudes; as, a square may be equivalent to a triangle. 3. (Geol.)  Contemporaneous in origin; as, the equivalent strata of different countries.\n\n1. Something equivalent; that which is equal in value, worth, weight, or force; as, to offer an equivalent for damage done. He owned that, if the Test Act were repealed, the Protestants were entitled to some equivalent. . . . During some weeks the word equivalent, then lately imported from France, was in the mouths of all the coffeehouse. Macaulay. 2. (Chem.)  That comparative quantity by weight of an element which possesses the same chemical value as other elements, as determined by actual experiment and reference to the same standard. Specifically: (a) The comparative proportions by which one element replaces another in any particular compound; thus, as zinc replaces hydrogen in hydrochloric acid, their equivalents are 32.5 and 1. (b) The combining proportion by weight of a substance, or the number expressing this proportion, in any particular compound; as, the equivalents of hydrogen and oxygen in water are respectively 1 and 8, and in hydric dioxide 1 and 16. Note: This term was adopted by Wollaston to avoid using the conjectural expression atomic weight, with which, however, for a time it was practically synonymous. The attempt to limit the term to the meaning of a universally comparative combining weight failed, because of the possibility of several compounds of the substances by reason of the variation in combining power which most elements exhibit. The equivalent was really identical with, or a multiple of submultiple of, the atomic weight. 3. (Chem.)  A combining unit, whether an atom, a radical, or a molecule; as, in acid salt two or more equivalents of acid unite with one or more equivalents of base. Mechanical equivalent of heat (Physics), the number of units of work which the unit of heat can perform; the mechanical energy which must be expended to raise the temperature of a unit weight of water from 0ยบ C. to 1ยบ C., or from 32ยบ F. to 33ยบ F. The term was introduced by Dr. Mayer of Heilbronn. Its value was found by Joule to be 1390 foot pounds upon the Centigrade, or 772 foot pounds upon the Fahrenheit, thermometric scale, whence it is often called Joule's equivalent, and represented by the symbol J. This is equal to 424 kilogram meters (Centigrade scale). A more recent determination by Professor Rowland gives the value 426.9 kilogram meters, for the latitude of Baltimore.\n\nTo make the equivalent to; to equal; equivalence. [R.]"}