{"word":"escape","definition":"1. To flee from and avoid; to be saved or exempt from; to shun; to obtain security from; as, to escape danger. \"Sailors that escaped the wreck.\" Shak. 2. To avoid the notice of; to pass unobserved by; to evade; as, the fact escaped our attention. They escaped the search of the enemy. Ludlow.\n\n1. To flee, and become secure from danger; -- often followed by from or out of. Haste, for thy life escape, nor look behindKeble. 2. To get clear from danger or evil of any form; to be passed without harm. Such heretics . . . would have been thought fortunate, if they escaped with life. Macaulay. 3. To get free from that which confines or holds; -- used of persons or things; as, to escape from prison, from arrest, or from slavery; gas escapes from the pipes; electricity escapes from its conductors. To escape out of these meshes. Thackeray.\n\n1. The act of fleeing from danger, of evading harm, or of avoiding notice; deliverance from injury or any evil; flight; as, an escape in battle; a narrow escape; also, the means of escape; as, a fire escape. I would hasten my escape from the windy storm. Ps. lv. 8. 2. That which escapes attention or restraint; a mistake; an oversight; also, transgression. [Obs.] I should have been more accurate, and corrected all those former escapes. Burton. 3. A sally. \"Thousand escapes of wit.\" Shak. 4. (Law)  The unlawful permission, by a jailer or other custodian, of a prisoner's departure from custody. Note: Escape is technically distinguishable from prison breach, which is the unlawful departure of the prisoner from custody, escape being the permission of the departure by the custodian, either by connivance or negligence. The term escape, however, is applied by some of the old authorities to a departure from custody by stratagem, or without force. Wharton. 5. (Arch.)  An apophyge. 6. Leakage or outflow, as of steam or a liquid. 7. (Elec.)  Leakage or loss of currents from the conducting wires, caused by defective insulation. Escape pipe (Steam Boilers), a pipe for carrying away steam that escapes through a safety valve. -- Escape valve (Steam Engine), a relief valve; a safety valve. See under Relief, and Safety. -- Escape wheel (Horol.), the wheel of an escapement."}