{"word":"estimate","definition":"1. To judge and form an opinion of the value of, from imperfect data, -- either the extrinsic (money), or intrinsic (moral), value; to fix the worth of roughly or in a general way; as, to estimate the value of goods or land; to estimate the worth or talents of a person. It is by the weight of silver, and not the name of the piece, that men estimate commodities and exchange them. Locke. It is always very difficult to estimate the age in which you are living. J. C. Shairp. 2. To from an opinion of, as to amount,, number, etc., from imperfect data, comparison, or experience; to make an estimate of; to calculate roughly; to rate; as, to estimate the cost of a trip, the number of feet in a piece of land. Syn. -- To appreciate; value; appraise; prize; rate; esteem; count; calculate; number. -- To Estimate, Esteem. Both these words imply an exercise of the judgment. Estimate has reference especially to the external relations of things, such as amount, magnitude, importance, etc. It usually involves computation or calculation; as, to estimate the loss or gain of an enterprise. Esteem has reference to the intrinsic or moral worth of a person or thing. Thus, we esteem a man for his kindness, or his uniform integrity. In this sense it implies a mingled sentiment of respect and attachment. We esteem it an honor to live in a free country. See Appreciate.\n\nA valuing or rating by the mind, without actually measuring, weighing, or the like; rough or approximate calculation; as, an estimate of the cost of a building, or of the quantity of water in a pond. Weigh success in a moral balance, and our whole estimate is changed. J. C. Shairp. Syn. -- Estimate, Estimation, Esteem. The noun estimate, like its verb, supposes chiefly an exercise of judgment in determining the amount, importance, or magnitude of things, with their other exterior relations; as, an estimate of expenses incurred; a true estimate of life, etc. Esteem is a moral sentiment made up of respect and attachment, -- the valuation of a person as possessing useful qualities or real worth. Thus we speak of the esteem of the wise and good as a thing greatly to be desired. Estimation seems to waver between the two. In our version of the Scriptures it is used simply for estimate; as, \"If he be poorer than thy estimation.\" Lev. xxvii. 8. In other cases, it verges toward esteem; as, \"I know him to be of worth and worthy estimation.\" Shak. It will probably settle down at last on this latter sense. \"Esteem is the value we place upon some degree of worth. It is higher than simple approbation, which is a decision of judgment. It is the commencement of affection.\" Gogan. No; dear as freedom is, and in my heart's Just estimation prized above all price. Cowper."}