{"word":"even","definition":"Evening. See Eve, n. 1. [Poetic.] Shak.\n\n1. Level, smooth, or equal in surface; not rough; free from irregularities; hence uniform in rate of motion of action; as, even ground; an even speed; an even course of conduct. 2. Equable; not easily ruffed or disturbed; calm; uniformly self- possessed; as, an even temper. 3. Parallel; on a level; reaching the same limit. And shall lay thee even with the ground. Luke xix. 44. 4. Balanced; adjusted; fair; equitable; impartial; just to both side; owing nothing on either side; -- said of accounts, bargains, or persons indebted; as, our accounts are even; an even bargain. To make the even truth in pleasure flow. Shak. 5. Without an irregularity, flaw, or blemish; pure. \"I know my life so even.\" Shak. 6. Associate; fellow; of the same condition. [Obs.] \"His even servant.\" Wyclif (Matt. 7. Not odd; capable of division by two without a remainder; -- said of numbers; as, 4 and 10 are even numbers. Whether the number of the stars is even or odd. Jer. Taylor. On even ground, with equal advantage. -- On even keel (Naut.), in a level or horizontal position.\n\n1. To make even or level; to level; to lay smooth. His temple Xerxes evened with the soil. Sir. W. Raleigh. It will even all inequalities Evelyn. 2. To equal [Obs.] \"To even him in valor.\" Fuller. 3. To place in an equal state, as to obligation, or in a state in which nothing is due on either side; to balance, as accounts; to make quits. Shak. 4. To set right; to complete. 5. To act up to; to keep pace with. Shak.\n\nTo be equal. [Obs.] R. Carew.\n\n1. In an equal or precisely similar manner; equally; precisely; just; likewise; as well. \"Is it even so\" Shak. Even so did these Gauls possess the coast. Spenser. 2. Up to, or down to, an unusual measure or level; so much as; fully; quite. Thou wast a soldier Even to Cato's wish. Shak. Without . . . making us even sensible of the change. Swift. 3. As might not be expected; -- serving to introduce what is unexpected or less expected. I have made several discoveries, which appear new, even to those who are versed in critical learning. Addison. 4. At the very time; in the very case. I knew they were had enough to please, even when I wrote them. Dryden. Note: Even is sometimes used to emphasize a word or phrase. \"I have debated even in my soul.\" Shak. By these presence, even the presence of Lord Mortimer. Shak."}