{"word":"event","definition":"1. That which comes, arrives, or happens; that which falls out; any incident, good or bad. \"The events of his early years.\" Macaulay. To watch quietly the course of events. Jowett (Thucyd. ) There is one event to the righteous, and to the wicked. Eccl. ix. 2. 2. An affair in hand; business; enterprise. [Obs.] \"Leave we him to his events.\" Shak. 3. The consequence of anything; the issue; conclusion; result; that in which an action, operation, or series of operations, terminates. Dark doubts between the promise and event. Young. Syn. -- Incident; occurrence; adventure; issue; result; termination; consequence; conclusion. -- Event, Occurrence, Incident, Circumstance. An event denotes that which arises from a preceding state of things. Hence we speak or watching the event; of tracing the progress of events. An occurrence has no reference to any antecedents, but simply marks that which meets us in our progress through life, as if by chance, or in the course of divine providence. The things which thus meet us, if important, are usually connected with antecedents; and hence event is the leading term. In the \"Declaration of Independence\" it is said, \"When, in the cource of human events, it becomes necessary.\" etc. Here, occurrences would be out of place. An incident is that which falls into a state of things to which is does not primarily belong; as, the incidents of a journey. The term is usually applied to things of secondary importance. A circumstance is one of the things surrounding us in our path of life. These may differ greatly in importance; but they are always outsiders, which operate upon us from without, exerting greater or less influence according to their intrinsic importance. A person giving an account of a campaign might dwell on the leading events which it produced; might mention some of its striking occurrences; might allude to some remarkable incidents which attended it; and might give the details of the favorable or adverse circumstances which marked its progress.\n\nTo break forth. [Obs.] B. Jonson."}