{"word":"evil","definition":"1. Having qualities tending to injury and mischief; having a nature or properties which tend to badness; mischievous; not good; worthless or deleterious; poor; as, an evil beast; and evil plant; an evil crop. A good tree can not bring forth evil fruit. Matt. vii. 18. 2. Having or exhibiting bad moral qualities; morally corrupt; wicked; wrong; vicious; as, evil conduct, thoughts, heart, words, and the like. Ah, what a sign it is of evil life, When death's approach is seen so terrible. Shak. 3. Producing or threatening sorrow, distress, injury, or calamity; unpropitious; calamitous; as, evil tidings; evil arrows; evil days. Because he hath brought up an evil name upon a virgin of Israel. Deut. xxii. 19. The owl shrieked at thy birth -- an evil sign. Shak. Evil news rides post, while good news baits. Milton. Evil eye, an eye which inflicts injury by some magical or fascinating influence. It is still believed by the ignorant and superstitious that some persons have the supernatural power of injuring by a look. It almost led him to believe in the evil eye. J. H. Newman. -- Evil speaking, speaking ill of others; calumny; censoriousness. -- The evil one, the Devil; Satan. Note: Evil is sometimes written as the first part of a compound (with or without a hyphen). In many cases the compounding need not be insisted on. Examples: Evil doer or evildoer, evil speakink or evil- speaking, evil worker, evil wishink, evil-hearted, evil-minded. Syn. -- Mischieveous; pernicious; injurious; hurtful; destructive; wicked; sinful; bad; corrupt; perverse; wrong; vicious; calamitious.\n\n1. Anything which impairs the happiness of a being or deprives a being of any good; anything which causes suffering of any kind to sentient beings; injury; mischief; harm; -- opposed to Ant: good. Evils which our own misdeeds have wrought. Milton. The evil that men do lives after them. Shak. 2. Moral badness, or the deviation of a moral being from the principles of virtue imposed by conscience, or by the will of the Supreme Being, or by the principles of a lawful human authority; disposition to do wrong; moral offence; wickedness; depravity. The heart of the sons of men is full of evil. Eccl. ix. 3. 3. malady or disease; especially in the phrase king's evil, the scrofula. [R.] Shak. He [Edward the Confessor] was the first that touched for the evil. Addison.\n\nIn an evil manner; not well; ill; badly; unhappily; injuriously; unkindly. Shak. It went evil with his house. 1 Chron. vii. 23. The Egyptians evil entreated us, and affected us. Deut. xxvi. 6."}