{"word":"exchange","definition":"1. The act of giving or taking one thing in return for another which is regarded as an equivalent; as, an exchange of cattle for grain. 2. The act of substituting one thing in the place of another; as, an exchange of grief for joy, or of a scepter for a sword, and the like; also, the act of giving and receiving reciprocally; as, an exchange of civilities or views. 3. The thing given or received in return; esp., a publication exchanged for another. Shak. 4. (Com.)  The process of setting accounts or debts between parties residing at a distance from each other, without the intervention of money, by exchanging orders or drafts, called bills of exchange. These may be drawn in one country and payable in another, in which case they are called foreign bills; or they may be drawn and made payable in the same country, in which case they are called inland bills. The term bill of exchange is often abbreviated into exchange; as, to buy or sell exchange. Note: A in London is creditor to B in New York, and C in London owes D in New York a like sum. A in London draws a bill of exchange on B in New York; C in London purchases the bill, by which A receives his debt due from B in New York. C transmits the bill to D in New York, who receives the amount from B. 5. (Law)  A mutual grant of equal interests, the one in consideration of the other. Estates exchanged must be equal in quantity, as fee simple for fee simple. Blackstone. 6. The place where the merchants, brokers, and bankers of a city meet at certain hours, to transact business. In this sense often contracted to 'Change. Arbitration of exchange. See under Arbitration. -- Bill of exchange. See under Bill. -- Exchange broker. See under Broker. -- Par of exchange, the established value of the coin or standard of value of one country when expressed in the coin or standard of another, as the value of the pound sterling in the currency of France or the United States. The par of exchange rarely varies, and serves as a measure for the rise and fall of exchange that is affected by the demand and supply. Exchange is at par when, for example, a bill in New York, for the payment of one hundred pounds sterling in London, can be purchased for the sum. Exchange is in favor of a place when it can be purchased there at or above par. -- Telephone exchange, a central office in which the wires of any two telephones or telephone stations may be connected to permit conversation. Syn. -- Barter; dealing; trade; traffic; interchange.\n\n1. To part with give, or transfer to another in consideration of something received as an equivalent; -- usually followed by for before the thing received. Exchange his sheep for shells, or wool for a sparking pebble or a diamond. Locke. 2. To part with for a substitute; to lay aside, quit, or resign (something being received in place of the thing as, to exchange a palace for cell. And death for life exchanged foolishly. Spenser. To shift his being Is to exchange one misery with another. Shak. 3. To give and receive reciprocally, as things of the same kind; to barter; to swap; as, to exchange horses with a neighbor; to exchange houses or hats. Exchange forgiveness with me, noble Hamlet. Shak. Syn. -- To barter; change; commute; interchange; bargain; truck; swap; traffic.\n\nTo be changed or received in exchange for; to pass in exchange; as, dollar exchanges for ten dimes."}