{"word":"exhaust","definition":"1. To draw or let out wholly; to drain off completely; as, to exhaust the water of a well; the moisture of the earth is exhausted by evaporation. 2. To empty by drawing or letting out the contents; as, to exhaust a well, or a treasury. 3. To drain, metaphorically; to use or expend wholly, or till the supply comes to an end; to deprive wholly of strength; to use up; to weary or tire out; to wear out; as, to exhaust one's strength, patience, or resources. A decrepit, exhausted old man at fifty-five. Motley. 4. To bring out or develop completely; to discuss thoroughly; as, to exhaust a subject. 5. (Chem.)  To subject to the action of various solvents in order to remove all soluble substances or extractives; as, to exhaust a drug successively with water, alcohol, and ether. Exhausted receiver. (Physics) See under Receiver. Syn. -- To spend; consume; tire out; weary.\n\n1. Drained; exhausted; having expended or lost its energy. 2. Pertaining to steam, air, gas, etc., that is released from the cylinder of an engine after having preformed its work. Exhaust draught, a forced draught produced by drawing air through a place, as through a furnace, instead of blowing it through. -- Exhaust fan, a fan blower so arranged as to produce an exhaust draught, or to draw air or gas out of a place, as out of a room in ventilating it. -- Exhaust nozzle, Exhaust orifice (Steam Engine), the blast orifice or nozzle. -- Exhaust pipe (Steam Engine), the pipe that conveys exhaust steam from the cylinder to the atmosphere or to the condenser. Exhaust port (Steam Engine), the opening, in the cylinder or valve, by which the exhaust steam escapes. -- Exhaust purifier (Milling), a machine for sorting grains, or purifying middlings by an exhaust draught. Knight. -- Exhaust steam (Steam Engine), steam which is allowed to escape from the cylinder after having been employed to produce motion of the piston. -- Exhaust valve (Steam Engine), a valve that lets exhaust steam escape out of a cylinder.\n\n1. The steam let out of a cylinder after it has done its work there. 2. The foul air let out of a room through a register or pipe provided for the purpose."}