{"word":"extreme","definition":"1. At the utmost point, edge, or border; outermost; utmost; farthest; most remote; at the widest limit. 2. Last; final; conclusive; -- said of time; as, the extreme hour of life. 3. The best of worst; most urgent; greatest; highest; immoderate; excessive; most violent; as, an extreme case; extreme folly. \"The extremest remedy.\" Dryden. \"Extreme rapidity.\" Sir W. Scott. Yet extreme gusts will blow out fire. Shak. 4. Radical; ultra; as, extreme opinions. The Puritans or extreme Protestants. Gladstone. 5. (Mus.)  Extended or contracted as much as possible; -- said of intervals; as, an extreme sharp second; an extreme flat forth. Extreme and mean ratio (Geom.), the relation of a line and its segments when the line is so divided that the whole is to the greater segment is to the less. -- Extreme distance. (Paint.) See Distance., n., 6. -- Extreme unction. See under Unction. Note: Although this adjective, being superlative in signification, is not properly subject to comparison, the superlative form not unfrequently occurs, especially in the older writers. \"Tried in his extremest state.\" Spenser. \"Extremest hardships.\" Sharp. \"Extremest of evils.\" Bacon. \"Extremest verge of the swift brook.\" Shak. \"The sea's extremest borders.\" Addison.\n\n1. The utmost point or verge; that part which terminates a body; extremity. 2. Utmost limit or degree that is supposable or tolerable; hence, furthest degree; any undue departure from the mean; -- often in the plural: things at an extreme distance from each other, the most widely different states, etc.; as, extremes of heat and cold, of virtue and vice; extremes meet. His parsimony went to the extreme of meanness. Bancroft. 3. An extreme state or condition; hence, calamity, danger, distress, etc. \"Resolute in most extremes.\" Shak. 4. (Logic)  Either of the extreme terms of a syllogism, the middle term being interposed between them. 5. (Math.)  The first or the last term of a proportion or series. In the extreme as much as possible. \"The position of the Port was difficult in the extreme.\" J. P. Peters."}