{"word":"fair","definition":"1. Free from spots, specks, dirt, or imperfection; unblemished; clean; pure. A fair white linen cloth. Book of Common Prayer. 2. Pleasing to the eye; handsome; beautiful. Who can not see many a fair French city, for one fair French made. Shak. 3. Without a dark hue; light; clear; as, a fair skin. The northern people large and fair-complexioned. Sir M. Hale. 4. Not overcast; cloudless; clear; pleasant; propitious; favorable; - - said of the sky, weather, or wind, etc.; as, a fair sky; a fair day. You wish fair winds may waft him over. Prior. 5. Free from obstacles or hindrances; unobstructed; unincumbered; open; direct; -- said of a road, passage, etc.; as, a fair mark; in fair sight; a fair view. The caliphs obtained a mighty empire, which was in a fair way to have enlarged. Sir W. Raleigh. 6. (Shipbuilding)  Without sudden change of direction or curvature; smooth; fowing; -- said of the figure of a vessel, and of surfaces, water lines, and other lines. 7. Characterized by frankness, honesty, impartiality, or candor; open; upright; free from suspicion or bias; equitable; just; -- said of persons, character, or conduct; as, a fair man; fair dealing; a fair statement. \"I would call it fair play.\" Shak. 8. Pleasing; favorable; inspiring hope and confidence; -- said of words, promises, etc. When fair words and good counsel will not prevail on us, we must be frighted into our duty. L' Estrange. 9. Distinct; legible; as, fair handwriting. 10. Free from any marked characteristic; average; middling; as, a fair specimen. The news is very fair and good, my lord. Shak. Fair ball. (Baseball) (a) A ball passing over the home base at the height called for by the batsman, and delivered by the pitcher while wholly within the lines of his position and facing the batsman. (b) A batted ball that falls inside the foul lines; -- called also a fair hit. -- Fair maid. (Zoöl.) (a) The European pilchard (Clupea pilchardus) when dried. (b) The southern scup (Stenotomus Gardeni). [Virginia] -- Fair one, a handsome woman; a beauty, -- Fair play, equitable or impartial treatment; a fair or equal chance; justice. -- From fair to middling, passable; tolerable. [Colloq.] -- The fair sex, the female sex. Syn. -- Candid; open; frank; ingenuous; clear; honest; equitable; impartial; reasonable. See Candid.\n\nClearly; openly; frankly; civilly; honestly; favorably; auspiciously; agreeably. Fair and square, justly; honestly; equitably; impartially. [Colloq.] -- To bid fair. See under Bid. -- To speak fair, to address with courtesy and frankness. [Archaic]\n\n1. Fairness, beauty. [Obs.] Shak. 2. A fair woman; a sweetheart. I have found out a gift for my fair. Shenstone. 3. Good fortune; good luck. Now fair befall thee ! Shak. The fair, anything beautiful; women, collectively. \"For slander's mark was ever yet the fair.\" Shak.\n\n1. To make fair or beautiful. [Obs.] Fairing the foul. Shak. 2. (Shipbuilding)  To make smooth and flowing, as a vessel's lines.\n\n1. A gathering of buyers and sellers, assembled at a particular place with their merchandise at a stated or regular season, or by special appointment, for trade. 2. A festival, and sale of fancy articles. erc., usually for some charitable object; as, a Grand Army fair. 3. A competitive exhibition of wares, farm products, etc., not primarily for purposes of sale; as, the Mechanics' fair; an agricultural fair. After the fair, Too late. [Colloq.]"}