{"word":"faith","definition":"1. Belief; the assent of the mind to the truth of what is declared by another, resting solely and implicitly on his authority and veracity; reliance on testimony. 2. The assent of the mind to the statement or proposition of another, on the ground of the manifest truth of what he utters; firm and earnest belief, on probable evidence of any kind, especially in regard to important moral truth. Faith, that is, fidelity, -- the fealty of the finite will and understanding to the reason. Coleridge. 3. (Theol.) (a) The belief in the historic truthfulness of the Scripture narrative, and the supernatural origin of its teachings, sometimes called historical and speculative faith. (b) The belief in the facts and truth of the Scriptures, with a practical love of them; especially, that confiding and affectionate belief in the person and work of Christ, which affects the character and life, and makes a man a true Christian, -- called a practical, evangelical, or saving faith. Without faith it is impossible to please him [God]. Heb. xi. 6. The faith of the gospel is that emotion of the mind which is called \"trust\" or \"confidence\" exercised toward the moral character of God, and particularly of the Savior. Dr. T. Dwight. Faith is an affectionate, practical confidence in the testimony of God. J. Hawes. 4. That which is believed on any subject, whether in science, politics, or religion; especially (Theol.), a system of religious belief of any kind; as, the Jewish or Mohammedan faith; and especially, the system of truth taught by Christ; as, the Christian faith; also, the creed or belief of a Christian society or church. Which to believe of her, Must be a faith that reason without miracle Could never plant in me. Shak. Now preacheth the faith which once he destroyed. Gal. i. 23. 5. Fidelity to one's promises, or allegiance to duty, or to a person honored and beloved; loyalty. Children in whom is no faith. Deut. xxvii. 20. Whose failing, while her faith to me remains, I should conceal. Milton. 6. Word or honor pledged; promise given; fidelity; as, he violated his faith. For you alone I broke me faith with injured Palamon. Dryden. 7. Credibility or truth. [R.] The faith of the foregoing narrative. Mitford. Act of faith. See Auto-da-fé. -- Breach of faith, Confession of faith, etc. See under Breach, Confession, etc. -- Faith cure, a method or practice of treating diseases by prayer and the exercise of faith in God. -- In good faith, with perfect sincerity.\n\nBy my faith; in truth; verily."}