{"word":"false","definition":"1. Uttering falsehood; unveracious; given to deceit; dishnest; as, a false witness. 2. Not faithful or loyal, as to obligations, allegiance, vows, etc.; untrue; treacherous; perfidious; as, a false friend, lover, or subject; false to promises. I to myself was false, ere thou to me. Milton. 3. Not according with truth or reality; not true; fitted or likely to deceive or disappoint; as, a false statement. 4. Not genuine or real; assumed or designed to deceive; counterfeit; hypocritical; as, false tears; false modesty; false colors; false jewelry. False face must hide what the false heart doth know. Shak. 5. Not well founded; not firm or trustworthy; erroneous; as, a false claim; a false conclusion; a false construction in grammar. Whose false foundation waves have swept away. Spenser. 6. Not essential or permanent, as parts of a structure which are temporary or supplemental. 7. (Mus.)  Not in tune. False arch (Arch.), a member having the appearance of an arch, though not of arch construction. -- False attic, an architectural erection above the main cornice, concealing a roof, but not having windows or inclosing rooms. -- False bearing, any bearing which is not directly upon a vertical support; thus, the weight carried by a corbel has a false bearing. -- False cadence, an imperfect or interrupted cadence. -- False conception (Med.), an abnormal conception in which a mole, or misshapen fleshy mass, is produced instead of a properly organized fetus. -- False croup (Med.), a spasmodic affection of the larynx attended with the symptoms of membranous croup, but unassociated with the deposit of a fibrinous membrane. -- False door or window (Arch.), the representation of a door or window, inserted to complete a series of doors or windows or to give symmetry. -- False fire, a combustible carried by vessels of war, chiefly for signaling, but sometimes burned for the purpose of deceiving an enemy; also, a light on shore for decoying a vessel to destruction. -- False galena. See Blende. -- False imprisonment (Law), the arrest and imprisonment of a person without warrant or cause, or contrary to law; or the unlawful detaining of a person in custody. -- False keel (Naut.), the timber below the main keel, used to serve both as a protection and to increase the shio's lateral resistance. -- False key, a picklock. -- False leg. (Zoöl.) See Proleg. -- False membrane (Med.), the fibrinous deposit formed in croup and diphtheria, and resembling in appearance an animal membrane. -- False papers (Naut.), documents carried by a ship giving false representations respecting her cargo, destination, ect., for the purpose of deceiving. -- False passage (Surg.), an unnatural passage leading off from a natural canal, such as the urethra, and produced usually by the unskillful introduction of instruments. -- False personation (Law), the intentional false assumption of the name and personality of another. -- False pretenses (Law), false representations concerning past or present facts and events, for the purpose of defrauding another. -- False rail (Naut.), a thin piece of timber placed on top of the head rail to strengthen it. -- False relation (Mus.), a progression in harmony, in which a certain note in a chord appears in the next chord prefixed by a flat or sharp. -- False return (Law), an untrue return made to a process by the officer to whom it was delivered for execution. -- False ribs (Anat.), the asternal rebs, of which there are five pairs in man. -- False roof (Arch.), the space between the upper ceiling and the roof. Oxford Gloss. -- False token, a false mark or other symbol, used for fraudulent purposes. -- False scorpion (Zoöl.), any arachnid of the genus Chelifer. See Book scorpion. -- False tack (Naut.), a coming up into the wind and filling away again on the same tack. -- False vampire (Zoöl.), the Vampyrus spectrum of South America, formerly erroneously supposed to have blood-sucking habits; -- called also vampire, and ghost vampire. The genuine blood-sucking bats belong to the genera Desmodus and Diphylla. See Vampire. -- False window. (Arch.) See False door, above. -- False wing. (Zoöl.) See Alula, and Bastard wing, under Bastard. -- False works (Civil Engin.), construction works to facilitate the erection of the main work, as scaffolding, bridge centering, etc.\n\nNot truly; not honestly; falsely. \"You play me false.\" Shak.\n\n1. To report falsely; to falsify. [Obs.] Chaucer. 2. To betray; to falsify. [Obs.] [He] hath his truthe falsed in this wise. Chaucer. 3. To mislead by want of truth; to deceive. [Obs.] In his falsed fancy. Spenser. 4. To feign; to pretend to make. [Obs.] \"And falsed oft his blows.\" Spenser."}