{"word":"fancy","definition":"1. The faculty by which the mind forms an image or a representation of anything perceived before; the power of combining and modifying such objects into new pictures or images; the power of readily and happily creating and recalling such objects for the purpose of amusement, wit, or embellishment; imagination. In the soul Are many lesser faculties, that serve Reason as chief. Among these fancy next Her office holds. Milton. 2. An image or representation of anything formed in the mind; conception; thought; idea; conceit. How now, my lord ! why do you keep alone, Of sorriest fancies your companoins making Shak. 3. An opinion or notion formed without much reflection; caprice; whim; impression. I have always had a fancy that learning might be made a play and recreation to children. Locke. 4. Inclination; liking, formed by caprice rather than reason; as, to strike one's fancy; hence, the object of inclination or liking. To fit your fancies to your father's will. Shak. 5. That which pleases or entertains the taste or caprice without much use or value. London pride is a pretty fancy for borders. Mortimer. 6. A sort of love song or light impromptu ballad. [Obs.] Shak. The fancy, all of a class who exhibit and cultivate any peculiar taste or fancy; hence, especially, sporting characters taken collectively, or any specific class of them, as jockeys, gamblers, prize fighters, etc. At a great book sale in London, which had congregated all the fancy. De Quincey. Syn. -- Imagination; conceit; taste; humor; inclination; whim; liking. See Imagination.\n\n1. To figure to one's self; to believe or imagine something without proof. If our search has reached no farther than simile and metaphor, we rather fancy than know. Locke. 2. To love. [Obs.] Shak.\n\n1. To form a conception of; to portray in the mind; to imagine. He whom I fancy, but can ne'er express. Dryden. 2. To have a fancy for; to like; to be pleased with, particularly on account of external appearance or manners. \"We fancy not the cardinal.\" Shak. 3. To believe without sufficient evidence; to imagine (something which is unreal). He fancied he was welcome, because those arounde him were his kinsmen. Thackeray.\n\n1. Adapted to please the fancy or taste; ornamental; as, fancy goods. 2. Extravagant; above real value. This anxiety never degenerated into a monomania, like that which led his [Frederick the Great's] father to pay fancy prices for giants. Macaulay. Fancy ball, a ball in which porsons appear in fanciful dresses in imitation of the costumes of different persons and nations. -- Fancy fair, a fair at which articles of fancy and ornament are sold, generally for some charitable purpose. -- Fancy goods, fabrics of various colors, patterns, etc., as ribbons, silks, laces, etc., in distinction from those of a simple or plain color or make. -- Fancy line (Naut.), a line rove through a block at the jaws of a gaff; -- used to haul it down. Fancy roller (Carding Machine), a clothed cylinder (usually having straight teeth) in front of the doffer. -- Fancy stocks, a species of stocks which afford great opportunity for stock gambling, since they have no intrinsic value, and the fluctuations in their prices are artificial. -- Fancy store, one where articles of fancy and ornament are sold. -- Fancy woods, the more rare and expensive furniture woods, as mahogany, satinwood, rosewood, etc."}