{"word":"fate","definition":"1. A fixed decree by which the order of things is prescribed; the immutable law of the universe; inevitable necessity; the force by which all existence is determined and conditioned. Necessity and chance Approach not me; and what I will is fate. Milton. Beyond and above the Olympian gods lay the silent, brooding, everlasting fate of which victim and tyrant were alike the instruments. Froude. 2. Appointed lot; allotted life; arranged or predetermined event; destiny; especially, the final lot; doom; ruin; death. The great, th'important day, big with the fate Of Cato and of Rome. Addison. Our wills and fates do so contrary run That our devices still are overthrown. Shak. The whizzing arrow sings, And bears thy fate, Antinous, on its wings. Pope. 3. The element of chance in the affairs of life; the unforeseen and unestimated conitions considered as a force shaping events; fortune; esp., opposing circumstances against which it is useless to struggle; as, fate was, or the fates were, against him. A brave man struggling in the storms of fate. Pope. Sometimes an hour of Fate's serenest weather strikes through our changeful sky its coming beams. B. Taylor. 4. pl. Etym: [L. Fata, pl. of fatum.] (Myth.)  The three goddesses, Clotho, Lachesis, and Atropos, sometimes called the Destinies, or Parcæwho were supposed to determine the course of human life. They are represented, one as holding the distaff, a second as spinning, and the third as cutting off the thread. Note: Among all nations it has been common to speak of fate or destiny as a power superior to gods and men -- swaying all things irresistibly. This may be called the fate of poets and mythologists. Philosophical fate is the sum of the laws of the universe, the product of eternal intelligence and the blind properties of matter. Theological fate represents Deity as above the laws of nature, and ordaining all things according to his will -- the expression of that will being the law. Krauth-Fleming. Syn. -- Destiny; lot; doom; fortune; chance."}