{"word":"fault","definition":"1. Defect; want; lack; default. One, it pleases me, for fault of a better, to call my friend. Shak. 2. Anything that fails, that is wanting, or that impairs excellence; a failing; a defect; a blemish. As patches set upon a little breach Discredit more in hiding of the fault. Shak. 3. A moral failing; a defect or dereliction from duty; a deviation from propriety; an offense less serious than a crime. 4. (Geol. & Mining) (a) A dislocation of the strata of the vein. (b) In coal seams, coal rendered worthless by impurities in the seam; as, slate fault, dirt fault, etc. Raymond. 5. (Hunting)  A lost scent; act of losing the scent. Ceasing their clamorous cry till they have singled, With much ado, the cold fault cleary out. Shak. 6. (Tennis)  Failure to serve the ball into the proper court. At fault, unable to find the scent and continue chase; hance, in trouble ot embarrassment, and unable to proceed; puzzled; thhrown off the track. -- To find fault, to find reason for blaming or complaining; to express dissatisfaction; to complain; -- followed by with before the thing complained of; but formerly by at. \"Matter to find fault at.\" Robynson (More's Utopia). Syn. -- -- Error; blemish; defect; imperfection; weakness; blunder; failing; vice. -- Fault, Failing, Defect, Foible. A fault is positive, something morally wrong; a failing is negative, some weakness or failling short in a man's character, disposition, or habits; a defect is also negative, and as applied to character is the absence of anyything which is necessary to its completeness or perfection; a foible is a less important weakness, which we overlook or smile at. A man may have many failings, and yet commit but few faults; or his faults and failings may be few, while his foibles are obvious to all. The faults of a friend are often palliated or explained away into mere defects, and the defects or foibles of an enemy exaggerated into faults. \"I have failings in common with every human being, besides my own peculiar faults; but of avarice I have generally held myself guiltless.\" Fox. \"Presumption and self-applause are the foibles of mankind.\" Waterland.\n\n1. To charge with a fault; to accuse; to find fault with; to blame. [Obs.] For that I will not fault thee. Old Song. 2. (Geol.)  To interrupt the continuity of (rock strata) by displacement along a plane of fracture; -- chiefly used in the p.p.; as, the coal beds are badly faulted.\n\nTo err; to blunder, to commit a fault; to do wrong. [Obs.] If after Samuel's death the people had asked of God a king, they had not faulted. Latimer."}