{"word":"favor","definition":"1. Kind regard; propitious aspect; countenance; friendly disposition; kindness; good will. Hath crawled into the favor of the king. Shak. 2. The act of countenancing, or the condition of being countenanced, or regarded propitiously; support; promotion; befriending. But found no favor in his lady's eyes. Dryden. And Jesus increased in wisdom and stature, and in favor with God and man. Luke ii. 52. 3. A kind act or office; kindness done or granted; benevolence shown by word or deed; an act of grace or good will, as distinct from justice or remuneration. Beg one favor at thy gracious hand. Shak. 4. Mildness or mitigation of punishment; lenity. I could not discover the lenity and fabor of this sentence. Swift. 5. The object of regard; person or thing favored. All these his wondrous works, but chiefly man, His chief delight and favor. Milton. 6. A gift or represent; something bestowed as an evidence of good will; a token of love; a knot of ribbons; something worn as a token of affection; as, a marriage favor is a bunch or knot of white ribbons or white flowers worn at a wedding. Wear thou this favor for me, and stick it in thy cap. Shak. 7. Appearance; look; countenance; face. [Obs.] This boy is fair, of female favor. Shak. 8. (Law)  Partiality; bias. Bouvier. 9. A letter or epistle; -- so called in civility or compliment; as, your favor of yesterday is received. 10. pl.  Love locks. [Obs.] Wright. Challenge to the favor or for favor (Law), the challenge of a juror on grounds not sufficient to constitute a principal challenge, but sufficient to give rise to a probable suspicion of favor or bias, such as acquaintance, business relation, etc. See Principal challenge, under Challenge. -- In favor of, upon the side of; favorable to; for the advantage of. -- In favor with, favored, countenanced, or encouraged by. -- To curry favor Etym: [see the etymology of Favor, above], to seek to gain favor by flattery, caresses, kindness, or officious civilities. -- With one's favor, or By one's favor, with leave; by kind permission. But, with your favor, I will treat it here. Dryden. Syn. -- Kindness; countenance; patronage; support; lenity; grace; gift; present; benefit.\n\n1. To regard with kindness; to support; to aid, or to have the disposition to aid, or to wish success to; to be propitious to; to countenance; to treat with consideration or tenderness; to show partiality or unfair bias towards. O happy youth! and favored of the skies. Pope. He that favoreth Joab, . . . let him go after Joab. 2 Sam. xx. 11. [The painter] has favored her squint admirably. Swift. 2. To afford advantages for success to; to facilitate; as, a weak place favored the entrance of the enemy. 3. To resemble in features; to have the aspect or looks of; as, the child favors his father. The porter owned that the gentleman favored his master. Spectator."}