{"word":"fear","definition":"A variant of Fere, a mate, a companion. [Obs.] Spenser.\n\n1. A painful emotion or passion excited by the expectation of evil, or the apprehension of impending danger; apprehension; anxiety; solicitude; alarm; dread. Note: The degrees of this passion, beginning with the most moderate, may be thus expressed, -- apprehension, fear, dread, fright, terror. Fear is an uneasiness of the mind, upon the thought of future evil likely to befall us. Locke. Where no hope is left, is left no fear. Milton. 2. (Script.) (a) Apprehension of incurring, or solicitude to avoid, God's wrath; the trembling and awful reverence felt toward the Supreme Belng. (b) Respectful reverence for men of authority or worth. I will put my fear in their hearts. Jer. xxxii. 40. I will teach you the fear of the Lord. Ps. xxxiv. 11. render therefore to all their dues; tribute to whom tribute is due . . . fear to whom fear. Rom. xiii. 7. 3. That which causes, or which is the object of, apprehension or alarm; source or occasion of terror; danger; dreadfulness. There were they in great fear, where no fear was. Ps. liii. 5. The fear of your adventure would counsel you to a more equal enterprise. Shak. For fear, in apprehension lest. \"For fear you ne'er see chain nor money more.\" Shak.\n\n1. To feel a painful apprehension of; to be afraid of; to consider or expect with emotion of alarm or solicitude. I will fear no evil, for thou art with me. Ps. xxiii. 4. Note: With subordinate clause. I greatly fear my money is not safe. Shak. I almost fear to quit your hand. D. Jerrold. 2. To have a reverential awe of; to solicitous to avoid the displeasure of. Leave them to God above; him serve and fear. Milton. 3. To be anxious or solicitous for. [R.] The sins of the father are to be laid upon the children, therefore . . . I fear you. Shak. 4. To suspect; to doubt. [Obs.] Ay what else, fear you not her courage Shak. 5. To affright; to terrify; to drive away or prevent approach of by fear. z2 fera their people from doing evil. Robynsin (More's utopia). Tush, tush! fear boys with bugs. Shak. Syn. -- To apprehend; drad; reverence; venerate.\n\nTo be in apprehension of evil; to be afraid; to feel anxiety on account of some expected evil. I exceedingly fear and quake. Heb. xii. 21."}