{"word":"feed","definition":"1. To give food to; to supply with nourishment; to satisfy the physical huger of. If thine enemy hunger, feed him. Rom. xii. 20. Unreasonable reatures feed their young. Shak. 2. To satisfy; grafity or minister to, as any sense, talent, taste, or desire. I will feed fat the ancient grudge I bear him. Shak. Feeding him with the hope of liberty. Knolles. 3. To fill the wants of; to supply with that which is used or wasted; as, springs feed ponds; the hopper feeds the mill; to feed a furnace with coal. 4. To nourish, in a general sense; to foster, strengthen, develop, and guard. Thou shalt feed people Israel. 2 Sam. v. 2. Mightiest powers by deepest calms are feed. B. Cornwall. 5. To graze; to cause to be cropped by feeding, as herbage by cattle; as, if grain is too forward in autumn, feed it with sheep. Once in three years feed your mowing lands. Mortimer. 6. To give for food, especially to animals; to furnish for consumption; as, to feed out turnips to the cows; to feed water to a steam boiler. 7. (Mach.) (a) To supply (the material to be operated upon) to a machine; as, to feed paper to a printing press. (b) To produce progressive operation upon or with (as in wood and metal working machines, so that the work moves to the cutting tool, or the tool to the work).\n\n1. To take food; to eat. Her kid . . . which I afterwards killed because it would not feed. De Foe. 2. To subject by eating; to satisfy the appetite; to feed one's self (upon something); to prey; -- with on or upon. Leaving thy trunk for crows to feed upon. Shak. 3. To be nourished, strengthened, or satisfied, as if by food. \"He feeds upon the cooling shade.\" Spenser. 4. To place cattle to feed; to pasture; to graze. If a man . . . shall put in his beast, and shall feed in anotheEx. xxii. 5.\n\n1. That which is eaten; esp., food for beasts; fodder; pasture; hay; grain, ground or whole; as, the best feed for sheep. 2. A grazing or pasture ground. Shak. 3. An allowance of provender given to a horse, cow, etc.; a meal; as, a feed of corn or oats. 4. A meal, or the act of eating. [R.] For such pleasure till that hour At feed or fountain never had I found. Milton. 5. The water supplied to steam boilers. 6. (Mach.) (a) The motion, or act, of carrying forward the stuff to be operated upon, as cloth to the needle in a sewing machine; or of producing progressive operation upon any material or object in a machine, as, in a turning lathe, by moving the cutting tool along or in the work. (b) The supply of material to a machine, as water to a steam boiler, coal to a furnace, or grain to a run of stones. (c) The mechanism by which the action of feeding is produced; a feed motion. Feed bag, a nose bag containing feed for a horse or mule. -- Feed cloth, an apron for leading cotton, wool, or other fiber, into a machine, as for carding, etc. -- Feed door, a door to a furnace, by which to supply coal. -- Feed head. (a) A cistern for feeding water by gravity to a steam boiler. (b) (Founding) An excess of metal above a mold, which serves to render the casting more compact by its pressure; -- also called a riser, deadhead, or simply feed or head Knight. -- Feed heater. (a) (Steam Engine) A vessel in which the feed water for the boiler is heated, usually by exhaust steam. (b) A boiler or kettle in which is heated food for stock. -- Feed motion, or Feed gear (Mach.), the train of mechanism that gives motion to the part that directly produces the feed in a machine. -- Feed pipe, a pipe for supplying the boiler of a steam engine, etc., with water. -- Feed pump, a force pump for supplying water to a steam boiler, etc. -- Feed regulator, a device for graduating the operation of a feeder. Knight. -- Feed screw, in lathes, a long screw employed to impart a regular motion to a tool rest or tool, or to the work. -- Feed water, water supplied to a steam boiler, etc. -- Feed wheel (Mach.), a kind of feeder. See Feeder, n., 8."}