{"word":"fence","definition":"1. That which fends off attack or danger; a defense; a protection; a cover; security; shield. Let us be backed with God and with the seas, Which he hath given for fence impregnable. Shak. A fence betwixt us and the victor's wrath. Addison. 2. An inclosure about a field or other space, or about any object; especially, an inclosing structure of wood, iron, or other material, intended to prevent intrusion from without or straying from within. Leaps o'er the fence with ease into the fold. Milton. Note: In England a hedge, ditch, or wall, as well as a structure of boards, palings, or rails, is called a fence. 3. (Locks)  A projection on the bolt, which passes through the tumbler gates in locking and unlocking. 4. Self-defense by the use of the sword; the art and practice of fencing and sword play; hence, skill in debate and repartee. See Fencing. Enjoy your dear wit, and gay rhetoric, That hath so well been taught her dazzing fence. Milton. Of dauntless courage and consummate skill in fence. Macaulay. 5. A receiver of stolen goods, or a place where they are received. [Slang] Mayhew.\n\n1. To fend off danger from; to give security to; to protect; to guard. To fence my ear against thy sorceries. Milton. 2. To inclose with a fence or other protection; to secure by an inclosure. O thou wall! . . . dive in the earth, And fence not Athens. Shak. A sheepcote fenced about with olive trees. Shak. To fence the tables (Scot. Church), to make a solemn address to those who present themselves to commune at the Lord's supper, on the feelings appropriate to the service, in order to hinder, so far as possible, those who are unworthy from approaching the table. McCheyne.\n\n1. To make a defense; to guard one's self of anything, as against an attack; to give protection or security, as by a fence. Vice is the more stubborn as well as the more dangerous evil, and therefore, in the first place, to be fenced against. Locke. 2. To practice the art of attack and defense with the sword or with the foil, esp. with the smallsword, using the point only. He will fence with his own shadow. Shak. 3. Hence, to fight or dispute in the manner of fencers, that is, by thrusting, guarding, parrying, etc. They fence and push, and, pushing, loudly roar; Their dewlaps and their sides are batDryden. As when a billow, blown against, Falls back, the voice with which I fenced A little ceased, but recommenced. Tennyson."}