{"word":"fermentation","definition":"1. The process of undergoing an effervescent change, as by the action of yeast; in a wider sense (Physiol. Chem.), the transformation of an organic substance into new compounds by the action of a ferment, either formed or unorganized. It differs in kind according to the nature of the ferment which causes it. 2. A state of agitation or excitement, as of the intellect or the feelings. It puts the soul to fermentation and activity. Jer. Taylor. A univesal fermentation of human thought and faith. C. Kingsley. Acetous, or Acetic, fermentation, a form of oxidation in which alcohol is converted into vinegar or acetic acid by the agency of a specific fungus or ferment (Mycoderma aceti). The process involves two distinct reactions, in which the oxygen of the air is essential. An intermediate product, aldehyde, is formed in the first process. 1. C2H6O + O = H2O + C2H4O Note: Alcohol. Water. Aldehyde. 2. C2H4O + O = C2H4O2 Note: Aldehyde. Acetic acid. -- Alcoholic fermentation, the fermentation which saccharine bodies undergo when brought in contact with the yeast plant or Torula. The sugar is converted, either directly or indirectly, into alcohol and carbonic acid, the rate of action being dependent on the rapidity with which the Torulæ develop. -- Ammoniacal fermentation, the conversion of the urea of the urine into ammonium carbonate, through the growth of the special urea ferment. CON2H4 + 2H2O = (NH4)2CO3 Note: Urea. Water. Ammonium carbonate. Note: Whenever urine is exposed to the air in open vessels for several days it undergoes this alkaline fermentation. -- Butyric fermentation, the decomposition of various forms of organic matter, through the agency of a peculiar worm-shaped vibrio, with formation of more or less butyric acid. It is one of the many forms of fermentation that collectively constitute putrefaction. See Lactic fermentation. -- Fermentation by an unorganized ferment or enzyme. Fermentations of this class are purely chemical reactions, in which the ferment acts as a simple catalytic agent. Of this nature are the decomposition or inversion of cane sugar into levulose and dextrose by boiling with dilute acids, the conversion of starch into dextrin and sugar by similar treatment, the conversion of starch into like products by the action of diastase of malt or ptyalin of saliva, the conversion of albuminous food into peptones and other like products by the action of pepsin-hydrochloric acid of the gastric juice or by the ferment of the pancreatic juice. -- Fermentation theory of disease (Biol. & Med.), the theory that most if not all, infectious or zymotic disease are caused by the introduction into the organism of the living germs of ferments, or ferments already developed (organized ferments), by which processes of fermentation are set up injurious to health. See Germ theory. -- Glycerin fermentation, the fermentation which occurs on mixing a dilute solution of glycerin with a peculiar species of schizomycetes and some carbonate of lime, and other matter favorable to the growth of the plant, the glycerin being changed into butyric acid, caproic acid, butyl, and ethyl alcohol. With another form of bacterium (Bacillus subtilis) ethyl alcohol and butyric acid are mainly formed. -- Lactic fermentation, the transformation of milk sugar or other saccharine body into lactic acid, as in the souring of milk, through the agency of a special bacterium (Bacterium lactis of Lister). In this change the milk sugar, before assuming the form of lactic acid, presumably passes through the stage of glucose. C12H22O11.H2O = 4C3H6O3 Note: Hydrated milk sugar. Lactic acid. Note: In the lactic fermentation of dextrose or glucose, the lactic acid which is formed is very prone to undergo butyric fermentation after the manner indicated in the following equation: 2C3H6O3 (lactic acid) = C4H8O2 (butyric acid) + 2CO2 (carbonic acid) + 2H2 (hydrogen gas). -- Putrefactive fermentation. See Putrefaction."}