{"word":"ferment","definition":"1. That which causes fermentation, as yeast, barm, or fermenting beer. Note: Ferments are of two kinds: (a) Formed or organized ferments. (b) Unorganized or structureless ferments. The latter are also called soluble or chemical ferments, and enzymes. Ferments of the first class are as a rule simple microscopic vegetable organisms, and the fermentations which they engender are due to their growth and development; as, the acetic ferment, the butyric ferment, etc. See Fermentation. Ferments of the second class, on the other hand, are chemical substances, as a rule soluble in glycerin and precipitated by alcohol. In action they are catalytic and, mainly, hydrolytic. Good examples are pepsin of the dastric juice, ptyalin of the salvia, and disease of malt. globular proteins, capable of catalyzing a wide variety of chemical reactions, not merely hydrolytic. The full set of enzymes causing production of ethyl alcohol from sugar has been identified and individually purified and studied. See enzyme 2. Intestine motion; heat; tumult; agitation. Subdue and cool the ferment of desire. Rogers. the nation is in a ferment. Walpole. in a ferment in a state of agitation, applied to human groups. 3. A gentle internal motion of the constituent parts of a fluid; fermentation. [R.] Down to the lowest lees the ferment ran. Thomson. ferment oils, volatile oils produced by the fermentation of plants, and not originally contained in them. These were the quintessences of the alchenists. Ure.\n\nTo cause ferment of fermentation in; to set in motion; to excite internal emotion in; to heat. Ye vigorous swains! while youth ferments your blood. Pope.\n\n1. To undergo fermentation; to be in motion, or to be excited into sensible internal motion, as the constituent oarticles of an animal or vegetable fluid; to work; to effervesce. 2. To be agitated or excited by violent emotions. But finding no redress, ferment an rage. Milton. The intellect of the age was a fermenting intellect. De Quincey."}