{"word":"file","definition":"1. An orderly succession; a line; a row; as: (a) (Mil) A row of soldiers ranged one behind another; -- in contradistinction to rank, which designates a row of soldiers standing abreast; a number consisting the depth of a body of troops, which, in the ordinary modern formation, consists of two men, the battalion standing two deep, or in two ranks. Note: The number of files in a company describes its width, as the number of ranks does its depth; thus, 100 men in \"fours deep\" would be spoken of as 25 files in 4 ranks. Farrow. (b) An orderly collection of papers, arranged in sequence or classified for preservation and reference; as, files of letters or of newspapers; this mail brings English files to the 15th instant. (c) The line, wire, or other contrivance, by which papers are put and kept in order. It is upon a file with the duke's other letters. Shak. (d) A roll or list. \"A file of all the gentry.\" Shak. 2. Course of thought; thread of narration. [Obs.] Let me resume the file of my narration. Sir H. Wotton. File firing, the act of firing by file, or each file independently of others. -- File leader, the soldier at the front of any file, who covers and leads those in rear of him. -- File marching, the marching of a line two deep, when faced to the right or left, so that the front and rear rank march side by side. Brande & C. --Indian file, or Single file, a line of men marching one behind another; a single row. -- On file, preserved in an orderly collection. -- Rank and file. (a) The body of soldiers constituing the mass of an army, including corporals and privates. Wilhelm. (b) Those who constitute the bulk or working members of a party, society, etc., in distinction from the leaders.\n\n1. To set in order; to arrange, or lay away, esp. as papers in a methodical manner for preservation and reverence; to place on file; to insert in its proper place in an arranged body of papers. I would have my several courses and my dishes well filed. Beau. & Fl. 2. To bring before a court or legislative body by presenting proper papers in a regular way; as, to file a petition or bill. Burrill. 3. (Law)  To put upon the files or among the records of a court; to note on (a paper) the fact date of its reception in court. To file a paper, on the part of a party, is to place it in the official custody of the clerk. To file, on the part of the clerk, is to indorse upon the paper the date of its reception, and retain it in his office, subject to inspection by whomsoever it may concern. Burrill.\n\nTo march in a file or line, as soldiers, not abreast, but one after another; -- generally with off. To file with, to follow closely, as one soldier after another in file; to keep pace. My endeavors Have ever come too short of my desires, Yet filed with my abilities. Shak.\n\n1. A steel instrument, having cutting ridges or teeth, made by indentation with a chisel, used for abrading or smoothing other substances, as metals, wood, etc. Note: A file differs from a rasp in having the furrows made by straight cuts of a chisel, either single or crossed, while the rasp has coarse, single teeth, raised by the pyramidal end of a triangular punch. 2. Anything employed to smooth, polish, or rasp, literally or figuratively. Mock the nice touches of the critic's file. Akenside. 3. A shrewd or artful person. [Slang] Fielding. Will is an old file spite of his smooth face. Thackeray. Bastard file, Cross file, etc. See under Bastard, Cross, etc. -- Cross-cut file, a file having two sets of teeth crossing obliquely. -- File blank, a steel blank shaped and ground ready for cutting to form a file. -- File cutter, a maker of files. -- Second-cut file, a file having teeth of a grade next finer than bastard. -- Single-cut file, a file having only one set of parallel teeth; a float. -- Smooth file, a file having teeth so fine as to make an almost smooth surface.\n\n1. To rub, smooth, or cut away, with a file; to sharpen with a file; as, to file a saw or a tooth. 2. To smooth or polish as with a file. Shak. File your tongue to a little more courtesy.Sir W.Scott.\n\nTo make f [Obs.] All his hairy breast with blood was filed.Spenser. For Banquo's issue have I filed mind.Shak."}