{"word":"fill","definition":"One of the thills or shafts of a carriage. Mortimer. Fill horse, a thill horse. Shak.\n\n1. To make full; to supply with as much as can be held or contained; to put or pour into, till no more can be received; to occupy the whole capacity of. The rain also filleth the pools. Ps. lxxxiv. 6. Jesus saith unto them, Fill the waterpots with water. Anf they filled them up to the brim. John ii. 7. 2. To furnish an abudant supply to; to furnish with as mush as is desired or desirable; to occupy the whole of; to swarm in or overrun. And God blessed them, saying. Be fruitful, and multiply, and fill the waters in the seas. Gen. i. 22. The Syrians filled the country. 1 Kings xx. 27. 3. To fill or supply fully with food; to feed; to satisfy. Whence should we have so much bread in the wilderness, as to fillso great a multitude Matt. xv. 33. Things that are sweet and fat are more filling. Bacon. 4. To possess and perform the duties of; to officiate in, as an incumbent; to occupy; to hold; as, a king fills a throne; the president fills the office of chief magistrate; the speaker of the House fills the chair. 5. To supply with an incumbent; as, to fill an office or a vacancy. A. Hamilton. 6. (Naut.) (a) To press and dilate, as a sail; as, the wind filled the sails. (b) To trim (a yard) so that the wind shall blow on the after side of the sails. 7. (Civil Engineering)  To make an embankment in, or raise the level of (a low place), with earth or gravel. To fill in, to insert; as, he filled in the figures. -- To fill out, to extend or enlarge to the desired limit; to make complete; as, to fill out a bill. -- To fill up, to make quite full; to fill to the brim or entirely; to occupy completely; to complete. \"The bliss that fills up all the mind.\" Pope. \"And fill up that which is behind of the afflictions of Christ.\" Col. i. 24.\n\n1. To become full; to have the whole capacity occupied; to have an abundant supply; to be satiated; as, corn fills well in a warm season; the sail fills with the wind. 2. To fill a cup or glass for drinking. Give me some wine; fill full. Shak. To back and fill. See under Back, v. i. -- To fill up, to grow or become quite full; as, the channel of the river fills up with sand.\n\nA full supply, as much as supplies want; as much as gives complete satisfaction. \"Ye shall eat your fill.\" Lev. xxv. 19. I'll bear thee hence, where I may weep my fill. Shak."}