{"word":"find","definition":"1. To meet with, or light upon, accidentally; to gain the first sight or knowledge of, as of something new, or unknown; hence, to fall in with, as a person. Searching the window for a flint, I found This paper, thus sealed up. Shak. In woods and forests thou art found. Cowley. 2. To learn by experience or trial; to perceive; to experience; to discover by the intellect or the feelings; to detect; to feel. \"I find you passing gentle.\" Shak. The torrid zone is now found habitable. Cowley. 3. To come upon by seeking; as, to find something lost. (a) To discover by sounding; as, to find bottom. (b) To discover by study or experiment direct to an object or end; as, water is found to be a compound substance. (c) To gain, as the object of desire or effort; as, to find leisure; to find means. (d) To attain to; to arrive at; to acquire. Seek, and ye shall find. Matt. vii. 7. Every mountain now hath found a tongue. Byron. 4. To provide for; to supply; to furnish; as, to find food for workemen; he finds his nephew in money. Wages £14 and all found. London Times. Nothing a day and find yourself. Dickens. 5. To arrive at, as a conclusion; to determine as true; to establish; as, to find a verdict; to find a true bill (of indictment) against an accused person. To find his title with some shows of truth. Shak. To find out, to detect (a thief); to discover (a secret) -- to solve or unriddle (a parable or enigma); to understand. \"Canst thou by searching find out God\" Job. xi. 7. \"We do hope to find out all your tricks.\" Milton. -- To find fault with, to blame; to censure. -- To find one's self, to be; to fare; -- often used in speaking of health; as, how do you find yourself this morning\n\nTo determine an issue of fact, and to declare such a determination to a court; as, the jury find for the plaintiff. Burrill.\n\nAnything found; a discovery of anything valuable; especially, a deposit, discovered by archæologists, of objects of prehistoric or unknown origin."}