{"word":"fine","definition":"1. Finished; brought to perfection; refined; hence, free from impurity; excellent; superior; elegant; worthy of admiration; accomplished; beautiful. The gain thereof [is better] than fine gold. Prov. iii. 14. A cup of wine that's brisk and fine. Shak. Not only the finest gentleman of his time, but one of the finest scholars. Felton. To soothe the sick bed of so fine a being [Keats]. Leigh Hunt. 2. Aiming at show or effect; loaded with ornament; overdressed or overdecorated; showy. He gratified them with occasional . . . fine writing. M. Arnold. 3. Nice; delicate; subtle; exquisite; artful; skillful; dexterous. The spider's touch, how exquisitely fine! Pope. The nicest and most delicate touches of satire consist in fine raillery. Dryden. He has as fine a hand at picking a pocket as a woman. T. Gray. 4. Not coarse, gross, or heavy; as: (a) Not gross; subtile; thin; tenous. The eye standeth in the finer medium and the object in the grosser. Bacon. (b) Not coarse; comminuted; in small particles; as, fine sand or flour. (c) Not thick or heavy; slender; filmy; as, a fine thread. (d) Thin; attenuate; keen; as, a fine edge. (e) Made of fine materials; light; delicate; as, fine linen or silk. 5. Having (such) a proportion of pure metal in its composition; as, coins nine tenths fine. 6. (Used ironically.) Ye have made a fine hand, fellows. Shak. Note: Fine is often compounded with participles and adjectives, modifying them adverbially; a, fine-drawn, fine-featured, fine- grained, fine-spoken, fine-spun, etc. Fine arch (Glass Making), the smaller fritting furnace of a glasshouse. Knight. -- Fine arts. See the Note under Art. -- Fine cut, fine cut tobacco; a kind of chewing tobacco cut up into shreds. -- Fine goods, woven fabrics of fine texture and quality. McElrath. -- Fine stuff, lime, or a mixture of lime, plaster, etc., used as material for the finishing coat in plastering. -- To sail fine (Naut.), to sail as close to the wind as possible. Syn. -- Fine, Beautiful. When used as a word of praise, fine (being opposed to coarse) denotes no \"ordinary thing of its kind.\" It is not as strong as beautiful, in reference to the single attribute implied in the latter term; but when we speak of a fine woman, we include a greater variety of particulars, viz., all the qualities which become a woman, -- breeding, sentiment, tact, etc. The term is equally comprehensive when we speak of a fine garden, landscape, horse, poem, etc.; and, though applied to a great variety of objects, the word has still a very definite sense, denoting a high degree of characteristic excellence.\n\n1. To make fine; to refine; to purify, to clarify; as, to fine gold. It hath been fined and refined by . . . learned men. Hobbes. 2. To make finer, or less coarse, as in bulk, texture, etc.; as. to fine the soil. L. H. Bailey. 3. To change by fine gradations; as (Naut.), to fine down a ship's lines, to diminish her lines gradually. I often sate at home On evenings, watching how they fined themselves With gradual conscience to a perfect night. Browning.\n\n1. End; conclusion; termination; extinction. [Obs.] \"To see their fatal fine.\" Spenser. Is this the fine of his fines Shak. 2. A sum of money paid as the settlement of a claim, or by way of terminating a matter in dispute; especially, a payment of money imposed upon a party as a punishment for an offense; a mulct. 3. (Law) (a) (Feudal Law) A final agreement concerning lands or rents between persons, as the lord and his vassal. Spelman. (b) (Eng. Law) A sum of money or price paid for obtaining a benefit, favor, or privilege, as for admission to a copyhold, or for obtaining or renewing a lease. Fine for alienation (Feudal Law), a sum of money paid to the lord by a tenant whenever he had occasion to make over his land to another. Burrill. -- Fine of lands, a species of conveyance in the form of a fictitious suit compromised or terminated by the acknowledgment of the previous owner that such land was the right of the other party. Burrill. See Concord, n., 4. -- In fine, in conclusion; by way of termination or summing up.\n\nTo impose a pecuniary penalty upon for an offense or breach of law; to set a fine on by judgment of a court; to punish by fine; to mulct; as, the trespassers were fined ten dollars.\n\nTo pay a fine. See Fine, n., 3 (b). [R.] Men fined for the king's good will; or that he would remit his anger; women fined for leave to marry. Hallam.\n\nTo finish; to cease; or to cause to cease. [Obs.]"}