{"word":"fish","definition":"A counter, used in various games.\n\n1. A name loosely applied in popular usage to many animals of diverse characteristics, living in the water. 2. (Zoöl.)  An oviparous, vertebrate animal usually having fins and a covering scales or plates. It breathes by means of gills, and lives almost entirely in the water. See Pisces. Note: The true fishes include the Teleostei (bony fishes), Ganoidei, Dipnoi, and Elasmobranchii or Selachians (sharks and skates). Formerly the leptocardia and Marsipobranciata were also included, but these are now generally regarded as two distinct classes, below the fishes. 3. pl.  The twelfth sign of the zodiac; Pisces. 4. The flesh of fish, used as food. 5. (Naut.) (a) A purchase used to fish the anchor. (b) A piece of timber, somewhat in the form of a fish, used to strengthen a mast or yard. Note: Fish is used adjectively or as part of a compound word; as, fish line, fish pole, fish spear, fish-bellied. Age of Fishes. See under Age, n., 8. -- Fish ball, fish (usually salted codfish) shared fine, mixed with mashed potato, and made into the form of a small, round cake. [U.S.] -- Fish bar. Same as Fish plate (below). -- Fish beam (Mech.), a beam one of whose sides (commonly the under one) swells out like the belly of a fish. Francis. -- Fish crow (Zoöl.), a species of crow (Corvus ossifragus), found on the Atlantic coast of the United States. It feeds largely on fish. -- Fish culture, the artifical breeding and rearing of fish; pisciculture. -- Fish davit. See Davit. -- Fish day, a day on which fish is eaten; a fast day. -- Fish duck (Zoöl.), any species of merganser. -- Fish fall, the tackle depending from the fish davit, used in hauling up the anchor to the gunwale of a ship. -- Fish garth, a dam or weir in a river for keeping fish or taking them easily. -- Fish glue. See Isinglass. -- Fish joint, a joint formed by a plate or pair of plates fastened upon two meeting beams, plates, etc., at their junction; -- used largely in connecting the rails of railroads. -- Fish kettle, a long kettle for boiling fish whole. -- Fish ladder, a dam with a series of steps which fish can leap in order to ascend falls in a river. -- Fish line, or Fishing line, a line made of twisted hair, silk, etc., used in angling. -- Fish louse (Zoöl.), any crustacean parasitic on fishes, esp. the parasitic Copepoda, belonging to Caligus, Argulus, and other related genera. See Branchiura. -- Fish maw (Zoöl.), the stomach of a fish; also, the air bladder, or sound. -- Fish meal, fish desiccated and ground fine, for use in soups, etc. -- Fish oil, oil obtained from the bodies of fish and marine animals, as whales, seals, sharks, from cods' livers, etc. -- Fish owl (Zoöl.), a fish-eating owl of the Old World genera Scotopelia and Ketupa, esp. a large East Indian species (K. Ceylonensis). -- Fish plate, one of the plates of a fish joint. -- Fish pot, a wicker basket, sunk, with a float attached, for catching crabs, lobsters, etc. -- Fish pound, a net attached to stakes, for entrapping and catching fish; a weir. [Local, U.S.] Bartlett. -- Fish slice, a broad knife for dividing fish at table; a fish trowel. -- Fish slide, an inclined box set in a stream at a small fall, or ripple, to catch fish descending the current. Knight. -- Fish sound, the air bladder of certain fishes, esp. those that are dried and used as food, or in the arts, as for the preparation of isinglass. -- Fish story, a story which taxes credulity; an extravagant or incredible narration. [Colloq. U.S.] Bartlett. -- Fish strainer. (a) A metal colander, with handles, for taking fish from a boiler. (b) A perforated earthenware slab at the bottom of a dish, to drain the water from a boiled fish. -- Fish trowel, a fish slice. -- Fish weir or wear, a weir set in a stream, for catching fish. -- Neither fish nor flesh (Fig.), neither one thing nor the other.\n\n1. To attempt to catch fish; to be employed in taking fish, by any means, as by angling or drawing a net. 2. To seek to obtain by artifice, or indirectly to seek to draw forth; as, to fish for compliments. Any other fishing question. Sir W. Scott.\n\n1. To catch; to draw out or up; as, to fish up an anchor. 2. To search by raking or sweeping. Swift. 3. To try with a fishing rod; to catch fish in; as, to fish a stream. Thackeray. 4. To strengthen (a beam, mast, etc.), or unite end to end (two timbers, railroad rails, etc.) by bolting a plank, timber, or plate to the beam, mast, or timbers, lengthwise on one or both sides. See Fish joint, under Fish, n. To fish the anchor. (Naut.) See under Anchor."}