{"word":"flag","definition":"1. To hang loose without stiffness; to bend down, as flexible bodies; to be loose, yielding, limp. As loose it [the sail] flagged around the mast. T. Moore. 2. To droop; to grow spiritless; to lose vigor; to languish; as, the spirits flag; the streugth flags. The pleasures of the town begin to flag. Swift. Syn. -- To droop; decline; fail; languish; pine.\n\n1. To let droop; to suffer to fall, or let fall, into feebleness; as, to flag the wings. prior. 2. To enervate; to exhaust the vigor or elasticity of. Nothing so flags the spirits. Echard.\n\n1. That which flags or hangs down loosely. 2. A cloth usually bearing a device or devices and used to indicate nationality, party, etc., or to give or ask information; -- commonly attached to a staff to be waved by the wind; a standard; a banner; an ensign; the colors; as, the national flag; a military or a naval flag. 3. (Zoöl.) (a) A group of feathers on the lower part of the legs of certain hawks, owls, etc. (b) A group of elongated wing feathers in certain hawks. (c) The bushy tail of a dog, as of a setter. Black flag. See under Black. -- Flag captain, Flag leutenant, etc., special officers attached to the flagship, as aids to the flag officer. -- Flag officer, the commander of a fleet or squadron; an admiral, or commodore. -- Flag of truse, a white flag carried or displayed to an enemy, as an invitation to conference, or for the purpose of making some communication not hostile. -- Flag share, the flag officer's share of prize money. -- Flag station (Railroad), a station at which trains do not stop unless signaled to do so, by a flag hung out or waved. -- National flag, a flag of a particular country, on which some national emblem or device, is emblazoned. -- Red flag, a flag of a red color, displayed as a signal of danger or token of defiance; the emblem of anarchists. -- To dip, the flag, to mlower it and quickly restore it to its place; -- done as a mark of respect. -- To hang out the white flag, to ask truce or quarter, or, in some cases, to manifest a friendly design by exhibiting a white flag. -- To hang the flag half-mast high or half-staff, to raise it only half way to the mast or staff, as a token or sign of mourning. -- To strike, or lower, the flag, to haul it down, in token of respect, submission, or, in an engagement, of surrender. -- Yellow flag, the quarantine flag of all nations; also carried at a vessel's fore, to denote that an infectious disease is on board.\n\n1. To signal to with a flag; as, to flag a train. 2. To convey, as a message, by means of flag signals; as, to flag an order to troops or vessels at a distance.\n\nAn aquatic plant, with long, ensiform leaves, belonging to either of the genera Iris and Acorus. Cooper's flag, the cat-tail (Typha latifolia), the long leaves of which are placed between the staves of barrels to make the latter water-tight. -- Corn flag. See under 2d Corn. -- Flag broom, a coarse of broom, originally made of flags or rushes. -- Flag root, the root of the sweet flag. -- Sweet flag. See Calamus, n., 2.\n\nTo furnish or deck out with flags.\n\n1. A flat stone used for paving. Woodward. 2. (Geol.)  Any hard, evenly stratified sandstone, which splits into layers suitable for flagstones.\n\nTo lay with flags of flat stones. The sides and floor are all flagged with . . . marble. Sandys."}