{"word":"flesh","definition":"1. The aggregate of the muscles, fat, and other tissues which cover the framework of bones in man and other animals; especially, the muscles. Note: In composition it is mainly albuminous, but contains in adition a large number of crystalline bodies, such as creatin, xanthin, hypoxanthin, carnin, etc. It is also rich in phosphate of potash. 2. Animal food, in distinction from vegetable; meat; especially, the body of beasts and birds used as food, as distinguished from fish. With roasted flesh, or milk, and wastel bread. Chaucer. 3. The human body, as distinguished from the soul; the corporeal person. As if this flesh, which walls about our life, Were brass impregnable. Shak. 4. The human eace; mankind; humanity. All flesh had corrupted his way upon the earth. Gen. vi. 12. 5. Human nature: (a) In a good sense, tenderness of feeling; gentleness. There is no flesh in man's obdurate heart. Cowper. (b) In a bad sense, tendency to transient or physical pleasure; desire for sensual gratification; carnality. (c) (Theol.) The character under the influence of animal propensities or selfish passions; the soul unmoved by spiritual influences. 6. Kindred; stock; race. He is our brother and our flesh. Gen. xxxvii. 27. 7. The soft, pulpy substance of fruit; also, that part of a root, fruit, and the like, which is fit to be eaten. Note: Flesh is often used adjectively or self-explaining compounds; as, flesh broth or flesh-broth; flesh brush or fleshbrush; flesh tint or flesh-tint; flesh wound. After the flesh, after the manner of man; in a gross or earthly manner. \"Ye judge after the flesh.\" John viii. 15. -- An arm of flesh, human strength or aid. -- Flesh and blood. See under Blood. -- Flesh broth, broth made by boiling flesh in water. -- Flesh fly (Zoöl.), one of several species of flies whose larvæ or maggots feed upon flesh, as the bluebottle fly; -- called also meat fly, carrion fly, and blowfly. See Blowly. -- Flesh meat, animal food. Swift. -- Flesh side, the side of a skin or hide which was next to the flesh; -- opposed to grain side. -- Flesh tint (Painting), a color used in painting to imitate the hue of the living body. -- Flesh worm (Zoöl.), any insect larva of a flesh fly. See Flesh fly (above). -- Proud flesh. See under Proud. -- To be one flesh, to be closely united as in marriage; to become as one person. Gen. ii. 24.\n\n1. To feed with flesh, as an incitement to further exertion; to initiate; -- from the practice of training hawks and dogs by feeding them with the first game they take, or other flesh. Hence, to use upon flesh (as a murderous weapon) so as to draw blood, especially for the first time. Full bravely hast thou fleshed Thy maiden sword. Shak. The wild dog Shall flesh his tooth on every innocent. Shak. 2. To glut; to satiate; hence, to harden, to accustom. \"Fleshed in triumphs.\" Glanvill. Old soldiers Fleshed in the spoils of Germany and France. Beau. & Fl. 3. (Leather Manufacture)  To remove flesh, membrance, etc., from, as from hides."}