{"word":"fling","definition":"1. To cast, send, to throw from the hand; to hurl; to dart; to emit with violence as if thrown from the hand; as, to fing a stone into the pond. 'T is Fate that flings the dice: and, as she flings, Of kings makes peasants, and of peasants kings. Dryden. He . . . like Jove, his lighting flung. Dryden. I know thy generous temper well. Fling but the appearance of dishonor on it, It straight takes fire. Addison. 2. To shed forth; to emit; to scatter. The sun begins to fling His flaring beams. Milton. Every beam new transient colors flings. Pope. 3. To throw; to hurl; to throw off or down; to prostrate; hence, to baffle; to defeat; as, to fling a party in litigation. His horse started, flung him, and fell upon him. Walpole. To fling about, to throw on all sides; to scatter. -- To fling away, to reject; to discard. Cromwell, I charge thee, fling away ambition. Shak. --To fling down. (a) To throw to the ground; esp., to throw in defiance, as formerly knights cast a glove into the arena as a challenge. This question so flung down before the guests, . . . Was handed over by consent of all To me who had not spoken. Tennyson. (b) To overturn; to demolish; to ruin. -- To fling in, to throw in; not to charge in an account; as, in settling accounts, one party flings in a small sum, or a few days' work. -- To fling off, to baffle in the chase; to defeat of prey; also, to get rid of. Addison. -- To fling open, to throw open; to open suddenly or with violence; as, to fling open a door. -- To fling out, to utter; to speak in an abrupt or harsh manner; as, to fling out hard words against another. -- To fling up, to relinquish; to abandon; as, to fling up a design.\n\n1. To throw; to wince; to flounce; as, the horse began to kick and fling. 2. To cast in the teeth; to utter abusive language; to sneer; as, the scold began to flout and fling. 3. To throw one's self in a violent or hasty manner; to rush or spring with violence or haste. And crop-full, out of doors he flings. Milton. I flung closer to his breast, As sword that, after battle, flings to sheath. Mrs. Browning. To fling out, to become ugly and intractable; to utter sneers and insinuations.\n\n1. A cast from the hand; a throw; also, a flounce; a kick; as, the fling of a horse. 2. A severe or contemptuous remark; an expression of sarcastic scorn; a gibe; a sarcasm. I, who love to have a fling, Both at senate house and king. Swift. 3. A kind of dance; as, the Highland fling. 4. A trifing matter; an object of contempt. [Obs.] England were but a fling Save for the crooked stick and the gray goose wing. Old Proverb. To have one's fling, to enjoy one's self to the full; to have a season of dissipation. J. H. Newman. \"When I was as young as you, I had my fling. I led a life of pleasure.\" D. Jerrold."}