{"word":"float","definition":"1. Anything which floats or rests on the surface of a fluid, as to sustain weight, or to indicate the height of the surface, or mark the place of, something. Specifically: (a) A mass of timber or boards fastened together, and conveyed down a stream by the current; a raft. (b) The hollow, metallic ball of a self-acting faucet, which floats upon the water in a cistern or boiler. (c) The cork or quill used in angling, to support the bait line, and indicate the bite of a fish. (d) Anything used to buoy up whatever is liable to sink; an inflated bag or pillow used by persons learning to swim; a life preserver. This reform bill . . . had been used as a float by the conservative ministry. J. P. Peters. 2. A float board. See Float board (below). 3. (Tempering)  A contrivance for affording a copious stream of water to the heated surface of an object of large bulk, as an anvil or die. Knight. 4. The act of flowing; flux; flow. [Obs.] Bacon. 5. A quantity of earth, eighteen feet square and one foot deep. [Obs.] Mortimer. 6. (Plastering)  The trowel or tool with which the floated coat of plastering is leveled and smoothed. 7. A polishing block used in marble working; a runner. Knight. 8. A single-cut file for smoothing; a tool used by shoemakers for rasping off pegs inside a shoe. 9. A coal cart. [Eng.] Simmonds. 10. The sea; a wave. See Flote, n. Float board, one of the boards fixed radially to the rim of an undershot water wheel or of a steamer's paddle wheel; -- a vane. -- Float case (Naut.), a caisson used for lifting a ship. -- Float copper or gold (Mining), fine particles of metallic copper or of gold suspended in water, and thus liable to be lost. -- Float ore, water-worn particles of ore; fragments of vein material found on the surface, away from the vein outcrop. Raymond. -- Float stone (Arch.), a siliceous stone used to rub stonework or brickwork to a smooth surface. -- Float valve, a valve or cock acted upon by a float. See Float, 1 (b).\n\n1. To rest on the surface of any fluid; to swim; to be buoyed up. The ark no more now floats, but seems on ground. Milton. Three blustering nights, borne by the southern blast, I floated. Dryden. 2. To move quietly or gently on the water, as a raft; to drift along; to move or glide without effort or impulse on the surface of a fluid, or through the air. They stretch their broad plumes and float upon the wind. Pope. There seems a floating whisper on the hills. Byron.\n\n1. To cause to float; to cause to rest or move on the surface of a fluid; as, the tide floated the ship into the harbor. Had floated that bell on the Inchcape rock. Southey. 2. To flood; to overflow; to cover with water. Proud Pactolus floats the fruitful lands. Dryden. 3. (Plastering)  To pass over and level the surface of with a float while the plastering is kept wet. 4. To support and sustain the credit of, as a commercial scheme or a joint-stock company, so as to enable"}