{"word":"floating","definition":"1. Buoyed upon or in a fluid; a, the floating timbers of a wreck; floating motes in the air. 2. Free or lose from the usual attachment; as, the floating ribs in man and some other animals. 3. Not funded; not fixed, invested, or determined; as, floating capital; a floating debt. Trade was at an end. Floating capital had been withdrawn in great masses from the island. Macaulay. Floating anchor (Naut.), a drag or sea anchor; drag sail. -- Floating battery (Mil.), a battery erected on rafts or the hulls of ships, chiefly for the defense of a coast or the bombardment of a place. -- Floating bridge. (a) A bridge consisting of rafts or timber, with a floor of plank, supported wholly by the water; a bateau bridge. See Bateau. (b) (Mil.) A kind of double bridge, the upper one projecting beyond the lower one, and capable of being moved forward by pulleys; -- used for carrying troops over narrow moats in attacking the outworks of a fort. (c) A kind of ferryboat which is guided and impelled by means of chains which are anchored on each side of a stream, and pass over wheels on the vessel, the wheels being driven by stream power. (d) The landing platform of a ferry dock. -- Floating cartilage (Med.), a cartilage which moves freely in the cavity of a joint, and often interferes with the functions of the latter. -- Floating dam. (a) An anchored dam. (b) A caisson used as a gate for a dry dock. -- Floating derrick, a derrick on a float for river and harbor use, in raising vessels, moving stone for harbor improvements, etc. -- Floating dock. (Naut.) See under Dock. -- Floating harbor, a breakwater of cages or booms, anchored and fastened together, and used as a protection to ships riding at anchor to leeward. Knight. -- Floating heart (Bot.), a small aquatic plant (Limnanthemum lacunosum) whose heart-shaped leaves float on the water of American ponds. -- Floating island, a dish for dessert, consisting of custard with floating masses of whipped cream or white of eggs. -- Floating kidney. (Med.) See Wandering kidney, under Wandering. -- Floating light, a light shown at the masthead of a vessel moored over sunken rocks, shoals, etc., to warn mariners of danger; a light- ship; also, a light erected on a buoy or floating stage. -- Floating liver. (Med.) See Wandering liver, under Wandering. -- Floating pier, a landing stage or pier which rises and falls with the tide. -- Floating ribs (Anat.), the lower or posterior ribs which are not connected with the others in front; in man they are the last two pairs. -- Floating screed (Plastering), a strip of plastering first laid on, to serve as a guide for the thickness of the coat. -- Floating threads (Weaving), threads which span several other threads without being interwoven with them, in a woven fabric.\n\n1. (Weaving)  Floating threads. See Floating threads, above. 2. The second coat of three-coat plastering. Knight."}