{"word":"flower","definition":"1. In the popular sense, the bloom or blossom of a plant; the showy portion, usually of a different color, shape, and texture from the foliage. 2. (Bot.)  That part of a plant destined to produce seed, and hence including one or both of the sexual organs; an organ or combination of the organs of reproduction, whether inclosed by a circle of foliar parts or not. A complete flower consists of two essential parts, the stamens and the pistil, and two floral envelopes, the corolla and callyx. In mosses the flowers consist of a few special leaves surrounding or subtending organs called archegonia. See Blossom, and Corolla. Note: If we examine a common flower, such for instance as a geranium, we shall find that it consists of: First, an outer envelope or calyx, sometimes tubular, sometimes consisting of separate leaves called sepals; secondly, an inner envelope or corolla, which is generally more or less colored, and which, like the calyx, is sometimes tubular, sometimes composed of separate leaves called petals; thirdly, one or more stamens, consisting of a stalk or filament and a head or anther, in which the pollen is produced; and fourthly, a pistil, which is situated in the center of the flower, and consists generally of three principal parts; one or more compartments at the base, each containing one or more seeds; the stalk or style; and the stigma, which in many familiar instances forms a small head, at the top of the style or ovary, and to which the pollen must find its way in order to fertilize the flower. Sir J. Lubbock. 3. The fairest, freshest, and choicest part of anything; as, the flower of an army, or of a family; the state or time of freshness and bloom; as, the flower of life, that is, youth. The choice and flower of all things profitable the Psalms do more briefly contain. Hooker. The flower of the chivalry of all Spain. Southey. A simple maiden in her flower Is worth a hundred coats of arms. Tennyson. 4. Grain pulverized; meal; flour. [Obs.] The flowers of grains, mixed with water, will make a sort of glue. Arbuthnot. 5. pl. (Old. Chem.)  A substance in the form of a powder, especially when condensed from sublimation; as, the flowers of sulphur. 6. A figure of speech; an ornament of style. 7. pl. (Print.)  Ornamental type used chiefly for borders around pages, cards, etc. W. Savage. 8. pl.  Menstrual discharges. Lev. xv. 24. Animal flower (Zoöl.) See under Animal. -- Cut flowers, flowers cut from the stalk, as for making a bouquet. -- Flower bed, a plat in a garden for the cultivation of flowers. -- Flower beetle (Zoöl.), any beetle which feeds upon flowers, esp. any one of numerous small species of the genus Meligethes, family Nitidulidæ, some of which are injurious to crops. -- Flower bird (Zoöl.), an Australian bird of the genus Anthornis, allied to the honey eaters. -- Flower bud, an unopened flower. -- Flower clock, an assemblage of flowers which open and close at different hours of the day, thus indicating the time. -- Flower head (Bot.), a compound flower in which all the florets are sessile on their receptacle, as in the case of the daisy. -- Flower pecker (Zoöl.), one of a family (Dicæidæ) of small Indian and Australian birds. They resemble humming birds in habits. -- Flower piece. (a) A table ornament made of cut flowers. (b) (Fine Arts) A picture of flowers. -- Flower stalk (Bot.), the peduncle of a plant, or the stem that supports the flower or fructification.\n\n1. To blossom; to bloom; to expand the petals, as a plant; to produce flowers; as, this plant flowers in June. 2. To come into the finest or fairest condition. Their lusty and flowering age. Robynson (More's Utopia). When flowered my youthful spring. Spenser. 3. To froth; to ferment gently, as new beer. That beer did flower a little. Bacon. 4. To come off as flowers by sublimation. [Obs.] Observations which have flowered off. Milton.\n\nTo embellish with flowers; to adorn with imitated flowers; as, flowered silk."}