{"word":"flush","definition":"1. To flow and spread suddenly; to rush; as, blood flushes into the face. The flushing noise of many waters. Boyle. It flushes violently out of the cock. Mortimer. 2. To become suddenly suffused, as the cheeks; to turn red; to blush. 3. To snow red; to shine suddenly; to glow. In her cheek, distemper flushing glowed. Milton. 4. To star Flushing from one spray unto another. W. Browne.\n\n1. To cause to be full; to flood; to overflow; to overwhelm with water; as, to flush the meadows; to flood for the purpose of cleaning; as, to flush a sewer. 2. To cause the blood to rush into (the face); to put to the blush, or to cause to glow with excitement. Nor flush with shame the passing virgin's cheek. Gay. Sudden a thought came like a full-blown rose, Flushing his brow. Keats. 3. To make suddenly or temporarily red or rosy, as if suffused with blood. How faintly flushed. how phantom fair, Was Monte Rosa, hanging there! Tennyson. 4. To excite; to animate; to stir. Such things as can only feed his pride and flush his ambition. South. 5. To cause to start, as a hunter a bird. Nares. To flush a joints (Masonry), to fill them in; to point the level; to make them flush.\n\n1. A sudden flowing; a rush which fills or overflows, as of water for cleansing purposes. In manner of a wave or flush. Ray. 2. A suffusion of the face with blood, as from fear, shame, modesty, or intensity of feeling of any kind; a blush; a glow. The flush of angered shame. Tennyson. 3. Any tinge of red color like that produced on the cheeks by a sudden rush of blood; as, the flush on the side of a peach; the flush on the clouds at sunset. 4. A sudden flood or rush of feeling; a thrill of excitement. animation, etc.; as, a flush of joy. 5. A flock of birds suddenly started up or flushed. 6. Etym: [From F. or Sp. flux. Cf. Flux.]  A hand of cards of the same suit.\n\n1. Full of vigor; fresh; glowing; bright. With all his crimes broad blown, as flush as May. Shak. 2. Affluent; abounding; well furnished or suppled; hence, liberal; prodigal. Lord Strut was not very flush in ready. Arbuthnot. 3. (Arch. & Mech.)  Unbroken or even in surface; on a level with the adjacent surface; forming a continuous surface; as, a flush panel; a flush joint. 4. (Card Playing)  Consisting of cards of one suit. Flush bolt. (a) A screw bolt whose head is countersunk, so as to be flush with a surface. (b) A sliding bolt let into the face or edge of a door, so as to be flush therewith. -- Flush deck. (Naut.) See under Deck, n., 1. -- Flush tank, a water tank which can be emptied rapidly for flushing drainpipes, etc.\n\nSo as to be level or even."}