{"word":"flying","definition":"Moving in the air with, or as with, wings; moving lightly or rapidly; intended for rapid movement. Flying army (Mil.) a body of cavalry and infantry, kept in motion, to cover its own garrisons and to keep the enemy in continual alarm. Farrow. --Flying artillery (Mil.), artillery trained to rapid evolutions, -- the men being either mounted or trained to spring upon the guns and caissons when they change position. -- Flying bridge, Flying camp. See under Bridge, and Camp. -- Flying buttress (Arch.), a contrivance for taking up the thrust of a roof or vault which can not be supported by ordinary buttresses. It consists of a straight bar of masonry, usually sloping, carried on an arch, and a solid pier or buttress sufficient to receive the thrust. The word is generally applied only to the straight bar with supporting arch. -- Flying colors, flags unfurled and waving in the air; hence: To come off with flying colors, to be victorious; to succeed thoroughly in an undertaking. -- Flying doe (Zoöl.), a young female kangaroo. -- Flying dragon. (a) (Zoöl.) See Dragon, 6. (b) A meteor. See under Dragon. -- Flying Dutchman. (a) A fabled Dutch mariner condemned for his crimes to sail the seas till the day of judgment. (b) A spectral ship. -- Flying fish. (Zoöl.) See Flying fish, in the Vocabulary. -- Flying fox (Zoöl.), the colugo. -- Flying frog (Zoöl.), an East Indian tree frog of the genus Rhacophorus, having very large and broadly webbed feet, which serve as parachutes, and enable it to make very long leaps. -- Flying gurnard (Zoöl.), a species of gurnard of the genus Cephalacanthus or Dactylopterus, with very large pectoral fins, said to be able to fly like the flying fish, but not for so great a distance. Note: Three species are known; that of the Atlantic is Cephalacanthus volitans. -- Flying jib (Naut.), a sail extended outside of the standing jib, on the flying-jib boom. -- Flying-jib boom (Naut.), an extension of the jib boom. -- Flying kites (Naut.), light sails carried only in fine weather. -- Flying lemur. (Zoöl.) See Colugo. -- Flying level (Civil Engin.), a reconnoissance level over the course of a projected road, canal, etc. -- Flying lizard. (Zoöl.) See Dragon, n, 6. -- Flying machine, an apparatus for navigating the air; a form of balloon. -- Flying mouse (Zoöl.), the opossum mouse (Acrobates pygmæus), of Australia. Note: It has lateral folds of skin, like the flying squirrels. -- Flying party (Mil.), a body of soldiers detailed to hover about an enemy. -- Flying phalanger (Zoöl.), one of several species of small marsuupials of the genera Petaurus and Belideus, of Australia and New Guinea, having lateral folds like those of the flying squirrels. The sugar squirrel (B. sciureus), and the ariel (B. ariel), are the best known; -- called also squirrel petaurus and flying squirrel. See Sugar squirrel. -- Flying pinion, the fly of a clock. -- Flying sap (Mil.), the rapid construction of trenches (when the enemy's fire of case shot precludes the method of simple trenching), by means of gabions placed in juxtaposition and filled with earth. -- Flying shot, a shot fired at a moving object, as a bird on the wing. -- Flying spider. (Zoöl.) See Ballooning spider. -- Flying squid (Zoöl.), an oceanic squid (Ommastrephes, or Sthenoteuthis, Bartramii), abundant in the Gulf Stream, which is able to leap out of the water with such force that it often falls on the deck of a vessel. -- Flying squirrel (Zoöl.) See Flying squirrel, in the Vocabulary. -- Flying start, a start in a sailing race in which the signal is given while the vessels are under way. -- Flying torch (Mil.), a torch attached to a long staff and used for signaling at night."}