{"word":"foot","definition":"1. (Anat.)  The terminal part of the leg of man or an animal; esp., the part below the ankle or wrist; that part of an animal upon which it rests when standing, or moves. See Manus, and Pes. 2. (Zoöl.)  The muscular locomotive organ of a mollusk. It is a median organ arising from the ventral region of body, often in the form of a flat disk, as in snails. See Illust. of Buccinum. 3. That which corresponds to the foot of a man or animal; as, the foot of a table; the foot of a stocking. 4. The lowest part or base; the ground part; the bottom, as of a mountain or column; also, the last of a row or series; the end or extremity, esp. if associated with inferiority; as, the foot of a hill; the foot of the procession; the foot of a class; the foot of the bed. And now at foot Of heaven's ascent they lift their feet. Milton. 5. Fundamental principle; basis; plan; -- used only in the singular. Answer directly upon the foot of dry reason. Berkeley. 6. Recognized condition; rank; footing; -- used only in the singular. [R.] As to his being on the foot of a servant. Walpole. 7. A measure of length equivalent to twelve inches; one third of a yard. See Yard. Note: This measure is supposed to be taken from the length of a man's foot. It differs in length in different countries. In the United States and in England it is 304.8 millimeters. 8. (Mil.)  Soldiers who march and fight on foot; the infantry, usually designated as the foot, in distinction from the cavalry. \"Both horse and foot.\" Milton. 9. (Pros.)  A combination of syllables consisting a metrical element of a verse, the syllables being formerly distinguished by their quantity or length, but in modern poetry by the accent. 10. (Naut.)  The lower edge of a sail. Note: Foot is often used adjectively, signifying of or pertaining to a foot or the feet, or to the base or lower part. It is also much used as the first of compounds. Foot artillery. (Mil.) (a) Artillery soldiers serving in foot. (b) Heavy artillery. Farrow. -- Foot bank (Fort.), a raised way within a parapet. -- Foot barracks (Mil.), barracks for infantery. -- Foot bellows, a bellows worked by a treadle. Knight. -- Foot company (Mil.), a company of infantry. Milton. -- Foot gear, covering for the feet, as stocking, shoes, or boots. -- Foot hammer (Mach.), a small tilt hammer moved by a treadle. -- Foot iron. (a) The step of a carriage. (b) A fetter. -- Foot jaw. (Zoöl.) See Maxilliped. -- Foot key (Mus.), an organ pedal. -- Foot level (Gunnery), a form of level used in giving any proposed angle of elevation to a piece of ordnance. Farrow. -- Foot mantle, a long garment to protect the dress in riding; a riding skirt. [Obs.] -- Foot page, an errand boy; an attendant. [Obs.] -- Foot passenger, one who passes on foot, as over a road or bridge. -- Foot pavement, a paved way for foot passengers; a footway; a trottoir. -- Foot poet, an inferior poet; a poetaster. [R.] Dryden. -- Foot post. (a) A letter carrier who travels on foot. (b) A mail delivery by means of such carriers. -- Fot pound, and Foot poundal. (Mech.) See Foot pound and Foot poundal, in the Vocabulary. -- Foot press (Mach.), a cutting, embossing, or printing press, moved by a treadle. -- Foot race, a race run by persons on foot. Cowper. -- Foot rail, a railroad rail, with a wide flat flange on the lower side. -- Foot rot, an ulcer in the feet of sheep; claw sickness. -- Foot rule, a rule or measure twelve inches long. -- Foot screw, an adjusting screw which forms a foot, and serves to give a machine or table a level standing on an uneven place. -- Foot secretion. (Zoöl.) See Sclerobase. -- Foot soldier, a soldier who serves on foot. -- Foot stick (Printing), a beveled piece of furniture placed against the foot of the page, to hold the type in place. -- Foot stove, a small box, with an iron pan, to hold hot coals for warming the feet. -- Foot tubercle. (Zoöl.) See Parapodium. -- Foot valve (Steam Engine), the valve that opens to the air pump from the condenser. -- Foot vise, a kind of vise the jaws of which are operated by a treadle. -- Foot waling (Naut.), the inside planks or lining of a vessel over the floor timbers. Totten. -- Foot wall (Mining), the under wall of an inclosed vein. By foot, or On foot, by walking; as, to pass a stream on foot. -- Cubic foot. See under Cubic. -- Foot and mouth disease, a contagious disease (Eczema epizoötica) of cattle, sheep, swine, etc., characterized by the formation of vesicles and ulcers in the mouth and about the hoofs. -- Foot of the fine (Law), the concluding portion of an acknowledgment in court by which, formerly, the title of land was conveyed. See Fine of land, under Fine, n.; also Chirograph. (b). -- Square foot. See under Square. -- To be on foot, to be in motion, action, or process of execution. -- To keep the foot (Script.), to preserve decorum. \"Keep thy foot when thou goest to the house of God.\" Eccl. v. 1. -- To put one's foot down, to take a resolute stand; to be determined. [Colloq.] -- To put the best foot foremost, to make a good appearance; to do one's best. [Colloq.] -- To set on foot, to put in motion; to originate; as, to set on foot a subscription. -- To put, or set, one on his feet, to put one in a position to go on; to assist to start. -- Under foot. (a) Under the feet; (Fig.) at one's mercy; as, to trample under foot. Gibbon. (b) Below par. [Obs.] \"They would be forced to sell . . . far under foot.\" Bacon.\n\n1. To tread to measure or music; to dance; to trip; to skip. Dryden. 2. To walk; -- opposed to ride or fly. Shak.\n\n1. To kick with the foot; to spurn. Shak. 2. To set on foot; to establish; to land. [Obs.] What confederacy have you with the traitors Late footed in the kingdom Shak. 3. To tread; as, to foot the green. Tickell. 4. To sum up, as the numbers in a column; -- sometimes with up; as, to foot (or foot up) an account. 5. The size or strike with the talon. [Poet.] Shak. 6. To renew the foot of, as of stocking. Shak. To foot a bill, to pay it. [Colloq.] -- To foot it, to walk; also, to dance. If you are for a merry jaunt, I'll try, for once, who can foot it farthest. Dryden."}