{"word":"formal","definition":"1. Belonging to the form, shape, frame, external appearance, or organization of a thing. 2. Belonging to the constitution of a thing, as distinguished from the matter composing it; having the power of making a thing what it is; constituent; essential; pertaining to oe depending on the forms, so called of the human intellect. Of [the sounds represented by] letters, the material part is breath and voice; the formal is constituted by the motion and figure of the organs of speech. Holder. 3. Done is due form, or with solemnity; according to regular method; not incidental, sudden or irregular; express; as, he gave his formal consent. His obscure funeral . . . No noble rite nor formal ostentation. Shak. 4. Devoted to, or done in accordance with, forms or rules; punctilious; regular; orderly; methodical; of a prescribed form; exact; prim; stiff; ceremonious; as, a man formal in his dress, his gait, his conversation. A cold-looking, formal garden, cut into angles and rhomboids. W. Irwing. She took off the formal cap that confined her hair. Hawthorne. 5. Having the form or appearance without the substance or essence; external; as, formal duty; formal worship; formal courtesy, etc. 6. Dependent in form; conventional. Still in constraint your suffering sex remains, Or bound in formal or in real chains. Pope. 7. Sound; normal. [Obs.] To make of him a formal man again. Shak. Formal cause. See under Cause. Syn. -- Precise; punctilious; stiff; starched; affected; ritual; ceremonial; external; outward. -- Formal, Ceremonious. When applied to things, these words usually denote a mere accordance with the rules of form or ceremony; as, to make a formal call; to take a ceremonious leave. When applied to a person or his manners, they are used in a bad sense; a person being called formal who shapes himself too much by some pattern or set form, and ceremonious when he lays too much stress on the conventional laws of social intercourse. Formal manners render a man stiff or ridiculous; a ceremonious carriage puts a stop to the ease and freedom of social intercourse."}