{"word":"form","definition":"A suffix used to denote in the form or shape of, resembling, etc.; as, valiform; oviform.\n\n1. The shape and structure of anything, as distinguished from the material of which it is composed; particular disposition or arrangement of matter, giving it individuality or distinctive character; configuration; figure; external appearance. The form of his visage was changed. Dan. iii. 19. And woven close close, both matter, form, and style. Milton. 2. Constitution; mode of construction, organization, etc.; system; as, a republican form of government. 3. Established method of expression or practice; fixed way of proceeding; conventional or stated scheme; formula; as, a form of prayer. Those whom form of laws Condemned to die. Dryden. 4. Show without substance; empty, outside appearance; vain, trivial, or conventional ceremony; conventionality; formality; as, a matter of mere form. Though well we may not pass upon his life Without the form of justice. Shak. 5. Orderly arrangement; shapeliness; also, comeliness; elegance; beauty. The earth was without form and void. Gen. i. 2. He hath no form nor comeliness. Is. liii. 2. 6. A shape; an image; a phantom. 7. That by which shape is given or determined; mold; pattern; model. 8. A long seat; a bench; hence, a rank of students in a school; a class; also, a class or rank in society. \"Ladies of a high form.\" Bp. Burnet. 9. The seat or bed of a hare. As in a form sitteth a weary hare. Chaucer. 10. (Print.)  The type or other matter from which an impression is to be taken, arranged and secured in a chase. 11. (Fine Arts)  The boundary line of a material object. In painting, more generally, the human body. 12. (Gram.)  The particular shape or structure of a word or part of speech; as, participial forms; verbal forms. 13. (Crystallog.)  The combination of planes included under a general crystallographic symbol. It is not necessarily a closed solid. 14. (Metaph.)  That assemblage or disposition of qualities which makes a conception, or that internal constitution which makes an existing thing to be what it is; -- called essential or substantial form, and contradistinguished from matter; hence, active or formative nature; law of being or activity; subjectively viewed, an idea; objectively, a law. 15. Mode of acting or manifestation to the senses, or the intellect; as, water assumes the form of ice or snow. In modern usage, the elements of a conception furnished by the mind's own activity, as contrasted with its object or condition, which is called the matter; subjectively, a mode of apprehension or belief conceived as dependent on the constitution of the mind; objectively, universal and necessary accompaniments or elements of every object known or thought of. 16. (Biol.)  The peculiar characteristics of an organism as a type of others; also, the structure of the parts of an animal or plant. Good form or Bad form, the general appearance, condition or action, originally of horses, atterwards of persons; as, the members of a boat crew are said to be in good form when they pull together uniformly. The phrases are further used colloquially in description of conduct or manners in society; as, it is not good form to smoke in the presence of a lady.\n\n1. To give form or shape to; to frame; to construct; to make; to fashion. God formed man of the dust of the ground. Gen. ii. 7. The thought that labors in my forming brain. Rowe. 2. To give a particular shape to; to shape, mold, or fashion into a certain state or condition; to arrange; to adjust; also, to model by instruction and discipline; to mold by influence, etc.; to train. 'T is education forms the common mind. Pope. Thus formed for speed, he challenges the wind. Dryden. 3. To go to make up; to act as constituent of; to be the essential or constitutive elements of; to answer for; to make the shape of; -- said of that out of which anything is formed or constituted, in whole or in part. The diplomatic politicians . . . who formed by far the majority. Burke. 4. To provide with a form, as a hare. See Form, n., 9. The melancholy hare is formed in brakes and briers. Drayton. 5. (Gram.)  To derive by grammatical rules, as by adding the proper suffixes and affixes.\n\n1. To take a form, definite shape, or arrangement; as, the infantry should form in column. 2. To run to a form, as a hare. B. Jonson. To form on (Mil.), to form a lengthened line with reference to (any given object) as a basis."}