{"word":"free","definition":"1. Exempt from subjection to the will of others; not under restraint, control, or compulsion; able to follow one's own impulses, desires, or inclinations; determining one's own course of action; not dependent; at liberty. That which has the power, or not the power, to operate, is that alone which is or is not free. Locke. 2. Not under an arbitrary or despotic government; subject only to fixed laws regularly and fairly administered, and defended by them from encroachments upon natural or acquired rights; enjoying political liberty. 3. Liberated, by arriving at a certain age, from the control of parents, guardian, or master. 4. Not confined or imprisoned; released from arrest; liberated; at liberty to go. Set an unhappy prisoner free. Prior. 5. Not subjected to the laws of physical necessity; capable of voluntary activity; endowed with moral liberty; -- said of the will. Not free, what proof could they have given sincere Of true allegiance, constant faith, or love. Milton. 6. Clear of offense or crime; guiltless; innocent. My hands are guilty, but my heart is free. Dryden. 7. Unconstrained by timidity or distrust; unreserved; ingenuous; frank; familiar; communicative. He was free only with a few. Milward. 8. Unrestrained; immoderate; lavish; licentious; -- used in a bad sense. The critics have been very free in their censures. Felton. A man may live a free life as to wine or women. Shelley. 9. Not close or parsimonious; liberal; open-handed; lavish; as, free with his money. 10. Exempt; clear; released; liberated; not encumbered or troubled with; as, free from pain; free from a burden; -- followed by from, or, rarely, by of. Princes declaring themselves free from the obligations of their treaties. Bp. Burnet. 11. Characteristic of one acting without restraint; charming; easy. 12. Ready; eager; acting without spurring or whipping; spirited; as, a free horse. 13. Invested with a particular freedom or franchise; enjoying certain immunities or privileges; admitted to special rights; -- followed by of. He therefore makes all birds, of every sect, Free of his farm. Dryden. 14. Thrown open, or made accessible, to all; to be enjoyed without limitations; unrestricted; not obstructed, engrossed, or appropriated; open; -- said of a thing to be possessed or enjoyed; as, a free school. Why, sir, I pray, are not the streets as free For me as for you Shak. 15. Not gained by importunity or purchase; gratuitous; spontaneous; as, free admission; a free gift. 16. Not arbitrary or despotic; assuring liberty; defending individual rights against encroachment by any person or class; instituted by a free people; -- said of a government, institutions, etc. 17. (O. Eng. Law)  Certain or honorable; the opposite of base; as, free service; free socage. Burrill. 18. (Law)  Privileged or individual; the opposite of common; as, a free fishery; a free warren. Burrill. 19. Not united or combined with anything else; separated; dissevered; unattached; at liberty to escape; as, free carbonic acid gas; free cells. Free agency, the capacity or power of choosing or acting freely, or without necessity or constraint upon the will. -- Free bench (Eng. Law), a widow's right in the copyhold lands of her husband, corresponding to dower in freeholds. -- Free board (Naut.), a vessel's side between water line and gunwale. -- Free bond (Chem.), an unsaturated or unemployed unit, or bond, of affinity or valence, of an atom or radical. -- Free-borough men (O.Eng. Law). See Friborg. -- Free chapel (Eccles.), a chapel not subject to the jurisdiction of the ordinary, having been founded by the king or by a subject specially authorized. [Eng.] Bouvier. -- Free charge (Elec.), a charge of electricity in the free or statical condition; free electricity. -- Free church. (a) A church whose sittings are for all and without charge. (b) An ecclesiastical body that left the Church of Scotland, in 1843, to be free from control by the government in spiritual matters. -- Free city, or Free town, a city or town independent in its government and franchises, as formerly those of the Hanseatic league. -- Free cost, freedom from charges or expenses. South. -- Free and easy, unconventional; unrestrained; regardless of formalities. [Colloq.] \"Sal and her free and easy ways.\" W. Black. -- Free goods, goods admitted into a country free of duty. -- Free labor, the labor of freemen, as distinguished from that of slaves. -- Free port. (Com.) (a) A port where goods may be received and shipped free of custom duty. (b) A port where goods of all kinds are received from ships of all nations at equal rates of duty. -- Free public house, in England, a tavern not belonging to a brewer, so that the landlord is free to brew his own beer or purchase where he chooses. Simmonds. -- Free school. (a) A school to which pupils are admitted without discrimination and on an equal footing. (b) A school supported by general taxation, by endowmants, etc., where pupils pay nothing for tuition; a public school. -- Free services (O.Eng. Law), such feudal services as were not unbecoming the character of a soldier or a freemen to perform; as, to serve under his lord in war, to pay a sum of money, etc. Burrill. -- Free ships, ships of neutral nations, which in time of war are free from capture even though carrying enemy's goods. -- Free socage (O.Eng. Law), a feudal tenure held by certain services which, though honorable, were not military. Abbott. -- Free States, those of the United States before the Civil War, in which slavery had ceased to exist, or had never existed. -- Free stuff (Carp.), timber free from knots; clear stuff. -- Free thought, that which is thought independently of the authority of others. -- Free trade, commerce unrestricted by duties or tariff regulations. -- Free trader, one who believes in free trade. -- To make free with, to take liberties with; to help one's self to. [Colloq.] -- To sail free (Naut.), to sail with the yards not braced in as sharp as when sailing closehauled, or close to the wind.\n\n1. Freely; willingly. [Obs.] I as free forgive you As I would be forgiven. Shak. 2. Without charge; as, children admitted free.\n\n1. To make free; to set at liberty; to rid of that which confines, limits, embarrasses, oppresses, etc.; to release; to disengage; to clear; -- followed by from, and sometimes by off; as, to free a captive or a slave; to be freed of these inconveniences. Clarendon. Our land is from the rage of tigers freed. Dryden. Arise, . . . free thy people from their yoke. Milton. 2. To remove, as something that confines or bars; to relieve from the constraint of. This master key Frees every lock, and leads us to his person. Dryden. 3. To frank. [Obs.] Johnson."}