{"word":"fret","definition":"See 1st Frith.\n\n1. To devour. [Obs.] The sow frete the child right in the cradle. Chaucer. 2. To rub; to wear away by friction; to chafe; to gall; hence, to eat away; to gnaw; as, to fret cloth; to fret a piece of gold or other metal; a worm frets the plants of a ship. With many a curve my banks I fret. Tennyson. 3. To impair; to wear away; to diminish. By starts His fretted fortunes give him hope and fear. Shak. 4. To make rough, agitate, or disturb; to cause to ripple; as, to fret the surface of water. 5. To tease; to irritate; to vex. Fret not thyself because of evil doers. Ps. xxxvii. 1.\n\n1. To be worn away; to chafe; to fray; as, a wristband frets on the edges. 2. To eat in; to make way by corrosion. Many wheals arose, and fretted one into another with great excoriation. Wiseman. 3. To be agitated; to be in violent commotion; to rankle; as, rancor frets in the malignant breast. 4. To be vexed; to be chafed or irritated; to be angry; to utter peevish expressions. He frets, he fumes, he stares, he stamps the ground. Dryden.\n\n1. The agitation of the surface of a fluid by fermentation or other cause; a rippling on the surface of water. Addison. 2. Agitation of mind marked by complaint and impatience; disturbance of temper; irritation; as, he keeps his mind in a continual fret. Yet then did Dennis rave in furious fret. Pope. 3. Herpes; tetter. Dunglison. 4. pl. (Mining)  The worn sides of river banks, where ores, or stones containing them, accumulate by being washed down from the hills, and thus indicate to the miners the locality of the veins.\n\nTo ornament with raised work; to variegate; to diversify. Whose skirt with gold was fretted all about. Spenser. Yon gray lines, That fret the clouds, are messengers of day. Shak.\n\n1. Ornamental work in relief, as carving or embossing. See Fretwork. 2. (Arch.)  An ornament consisting of smmall fillets or slats intersecting each other or bent at right angles, as in classical designs, or at obilique angles, as often in Oriental art. His lady's cabinet is a adorned on the fret, ceiling, and chimney- piece with . . . carving. Evelyn. 3. The reticulated headdress or net, made of gold or silver wire, in which ladies in the Middle Ages confined their hair. A fret of gold she had next her hair. Chaucer. Fret saw, a saw with a long, narrow blade, used in cutting frets, scrolls, etc.; a scroll saw; a keyhole saw; a compass saw.\n\n1. (Her.)  A saltire interlaced with a mascle. 2. (Mus.)  A short piece of wire, or other material fixed across the finger board of a guitar or a similar instrument, to indicate where the finger is to be placed.\n\nTo furnish with frets, as an instrument of music."}