{"word":"front","definition":"1. The forehead or brow, the part of the face above the eyes; sometimes, also, the whole face. Bless'd with his father's front, his mother's tongue. Pope. Grim-visaged war hath smoothed his wrinkled front. Shak. His front yet threatens, and his frowns command. Prior. 2. The forehead, countenance, or personal presence, as expressive of character or temper, and especially, of boldness of disposition, sometimes of impudence; seeming; as, a bold front; a hardened front. With smiling fronts encountering. Shak. The inhabitants showed a bold front. Macaulay. 3. The part or surface of anything which seems to look out, or to be directed forward; the fore or forward part; the foremost rank; the van; -- the opposite to back or rear; as, the front of a house; the front of an army. Had he his hurts before Ay, on the front. Shak. 4. A position directly before the face of a person, or before the foremost part of a thing; as, in front of un person, of the troops, or of a house. 5. The most conspicuous part. The very head and front of my offending. Shak. 6. That which covers the foremost part of the head: a front piece of false hair worn by women. Like any plain Miss Smith's, who wears s front. Mrs. Browning. 7. The beginning. \"Summer's front.\" Shak. Bastioned front (Mil.), a curtain connerting two half bastions. -- Front door, the door in the front wall of a building, usually the principal entrance. -- Front of fortification, the works constructed upon any one side of a polygon. Farrow. -- Front of operations, all that part of the field of operations in front of the successive positions occupied by the army as it moves forward. Farrow. -- To come to the front, to attain prominence or leadership.\n\nOf or relating to the front or forward part; having a position in front; foremost; as, a front view.\n\n1. To oppose face to face; to oppose directly; to meet in a hostile manner. You four shall front them in the narrow lane. Shak. 2. To appear before; to meet. [Enid] daily fronted him In some fresh splendor. Tennyson. 3. To face toward; to have the front toward; to confront; as, the house fronts the street. And then suddenly front the changed reality. J. Morley. 4. To stand opposed or opposite to, or over against as, his house fronts the church. 5. To adorn in front; to supply a front to; as, to front a house with marble; to front a head with laurel. Yonder walls, that pertly front your town. Shak.\n\nTo have or turn the face or front in any direction; as, the house fronts toward the east."}