{"word":"function","definition":"1. The act of executing or performing any duty, office, or calling; per formance. \"In the function of his public calling.\" Swift. 2. (Physiol.)  The appropriate action of any special organ or part of an animal or vegetable organism; as, the function of the heart or the limbs; the function of leaves, sap, roots, etc.; life is the sum of the functions of the various organs and parts of the body. 3. The natural or assigned action of any power or faculty, as of the soul, or of the intellect; the exertion of an energy of some determinate kind. As the mind opens, and its functions spread. Pope. 4. The course of action which peculiarly pertains to any public officer in church or state; the activity appropriate to any business or profession. Tradesmen . . . going about their functions. Shak. The malady which made him incapable of performing his regal functions. Macaulay. 5. (Math.)  A quantity so connected with another quantity, that if any alteration be made in the latter there will be a consequent alteration in the former. Each quantity is said to be a function of the other. Thus, the circumference of a circle is a function of the diameter. If x be a symbol to which different numerical values can be assigned, such expressions as x2, 3x, Log. x, and Sin. x, are all functions of x. Algebraic function, a quantity whose connection with the variable is expressed by an equation that involves only the algebraic operations of addition, subtraction, multiplication, division, raising to a given power, and extracting a given root; -- opposed to transcendental function. -- Arbitrary function. See under Arbitrary. -- Calculus of functions. See under Calculus. -- Carnot's function (Thermo-dynamics), a relation between the amount of heat given off by a source of heat, and the work which can be done by it. It is approximately equal to the mechanical equivalent of the thermal unit divided by the number expressing the temperature in degrees of the air thermometer, reckoned from its zero of expansion. -- Circular functions. See Inverse trigonometrical functions (below). -- Continuous function, a quantity that has no interruption in the continuity of its real values, as the variable changes between any specified limits. -- Discontinuous function. See under Discontinuous. -- Elliptic functions, a large and important class of functions, so called because one of the forms expresses the relation of the arc of an ellipse to the straight lines connected therewith. -- Explicit function, a quantity directly expressed in terms of the independently varying quantity; thus, in the equations y = 6x2, y = 10 -x3, the quantity y is an explicit function of x. -- Implicit function, a quantity whose relation to the variable is expressed indirectly by an equation; thus, y in the equation x2 + y2 = 100 is an implicit function of x. -- Inverse trigonometrical functions, or Circular function, the lengths of arcs relative to the sines, tangents, etc. Thus, AB is the arc whose sine is BD, and (if the length of BD is x) is written sin - 1x, and so of the other lines. See Trigonometrical function (below). Other transcendental functions are the exponential functions, the elliptic functions, the gamma functions, the theta functions, etc. -- One-valued function, a quantity that has one, and only one, value for each value of the variable. -- Transcendental functions, a quantity whose connection with the variable cannot be expressed by algebraic operations; thus, y in the equation y = 10x is a transcendental function of x. See Algebraic function (above). -- Trigonometrical function, a quantity whose relation to the variable is the same as that of a certain straight line drawn in a circle whose radius is unity, to the length of a corresponding are of the circle. Let AB be an arc in a circle, whose radius OA is unity let AC be a quadrant, and let OC, DB, and AF be drawnpependicular to OA, and EB and CG parallel to OA, and let OB be produced to G and F. E Then BD is the sine of the arc AB; OD or EB is the cosine, AF is the tangent, CG is the cotangent, OF is the secant OG is the cosecant, AD is the versed sine, and CE is the coversed sine of the are AB. If the length of AB be represented by x (OA being unity) then the lengths of Functions. these lines (OA being unity) are the trigonometrical functions of x, and are written sin x, cos x, tan x (or tang x), cot x, sec x, cosec x, versin x, coversin x. These quantities are also considered as functions of the angle BOA.\n\nTo execute or perform a function; to transact one's regular or appointed business."}