{"word":"garden","definition":"1. A piece of ground appropriates to the cultivation of herbs, fruits, flowers, or vegetables. 2. A rich, well-cultivated spot or tract of country. I am arrived from fruitful Lombardy, The pleasant garden of great Italy. Shak. Note: Garden is often used adjectively or in self-explaining compounds; as, garden flowers, garden tools, garden walk, garden wall, garden house or gardenhouse. Garden balsam, an ornamental plant (Impatiens Balsamina). -- Garden engine, a wheelbarrow tank and pump for watering gardens. -- Garden glass. (a) A bell glass for covering plants. (b) A globe of dark-colored glass, mounted on a pedestal, to reflect surrounding objects; -- much used as an ornament in gardens in Germany. -- Garden house (a) A summer house. Beau & Fl. (b) A privy. [Southern U.S.] -- Garden husbandry, the raising on a small scale of seeds, fruits, vegetables, etc., for sale. -- Garden mold or mould, rich, mellow earth which is fit for a garden. Mortimer. -- Garden nail, a cast nail used, for fastening vines to brick walls. Knight. -- Garden net, a net for covering fruits trees, vines, etc., to protect them from birds. -- Garden party, a social party held out of doors, within the grounds or garden attached to a private residence. -- Garden plot, a plot appropriated to a garden. Garden pot, a watering pot. -- Garden pump, a garden engine; a barrow pump. -- Garden shears, large shears, for clipping trees and hedges, pruning, etc. -- Garden spider, (Zoöl.), the diadem spider (Epeira diadema), common in gardens, both in Europe and America. It spins a geometrical web. See Geometric spider, and Spider web. -- Garden stand, a stand for flower pots. -- Garden stuff, vegetables raised in a garden. [Colloq.] -- Garden syringe, a syringe for watering plants, sprinkling them with solutions for destroying insects, etc. -- Garden truck, vegetables raised for the market. [Colloq.] -- Garden ware, garden truck. [Obs.] Mortimer. -- Bear garden, Botanic garden, etc. See under Bear, etc. -- Hanging garden. See under Hanging. -- Kitchen garden, a garden where vegetables are cultivated for household use. -- Market garden, a piece of ground where vegetable are cultivated to be sold in the markets for table use.\n\nTo lay out or cultivate a garden; to labor in a garden; to practice horticulture.\n\nTo cultivate as a garden."}