{"word":"gate","definition":"1. A large door or passageway in the wall of a city, of an inclosed field or place, or of a grand edifice, etc.; also, the movable structure of timber, metal, etc., by which the passage can be closed. 2. An opening for passage in any inclosing wall, fence, or barrier; or the suspended framework which closes or opens a passage. Also, figuratively, a means or way of entrance or of exit. Knowest thou the way to Dover Both stile and gate, horse way and footpath. Shak. Opening a gate for a long war. Knolles. 3. A door, valve, or other device, for stopping the passage of water through a dam, lock, pipe, etc. 4. (Script.)  The places which command the entrances or access; hence, place of vantage; power; might. The gates of hell shall not prevail against it. Matt. xvi. 18. 5. In a lock tumbler, the opening for the stump of the bolt to pass through or into. 6. (Founding) (a) The channel or opening through which metal is poured into the mold; the ingate. (b) The waste piece of metal cast in the opening; a sprue or sullage piece. [Written also geat and git.] Gate chamber, a recess in the side wall of a canal lock, which receives the opened gate. -- Gate channel. See Gate, 5. -- Gate hook, the hook-formed piece of a gate hinge. -- Gate money, entrance money for admission to an inclosure. -- Gate tender, one in charge of a gate, as at a railroad crossing. -- Gate valva, a stop valve for a pipe, having a sliding gate which affords a straight passageway when open. -- Gate vein (Anat.), the portal vein. -- To break gates (Eng. Univ.), to enter a college inclosure after the hour to which a student has been restricted. -- To stand in the gate, or gates, to occupy places or advantage, power, or defense.\n\n1. To supply with a gate. 2. (Eng. Univ.) To punish by requiring to be within the gates at an earlier hour than usual.\n\n1. A way; a path; a road; a street (as in Highgate). [O. Eng. & Scot.] I was going to be an honest man; but the devil has this very day flung first a lawyer, and then a woman, in my gate. Sir W. Scott. 2. Manner; gait. [O. Eng. & Scot.]"}