{"word":"gather","definition":"1. To bring together; to collect, as a number of separate things, into one place, or into one aggregate body; to assemble; to muster; to congregate. And Belgium's capital had gathered them Her beauty and her chivalry. Byron. When he had gathered all the chief priests and scribes of the people together. Matt. ii. 4. 2. To pick out and bring together from among what is of less value; to collect, as a harvest; to harvest; to cull; to pick off; to pluck. A rose just gathered from the stalk. Dryden. Do men gather grapes of thorns, or figs of thistles Matt. vii. 16. Gather us from among the heathen. Ps. cvi. 47. 3. To accumulate by collecting and saving little by little; to amass; to gain; to heap up. He that by usury and unjust gain increaseth his substance, he shall gather it for him that will pity the poor. Prov. xxviii. 8. To pay the creditor . . . he must gather up money by degrees. Locke. 4. To bring closely together the parts or particles of; to contract; to compress; to bring together in folds or plaits, as a garment; also, to draw together, as a piece of cloth by a thread; to pucker; to plait; as, to gather a ruffle. Gathering his flowing robe, he seemed to stand In act to speak, and graceful stretched his hand. Pope. 5. To derive, or deduce, as an inference; to collect, as a conclusion, from circumstances that suggest, or arguments that prove; to infer; to conclude. Let me say no moreGather the sequel by that went before. Shak. 6. To gain; to win. [Obs.] He gathers ground upon her in the chase. Dryden. 7. (Arch.)  To bring together, or nearer together, in masonry, as where the width of a fireplace is rapidly diminished to the width of the flue, or the like. 8. (Naut.)  To haul in; to take up; as, to gather the slack of a rope. To be gathered to one's people, or to one's fathers to die. Gen. xxv. 8. -- To gather breath, to recover normal breathing after being out of breath; to get breath; to rest. Spenser. -- To gather one's self together, to collect and dispose one's powers for a great effort, as a beast crouches preparatory to a leap. -- To gather way (Naut.), to begin to move; to move with increasing speed.\n\n1. To come together; to collect; to unite; to become assembled; to congregate. When small humors gather to a gout. Pope. Tears from the depth of some divine despair Rise in the heart, and gather to the eyes. Tennyson. 2. To grow larger by accretion; to increase. Their snowball did not gather as it went. Bacon. 3. To concentrate; to come to a head, as a sore, and generate pus; as, a boil has gathered. 4. To collect or bring things together. Thou knewest that I reap where I sowed not, and gather where I have not strewed. Matt. xxv. 26.\n\n1. A plait or fold in cloth, made by drawing a thread through it; a pucker. 2. (Carriage Making)  The inclination forward of the axle journals to keep the wheels from working outward. 3. (Arch.)  The soffit or under surface of the masonry required in gathering. See Gather, v. t., 7."}