{"word":"general","definition":"1. Relating to a genus or kind; pertaining to a whole class or order; as, a general law of animal or vegetable economy. 2. Comprehending many species or individuals; not special or particular; including all particulars; as, a general inference or conclusion. 3. Not restrained or limited to a precise import; not specific; vague; indefinite; lax in signification; as, a loose and general expression. 4. Common to many, or the greatest number; widely spread; prevalent; extensive, though not universal; as, a general opinion; a general custom. This general applause and cheerful sShak. 5. Having a relation to all; common to the whole; as, Adam, our general sire. Milton. 6. As a whole; in gross; for the most part. His general behavior vain, ridiculous. Shak. 7. Usual; common, on most occasions; as, his general habit or method. Note: The word general, annexed to a name of office, usually denotes chief or superior; as, attorney-general; adjutant general; commissary general; quartermaster general; vicar-general, etc. General agent (Law), an agent whom a principal employs to transact all his business of a particular kind, or to act in his affairs generally. -- General assembly. See the Note under Assembly. -- General average, General Court. See under Average, Court. -- General court-martial (Mil.), the highest military and naval judicial tribunal. -- General dealer (Com.), a shopkeeper who deals in all articles in common use. -- General demurrer (Law), a demurrer which objects to a pleading in general terms, as insufficient, without specifying the defects. Abbott. -- General epistle, a canonical epistle. -- General guides (Mil.), two sergeants (called the right, and the left, general guide) posted opposite the right and left flanks of an infantry battalion, to preserve accuracy in marching. Farrow. -- General hospitals (Mil.), hospitals established to receive sick and wounded sent from the field hospitals. Farrow. General issue (Law), an issue made by a general plea, which traverses the whole declaration or indictment at once, without offering any special matter to evade it. Bouvier. Burrill. -- General lien (Law), a right to detain a chattel, etc., until payment is made of any balance due on a general account. -- General officer (Mil.), any officer having a rank above that of colonel. -- General orders (Mil.), orders from headquarters published to the whole command. -- General practitioner, in the United States, one who practices medicine in all its branches without confining himself to any specialty; in England, one who practices both as physician and as surgeon. -- General ship, a ship not chartered or let to particular parties. -- General term (Logic), a term which is the sign of a general conception or notion. -- General verdict (Law), the ordinary comprehensive verdict in civil actions, \"for the plaintiff\" or \"for the defendant\". Burrill. -- General warrant (Law), a warrant, now illegal, to apprehend suspected persons, without naming individuals. Syn. General, Common, Universal. Common denotes primarily that in which many share; and hence, that which is often met with. General is stronger, denoting that which pertains to a majority of the individuals which compose a genus, or whole. Universal, that which pertains to all without exception. To be able to read and write is so common an attainment in the United States, that we may pronounce it general, though by no means universal. Syn: Gen\"er*al, n. Etym: [F. général. See General., a.] 1. The whole; the total; that which comprehends or relates to all, or the chief part; -- opposed to particular. In particulars our knowledge begins, and so spreads itself by degrees to generals. Locke. 2. (Mil.)  One of the chief military officers of a government or country; the commander of an army, of a body of men not less than a brigade. In European armies, the highest military rank next below field marshal. Note: In the United States the office of General of the Army has been created by temporary laws, and has been held only by Generals U. S. Grant, W. T. Sherman, and P. H. Sheridan. Popularly, the title General is given to various general officers, as General, Lieutenant general, Major general, Brigadier general, Commissary general, etc. See Brigadier general, Lieutenant general, Major general, in the Vocabulary. 3. (Mil.)  The roll of the drum which calls the troops together; as, to beat the general. 4. (Eccl.)  The chief of an order of monks, or of all the houses or congregations under the same rule. 5. The public; the people; the vulgar. [Obs.] Shak. In general, in the main; for the most part."}