{"word":"genius","definition":"1. A good or evil spirit, or demon, supposed by the ancients to preside over a man's destiny in life; a tutelary deity; a supernatural being; a spirit, good or bad. Cf. Jinnee. The unseen genius of the wood. Milton. We talk of genius still, but with thought how changed! The genius of Augustus was a tutelary demon, to be sworn by and to receive offerings on an altar as a deity. Tylor. 2. The peculiar structure of mind with whoch each individual is endowed by nature; that disposition or aptitude of mind which is peculiar to each man, and which qualifies him for certain kinds of action or special success in any pursuit; special taste, inclination, or disposition; as, a genius for history, for poetry, or painting. 3. Peculiar character; animating spirit, as of a nation, a religion, a language. 4. Distinguished mental superiority; uncommon intellectual power; especially, superior power of invention or origination of any kind, or of forming new combinations; as, a man of genius. Genius of the highest kind implies an unusual intensity of the modifyng power. Coleridge. 5. A man endowed with uncommon vigor of mind; a man of superior intellectual faculties; as, Shakespeare was a rare genius. Syn. -- Genius, Talent. Genius implies high and peculiar gifts of nature, impelling the mind to certain favorite kinds of mental effort, and producing new combinations of ideas, imagery, etc. Talent supposes general strength of intellect, with a peculiar aptitude for being molded and directed to specific employments and valuable ends and purposes. Genius is connected more or less with the exercise of imagination, and reaches its ends by a kind of intuitive power. Talent depends more on high mental training, and a perfect command of all the faculties, memory, judgment, sagacity, etc. Hence we speak of a genius for poetry, painting. etc., and a talent for business or diplomacy. Among English orators, Lord Chatham was distinguished for his genius; William Pitt for his preëminent talents, and especially his unrivaled talent for debate. Genius loci ( Etym: [L.], the genius or presiding divinity of a place; hence, the pervading spirit of a place or institution, as of a college, etc."}