{"word":"gill","definition":"1. (Anat.)  An organ for aquatic respiration; a branchia. Fishes perform respiration under water by the gills. Ray. Note: Gills are usually lamellar or filamentous appendages, through which the blood circulates, and in which it is exposed to the action of the air contained in the water. In vertebrates they are appendages of the visceral arches on either side of the neck. In invertebrates they occupy various situations. 2. pl. (Bot.)  The radiating, gill-shaped plates forming the under surface of a mushroom. 3. (Zoöl.)  The fleshy flap that hangs below the beak of a fowl; a wattle. 4. The flesh under or about the chin. Swift. 5. (Spinning)  One of the combs of closely ranged steel pins which divide the ribbons of flax fiber or wool into fewer parallel filaments. Etym: [Prob. so called from F. aiguilles, needles. Ure.] Gill arches, Gill bars. (Anat.) Same as Branchial arches. -- Gill clefts. (Anat.) Same as Branchial clefts. See under Branchial. -- Gill cover, Gill lid. See Operculum. -- Gill frame, or Gill head (Flax Manuf.), a spreader; a machine for subjecting flax to the action of gills. Knight. -- Gill net, a flat net so suspended in the water that its meshes allow the heads of fish to pass, but catch in the gills when they seek to extricate themselves. -- Gill opening, or Gill slit (Anat.), an opening behind and below the head of most fishes, and some amphibians, by which the water from the gills is discharged. In most fishes there is a single opening on each side, but in the sharks and rays there are five, or more, on each side. -- Gill rakes, or Gill rakers (Anat.), horny filaments, or progresses, on the inside of the branchial arches of fishes, which help to prevent solid substances from being carried into gill cavities.\n\nA two-wheeled frame for transporting timber. [Prov. Eng.]\n\nA leech. [Also gell.] [Scot.] Jameison.\n\nA woody glen; a narrow valley containing a stream. [Prov. Eng. & Scot.]\n\nA measure of capacity, containing one fourth of a pint.\n\n1. A young woman; a sweetheart; a flirting or wanton girl. \"Each Jack with his Gill.\" B. Jonson. 2. (Bot.)  The ground ivy (Nepeta Glechoma); -- called also gill over the ground, and other like names. 3. Malt liquor medicated with ground ivy. Gill ale. (a) Ale flavored with ground ivy. (b) (Bot.) Alehoof."}