{"word":"give","definition":"1. To bestow without receiving a return; to confer without compensation; to impart, as a possession; to grant, as authority or permission; to yield up or allow. For generous lords had rather give than pay. Young. 2. To yield possesion of; to deliver over, as property, in exchange for something; to pay; as, we give the value of what we buy. What shall a man give in exchange for his soul Matt. xvi. 26. 3. To yield; to furnish; to produce; to emit; as, flint and steel give sparks. 4. To communicate or announce, as advice, tidings, etc.; to pronounce; to render or utter, as an opinion, a judgment, a sentence, a shout, etc. 5. To grant power or license to; to permit; to allow; to license; to commission. It is given me once again to behold my friend. Rowe. Then give thy friend to shed the sacred wine. Pope. 6. To exhibit as a product or result; to produce; to show; as, the number of men, divided by the number of ships, gives four hundred to each ship. 7. To devote; to apply; used reflexively, to devote or apply one's self; as, the soldiers give themselves to plunder; also in this sense used very frequently in the past participle; as, the people are given to luxury and pleasure; the youth is given to study. 8. (Logic & Math.)  To set forth as a known quantity or a known relation, or as a premise from which to reason; -- used principally in the passive form given. 9. To allow or admit by way of supposition. I give not heaven for lost. Mlton. 10. To attribute; to assign; to adjudge. I don't wonder at people's giving him to me as a lover. Sheridan. 11. To excite or cause to exist, as a sensation; as, to give offense; to give pleasure or pain. 12. To pledge; as, to give one's word. 13. To cause; to make; -- with the infinitive; as, to give one to understand, to know, etc. But there the duke was given to understand That in a gondola were seen together Lorenzo and his amorous Jessica. Shak. To give away, to make over to another; to transfer. Whatsoever we employ in charitable uses during our lives, is given away from ourselves. Atterbury. -- To give back, to return; to restore. Atterbury. -- To give the bag, to cheat. [Obs.] I fear our ears have given us the bag. J. Webster. -- To give birth to. (a) To bear or bring forth, as a child. (b) To originate; to give existence to, as an enterprise, idea. -- To give chase, to pursue. -- To give ear to. See under Ear. -- To give forth, to give out; to publish; to tell. Hayward. -- To give ground. See under Ground, n. -- To give the hand, to pledge friendship or faith. -- To give the hand of, to espouse; to bestow in marriage. -- To give the head. See under Head, n. -- To give in. (a) To abate; to deduct. (b) To declare; to make known; to announce; to tender; as, to give in one's adhesion to a party. -- To give the lie to (a person), to tell (him) that he lies. -- To give line. See under Line. -- To give off, to emit, as steam, vapor, odor, etc. -- To give one's self away, to make an inconsiderate surrender of one's cause, an unintentional disclosure of one's purposes, or the like. [Colloq.] -- To give out. (a) To utter publicly; to report; to announce or declare. One that gives out himself Prince Florizel. Shak. Give out you are of Epidamnum. Shak. (b) To send out; to emit; to distribute; as, a substance gives out steam or odors. -- To give over. (a) To yield completely; to quit; to abandon. (b) To despair of. (c) To addict, resign, or apply (one's self). The Babylonians had given themselves over to all manner of vice. Grew. -- To give place, to withdraw; to yield one's claim. -- To give points. (a) In games of skill, to equalize chances by conceding a certain advantage; to allow a handicap. (b) To give useful suggestions. [Colloq.] -- To give rein. See under Rein, n. -- To give the sack . Same as To give the bag. -- To give and take. (a) To average gains and losses. (b) To exchange freely, as blows, sarcasms, etc. -- To give time (Law), to accord extension or forbearance to a debtor. Abbott. -- To give the time of day, to salute one with the compliment appropriate to the hour, as \"good morning.\" \"good evening\", etc. -- To give tongue, in hunter's phrase, to bark; -- said of dogs. -- To give up. (a) To abandon; to surrender. \"Don't give up the ship.\" He has . . . given up For certain drops of salt, your city Rome. Shak. (b) To make public; to reveal. I'll not state them By giving up their characters. Beau. & Fl. (c) (Used also reflexively.) -- To give up the ghost. See under Ghost. -- To give one's self up, to abandon hope; to despair; to surrender one's self. -- To give way. (a) To withdraw; to give place. (b) To yield to force or pressure; as, the scaffolding gave way. (c) (Naut.) To begin to row; or to row with increased energy. (d) (Stock Exchange). To depreciate or decline in value; as, railroad securities gave way two per cent. -- To give way together, to row in time; to keep stroke. Syn. -- To Give, Confer, Grant. To give is the generic word, embracing all the rest. To confer was originally used of persons in power, who gave permanent grants or privileges; as, to confer the order of knighthood; and hence it still denotes the giving of something which might have been withheld; as, to confer a favor. To grant is to give in answer to a petition or request, or to one who is in some way dependent or inferior.\n\n1. To give a gift or gifts. 2. To yield to force or pressure; to relax; to become less rigid; as, the earth gives under the feet. 3. To become soft or moist. [Obs.] Bacon . 4. To move; to recede. Now back he gives, then rushes on amain. Daniel. 5. To shed tears; to weep. [Obs.] Whose eyes do never give But through lust and laughter. Shak. 6. To have a misgiving. [Obs.] My mind gives ye're reserved To rob poor market women. J. Webster. 7. To open; to lead. [A Gallicism] This, yielding, gave into a grassy walk. Tennyson. To give back, to recede; to retire; to retreat. They gave back and came no farther. Bunyan. -- To give in, to yield; to succumb; to acknowledge one's self beaten; to cease opposition. The Scots battalion was enforced to give in. Hayward. This consideration may induce a translator to give in to those general phrases. Pope. -- To give off, to cease; to forbear. [Obs.] Locke. -- To give on or upon. (a) To rush; to fall upon. [Obs.] (b) To have a view of; to be in sight of; to overlook; to look toward; to open upon; to front; to face. [A Gallicism: cf. Fr. donner sur.] Rooms which gave upon a pillared porch. Tennyson. The gloomy staircase on which the grating gave. Dickens. -- To give out. (a) To expend all one's strength. Hence: (b) To cease from exertion; to fail; to be exhausted; as, my feet being to give out; the flour has given out. -- To give over, to cease; to discontinue; to desist. It would be well for all authors, if they knew when to give over, and to desist from any further pursuits after fame. Addison. -- To give up, to cease from effort; to yield; to despair; as, he would never give up."}