{"word":"glass","definition":"1. A hard, brittle, translucent, and commonly transparent substance, white or colored, having a conchoidal fracture, and made by fusing together sand or silica with lime, potash, soda, or lead oxide. It is used for window panes and mirrors, for articles of table and culinary use, for lenses, and various articles of ornament. Note: Glass is variously colored by the metallic oxides; thus, manganese colors it violet; copper (cuprous), red, or (cupric) green; cobalt, blue; uranium, yellowish green or canary yellow; iron, green or brown; gold, purple or red; tin, opaque white; chromium, emerald green; antimony, yellow. 2. (Chem.)  Any substance having a peculiar glassy appearance, and a conchoidal fracture, and usually produced by fusion. 3. Anything made of glass. Especially: (a) A looking-glass; a mirror. (b) A vessel filled with running sand for measuring time; an hourglass; and hence, the time in which such a vessel is exhausted of its sand. She would not live The running of one glass. Shak. (c) A drinking vessel; a tumbler; a goblet; hence, the contents of such a vessel; especially; spirituous liquors; as, he took a glass at dinner. (d) An optical glass; a lens; a spyglass; -- in the plural, spectacles; as, a pair of glasses; he wears glasses. (e) A weatherglass; a barometer. Note: Glass is much used adjectively or in combination; as, glass maker, or glassmaker; glass making or glassmaking; glass blower or glassblower, etc. Bohemian glass, Cut glass, etc. See under Bohemian, Cut, etc. -- Crown glass, a variety of glass, used for making the finest plate or window glass, and consisting essentially of silicate of soda or potash and lime, with no admixture of lead; the convex half of an achromatic lens is composed of crown glass; -- so called from a crownlike shape given it in the process of blowing. -- Crystal glass, or Flint glass. See Flint glass, in the Vocabulary. -- Cylinder glass, sheet glass made by blowing the glass in the form of a cylinder which is then split longitudinally, opened out, and flattened. -- Glass of antimony, a vitreous oxide of antimony mixed with sulphide. -- Glass blower, one whose occupation is to blow and fashion glass. -- Glass blowing, the art of shaping glass, when reduced by heat to a viscid state, by inflating it through a tube. -- Glass cloth, a woven fabric formed of glass fibers. -- Glass coach, a coach superior to a hackney-coach, hired for the day, or any short period, as a private carriage; -- so called because originally private carriages alone had glass windows. [Eng.] Smart. Glass coaches are [allowed in English parks from which ordinary hacks are excluded], meaning by this term, which is never used in America, hired carriages that do not go on stands. J. F. Cooper. -- Glass cutter. (a) One who cuts sheets of glass into sizes for window panes, ets. (b) One who shapes the surface of glass by grinding and polishing. (c) A tool, usually with a diamond at the point, for cutting glass. -- Glass cutting. (a) The act or process of dividing glass, as sheets of glass into panes with a diamond. (b) The act or process of shaping the surface of glass by appylying it to revolving wheels, upon which sand, emery, and, afterwards, polishing powder, are applied; especially of glass which is shaped into facets, tooth ornaments, and the like. Glass having ornamental scrolls, etc., cut upon it, is said to be engraved. -- Glass metal, the fused material for making glass. -- Glass painting, the art or process of producing decorative effects in glass by painting it with enamel colors and combining the pieces together with slender sash bars of lead or other metal. In common parlance, glass painting and glass staining (see Glass staining, below) are used indifferently for all colored decorative work in windows, and the like. -- Glass paper, paper faced with pulvirezed glass, and used for abrasive purposes. -- Glass silk, fine threads of glass, wound, when in fusion, on rapidly rotating heated cylinders. -- Glass silvering, the process of transforming plate glass into mirrors by coating it with a reflecting surface, a deposit of silver, or a mercury amalgam. -- Glass soap, or Glassmaker's soap, the black oxide of manganese or other substances used by glass makers to take away color from the materials for glass. -- Glass staining, the art or practice of coloring glass in its whole substance, or, in the case of certain colors, in a superficial film only; also, decorative work in glass. Cf. Glass painting. -- Glass tears. See Rupert's drop. -- Glass works, an establishment where glass is made. -- Heavy glass, a heavy optical glass, consisting essentially of a borosilicate of potash. -- Millefiore glass. See Millefiore. -- Plate glass, a fine kind of glass, cast in thick plates, and flattened by heavy rollers, -- used for mirrors and the best windows. -- Pressed glass, glass articles formed in molds by pressure when hot. -- Soluble glass (Chem.), a silicate of sodium or potassium, found in commerce as a white, glassy mass, a stony powder, or dissolved as a viscous, sirupy liquid; -- used for rendering fabrics incombustible, for hardening artificial stone, etc.; -- called also water glass. -- Spun glass, glass drawn into a thread while liquid. -- Toughened glass, Tempered glass, glass finely tempered or annealed, by a peculiar method of sudden cooling by plunging while hot into oil, melted wax, or paraffine, etc.; -- called also, from the name of the inventor of the process, Bastie glass. -- Water glass. (Chem.) See Soluble glass, above. -- Window glass, glass in panes suitable for windows.\n\n1. To reflect, as in a mirror; to mirror; -- used reflexively. Happy to glass themselves in such a mirror. Motley. Where the Almighty's form glasses itself in tempests. Byron. 2. To case in glass. [R.] Shak. 3. To cover or furnish with glass; to glaze. Boyle. 4. To smooth or polish anything, as leater, by rubbing it with a glass burnisher."}