{"word":"globe","definition":"1. A round or spherical body, solid or hollow; a body whose surface is in every part equidistant from the center; a ball; a sphere. 2. Anything which is nearly spherical or globular in shape; as, the globe of the eye; the globe of a lamp. 3. The earth; the terraqueous ball; -- usually preceded by the definite article. Locke. 4. A round model of the world; a spherical representation of the earth or heavens; as, a terrestrial or celestial globe; -- called also artificial globe. 5. A body of troops, or of men or animals, drawn up in a circle; -- a military formation used by the Romans, answering to the modern infantry square. Him round A globe of fiery seraphim inclosed. Milton. Globe amaranth (Bot.), a plant of the genus Gomphrena (G. globosa), bearing round heads of variously colored flowers, which long retain color when gathered. -- Globe animalcule, a small, globular, locomotive organism (Volvox globator), once throught to be an animal, afterward supposed to be a colony of microscopic algæ. -- Globe of compression (Mil.), a kind of mine producing a wide crater; -- called also overcharged mine. -- Globe daisy (Bot.), a plant or flower of the genus Globularing, common in Europe. The flowers are minute and form globular heads. -- Globe sight, a form of front sight placed on target rifles. -- Globe slater (Zoöl.), an isopod crustacean of the genus Spheroma. -- Globe thistle (Bot.), a thistlelike plant with the flowers in large globular heads (Cynara Scolymus); also, certain species of the related genus Echinops. -- Globe valve. (a) A ball valve. (b) A valve inclosed in a globular chamber. Knight. Syn. -- Globe, Sphere, Orb, Ball. -- Globe denotes a round, and usually a solid body; sphere is the term applied in astronomy to such a body, or to the concentric spheres or orbs of the old astronomers; orb is used, especially in poetry, for globe or sphere, and also for the pathway of a heavenly body; ball is applied to the heavenly bodies concieved of as impelled through space.\n\nTo gather or form into a globe."}