{"word":"golden","definition":"1. Made of gold; consisting of gold. 2. Having the color of gold; as, the golden grain. 3. Very precious; highly valuable; excellent; eminently auspicious; as, golden opinions. Golden age. (a) The fabulous age of primeval simplicity and purity of manners in rural employments, followed by the silver, bronze, and iron ages. Dryden. (b) (Roman Literature) The best part (B. C. 81 -- A. D. 14) of the classical period of Latinity; the time when Cicero, Cæsar, Virgil, etc., wrote. Hence: (c) That period in the history of a literature, etc., when it flourishes in its greatest purity or attains its greatest glory; as, the Elizabethan age has been considered the golden age of English literature. -- Golden balls, three gilt balls used as a sign of a pawnbroker's office or shop; -- originally taken from the coat of arms of Lombardy, the first money lenders in London having been Lombards. -- Golden bull. See under Bull, an edict. -- Golden chain (Bot.), the shrub Cytisus Laburnum, so named from its long clusters of yellow blossoms. -- Golden club (Bot.), an aquatic plant (Orontium aquaticum), bearing a thick spike of minute yellow flowers. -- Golden cup (Bot.), the buttercup. -- Golden eagle (Zoöl.), a large and powerful eagle (Aquila Chrysaëtos) inhabiting Europe, Asia, and North America. It is so called from the brownish yellow tips of the feathers on the head and neck. A dark variety is called the royal eagle; the young in the second year is the ring-tailed eagle. -- Golden fleece. (a) (Mythol.) The fleece of gold fabled to have been taken from the ram that bore Phryxus through the air to Colchis, and in quest of which Jason undertook the Argonautic expedition. (b) (Her.) An order of knighthood instituted in 1429 by Philip the Good, Duke of Burgundy; -- called also Toison d'Or. -- Golden grease, a bribe; a fee. [Slang] -- Golden hair (Bot.), a South African shrubby composite plant with golden yellow flowers, the Chrysocoma Coma-aurea. -- Golden Horde (Hist.), a tribe of Mongolian Tartars who overran and settled in Southern Russia early in the 18th century. -- Golden Legend, a hagiology (the \"Aurea Legenda\") written by James de Voragine, Archbishop of Genoa, in the 13th century, translated and printed by Caxton in 1483, and partially paraphrased by Longfellow in a poem thus entitled. -- Golden marcasite tin. [Obs.] -- Golden mean, the way of wisdom and safety between extremes; sufficiency without excess; moderation. Angels guard him in the golden mean. Pope. -- Golden mole (Zoöl), one of several South African Insectivora of the family Chrysochloridæ, resembling moles in form and habits. The fur is tinted with green, purple, and gold. -- Golden number (Chronol.), a number showing the year of the lunar or Metonic cycle. It is reckoned from 1 to 19, and is so called from having formerly been written in the calendar in gold. -- Golden oriole. (Zoöl.) See Oriole. -- Golden pheasant. See under Pheasant. -- Golden pippin, a kind of apple, of a bright yellow color. -- Golden plover (Zoöl.), one of several species of plovers, of the genus Charadrius, esp. the European (C. apricarius, or pluvialis; -- called also yellow, black-breasted hill, and whistling, plover. The common American species (C. dominicus) is also called frostbird, and bullhead. -- Golden robin. (Zoöl.) See Baltimore oriole, in Vocab. -- Golden rose (R. C. Ch.), a gold or gilded rose blessed by the pope on the fourth Sunday in Lent, and sent to some church or person in recognition of special services rendered to the Holy See. -- Golden rule. (a) The rule of doing as we would have others do to us. Cf. Luke vi. 31. (b) The rule of proportion, or rule of three. -- Golden samphire (Bot.), a composite plant (Inula crithmoides), found on the seashore of Europe. -- Golden saxifrage (Bot.), a low herb with yellow flowers (Chrysosplenium oppositifolium), blossoming in wet places in early spring. -- Golden seal (Bot.), a perennial ranunculaceous herb (Hydrastis Canadensis), with a thick knotted rootstock and large rounded leaves. -- Golden sulphide, or sulphuret, of antimony (Chem.), the pentasulphide of antimony, a golden or orange yellow powder. -- Golden warbler (Zoöl.), a common American wood warbler (Dendroica æstiva); -- called also blue-eyed yellow warbler, garden warbler, and summer yellow bird. -- Golden wasp (Zoöl.), a bright-colored hymenopterous insect, of the family Chrysididæ. The colors are golden, blue, and green. -- Golden wedding. See under Wedding."}