{"word":"grafting","definition":"The act or method of weaving a cover for a ring, rope end, etc. 3. (Surg.)  The transplanting of a portion of flesh or skin to a denuded surface; autoplasty. 4. (Carp.)  A scarfing or endwise attachment of one timber to another. Cleft grafting (Hort.) a method of grafting in which the scion is placed in a cleft or slit in the stock or stump made by sawing off a branch, usually in such a manaer that its bark evenly joins that of the stock. -- Crown, or Rind, grafting, a method of grafting which the alburnum and inner bark are separated, and between them is inserted the lower end of the scion cut slantwise. -- Saddle grafting, a mode of grafting in which a deep cleft is made in the end of the scion by two sloping cuts, and the end of the stock is made wedge-shaped to fit the cleft in the scion, which is placed upon it saddlewise. -- Side grafting, a mode of grafting in which the scion, cut quite across very obliquely, so as to give it the form of a slender wedge, is thrust down inside of the bark of the stock or stem into which it is inserted, the cut side of the scion being next the wood of the stock. -- Skin grafting. (Surg.) See Autoplasty. -- Splice grafting (Hort.), a method of grafting by cutting the ends of the scion and stock completely across and obliquely, in such a manner that the sections are of the same shape, then lapping the ends so that the one cut surface exactly fits the other, and securing them by tying or otherwise. -- Whip grafting, tongue grafting, the same as splice grafting, except that a cleft or slit is made in the end of both scion and stock, in the direction of the grain and in the middle of the sloping surface, forming a kind of tongue, so that when put together, the tongue of each is inserted in the slit of the other. -- Grafting scissors, a surgeon's scissors, used in rhinoplastic operations, etc. -- Grafting tool. (a) Any tool used in grafting. (b) A very strong curved spade used in digging canals. -- Grafting wax, a composition of rosin, beeswax tallow, etc., used in binding up the wounds of newly grafted trees."}