{"word":"grand","definition":"1. Of large size or extent; great; extensive; hence, relatively great; greatest; chief; principal; as, a grand mountain; a grand army; a grand mistake. \"Our grand foe, Satan.\" Milton. Making so bold . . . to unseal Their grand commission. Shak. 2. Great in size, and fine or imposing in appearance or impression; illustrious, dignifled, or noble (said of persons); majestic, splendid, magnificent, or sublime (said of things); as, a grand monarch; a grand lord; a grand general; a grand view; a grand conception. They are the highest models of expression, the unapproached masters of the grand style. M. Arnold. 3. Having higher rank or more dignity, size, or importance than other persons or things of the same name; as, a grand lodge; a grand vizier; a grand piano, etc. 4. Standing in the second or some more remote degree of parentage or descent; -- generalIy used in composition; as, grandfather, grandson, grandchild, etc. What cause Mov'd our grand parents, in that happy state, Favor'd of Heaven so highly, to fall off From their Creator. Milton. Grand action, a pianoforte action, used in grand pianos, in which special devices are employed to obtain perfect action of the hammer in striking and leaving the string. -- Grand Army of the Republic, an organized voluntary association of men who served in the Union army or navy during the civil war in the United States. The order has chapters, called Posts, throughout the country. -- Grand cross. (a) The highest rank of knighthood in the Order of the Bath. (b) A knight grand cross. -- Grand cordon, the cordon or broad ribbon, identified with the highest grade in certain honorary orders; hence, a person who holds that grade. -- Grand days (Eng. Law), certain days in the terms which are observed as holidays in the inns of court and chancery (Candlemas, Ascension, St. John Baptist's, and All Saints' Days); called also Dies non juridici. -- Grand duchess. (a) The wife or widow of a grand duke. (b) A lady having the sovereignty of a duchy in her own right. (c) In Russia, a daughter of the Czar. -- Grand duke. (a) A sovereign duke, inferior in rank to a king; as, the Grand Duke of Tuscany. (b) In Russia, a son of the Czar. (c) (Zoöl.) The European great horned owl or eagle owl (Bubo maximas). -- Grand-guard, or Grandegarde, a piece of plate armor used in tournaments as an extra protection for the left shoulder and breast. -- Grand juror, a member of a grand jury. -- Grand jury (Law), a jury of not less than twelve men, and not more than twenty-three, whose duty it is, in private session, to examine into accusations against persons charged with crime, and if they see just cause, then to find bills of indictment against them, to be presented to the court; -- called also grand inquest. -- Grand juryman, a grand juror. -- Grand larceny. (Law) See under Larceny. -- Grand lodge, the chief lodge, or governing body, among Freemasons and other secret orders. -- Grand master. (a) The head of one of the military orders of knighthood, as the Templars, Hospitallers, etc. (b) The head of the order of Freemasons or of Good Templars, etc. -- Grand paunch, a glutton or gourmand. [Obs.] Holland. -- Grand pensionary. See under Pensionary. -- Grand piano (Mus.), a large piano, usually harp-shaped, in which the wires or strings are generally triplicated, increasing the power, and all the mechanism is introduced in the most effective manner, regardless of the size of the instrument. -- Grand relief (Sculp.), alto relievo. -- Grand Seignior. See under Seignior. -- Grand stand, the principal stand, or erection for spectators, at a, race course, etc. -- Grand vicar (Eccl.), a principal vicar; an ecclesiastical delegate in France. -- Grand vizier. See under Vizier. Syn. -- Magnificent; sublime; majestic; dignified; elevated; stately; august; pompous; lofty; eralted; noble. -- Grand, Magnificent, Sublime. Grand, in reference to objects of taste, is applied to that which expands the mind by a sense of vastness and majesty; magnificent is applied to anything which is imposing from its splendor; sublime describes that which is awful and elevating. A cataract is grand; a rich and varied landscape is magnificent; an overhanging precipice is sublime. \"Grandeur admits of degrees and modifications; but magnificence is that which has already reached the highest degree of superiority naturally belonging to the object in question.\" Crabb."}