{"word":"grave","definition":"(Naut.) To clean, as a vessel's bottom, of barnacles, grass, etc., and pay it over with pitch; -- so called because graves or greaves was formerly used for this purpose.\n\n1. Of great weight; heavy; ponderous. [Obs.] His shield grave and great. Chapman. 2. Of importance; momentous; weighty; influential; sedate; serious; - - said of character, relations, etc.; as, grave deportment, character, influence, etc. Most potent, grave, and reverend seigniors. Shak. A grave and prudent law, full of moral equity. Milton. 3. Not light or gay; solemn; sober; plain; as, a grave color; a grave face. 4. (Mus.) (a) Not acute or sharp; low; deep; -- said of sound; as, a grave note or key. The thicker the cord or string, the more grave is the note or tone. Moore (Encyc. of Music). (b) Slow and solemn in movement. Grave accent. (Pron.) See the Note under Accent, n., 2. Syn. -- Solemn; sober; serious; sage; staid; demure; thoughtful; sedate; weighty; momentous; important. -- Grave, Sober, Serious, Solemn. Sober supposes the absence of all exhilaration of spirits, and is opposed to gay or flighty; as, sober thought. Serious implies considerateness or reflection, and is opposed to jocose or sportive; as, serious and important concerns. Grave denotes a state of mind, appearance, etc., which results from the pressure of weighty interests, and is opposed to hilarity of feeling or vivacity of manner; as, a qrave remark; qrave attire. Solemn is applied to a case in which gravity is carried to its highest point; as, a solemn admonition; a solemn promise.\n\n1. To dig. [Obs.] Chaucer. He hath graven and digged up a pit. Ps. vii. 16 (Book of Common Prayer). 2. To carve or cut, as letters or figures, on some hard substance; to engrave. Thou shalt take two onyx stones, and grave on them the names of the children of Israel. Ex. xxviii. 9. 3. To carve out or give shape to, by cutting with a chisel; to sculpture; as, to grave an image. With gold men may the hearte grave. Chaucer. 4. To impress deeply (on the mind); to fix indelibly. O! may they graven in thy heart remain. Prior. 5. To entomb; to bury. [Obs.] Chaucer. Lie full low, graved in the hollow ground. Shak.\n\nTo write or delineate on hard substances, by means of incised lines; to practice engraving.\n\nAn excavation in the earth as a place of burial; also, any place of interment; a tomb; a sepulcher. Hence: Death; destruction. He bad lain in the grave four days. John xi. 17. Grave wax, adipocere."}