{"word":"ground","definition":"1. The surface of the earth; the outer crust of the globe, or some indefinite portion of it. There was not a man to till the ground. Gen. ii. 5. The fire ran along upon the ground. Ex. ix. 23. Hence:  A floor or pavement supposed to rest upon the earth. 2. Any definite portion of the earth's surface; region; territory; country. Hence: A territory appropriated to, or resorted to, for a particular purpose; the field or place of action; as, a hunting or fishing ground; a play ground. From . . . old Euphrates, to the brook that parts Egypt from Syrian ground. Milton. 3. Land; estate; possession; field; esp. (pl.), the gardens, lawns, fields, etc., belonging to a homestead; as, the grounds of the estate are well kept. Thy next design is on thy neighbor's grounds. Dryden. 4. 4. The basis on which anything rests; foundation. Hence: The foundation of knowledge, belief, or conviction; a premise, reason, or datum; ultimate or first principle; cause of existence or occurrence; originating force or agency; as, the ground of my hope. 5. (Paint. & Decorative Art) (a) That surface upon which the figures of a composition are set, and which relieves them by its plainness, being either of one tint or of tints but slightly contrasted with one another; as, crimson Bowers on a white ground. See Background, Foreground, and Middle-ground. (b) In sculpture, a flat surface upon which figures are raised in relief. (c) In point lace, the net of small meshes upon which the embroidered pattern is applied; as, Brussels ground. See Brussels lace, under Brussels. 6. (Etching)  A gummy composition spread over the surface of a metal to be etched, to prevent the acid from eating except where an opening is made by the needle. 7. (Arch.)  One of the pieces of wood, flush with the plastering, to which moldings, etc., are attached; -- usually in the plural. Note: Grounds are usually put up first and the plastering floated flush with them. 8. (Mus.) (a) A composition in which the bass, consisting of a few bars of independent notes, is continually repeated to a varying melody. (b) The tune on which descants are raised; the plain song. Moore (Encyc.). On that ground I'll build a holy descant. Shak. 9. (Elec.)  A conducting connection with the earth, whereby the earth is made part of an electrical circuit. 10. pl.  Sediment at the bottom of liquors or liquids; dregs; lees; feces; as, coffee grounds. 11. The pit of a theater. [Obs.] B. Jonson. Ground angling, angling with a weighted line without a float. -- Ground annual (Scots Law), an estate created in land by a vassal who instead of selling his land outright reserves an annual ground rent, which becomes a perpetual charge upon the land. -- Ground ash. (Bot.) See Groutweed. -- Ground bailiff (Mining), a superintendent of mines. Simmonds. -- Ground bait, bits of bread, boiled barley or worms, etc., thrown into the water to collect the fish, Wallon. -- Ground bass or base (Mus.), fundamental base; a fundamental base continually repeated to a varied melody. -- Ground beetle (Zoöl.), one of numerous species of carnivorous beetles of the family Carabidæ, living mostly in burrows or under stones, etc. -- Ground chamber, a room on the ground floor. -- Ground cherry. (Bot.) (a) A genus (Physalis) of herbaceous plants having an inflated calyx for a seed pod: esp., the strawberry tomato (P. Alkekengi). See Alkekengl. (b) A European shrub (Prunus Chamæcerasus), with small, very acid fruit. -- Ground cuckoo. (Zoöl.) See Chaparral cock. -- Ground cypress. (Bot.) See Lavender cotton. -- Ground dove (Zoöl.), one of several small American pigeons of the genus Columbigallina, esp. C. passerina of the Southern United States, Mexico, etc. They live chiefly on the ground. -- Ground fish (Zoöl.), any fish which constantly lives on the botton of the sea, as the sole, turbot, halibut. -- Ground floor, the floor of a house most nearly on a level with the ground; -- called also in America, but not in England, the first floor. -- Ground form (Gram.), the stem or basis of a word, to which the other parts are added in declension or conjugation. It is sometimes, but not always, the same as the root. -- Ground furze (Bot.), a low slightly thorny, leguminous shrub (Ononis arvensis) of Europe and Central Asia,; -- called also rest- harrow. -- Ground game, hares, rabbits, etc., as distinguished from winged game. -- Ground hele (Bot.), a perennial herb (Veronica officinalis) with small blue flowers, common in Europe and America, formerly thought to have curative properties. -- Ground of the heavens (Astron.), the surface of any part of the celestial sphere upon which the stars may be regarded as projected. -- Ground hemlock (Bot.), the yew (Taxus baccata var. Canadensisi) of eastern North America, distinguished from that of Europe by its low, straggling stems. -- Ground hog. (Zoöl.) (a) The woodchuck or American marmot (Arctomys monax). See Woodchuck. (b) The aardvark. -- Ground hold (Naut.), ground tackle. [Obs.] Spenser. -- Ground ice, ice formed at the bottom of a body of water before it forms on the surface. -- Ground ivy. (Bot.) A trailing plant; alehoof. See Gill. -- Ground joist, a joist for a basement or ground floor; a. sleeper. -- Ground lark (Zoöl.), the European pipit. See Pipit. -- Ground laurel (Bot.). See Trailing arbutus, under Arbutus. -- Ground line (Descriptive Geom.), the line of intersection of the horizontal and vertical planes of projection. -- Ground liverwort (Bot.), a flowerless plant with a broad flat forking thallus and the fruit raised on peduncled and radiated receptacles (Marchantia polymorpha). -- Ground mail, in Scotland, the fee paid for interment in a churchyard. -- Ground mass (Geol.), the fine-grained or glassy base of a rock, in which distinct crystals of its constituents are embedded. -- Ground parrakeet (Zoöl.), one of several Australian parrakeets, of the genera Callipsittacus and Geopsittacus, which live mainly upon the ground. -- Ground pearl (Zoöl.), an insect of the family Coccidæ (Margarodes formicarum), found in ants' nests in the Bahamas, and having a shelly covering. They are strung like beads, and made into necklaces by the natives. -- Ground pig (Zoöl.), a large, burrowing, African rodent (Aulacodus Swinderianus) about two feet long, allied to the porcupines but with harsh, bristly hair, and no spines; -- called also ground rat. -- Ground pigeon (Zoöl.), one of numerous species of pigeons which live largely upon the ground, as the tooth-billed pigeon (Didunculus strigirostris), of the Samoan Islands, and the crowned pigeon, or goura. See Goura, and Ground dove (above). -- Ground pine. (Bot.) (a) A blue-flowered herb of the genus Ajuga (A. Chamæpitys), formerly included in the genus Teucrium or germander, and named from its resinous smell. Sir L. Hill. (b) A long, creeping, evergreen plant of the genus Lycopodium (L. clavatum); -- called also club moss. (c) A tree-shaped evergreen plant about eight inches in height, of the same genus (L. dendroideum) found in moist, dark woods in the northern part of the United States. Gray. -- Ground plan (Arch.), a plan of the ground floor of any building, or of any floor, as distinguished from an elevation or perpendicular section. -- Ground plane, the horizontal plane of projection in perspective drawing. -- Ground plate. (a) (Arch.) One of the chief pieces of framing of a building; a timber laid horizontally on or near the ground to support the uprights; a ground sill or groundsel. (b) (Railroads) A bed plate for sleepers or ties; a mudsill. (c) (Teleg.) A metallic plate buried in the earth to conduct the electric current thereto. Connection to the pipes of a gas or water main is usual in cities. Knight. -- Ground plot, the ground upon which any structure is erected; hence, any basis or foundation; also, a ground plan. -- Ground plum (Bot.), a leguminous plant (Astragalus caryocarpus) occurring from the Saskatchewan to Texas, and having a succulent plum-shaped pod. -- Ground rat. (Zoöl.) See Ground pig (above). -- Ground rent, rent paid for the privilege of building on another man's land. -- Ground robin. (Zoöl.) See Chewink. -- Ground room, a room on the ground floor; a lower room. Tatler. -- Ground sea, the West Indian name for a swell of the ocean, which occurs in calm weather and without obvious cause, breaking on the shore in heavy roaring billows; -- called also rollers, and in Jamaica, the North sea. -- Ground sill. See Ground plate (a) (above). -- Ground snake (Zoöl.), a small burrowing American snake (Celuta amoena). It is salmon colored, and has a blunt tail. -- Ground squirrel. (Zoöl.) (a) One of numerous species of burrowing rodents of the genera Tamias and Spermophilus, having cheek pouches. The former genus includes the Eastern striped squirrel or chipmunk and some allied Western species; the latter includes the prairie squirrel or striped gopher, the gray gopher, and many allied Western species. See Chipmunk, and Gopher. (b) Any species of the African genus Xerus, allied to Tamias. -- Ground story. Same as Ground floor (above). -- Ground substance (Anat.), the intercellular substance, or matrix, of tissues. -- Ground swell. (a) (Bot.) The plant groundsel. [Obs.] Holland. (b) A broad, deep swell or undulation of the ocean, caused by a long continued gale, and felt even at a remote distance after the gale has ceased. -- Ground table. (Arch.) See Earth table, under Earth. -- Ground tackle (Naut.), the tackle necessary to secure a vessel at anchor. Totten. -- Ground thrush (Zoöl.), one of numerous species of bright-colored Oriental birds of the family Pittidæ. See Pitta. -- Ground tier. (a) The lowest tier of water casks in a vessel's hold. Totten. (b) The lowest line of articles of any kind stowed in a vessel's hold. (c) The lowest range of boxes in a theater. -- Ground timbers (Shipbuilding) the timbers which lie on the keel and are bolted to the keelson; floor timbers. Knight. -- Ground tit. (Zoöl.) See Ground wren (below). -- Ground wheel, that wheel of a harvester, mowing machine, etc., which, rolling on the ground, drives the mechanism. -- Ground wren (Zoöl.), a small California bird (Chamæa fasciata) allied to the wrens and titmice. It inhibits the arid plains. Called also gronnd tit, and wren lit. -- To bite the ground, To break ground. See under Bite, Break. -- To come to the ground, To fall to the ground, to come to nothing; to fail; to miscarry. -- To gain ground. (a) To advance; to proceed forward in confict; as, an army in battle gains ground. (b) To obtain an advantage; to have some success; as, the army gains ground on the enemy. (c) To gain credit; to become more prosperous or influential. -- To get, or To gather, ground, to gain ground. [R.] \"Evening mist . . . gathers ground fast.\" Milton. There is no way for duty to prevail, and get ground of them, but by bidding higher. South. -- To give ground, to recede; to yield advantage. These nine . . . began to give me ground. Shak. --To lose ground, to retire; to retreat; to withdraw from the position taken; hence, to lose advantage; to lose credit or reputation; to decline. -- To stand one's ground, to stand firm; to resist attack or encroachment. Atterbury. -- To take the ground to touch bottom or become stranded; -- said of a ship.\n\n1. To lay, set, or run, on the ground. 2. To found; to fix or set, as on a foundation, reason, or principle; to furnish a ground for; to fix firmly. Being rooted and grounded in love. Eph. iii. 17. So far from warranting any inference to the existence of a God, would, on the contrary, ground even an argument to his negation. Sir W. Hamilton 3. To instruct in elements or first principles. 4. (Elec.)  To connect with the ground so as to make the earth a part of an electrical circuit. 5. (Fine Arts)  To cover with a ground, as a copper plate for etching (see Ground, n., 5); or as paper or other materials with a uniform tint as a preparation for ornament.\n\nTo run aground; to strike the bottom and remain fixed; as, the ship grounded on the bar.\n\nimp. & p. p. of Grind. Ground cock, a cock, the plug of which is ground into its seat, as distinguished from a compression cock. Knight. -- Ground glass, glass the transparency of which has been destroyed by having its surface roughened by grinding. -- Ground joint, a close joint made by grinding together two pieces, as of metal with emery and oil, or of glass with fine sand and water."}