{"word":"guinea","definition":"1. A district on the west coast of Africa (formerly noted for its export of gold and slaves) after which the Guinea fowl, Guinea grass, Guinea peach, etc., are named. 2. A gold coin of England current for twenty-one shillings sterling, or about five dollars, but not coined since the issue of sovereigns in 1817. The guinea, so called from the Guinea gold out of which it was first struck, was proclaimed in 1663, and to go for twenty shillings; but it never went for less than twenty-one shillings. Pinkerton. Guinea corn. (Bot.) See Durra. -- Guinea Current (Geog.), a current in the Atlantic Ocean setting southwardly into the Bay of Benin on the coast of Guinea.-- Guinea dropper one who cheats by dropping counterfeit guineas. [Obs.] Gay. -- Guinea fowl, Guinea hen (Zoöl.), an African gallinaceous bird, of the genus Numida, allied to the pheasants. The common domesticated species (N. meleagris), has a colored fleshy horn on each aide of the head, and is of a dark gray color, variegated with small white spots. The crested Guinea fowl (N. cristata) is a finer species.-- Guinea grains (Bot.), grains of Paradise, or amomum. See Amomum. -- Guinea grass (Bot.), a tall strong forage grass (Panicum jumentorum) introduced. from Africa into the West Indies and Southern United States. -- Guinea-hen flower (Bot.), a liliaceous flower (Fritillaria Meleagris) with petals spotted like the feathers of the Guinea hen. -- Guinea peach. See under Peach. -- Guinea pepper (Bot.), the pods of the Xylopia aromatica, a tree of the order Anonaceæ, found in tropical West Africa. They are also sold under the name of Piper Æthiopicum. --Guinea pig. Note: [Prob. a mistake for Guiana pig.] (a) (Zoöl.) A small Brazilian rodent (Cavia cobaya), about seven inches in length and usually of a white color, with spots of orange and black. (b) A contemptuous sobriquet. Smollett. -- Guinea plum (Bot.), the fruit of Parinarium excelsum, a large West African tree of the order Chrysobalaneæ, having a scarcely edible fruit somewhat resembling a plum, which is also called gray plum and rough-skin plum. -- Guinea worm (Zoöl.), a long and slender African nematoid worm (Filaria Medinensis) of a white color. It lives in the cellular tissue of man, beneath the skin, and produces painful sores."}