{"word":"hair","definition":"1. The collection or mass of filaments growing from the skin of an animal, and forming a covering for a part of the head or for any part or the whole of the body. 2. One the above-mentioned filaments, consisting, in invertebrate animals, of a long, tubular part which is free and flexible, and a bulbous root imbedded in the skin. Then read he me how Sampson lost his hairs. Chaucer. And draweth new delights with hoary hairs. Spenser. 3. Hair (human or animal) used for various purposes; as, hair for stuffing cushions. 4. (Zoöl.)  A slender outgrowth from the chitinous cuticle of insects, spiders, crustaceans, and other invertebrates. Such hairs are totally unlike those of vertebrates in structure, composition, and mode of growth. 5. An outgrowth of the epidermis, consisting of one or of several cells, whether pointed, hooked, knobbed, or stellated. Internal hairs occur in the flower stalk of the yellow frog lily (Nuphar). 6. A spring device used in a hair-trigger firearm. 7. A haircloth. [Obc.] Chaucer. 8. Any very small distance, or degree; a hairbreadth. Note: Hairs is often used adjectively or in combination; as, hairbrush or hair brush, hair dye, hair oil, hairpin, hair powder, a brush, a dye, etc., for the hair. Against the hair, in a rough and disagreeable manner; against the grain. [Obs.] \"You go against the hair of your professions.\" Shak. -- Hair bracket (Ship Carp.), a molding which comes in at the back of, or runs aft from, the figurehead. -- Hair cells (Anat.), cells with hairlike processes in the sensory epithelium of certain parts of the internal ear. -- Hair compass, Hair divider, a compass or divider capable of delicate adjustment by means of a screw. -- Hair glove, a glove of horsehair for rubbing the skin. -- Hair lace, a netted fillet for tying up the hair of the head. Swift. -- Hair line, a line made of hair; a very slender line. -- Hair moth (Zoöl.), any moth which destroys goods made of hair, esp. Tinea biselliella. -- Hair pencil, a brush or fine hair, for painting; -- generally called by the name of the hair used; as, a camel's hair pencil, a sable's hair pencil, etc. -- Hair plate, an iron plate forming the back of the hearth of a bloomery fire. -- Hair powder, a white perfumed powder, as of flour or starch, formerly much used for sprinkling on the hair of the head, or on wigs. -- Hair seal (Zoöl.), any one of several species of eared seals which do not produce fur; a sea lion. -- Hair seating, haircloth for seats of chairs, etc. -- Hair shirt, a shirt, or a band for the loins, made of horsehair, and worn as a penance. -- Hair sieve, a strainer with a haircloth bottom. -- Hair snake. See Gordius. -- Hair space (Printing), the thinnest metal space used in lines of type. -- Hair stroke, a delicate stroke in writing. -- Hair trigger, a trigger so constructed as to discharge a firearm by a very slight pressure, as by the touch of a hair. Farrow. -- Not worth a hair, of no value. -- To a hair, with the nicest distinction. -- To split hairs, to make distinctions of useless nicety."}