{"word":"hand","definition":"1. That part of the fore limb below the forearm or wrist in man and monkeys, and the corresponding part in many other animals; manus; paw. See Manus. 2. That which resembles, or to some extent performs the office of, a human hand; as: (a) A limb of certain animals, as the foot of a hawk, or any one of the four extremities of a monkey. (b) An index or pointer on a dial; as, the hour or minute hand of a clock. 3. A measure equal to a hand's breadth, -- four inches; a palm. Chiefly used in measuring the height of horses. 4. Side; part; direction, either right or left. On this hand and that hand, were hangings. Ex. xxxviii. 15. The Protestants were then on the winning hand. Milton. 5. Power of performance; means of execution; ability; skill; dexterity. He had a great mind to try his hand at a Spectator. Addison. 6. Actual performance; deed; act; workmanship; agency; hence, manner of performance. To change the hand in carrying on the war. Clarendon. Gideon said unto God, If thou wilt save Israel by my hand. Judges vi. 36. 7. An agent; a servant, or laborer; a workman, trained or competent for special service or duty; a performer more or less skillful; as, a deck hand; a farm hand; an old hand at speaking. A dictionary containing a natural history requires too many hands, as well as too much time, ever to be hoped for. Locke. I was always reckoned a lively hand at a simile. Hazlitt. 8. Handwriting; style of penmanship; as, a good, bad or running hand. Hence, a signature. I say she never did invent this letter; This is a man's invention and his hand. Shak. Some writs require a judge's hand. Burril. 9. Personal possession; ownership; hence, control; direction; management; -- usually in the plural. \"Receiving in hand one year's tribute.\" Knolles. Albinus . . . found means to keep in his hands the goverment of Britain. Milton. 10. Agency in transmission from one person to another; as, to buy at first hand, that is, from the producer, or when new; at second hand, that is, when no longer in the producer's hand, or when not new. 11. Rate; price. [Obs.] \"Business is bought at a dear hand, where there is small dispatch.\" Bacon. 12. That which is, or may be, held in a hand at once; as: (a) (Card Playing) The quota of cards received from the dealer. (b) (Tobacco Manuf.) A bundle of tobacco leaves tied together. 13. (Firearms)  The small part of a gunstock near the lock, which is grasped by the hand in taking aim. Note: Hand is used figuratively for a large variety of acts or things, in the doing, or making, or use of which the hand is in some way employed or concerned; also, as a symbol to denote various qualities or conditions, as: (a) Activity; operation; work; -- in distinction from the head, which implies thought, and the heart, which implies affection. \"His hand will be against every man.\" Gen. xvi. 12.(b) Power; might; supremacy; -- often in the Scriptures. \"With a mighty hand . . . will I rule over you.\" Ezek. xx. 33.(c) Fraternal feeling; as, to give, or take, the hand; to give the right hand. (d) Contract; -- commonly of marriage; as, to ask the hand; to pledge the hand. Note: Hand is often used adjectively or in compounds (with or without the hyphen), signifying performed by the hand; as, hand blow or hand- blow, hand gripe or hand-gripe: used by, or designed for, the hand; as, hand ball or handball, hand bow, hand fetter, hand grenade or hand-grenade, handgun or hand gun, handloom or hand loom, handmill or hand organ or handorgan, handsaw or hand saw, hand-weapon: measured or regulated by the hand; as, handbreadth or hand's breadth, hand gallop or hand-gallop. Most of the words in the following paragraph are written either as two words or in combination. Hand bag, a satchel; a small bag for carrying books, papers, parcels, etc. -- Hand basket, a small or portable basket. -- Hand bell, a small bell rung by the hand; a table bell. Bacon. -- Hand bill, a small pruning hook. See 4th Bill. -- Hand car. See under Car. -- Hand director (Mus.), an instrument to aid in forming a good position of the hands and arms when playing on the piano; a hand guide. -- Hand drop. See Wrist drop. -- Hand gallop. See under Gallop. -- Hand gear (Mach.), apparatus by means of which a machine, or parts of a machine, usually operated by other power, may be operated by hand. -- Hand glass. (a) A glass or small glazed frame, for the protection of plants. (b) A small mirror with a handle. -- Hand guide. Same as Hand director (above). -- Hand language, the art of conversing by the hands, esp. as practiced by the deaf and dumb; dactylology. -- Hand lathe. See under Lathe. -- Hand money, money paid in hand to bind a contract; earnest money. -- Hand organ (Mus.), a barrel organ, operated by a crank turned by hand. -- Hand plant. (Bot.) Same as Hand tree (below). -- Hand rail, a rail, as in staircases, to hold by. Gwilt. -- Hand sail, a sail managed by the hand. Sir W. Temple. -- Hand screen, a small screen to be held in the hand. -- Hand screw, a small jack for raising heavy timbers or weights; (Carp.) a screw clamp. -- Hand staff (pl. Hand staves), a javelin. Ezek. xxxix. 9. -- Hand stamp, a small stamp for dating, addressing, or canceling papers, envelopes, etc. -- Hand tree (Bot.), a lofty tree found in Mexico (Cheirostemon platanoides), having red flowers whose stamens unite in the form of a hand. -- Hand vise, a small vise held in the hand in doing small work. Moxon. -- Hand work, or Handwork, work done with the hands, as distinguished from work done by a machine; handiwork. -- All hands, everybody; all parties. -- At all hands, On all hands, on all sides; from every direction; generally. -- At any hand, At no hand, in any (or no) way or direction; on any account; on no account. \"And therefore at no hand consisting with the safety and interests of humility.\" Jer. Taylor. -- At first hand, At second hand. See def. 10 (above). -- At hand. (a) Near in time or place; either present and within reach, or not far distant. \"Your husband is at hand; I hear his trumpet.\" Shak. (b) Under the hand or bridle. [Obs.] \"Horses hot at hand.\" Shak. -- At the hand of, by the act of; as a gift from. \"Shall we receive good at the hand of God and shall we not receive evil\" Job ii. 10. -- Bridle hand. See under Bridle. -- By hand, with the hands, in distinction from instrumentality of tools, engines, or animals; as, to weed a garden by hand; to lift, draw, or carry by hand. -- Clean hands, freedom from guilt, esp. from the guilt of dishonesty in money matters, or of bribe taking. \"He that hath clean hands shall be stronger and stronger.\" Job xvii. 9. -- From hand to hand, from one person to another. -- Hand in hand. (a) In union; conjointly; unitedly. Swift. (b) Just; fair; equitable. As fair and as good, a kind of hand in hand comparison. Shak. -- Hand over hand, Hand over fist, by passing the hands alternately one before or above another; as, to climb hand over hand; also, rapidly; as, to come up with a chase hand over hand. -- Hand over head, negligently; rashly; without seeing what one does. [Obs.] Bacon. -- Hand running, consecutively; as, he won ten times hand running. -- Hand off! keep off! forbear! no interference or meddling! -- Hand to hand, in close union; in close fight; as, a hand to hand contest. Dryden. -- Heavy hand, severity or oppression. -- In hand. (a) Paid down. \"A considerable reward in hand, and . . . a far greater reward hereafter.\" Tillotson. (b) In preparation; taking place. Chaucer. \"Revels . . . in hand.\" Shak. (c) Under consideration, or in the course of transaction; as, he has the business in hand. -- In one's hand or hands. (a) In one's possession or keeping. (b) At one's risk, or peril; as, I took my life in my hand. -- Laying on of hands, a form used in consecrating to office, in the rite of confirmation, and in blessing persons. -- Light hand, gentleness; moderation. -- Note of hand, a promissory note. -- Off hand, Out of hand, forthwith; without delay, hesitation, or difficulty; promptly. \"She causeth them to be hanged up out of hand.\" Spenser. -- Off one's hands, out of one's possession or care. -- On hand, in present possession; as, he has a supply of goods on hand. -- On one's hands, in one's possession care, or management. -- Putting the hand under the thigh, an ancient Jewish ceremony used in swearing. -- Right hand, the place of honor, power, and strength. -- Slack hand, idleness; carelessness; inefficiency; sloth. -- Strict hand, severe discipline; rigorous government. -- To bear a hand (Naut), to give help quickly; to hasten. -- To bear in hand, to keep in expectation with false pretenses. [Obs.] Shak. -- To be hand and glove, or in glove with. See under Glove. -- To be on the mending hand, to be convalescent or improving. -- To bring up by hand, to feed (an infant) without suckling it. -- To change hand. See Change. -- To change hands, to change sides, or change owners. Hudibras. -- To clap the hands, to express joy or applause, as by striking the palms of the hands together. -- To come to hand, to be received; to be taken into possession; as, the letter came to hand yesterday. -- To get hand, to gain influence. [Obs.] Appetites have . . . got such a hand over them. Baxter. -- To got one's hand in, to make a beginning in a certain work; to become accustomed to a particular business. -- To have a hand in, to be concerned in; to have a part or concern in doing; to have an agency or be employed in. -- To have in hand. (a) To have in one's power or control. Chaucer. (b) To be engaged upon or occupied with. -- To have one's hands full, to have in hand al that one can do, or more than can be done conveniently; to be pressed with labor or engagements; to be surrounded with difficulties. -- To have, or get, the (higher) upper hand, to have, or get, the better of another person or thing. -- To his hand, To my hand, etc., in readiness; already prepared. \"The work is made to his hands.\" Locke. -- To hold hand, to compete successfully or on even conditions. [Obs.] Shak. -- To lay hands on, to seize; to assault. -- To lend a hand, to give assistance. -- To lift, or put forth, the hand against, to attack; to oppose; to kill. -- To live from hand to mouth, to obtain food and other necessaries as want compels, without previous provision. -- To make one's hand, to gain advantage or profit. -- To put the hand unto, to steal. Ex. xxii. 8.-- To put the last, or finishing, hand to, to make the last corrections in; to complete; to perfect. -- To set the hand to, to engage in; to undertake. That the Lord thy God may bless thee in all that thou settest thine hand to. Deut. xxiii. 20. -- To stand one in hand, to concern or affect one. -- To strike hands, to make a contract, or to become surety for another's debt or good behavior. -- To take in hand. (a) To attempt or undertake. (b) To seize and deal with; as, he took him in hand. -- To wash the hands of, to disclaim or renounce interest in, or responsibility for, a person or action; as, to wash one's hands of a business. Matt. xxvii. 24. -- Under the hand of, authenticated by the handwriting or signature of; as, the deed is executed under the hand and seal of the owner.\n\n1. To give, pass, or transmit with the hand; as, he handed them the letter. 2. To lead, guide, or assist with the hand; to conduct; as, to hand a lady into a carriage. 3. To manage; as, I hand my oar. [Obs.] Prior. 4. To seize; to lay hands on. [Obs.] Shak. 5. To pledge by the hand; to handfast. [R.] 6. (Naut.)  To furl; -- said of a sail. Totten. To hand down, to transmit in succession, as from father to son, or from predecessor to successor; as, fables are handed down from age to age; to forward to the proper officer (the decision of a higher court); as, the Clerk of the Court of Appeals handed down its decision. -- To hand over, to yield control of; to surrender; to deliver up.\n\nTo coöperate. [Obs.] Massinger."}