{"word":"handsome","definition":"1. Dexterous; skillful; handy; ready; convenient; -- applied to things as persons. [Obs.] That they [engines of war] be both easy to be carried and handsome to be moved and turned about. Robynson (Utopia). For a thief it is so handsome as it may seem it was first invented for him. Spenser. 2. Agreeable to the eye or to correct taste; having a pleasing appearance or expression; attractive; having symmetry and dignity; comely; -- expressing more than pretty, and less than beautiful; as, a handsome man or woman; a handsome garment, house, tree, horse. 3. Suitable or fit in action; marked with propriety and ease; graceful; becoming; appropriate; as, a handsome style, etc. Easiness and handsome address in writing. Felton. 4. Evincing a becoming generosity or nobleness of character; liberal; generous. Handsome is as handsome does. Old Proverb. 5. Ample; moderately large. He . . . accumulated a handsome sum of money. V. Knox. To do the handsome thing, to act liberally. [Colloq.] Syn. -- Handsome, Pretty. Pretty applies to things comparatively small, which please by their delicacy and grace; as, a pretty girl, a pretty flower, a pretty cottage. Handsome rises higher, and is applied to objects on a larger scale. We admire what is handsome, we are pleased with what is pretty. The word is connected with hand, and has thus acquired the idea of training, cultivation, symmetry, and proportion, which enters so largely into our conception of handsome. Thus Drayton makes mention of handsome players, meaning those, who are well trained; and hence we speak of a man's having a handsome address, which is the result of culture; of a handsome horse or dog, which implies well proportioned limbs; of a handsome face, to which, among other qualities, the idea of proportion and a graceful contour are essential; of a handsome tree, and a handsome house or villa. So, from this idea of proportion or suitableness, we have, with a different application, the expressions, a handsome fortune, a handsome offer.\n\nTo render handsome. [Obs.] Donne"}