{"word":"hatch","definition":"1. To cross with lines in a peculiar manneHatching. Shall win this sword, silvered and hatched. Chapman. Those hatching strokes of the pencil. Dryden. 2. To cross; to spot; to stain; to steep. [Obs.] His weapon hatched in blood. Beau. & Fl.\n\n1. To produce, as young, from an egg or eggs by incubation, or by artificial heat; to produce young from (eggs); as, the young when hatched. Paley. As the partridge sitteth on eggs, and hatcheth them not. Jer. xvii. 11. For the hens do not sit upon the eggs; but by keeping them in a certain equal heat they [the husbandmen] bring life into them and hatch them. Robynson (More's Utopia). 2. To contrive or plot; to form by meditation, and bring into being; to originate and produce; to concoct; as, to hatch mischief; to hatch heresy. Hooker. Fancies hatched In silken-folded idleness. Tennyson.\n\nTo produce young; -- said of eggs; to come forth from the egg; -- said of the young of birds, fishes, insects, etc.\n\n1. The act of hatching. 2. Development; disclosure; discovery. Shak. 3. The chickens produced at once or by one incubation; a brood.\n\n1. A door with an opening over it; a half door, sometimes set with spikes on the upper edge. In at the window, or else o'er the hatch. Shak. 2. A frame or weir in a river, for catching fish. 3. A flood gate; a a sluice gate. Ainsworth. 4. A bedstead. [Scot.] Sir W. Scott. 5. An opening in the deck of a vessel or floor of a warehouse which serves as a passageway or hoistway; a hatchway; also; a cover or door, or one of the covers used in closing such an opening. 6. (Mining)  An opening into, or in search of, a mine. Booby hatch, Buttery hatch, Companion hatch, etc. See under Booby, Buttery, etc. -- To batten down the hatches (Naut.), to lay tarpaulins over them, and secure them with battens. -- To be under hatches, to be confined below in a vessel; to be under arrest, or in slavery, distress, etc.\n\nTo close with a hatch or hatches. 'T were not amiss to keep our door hatched. Shak"}