{"word":"have","definition":"1. To hold in possession or control; to own; as, he has a farm. 2. To possess, as something which appertains to, is connected with, or affects, one. The earth hath bubbles, as the water has. Shak. He had a fever late. Keats. 3. To accept possession of; to take or accept. Break thy mind to me in broken English; wilt thou have me Shak. 4. To get possession of; to obtain; to get. Shak. 5. To cause or procure to be; to effect; to exact; to desire; to require. It had the church accurately described to me. Sir W. Scott. Wouldst thou have me turn traitor also Ld. Lytton. 6. To bear, as young; as, she has just had a child. 7. To hold, regard, or esteem. Of them shall I be had in honor. 2 Sam. vi. 22. 8. To cause or force to go; to take. \"The stars have us to bed.\" Herbert. \"Have out all men from me.\" 2 Sam. xiii. 9. 9. To take or hold (one's self); to proceed promptly; -- used reflexively, often with ellipsis of the pronoun; as, to have after one; to have at one or at a thing, i. e., to aim at one or at a thing; to attack; to have with a companion. Shak. 10. To be under necessity or obligation; to be compelled; followed by an infinitive. Science has, and will long have, to be a divider and a separatist. M. Arnold. The laws of philology have to be established by external comparison and induction. Earle. 11. To understand. You have me, have you not Shak. 12. To put in an awkward position; to have the advantage of; as, that is where he had him. [Slang] Note: Have, as an auxiliary verb, is used with the past participle to form preterit tenses; as, I have loved; I shall have eaten. Originally it was used only with the participle of transitive verbs, and denoted the possession of the object in the state indicated by the participle; as, I have conquered him, I have or hold him in a conquered state; but it has long since lost this independent significance, and is used with the participles both of transitive and intransitive verbs as a device for expressing past time. Had is used, especially in poetry, for would have or should have. Myself for such a face had boldly died. Tennyson. To have a care, to take care; to be on one's guard. -- To have (a man) out, to engage (one) in a duel. -- To have done (with). See under Do, v. i. -- To have it out, to speak freely; to bring an affair to a conclusion. -- To have on, to wear. -- To have to do with. See under Do, v. t. Syn. -- To possess; to own. See Possess."}