{"word":"hedge","definition":"A thicket of bushes, usually thorn bushes; especially, such a thicket planted as a fence between any two portions of land; and also any sort of shrubbery, as evergreens, planted in a line or as a fence; particularly, such a thicket planted round a field to fence it, or in rows to separate the parts of a garden. The roughest berry on the rudest hedge. Shak. Through the verdant maze Of sweetbrier hedges I pursue my walk. Thomson. Note: Hedge, when used adjectively or in composition, often means rustic, outlandish, illiterate, poor, or mean; as, hedge priest; hedgeborn, etc. Hedge bells, Hedge bindweed (Bot.), a climbing plant related to the morning-glory (Convolvulus sepium). -- Hedge bill, a long-handled billhook. -- Hedge garlic (Bot.), a plant of the genus Alliaria. See Garlic mustard, under Garlic. -- Hedge hyssop (Bot.), a bitter herb of the genus Gratiola, the leaves of which are emetic and purgative. -- Hedge marriage, a secret or clandestine marriage, especially one performed by a hedge priest. [Eng.] -- Hedge mustard (Bot.), a plant of the genus Sisymbrium, belonging to the Mustard family. -- Hedge nettle (Bot.), an herb, or under shrub, of the genus Stachys, belonging to the Mint family. It has a nettlelike appearance, though quite harmless. -- Hedge note. (a) The note of a hedge bird. (b) Low, contemptible writing. [Obs.] Dryden. -- Hedge priest, a poor, illiterate priest. Shak. -- Hedge school, an open-air school in the shelter of a hedge, in Ireland; a school for rustics. -- Hedge sparrow (Zoöl.), a European warbler (Accentor modularis) which frequents hedges. Its color is reddish brown, and ash; the wing coverts are tipped with white. Called also chanter, hedge warbler, dunnock, and doney. -- Hedge writer, an insignificant writer, or a writer of low, scurrilous stuff. [Obs.] Swift. -- To breast up a hedge. See under Breast. -- To hang in the hedge, to be at a standstill. \"While the business of money hangs in the hedge.\" Pepys.\n\n1. To inclose or separate with a hedge; to fence with a thickly set line or thicket of shrubs or small trees; as, to hedge a field or garden. 2. To obstruct, as a road, with a barrier; to hinder from progress or success; -- sometimes with up and out. I will hedge up thy way with thorns. Hos. ii. 6. Lollius Urbius . . . drew another wall . . . to hedge out incursions from the north. Milton. 3. To surround for defense; to guard; to protect; to hem (in). \"England, hedged in with the main.\" Shak. 4. To surround so as to prevent escape. That is a law to hedge in the cuckoo. Locke. To hedge a bet, to bet upon both sides; that is, after having bet on one side, to bet also on the other, thus guarding against loss.\n\n1. To shelter one's self from danger, risk, duty, responsibility, etc., as if by hiding in or behind a hedge; to skulk; to slink; to shirk obligations. I myself sometimes, leaving the fear of God on the left hand and hiding mine honor in my necessity, am fain to shuffle, to hedge and to lurch. Shak. 2. (Betting)  To reduce the risk of a wager by making a bet against the side or chance one has bet on. 3. To use reservations and qualifications in one's speech so as to avoid committing one's self to anything definite. The Heroic Stanzas read much more like an elaborate attempt to hedge between the parties than . . . to gain favor from the Roundheads. Saintsbury."}