{"word":"history","definition":"1. A learning or knowing by inquiry; the knowledge of facts and events, so obtained; hence, a formal statement of such information; a narrative; a description; a written record; as, the history of a patient's case; the history of a legislative bill. 2. A systematic, written account of events, particularly of those affecting a nation, institution, science, or art, and usually connected with a philosophical explanation of their causes; a true story, as distinguished from a romance; -- distinguished also from annals, which relate simply the facts and events of each year, in strict chronological order; from biography, which is the record of an individual's life; and from memoir, which is history composed from personal experience, observation, and memory. Histories are as perfect as the historian is wise, and is gifted with an eye and a soul. Carlyle. For aught that I could ever read, Could ever hear by tale or history. Shak. What histories of toil could I declare! Pope. History piece, a representation in painting, drawing, etc., of any real event, including the actors and the action. -- Natural history, a description and classification of objects in nature, as minerals, plants, animals, etc., and the phenomena which they exhibit to the senses. Syn. -- Chronicle; annals; relation; narration. -- History, Chronicle, Annals. History is a methodical record of important events which concern a community of men, usually so arranged as to show the connection of causes and effects, to give an analysis of motive and action etc. A chronicle is a record of such events, conforming to the order of time as its distinctive feature. Annals are a chronicle divided up into separate years. By poetic license annals is sometimes used for history. Justly Cæsar scorns the poet's lays; It is to history he trusts for praise. Pope. No more yet of this; For 't is a chronicle of day by day, Not a relation for a breakfast. Shak. Many glorious examples in the annals of our religion. Rogers.\n\nTo narrate or record. [Obs.] Shak."}