{"word":"hog","definition":"1. (Zoöl.)  A quadruped of the genus Sus, and allied genera of Suidæ; esp., the domesticated varieties of S. scrofa, kept for their fat and meat, called, respectively, lard and pork; swine; porker; specifically, a castrated boar; a barrow. Note: The domestic hogs of Siam, China, and parts of Southern Europe, are thought to have been derived from Sus Indicus. 2. A mean, filthy, or gluttonous fellow. [Low.] 3. A young sheep that has not been shorn. [Eng.] 4. (Naut.)  A rough, flat scrubbing broom for scrubbing a ship's bottom under water. Totten. 5. (Paper Manuf.) A device for mixing and stirring the pulp of which paper is made. Bush hog, Ground hog, etc. See under Bush, Ground, etc. -- Hog caterpillar (Zoöl.), the larva of the green grapevine sphinx; -- so called because the head and first three segments are much smaller than those behind them, so as to make a resemblance to a hog's snout. See Hawk moth. -- Hog cholera, an epidemic contagious fever of swine, attended by liquid, fetid, diarrhea, and by the appearance on the skin and mucous membrane of spots and patches of a scarlet, purple, or black color. It is fatal in from one to six days, or ends in a slow, uncertain recovery. Law (Farmer's Veter. Adviser. )-- Hog deer (Zoöl.), the axis deer. -- Hog gum (Bot.), West Indian tree (Symphonia globulifera), yielding an aromatic gum. -- Hog of wool, the trade name for the fleece or wool of sheep of the second year. -- Hog peanut (Bot.), a kind of earth pea. -- Hog plum (Bot.), a tropical tree, of the genus Spondias (S. lutea), with fruit somewhat resembling plums, but chiefly eaten by hogs. It is found in the West Indies. -- Hog's bean (Bot.), the plant henbane. -- Hog's bread.(Bot.) See Sow bread. -- Hog's fennel. (Bot.) See under Fennel. -- Mexican hog (Zoöl.), the peccary. -- Water hog. (Zoöl.) See Capybara.\n\n1. To cut short like bristles; as, to hog the mane of a horse. Smart. 2. (Naut.)  To scrub with a hog, or scrubbing broom.\n\nTo become bent upward in the middle, like a hog's back; -- said of a ship broken or strained so as to have this form."}