{"word":"hold","definition":"The whole interior portion of a vessel below the lower deck, in which the cargo is stowed.\n\n1. To cause to remain in a given situation, position, or relation, within certain limits, or the like; to prevent from falling or escaping; to sustain; to restrain; to keep in the grasp; to retain. The loops held one curtain to another. Ex. xxxvi. 12. Thy right hand shall hold me. Ps. cxxxix. 10. They all hold swords, being expert in war. Cant. iii. In vain he seeks, that having can not hold. Spenser. France, thou mayst hold a serpent by the tongue, . . . A fasting tiger safer by the tooth, Than keep in peace that hand which thou dost hold. Shak. 2. To retain in one's keeping; to maintain possession of, or authority over; not to give up or relinquish; to keep; to defend. We mean to hold what anciently we claim Of deity or empire. Milton. 3. To have; to possess; to be in possession of; to occupy; to derive title to; as, to hold office. This noble merchant held a noble house. Chaucer. Of him to hold his seigniory for a yearly tribute. Knolles. And now the strand, and now the plain, they held. Dryden. 4. To impose restraint upon; to limit in motion or action; to bind legally or morally; to confine; to restrain. We can not hold mortality's strong hand. Shak. Death! what do'st O,hold thy blow. Grashaw. He hat not sufficient judgment and self-command to hold his tongue. Macaulay. 5. To maintain in being or action; to carry on; to prosecute, as a course of conduct or an argument; to continue; to sustain. Hold not thy peace, and be not still. Ps. lxxxiii. 1. Seedtime and harvest, heat and hoary frost, Shall hold their course. Milton. 6. To prosecute, have, take, or join in, as something which is the result of united action; as to, hold a meeting, a festival, a session, etc.; hence, to direct and bring about officially; to conduct or preside at; as, the general held a council of war; a judge holds a court; a clergyman holds a service. I would hold more talk with thee. Shak. 7. To receive and retain; to contain as a vessel; as, this pail holds milk; hence, to be able to receive and retain; to have capacity or containing power for. Broken cisterns that can hold no water. Jer. ii. 13. One sees more devils than vast hell can hold. Shak. 8. To accept, as an opinion; to be the adherent of, openly or privately; to persist in, as a purpose; to maintain; to sustain. Stand fast and hold the traditions which ye have been taught. 2 Thes. ii.15. But still he held his purpose to depart. Dryden. 9. To consider; to regard; to esteem; to account; to think; to judge. I hold him but a fool. Shak. I shall never hold that man my friend. Shak. The Lord will not hold him guiltless that taketh his name in vain. Ex. xx. 7. 10. To bear, carry, or manage; as he holds himself erect; he holds his head high. Let him hold his fingers thus. Shak. To hold a wager, to lay or hazard a wager. Swift. -- To hold forth, to offer; to exhibit; to propose; to put forward. \"The propositions which books hold forth and pretend to teach.\" Locke. -- To held in, to restrain; to curd. -- To hold in hand, to toy with; to keep in expectation; to have in one's power. [Obs.] O, fie! to receive favors, return falsehoods, And hold a lady in hand. Beaw. & Fl. --To hold in play, to keep under control; to dally with. Macaulay. -- To hold off, to keep at a distance. -- To hold on, to hold in being, continuance or position; as, to hold a rider on. -- To hold one's day, to keep one's appointment. [Obs.] Chaucer. -- To hold one's own. (a) To keep good one's present condition absolutely or relatively; not to fall off, or to lose ground; as, a ship holds her own when she does not lose ground in a race or chase; a man holds his own when he does not lose strength or weight. -- To hold one's peace, to keep silence.- To hold out. (a) To extend; to offer. \"Fortune holds out these to you as rewards.\" B. Jonson. (b) To continue to do or to suffer; to endure. \"He can not long hold out these pangs.\" Shak. -- To hold up. (a) To raise; to lift; as, hold up your head. (b) To support; to sustain. \"He holds himself up in virtue.\"Sir P. Sidney. (c) To exhibit; to display; as, he was held up as an example. (d) To rein in; to check; to halt; as, hold up your horses. -- To hold water. (a) Literally, to retain water without leaking; hence (Fig.), to be whole, sound, consistent, without gaps or holes; -- commonly used in a negative sense; as, his statements will not hold water. [Collog.] (b) (Naut.) To hold the oars steady in the water, thus checking the headway of a boat.\n\nIn general, to keep one's self in a given position or condition; to remain fixed. Hence: 1. Not to more; to halt; to stop;-mostly in the imperative. And damned be him that first cries, \"Hold, enough!\" Shak. 2. Not to give way; not to part or become separated; to remain unbroken or unsubdued. Our force by land hath nobly held. Shak. 3. Not to fail or be found wanting; to continue; to last; to endure a test or trial; to abide; to persist. While our obedience holds. Milton. The rule holds in land as all other commodities. Locke. 4. Not to fall away, desert, or prove recreant; to remain attached; to cleave;-often with with, to, or for. He will hold to the one and despise the other. Matt. vi. 24 5. To restrain one's self; to refrain. His dauntless heart would fain have held From weeping, but his eyes rebelled. Dryden. 6. To derive right or title; -- generally with of. My crown is absolute, and holds of none. Dryden. His imagination holds immediately from nature. Hazlitt. Hold on! Hold up! wait; stop; forbear. [Collog] -- To hold forth, to speak in public; to harangue; to preach. L'Estrange. -- To hold in, to restrain one's self; as, he wanted to laugh and could hardly hold in. -- To hold off, to keep at a distance. -- To hold on, to keep fast hold; to continue; to go on. \"The trade held on for many years,\" Swift. -- To hold out, to last; to endure; to continue; to maintain one's self; not to yield or give way. -- To hold over, to remain in office, possession, etc., beyond a certain date. -- To hold to or with, to take sides with, as a person or opinion. -- To hold together, to be joined; not to separate; to remain in union. Dryden. Locke. -- To hold up. (a) To support one's self; to remain unbent or unbroken; as, to hold up under misfortunes. (b) To cease raining; to cease to stop; as, it holds up. Hudibras. (c) To keep up; not to fall behind; not to lose ground. Collier.\n\n1. The act of holding, as in or with the hands or arms; the manner of holding, whether firm or loose; seizure; grasp; clasp; gripe; possession; -- often used with the verbs take and lay. Ne have I not twelve pence within mine hold. Chaucer. Thou should'st lay hold upon him. B. Jonson. My soul took hold on thee. Addison. Take fast hold of instruction. Pror. iv. 13. 2. The authority or ground to take or keep; claim. The law hath yet another hold on you. Shak. 3. Binding power and influence. Fear . . . by which God and his laws take the surest hold of. Tillotson. 4. Something that may be grasped; means of support. If a man be upon an high place without rails or good hold, he is ready to fall. Bacon. 5. A place of confinement; a prison; confinement; custody; guard. They . . . put them in hold unto the next day. Acts. iv. 3. King Richard, he is in the mighty hold Of Bolingbroke. Shak. 6. A place of security; a fortified place; a fort; a castle; -- often called a stronghold. Chaucer. New comers in an ancient hold Tennyson. 7. (Mus.)  A character [thus pause, and corona."}