{"word":"hollow","definition":"1. Having an empty space or cavity, natural or artificial, within a solid substance; not solid; excavated in the interior; as, a hollow tree; a hollow sphere. Hollow with boards shalt thou make it. Ex. xxvii. 8.. 2. Depressed; concave; gaunt; sunken. With hollow eye and wrinkled brow. Shak. 3. Reverberated from a cavity, or resembling such a sound; deep; muffled; as, a hollow roar. Dryden. 4. Not sincere or faithful; false; deceitful; not sound; as, a hollow heart; a hollow friend. Milton. Hollow newel (Arch.), an opening in the center of a winding staircase in place of a newel post, the stairs being supported by the wall; an open newel; also, the stringpiece or rail winding around the well of such a staircase. -- Hollow quoin (Engin.), a pier of stone or brick made behind the lock gates of a canal, and containing a hollow or recess to receive the ends of the gates. -- Hollow root. (Bot.) See Moschatel. -- Hollow square. See Square. -- Hollow ware, hollow vessels; -- a trade name for cast-iron kitchen utensils, earthenware, etc. Syn.- Concave; sunken; low; vacant; empty; void; false; faithless; deceitful; treacherous.\n\n1. A cavity, natural or artificial; an unfilled space within anything; a hole, a cavern; an excavation; as the hollow of the hand or of a tree. 2. A low spot surrounded by elevations; a depressed part of a surface; a concavity; a channel. Forests grew Upon the barren hollows. Prior. I hate the dreadful hollow behind the little wood. Tennyson.\n\nTo make hollow, as by digging, cutting, or engraving; to excavate. \"Trees rudely hollowed.\" Dryden.\n\nWholly; completely; utterly; -- chiefly after the verb to beat, and often with all; as, this story beats the other all hollow. See All, adv. [Collog.] The more civilized so-called Caucasian races have beaten the Turks hollow in the struggle for existence. Darwin.\n\nHollo.\n\nTo shout; to hollo. Whisperings and hollowings are alike to a deaf ear. Fuller.\n\nTo urge or call by shouting. He has hollowed the hounds. Sir W. Scott."}