{"word":"honor","definition":"1. Esteem due or paid to worth; high estimation; respect; consideration; reverence; veneration; manifestation of respect or reverence. A prophet is not without honor, save in his own country. Matt. xiii. 57. 2. That which rightfully attracts esteem, respect, or consideration; self-respect; dignity; courage; fidelity; especially, excellence of character; high moral worth; virtue; nobleness; specif., in men, integrity; uprightness; trustworthness; in women, purity; chastity. If she have forgot Honor and virtue. Shak. Godlike erect, with native honor clad. Milton. 3. A nice sense of what is right, just, and true, with course of life correspondent thereto; strict conformity to the duty imposed by conscience, position, or privilege. Say, what is honor 'T is the finest sense Of justice which the human mind can frame, Intent each lurking frailty to disclaim, And guard the way of life from all offense Suffered or done. Wordsworth. I could not love thee, dear, so much, Loved I not honor more. Lovelace. 4. That to which esteem or consideration is paid; distinguished position; high rank. \"Restored me to my honors.\" Shak. I have given thee . . . both riches, and honor. 1 Kings iii. 13. Thou art clothed with honor and majesty. Ps. civ. 1. 5. Fame; reputation; credit. Some in theiractions do woo, and affect honor and reputation. Bacon. If my honor is meant anything distinct from conscience, 't is no more than a regard to the censure and esteem of the world. Rogers. 6. A token of esteem paid to worth; a mark of respect; a ceremonial sign of consideration; as, he wore an honor on his breast; military honors; civil honors. \"Their funeral honors.\" Dryden. 7. A cause of respect and fame; a glory; an excellency; an ornament; as, he is an honor to his nation. 8. A title applied to the holders of certain honorable civil offices, or to persons of rank; as, His Honor the Mayor. See Note under Honorable. 9. (Feud. Law)  A seigniory or lordship held of the king, on which other lordships and manors depended. Cowell. 10. pl.  Academic or university prizes or distinctions; as, honors in classics. 11. pl. (Whist)  The ace, king, queen, and jack of trumps. The ten and nine are sometimes called Dutch honors. R. A. Proctor. Affair of honor, a dispute to be decided by a duel, or the duel itself. -- Court of honor, a court or tribunal to investigate and decide questions relating to points of honor; as a court of chivalry, or a military court to investigate acts or omissions which are unofficerlike or ungentlemanly in their nature. -- Debt of honor, a debt contracted by a verbal promise, or by betting or gambling, considered more binding than if recoverable by law. -- Honor bright! An assurance of truth or fidelity. [Colloq.] -- Honor court (Feudal Law), one held in an honor or seignory. -- Honor point. (Her.) See Escutcheon. -- Honors of war (Mil.), distinctions granted to a vanquished enemy, as of marching out from a camp or town armed, and with colors flying. -- Law, or Code, of honor, certain rules by which social intercourse is regulated among persons of fashion, and which are founded on a regard to reputation. Paley. -- Maid of honor, a lady of rank, whose duty it is to attend the queen when she appears in public. -- On one's honor, on the pledge of one's honor; as, the members of the House of Lords in Great Britain, are not under oath, but give their statements or verdicts on their honor. -- Point of honor, a scruple or nice distinction in matters affecting one's honor; as, he raised a point of honor. -- To do the honors, to bestow honor, as on a guest; to act as host or hostess at an entertainment. \"To do the honors and to give the word.\" Pope. -- To do one honor, to confer distinction upon one. -- To have the honor, to have the privilege or distinction. -- Word of honor, an engagement confirmed by a pledge of honor.\n\n1. To regard or treat with honor, esteem, or respect; to revere; to treat with deference and submission; when used of the Supreme Being, to reverence; to adore; to worship. Honor thy father and thy mother. Ex. xx. 12. That all men should honor the Son, even as they honor the Father. John v. 23. It is a custom More honor'd in the breach than the observance. Shak. 2. To dignify; to raise to distinction or notice; to bestow honor upon; to elevate in rank or station; to ennoble; to exalt; to glorify; hence, to do something to honor; to treat in a complimentary manner or with civility. Thus shall it be done to the man whom the king delighten to honor. Esther vi. 9. The name of Cassius honors this corruption. Shak. 3. (Com.)  To accept and pay when due; as, to honora bill of exchange."}