{"word":"horned","definition":"Furnished with a horn or horns; furnished with a hornlike process or appendage; as, horned cattle; having some part shaped like a horn. The horned moon with one bright star Within the nether tip. Coleridge. Horned bee (Zoöl.), a British wild bee (Osmia bicornis), having two little horns on the head. -- Horned dace (Zoöl.), an American cyprinoid fish (Semotilus corporialis) common in brooks and ponds; the common chub. See Illust. of Chub. -- Horned frog (Zoöl.), a very large Brazilian frog (Ceratophrys cornuta), having a pair of triangular horns arising from the eyelids. -- Horned grebe (Zoöl.), a species of grebe (Colymbus auritus), of Arctic Europe and America, having two dense tufts of feathers on the head. -- Horned horse (Zoöl.), the gnu. -- Horned lark (Zoöl.), the shore lark. -- Horned lizard (Zoöl.), the horned toad. -- Horned owl (Zoöl.), a large North American owl (Bubo Virginianus), having a pair of elongated tufts of feathers on the head. Several distinct varieties are known; as, the Arctic, Western, dusky, and striped horned owls, differing in color, and inhabiting different regions; -- called also great horned owl, horn owl, eagle owl, and cat owl. Sometimes also applied to the long-eared owl. See Eared owl, under Eared. -- Horned poppy. (Bot.) See Horn poppy, under Horn. -- Horned pout (Zoöl.), an American fresh-water siluroid fish; the bullpout. -- Horned rattler (Zoöl.), a species of rattlesnake (Crotalus cerastes), inhabiting the dry, sandy plains, from California to Mexico. It has a pair of triangular horns between the eyes; -- called also sidewinder. -- Horned ray (Zoöl.), the sea devil. -- Horned screamer (Zoöl.), the kamichi. -- Horned snake (Zoöl.), the cerastes. -- Horned toad (Zoöl.), any lizard of the genus Phrynosoma, of which nine or ten species are known. These lizards have several hornlike spines on the head, and a broad, flat body, covered with spiny scales. They inhabit the dry, sandy plains from California to Mexico and Texas. Called also horned lizard. -- Horned viper. (Zoöl.) See Cerastes."}