{"word":"horse","definition":"1. (Zoöl.)  A hoofed quadruped of the genus Equus; especially, the domestic horse (E. caballus), which was domesticated in Egypt and Asia at a very early period. It has six broad molars, on each side of each jaw, with six incisors, and two canine teeth, both above and below. The mares usually have the canine teeth rudimentary or wanting. The horse differs from the true asses, in having a long, flowing mane, and the tail bushy to the base. Unlike the asses it has callosities, or chestnuts, on all its legs. The horse excels in strength, speed, docility, courage, and nobleness of character, and is used for drawing, carrying, bearing a rider, and like purposes. Note: Many varieties, differing in form, size, color, gait, speed, etc., are known, but all are believed to have been derived from the same original species. It is supposed to have been a native of the plains of Central Asia, but the wild species from which it was derived is not certainly known. The feral horses of America are domestic horses that have run wild; and it is probably true that most of those of Asia have a similar origin. Some of the true wild Asiatic horses do, however, approach the domestic horse in several characteristics. Several species of fossil (Equus) are known from the later Tertiary formations of Europe and America. The fossil species of other genera of the family Equidæ are also often called horses, in general sense. 2. The male of the genus horse, in distinction from the female or male; usually, a castrated male. 3. Mounted soldiery; cavalry; -- used without the plural termination; as, a regiment of horse; -- distinguished from foot. The armies were appointed, consisting of twenty-five thousand horse and foot. Bacon. 4. A frame with legs, used to support something; as, a clotheshorse, a sawhorse, etc. 5. A frame of timber, shaped like a horse, on which soldiers were made to ride for punishment. 6. Anything, actual or figurative, on which one rides as on a horse; a hobby. 7. (Mining)  A mass of earthy matter, or rock of the same character as the wall rock, occurring in the course of a vein, as of coal or ore; hence, to take horse -- said of a vein -- is to divide into branches for a distance. 8. (Naut.) (a) See Footrope, a. (b) A breastband for a leadsman. (c) An iron bar for a sheet traveler to slide upon. (d) A jackstay. W. C. Russell. Totten. Note: Horse is much used adjectively and in composition to signify of, or having to do with, a horse or horses, like a horse, etc.; as, horse collar, horse dealer or horsehorsehoe, horse jockey; and hence, often in the sense of strong, loud, coarse, etc.; as, horselaugh, horse nettle or horse-nettle, horseplay, horse ant, etc. Black horse, Blood horse, etc. See under Black, etc. -- Horse aloes, caballine aloes. -- Horse ant (Zoöl.), a large ant (Formica rufa); -- called also horse emmet. -- Horse artillery, that portion of the artillery in which the cannoneers are mounted, and which usually serves with the cavalry; flying artillery. -- Horse balm (Bot.), a strong-scented labiate plant (Collinsonia Canadensis), having large leaves and yellowish flowers. -- Horse bean (Bot.), a variety of the English or Windsor bean (Faba vulgaris), grown for feeding horses. -- Horse boat, a boat for conveying horses and cattle, or a boat propelled by horses. -- Horse bot. (Zoöl.) See Botfly, and Bots. -- Horse box, a railroad car for transporting valuable horses, as hunters. [Eng.] -- Horse breaker or trainer, one employed in subduing or training horses for use. -- Horse car. (a) A railroad car drawn by horses. See under Car. (b) A car fitted for transporting horses. -- Horse cassia (Bot.), a leguminous plant (Cassia Javanica), bearing long pods, which contain a black, catharic pulp, much used in the East Indies as a horse medicine. -- Horse cloth, a cloth to cover a horse. -- Horse conch (Zoöl.), a large, spiral, marine shell of the genus Triton. See Triton. -- Horse courser. (a) One that runs horses, or keeps horses for racing. Johnson. (b) A dealer in horses. [Obs.] Wiseman. -- Horse crab (Zoöl.), the Limulus; -- called also horsefoot, horsehoe crab, and king crab. -- Horse crevallé (Zoöl.), the cavally. -- Horse emmet (Zoöl.), the horse ant. -- Horse finch (Zoöl.), the chaffinch. [Prov. Eng.] -- Horse gentian (Bot.), fever root. -- Horse iron (Naut.), a large calking iron. -- Horse latitudes, a space in the North Atlantic famous for calms and baffling winds, being between the westerly winds of higher latitudes and the trade winds. Ham. Nav. Encyc. -- Horse mackrel. (Zoöl.) (a) The common tunny (Orcynus thunnus), found on the Atlantic coast of Europe and America, and in the Mediterranean. (b) The bluefish (Pomatomus saltatrix). (c) The scad. (d) The name is locally applied to various other fishes, as the California hake, the black candlefish, the jurel, the bluefish, etc. -- Horse marine (Naut.), an awkward, lubbery person; one of a mythical body of marine cavalry. [Slang] -- Horse mussel (Zoöl.), a large, marine mussel (Modiola modiolus), found on the northern shores of Europe and America. -- Horse nettle (Bot.), a coarse, prickly, American herb, the Solanum Carolinense. -- Horse parsley. (Bot.) See Alexanders. -- Horse purslain (Bot.), a coarse fleshy weed of tropical America (Trianthema monogymnum). -- Horse race, a race by horses; a match of horses in running or trotting. -- Horse racing, the practice of racing with horses. -- Horse railroad, a railroad on which the cars are drawn by horses; -- in England, and sometimes in the United States, called a tramway. -- Horse run (Civil Engin.), a device for drawing loaded wheelbarrows up an inclined plane by horse power. -- Horse sense, strong common sense. [Colloq. U.S.] -- Horse soldier, a cavalryman. -- Horse sponge (Zoöl.), a large, coarse, commercial sponge (Spongia equina). -- Horse stinger (Zoöl.), a large dragon fly. [Prov. Eng.] -- Horse sugar (Bot.), a shrub of the southern part of the United States (Symplocos tinctoria), whose leaves are sweet, and good for fodder. -- Horse tick (Zoöl.), a winged, dipterous insect (Hippobosca equina), which troubles horses by biting them, and sucking their blood; -- called also horsefly, horse louse, and forest fly. -- Horse vetch (Bot.), a plant of the genus Hippocrepis (H. comosa), cultivated for the beauty of its flowers; -- called also horsehoe vetch, from the peculiar shape of its pods. -- Iron horse, a locomotive. [Colloq.] -- Salt horse, the sailor's name for salt beef. -- To look a gift horse in the mouth, to examine the mouth of a horse which has been received as a gift, in order to ascertain his age; -- hence, to accept favors in a critical and thankless spirit. Lowell. -- To take horse. (a) To set out on horseback. Macaulay. (b) To be covered, as a mare. (c) See definition 7 (above).\n\n1. To provide with a horse, or with horses; to mount on, or as on, a horse. \"Being better horsed, outrode me.\" Shak. 2. To sit astride of; to bestride. Shak. 3. To cover, as a mare; -- said of the male. 4. To take or carry on the back; as, the keeper, horsing a deer. S. Butler. 5. To place on the back of another, or on a wooden horse, etc., to be flogged; to subject to such punishment.\n\nTo get on horseback. [Obs.] Shelton."}