{"word":"hour","definition":"1. The twenty-fourth part of a day; sixty minutes. 2. The time of the day, as expressed in hours and minutes, and indicated by a timepiece; as, what is the hour At what hour shall we meet 3. Fixed or appointed time; conjuncture; a particular time or occasion; as, the hour of greatest peril; the man for the hour. Woman, . . . mine hour is not yet come. John ii. 4. This is your hour, and the power of darkness. Luke xxii. 53. 4. pl. (R. C. Ch.)  Certain prayers to be repeated at stated times of the day, as matins and vespers. 5. A measure of distance traveled. Vilvoorden, three hours from Brussels. J. P. Peters. After hours, after the time appointed for one's regular labor. -- Canonical hours. See under Canonical. -- Hour angle (Astron.), the angle between the hour circle passing through a given body, and the meridian of a place. -- Hour circle. (Astron.) (a) Any circle of the sphere passing through the two poles of the equator; esp., one of the circles drawn on an artificial globe through the poles, and dividing the equator into spaces of 15ยบ, or one hour, each. (b) A circle upon an equatorial telescope lying parallel to the plane of the earth's equator, and graduated in hours and subdivisions of hours of right ascension. (c) A small brass circle attached to the north pole of an artificial globe, and divided into twenty-four parts or hours. It is used to mark differences of time in working problems on the globe. -- Hour hand, the hand or index which shows the hour on a timepiece. -- Hour line. (a) (Astron.) A line indicating the hour. (b) (Dialing) A line on which the shadow falls at a given hour; the intersection of an hour circle which the face of the dial. -- Hour plate, the plate of a timepiece on which the hours are marked; the dial. Locke. -- Sidereal hour, the twenty-fourth part of a sidereal day. -- Solar hour, the twenty-fourth part of a solar day. -- The small hours, the early hours of the morning, as one o'clock, two o'clock, etc. -- To keep good hours, to be regular in going to bed early."}