{"word":"house","definition":"1. A structure intended or used as a habitation or shelter for animals of any kind; but especially, a building or edifice for the habitation of man; a dwelling place, a mansion. Houses are built to live in; not to look on. Bacon. Bees with smoke and doves with noisome stench Are from their hives and houses driven away. Shak. 2. Household affairs; domestic concerns; particularly in the phrase to keep house. See below. 3. Those who dwell in the same house; a household. One that feared God with all his house. Acts x. 2. 4. A family of ancestors, descendants, and kindred; a race of persons from the same stock; a tribe; especially, a noble family or an illustrious race; as, the house of Austria; the house of Hanover; the house of Israel. The last remaining pillar of their house, The one transmitter of their ancient name. Tennyson. 5. One of the estates of a kingdom or other government assembled in parliament or legislature; a body of men united in a legislative capacity; as, the House of Lords; the House of Commons; the House of Representatives; also, a quorum of such a body. See Congress, and Parliament. 6. (Com.)  A firm, or commercial establishment. 7. A public house; an inn; a hotel. 8. (Astrol.)  A twelfth part of the heavens, as divided by six circles intersecting at the north and south points of the horizon, used by astrologers in noting the positions of the heavenly bodies, and casting horoscopes or nativities. The houses were regarded as fixed in respect to the horizon, and numbered from the one at the eastern horizon, called the ascendant, first house, or house of life, downward, or in the direction of the earth's revolution, the stars and planets passing through them in the reverse order every twenty- four hours. 9. A square on a chessboard, regarded as the proper place of a piece. 10. An audience; an assembly of hearers, as at a lecture, a theater, etc.; as, a thin or a full house. 11. The body, as the habitation of the soul. This mortal house I'll ruin, Do Cæsar what he can. Shak. 12. [With an adj., as narrow, dark, etc.]  The grave. \"The narrow house.\" Bryant. Note: House is much used adjectively and as the first element of compounds. The sense is usually obvious; as, house cricket, housemaid, house painter, housework. House ant (Zoöl.), a very small, yellowish brown ant (Myrmica molesta), which often infests houses, and sometimes becomes a great pest. -- House of bishops (Prot. Epis. Ch.), one of the two bodies composing a general convertion, the other being House of Clerical and Lay Deputies. -- House boat, a covered boat used as a dwelling. -- House of call, a place, usually a public house, where journeymen connected with a particular trade assemble when out of work, ready for the call of employers. [Eng.] Simonds. -- House car (Railroad), a freight car with inclosing sides and a roof; a box car. -- House of correction. See Correction. -- House cricket (Zoöl.), a European cricket (Gryllus domesticus), which frequently lives in houses, between the bricks of chimneys and fireplaces. It is noted for the loud chirping or stridulation of the males. -- House dog, a dog kept in or about a dwelling house. -- House finch (Zoöl.), the burion. -- House flag, a flag denoting the commercial house to which a merchant vessel belongs. -- House fly (Zoöl.), a common fly (esp. Musca domestica), which infests houses both in Europe and America. Its larva is a maggot which lives in decaying substances or excrement, about sink drains, etc. -- House of God, a temple or church. -- House of ill fame. See Ill fame under Ill, a. -- House martin (Zoöl.), a common European swallow (Hirundo urbica). It has feathered feet, and builds its nests of mud against the walls of buildings. Called also house swallow, and window martin. -- House mouse (Zoöl.), the common mouse (Mus musculus). -- House physician, the resident medical adviser of a hospital or other public institution. -- House snake (Zoöl.), the milk snake. -- House sparrow (Zoöl.), the common European sparrow (Passer domesticus). It has recently been introduced into America, where it has become very abundant, esp. in cities. Called also thatch sparrow. -- House spider (Zoöl.), any spider which habitually lives in houses. Among the most common species are Theridium tepidariorum and Tegenaria domestica. -- House surgeon, the resident surgeon of a hospital. -- House wren (Zoöl.), the common wren of the Eastern United States (Troglodytes aëdon). It is common about houses and in gardens, and is noted for its vivacity, and loud musical notes. See Wren. -- Religious house, a monastery or convent. -- The White House, the official residence of the President of the United States; -- hence, colloquially, the office of President. -- To bring down the house. See under Bring. -- To keep house, to maintain an independent domestic establishment. -- To keep open house, to entertain friends at all times. Syn. -- Dwelling; residence; abode. See Tenement.\n\n1. To take or put into a house; to shelter under a roof; to cover from the inclemencies of the weather; to protect by covering; as, to house one's family in a comfortable home; to house farming utensils; to house cattle. At length have housed me in a humble shed. Young. House your choicest carnations, or rather set them under a penthouse. Evelyn. 2. To drive to a shelter. Shak. 3. To admit to residence; to harbor. Palladius wished him to house all the Helots. Sir P. Sidney. 4. To deposit and cover, as in the grave. Sandys. 5. (Naut.)  To stow in a safe place; to take down and make safe; as, to house the upper spars.\n\n1. To take shelter or lodging; to abide to dwell; to lodge. You shall not house with me. Shak. 2. (Astrol.)  To have a position in one of the houses. See House, n., 8. \"Where Saturn houses.\" Dryden."}