{"word":"idea","definition":"1. The transcript, image, or picture of a visible object, that is formed by the mind; also, a similar image of any object whatever, whether sensible or spiritual. Her sweet idea wandered through his thoughts. Fairfax. Being the right idea of your father Both in your form and nobleness of mind. Shak. This representation or likeness of the object being transmitted from thence [the senses] to the imagination, and lodged there for the view and observation of the pure intellect, is aptly and properly called its idea. P. Browne. 2. A general notion, or a conception formed by generalization. Alice had not the slightest idea what latitude was. L. Caroll. 3. Hence: Any object apprehended, conceived, or thought of, by the mind; a notion, conception, or thought; the real object that is conceived or thought of. Whatsoever the mind perceives in itself, or as the immediate object of perception, thought, or undersanding, that I call idea. Locke. 4. A belief, option, or doctrine; a characteristic or controlling principle; as, an essential idea; the idea of development. That fellow seems to me to possess but one idea, and that is a wrong one. Johnson. What is now \"idea\" for us How infinite the fall of this word, since the time where Milton sang of the Creator contemplating his newly- created world, -\"how it showed . . . Answering his great idea,\" -to its present use, when this person \"has an idea that the train has started,\" and the other \"had no idea that the dinner would be so bad!\" Trench. 5. A plan or purpose of action; intention; design. I shortly afterwards set off for that capital, with an idea of undertaking while there the translation of the work. W. Irving. 6. A rational conception; the complete conception of an object when thought of in all its essential elements or constituents; the necessary metaphysical or constituent attributes and relations, when conceived in the abstract. 7. A fiction object or picture created by the imagination; the same when proposed as a pattern to be copied, or a standard to be reached; one of the archetypes or patterns of created things, conceived by the Platonists to have excited objectively from eternity in the mind of the Deity. Thence to behold this new-created world, The addition of his empire, how it showed In prospect from his throne, how good, how fair, Answering his great idea. Milton. Note: \"In England, Locke may be said to have been the first who naturalized the term in its Cartesian universality. When, in common language, employed by Milton and Dryden, after Descartes, as before him by Sidney, Spenser, Shakespeare, Hooker, etc., the meaning is Platonic.\" Sir W. Hamilton. Abstract idea, Association of ideas, etc. See under Abstract, Association, etc. Syn. -- Notion; conception; thought; sentiment; fancy; image; perception; impression; opinion; belief; observation; judgment; consideration; view; design; intention; purpose; plan; model; pattern. There is scarcely any other word which is subjected to such abusive treatment as is the word idea, in the very general and indiscriminative way in which it is employed, as it is used variously to signify almost any act, state, or content of thought."}