{"word":"ink","definition":"The step, or socket, in which the lower end of a millstone spindle runs.\n\n1. A fluid, or a viscous material or preparation of various kinds (commonly black or colored), used in writing or printing. Make there a prick with ink. Chaucer. Deformed monsters, foul and black as ink. Spenser. 2. A pigment. See India ink, under India. Note: Ordinarily, black ink is made from nutgalls and a solution of some salt of iron, and consists essentially of a tannate or gallate of iron; sometimes indigo sulphate, or other coloring matter,is added. Other black inks contain potassium chromate, and extract of logwood, salts of vanadium, etc. Blue ink is usually a solution of Prussian blue. Red ink was formerly made from carmine (cochineal), Brazil wood, etc., but potassium eosin is now used. Also red, blue, violet, and yellow inks are largely made from aniline dyes. Indelible ink is usually a weak solution of silver nitrate, but carbon in the form of lampblack or India ink, salts of molybdenum, vanadium, etc., are also used. Sympathetic inks may be made of milk, salts of cobalt, etc. See Sympathetic ink (below). Copying ink, a peculiar ink used for writings of which copies by impression are to be taken. -- Ink bag (Zoöl.), an ink sac. -- Ink berry. (Bot.) (a) A shrub of the Holly family (Ilex glabra), found in sandy grounds along the coast from New England to Florida, and producing a small black berry. (b) The West Indian indigo berry. See Indigo. -- Ink plant (Bot.), a New Zealand shrub (Coriaria thumifolia), the berries of which uield a juice which forms an ink. -- Ink powder, a powder from which ink is made by solution. -- Ink sac (Zoöl.), an organ, found in most cephalopods, containing an inky fluid which can be ejected from a duct opening at the base of the siphon. The fluid serves to cloud the water, and enable these animals to escape from their enemies. See Illust. of Dibranchiata. -- Printer's ink, or Printing ink. See under Printing. -- Sympathetic ink, a writing fluid of such a nature that what is written remains invisible till the action of a reagent on the characters makes it visible.\n\nTo put ink upon; to supply with ink; to blacken, color, or daub with ink."}