{"word":"institute","definition":"Established; organized; founded. [Obs.] They have but few laws. For to a people so instruct and institute, very few to suffice. Robynson (More's Utopia).\n\n1. To set up; to establish; to ordain; as, to institute laws, rules, etc. 2. To originate and establish; to found; to organize; as, to institute a court, or a society. Whenever any from of government becomes destructive of these ends it is the right of the people to alter or to abolish it, and to institute a new government. Jefferson (Decl. of Indep. ). 3. To nominate; to appoint. [Obs.] We institute your Grace To be our regent in these parts of France. Shak. 4. To begin; to commence; to set on foot; as, to institute an inquiry; to institute a suit. And haply institute A course of learning and ingenious studies. Shak. 5. To ground or establish in principles and rudiments; to educate; to instruct. [Obs.] If children were early instituted, knowledge would insensibly insinuate itself. Dr. H. More. 6. (Eccl. Law)  To invest with the spiritual charge of a benefice, or the care of souls. Blackstone. Syn. -- To originate; begin; commence; establish; found; erect; organize; appoint; ordain.\n\n1. The act of instituting; institution. [Obs.] \"Water sanctified by Christ's institute.\" Milton. 2. That which is instituted, established, or fixed, as a law, habit, or custom. Glover. 3. Hence: An elementary and necessary principle; a precept, maxim, or rule, recognized as established and authoritative; usually in the plural, a collection of such principles and precepts; esp., a comprehensive summary of legal principles and decisions; as, the Institutes of Justinian; Coke's Institutes of the Laws of England. Cf. Digest, n. They made a sort of institute and digest of anarchy. Burke. To make the Stoics' institutes thy own. Dryden. 4. An institution; a society established for the promotion of learning, art, science, etc.; a college; as, the Institute of Technology; also, a building owned or occupied by such an institute; as, the Cooper Institute. 5. (Scots Law)  The person to whom an estate is first given by destination or limitation. Tomlins. Institutes of medicine, theoretical medicine; that department of medical science which attempts to account philosophically for the various phenomena of health as well as of disease; physiology applied to the practice of medicine. Dunglison."}