{"word":"inversion","definition":"1. The act of inverting, or turning over or backward, or the state of being inverted. 2. A change by inverted order; a reversed position or arrangement of things; transposition. It is just the inversion of an act of Parliament; your lordship first signed it, and then it was passed among the Lords and Commons. Dryden. 3. (Mil.)  A movement in tactics by which the order of companies in line is inverted, the right being on the left, the left on the right, and so on. 4. (Math.)  A change in the order of the terms of a proportion, so that the second takes the place of the first, and the fourth of the third. 5. (Geom.)  A peculiar method of transformation, in which a figure is replaced by its inverse figure. Propositions that are true for the original figure thus furnish new propositions that are true in the inverse figure. See Inverse figures, under Inverse. 6. (Gram.)  A change of the usual order of words or phrases; as, \"of all vices, impurity is one of the most detestable,\" instead of, \"impurity is one of the most detestable of all vices.\" 7. (Rhet.)  A method of reasoning in which the orator shows that arguments advanced by his adversary in opposition to him are really favorable to his cause. 8. (Mus.) (a) Said of intervals, when the lower tone is placed an octave higher, so that fifths become fourths, thirds sixths, etc. (b) Said of a chord, when one of its notes, other than its root, is made the bass. (c) Said of a subject, or phrase, when the intervals of which it consists are repeated in the contrary direction, rising instead of falling, or vice versa. (d) Said of double counterpoint, when an upper and a lower part change places. 9. (Geol.)  The folding back of strata upon themselves, as by upheaval, in such a manner that the order of succession appears to be reversed. 10. (Chem.)  The act or process by which cane sugar (sucrose), under the action of heat and acids or ferments (as diastase), is broken or split up into grape sugar (dextrose), and fruit sugar (levulose); also, less properly, the process by which starch is converted into grape sugar (dextrose). Note: The terms invert and inversion, in this sense, owe their meaning to the fact that the plane of polarization of light, which is rotated to the right by cane sugar, is turned toward the left by levulose."}