{"word":"it","definition":"The neuter pronoun of the third person, corresponding to the masculine pronoun he and the feminine she, and having the same plural (they, their of theirs, them). Note: The possessive form its is modern, being rarely found in the writings of Shakespeare and Milton, and not at all in the original King James's version of the Bible. During the transition from the regular his to the anomalous its, it was to some extent employed in the possessive without the case ending. See His, and He. In Dryden's time its had become quite established as the regular form. The day present hath ever inough to do with it owne grief. Genevan Test. Do, child, go to it grandam, child. Shak. It knighthood shall do worse. It shall fright all it friends with borrowing letters. B. Jonson. Note: In the course of time, the nature of the neuter sign i in it, the form being found in but a few words, became misunderstood. Instead of being looked upon as an affix, it passed for part of the original word. Hence was formed from it the anomalous genitive it, superseding the Saxon his. Latham. The fruit tree yielding fruit after his (its) kind. Gen. i. 11. It is used, -- 1. As a substance for any noun of the neuter gender; as, here is the book, take it home. 2. As a demonstrative, especially at the beginning of a sentence, pointing to that which is about to be stated, named, or mentioned, or referring to that which apparent or well known; as, I saw it was John. It is I; be not afraid. Matt. xiv. 27. Peter heard that it was the Lord. John xxi. 7. Often, in such cases, as a substitute for a sentence or clause; as, it is thought he will come; it is wrong to do this. 3. As an indefinite nominative for a impersonal verb; as, it snows; it rains. 4. As a substitute for such general terms as, the state of affairs, the condition of things, and the like; as, how is it with the sick man Think on me when it shall be well with thee. Gen. xl. 14. 5. As an indefinite object after some intransitive verbs, or after a substantive used humorously as a verb; as, to foot it (i. e., to walk). The Lacedemonians, at the Straits of Thermopylæ, when their arms failed them, fought it out with nails and teeth. Dryden. Whether the charmer sinner it, or saint it, If folly grows romantic, I must paint it. Pope. Its self. See Itself."}