{"word":"joint","definition":"1. The place or part where two things or parts are joined or united; the union of two or more smooth or even surfaces admitting of a close-fitting or junction; junction as, a joint between two pieces of timber; a joint in a pipe. 2. A joining of two things or parts so as to admit of motion; an articulation, whether movable or not; a hinge; as, the knee joint; a node or joint of a stem; a ball and socket joint. See Articulation. A scaly gauntlet now, with joints of steel, Must glove this hand. Shak. To tear thee joint by joint. Milton. 3. The part or space included between two joints, knots, nodes, or articulations; as, a joint of cane or of a grass stem; a joint of the leg. 4. Any one of the large pieces of meat, as cut into portions by the butcher for roasting. 5. (Geol.)  A plane of fracture, or divisional plane, of a rock transverse to the stratification. 6. (Arch.)  The space between the adjacent surfaces of two bodies joined and held together, as by means of cement, mortar, etc.; as, a thin joint. 7. The means whereby the meeting surfaces of pieces in a structure are secured together. Coursing joint (Masonry), the mortar joint between two courses of bricks or stones. -- Fish joint, Miter joint, Universal joint, etc. See under Fish, Miter, etc. -- Joint bolt, a bolt for fastening two pieces, as of wood, one endwise to the other, having a nut embedded in one of the pieces. -- Joint chair (Railroad), the chair that supports the ends of abutting rails. -- Joint coupling, a universal joint for coupling shafting. See under Universal. -- Joint hinge, a hinge having long leaves; a strap hinge. -- Joint splice, a reënforce at a joint, to sustain the parts in their true relation. -- Joint stool. (a) A stool consisting of jointed parts; a folding stool. Shak. (b) A block for supporting the end of a piece at a joint; a joint chair. -- Out of joint, out of place; dislocated, as when the head of a bone slips from its socket; hence, not working well together; disordered. \"The time is out of joint.\" Shak.\n\n1. Joined; united; combined; concerted; as joint action. 2. Involving the united activity of two or more; done or produced by two or more working together. I read this joint effusion twice over. T. Hook. 3. United, joined, or sharing with another or with others; not solitary in interest or action; holding in common with an associate, or with associates; acting together; as, joint heir; joint creditor; joint debtor, etc. \"Joint tenants of the world.\" Donne. 4. Shared by, or affecting two or more; held in common; as, joint property; a joint bond. A joint burden laid upon us all. Shak. Joint committee (Parliamentary Practice), a committee composed of members of the two houses of a legislative body, for the appointment of which concurrent resolutions of the two houses are necessary. Cushing. -- Joint meeting, or Joint session, the meeting or session of two distinct bodies as one; as, a joint meeting of committees representing different corporations; a joint session of both branches of a State legislature to chose a United States senator. \"Such joint meeting shall not be dissolved until the electoral votes are all counted and the result declared.\" Joint Rules of Congress, U. S. -- Joint resolution (Parliamentary Practice), a resolution adopted concurrently by the two branches of a legislative body. \"By the constitution of the United States and the rules of the two houses, no absolute distinction is made between bills and joint resolutions.\" Barclay (Digest). -- Joint rule (Parliamentary Practice), a rule of proceeding adopted by the concurrent action of both branches of a legislative assembly. \"Resolved, by the House of Representatives (the Senate concurring), that the sixteenth and seventeenth joint rules be suspended for the remainder of the session.\" Journal H. of R., U. S. -- Joint and several (Law), a phrase signifying that the debt, credit, obligation, etc., to which it is applied is held in such a way that the parties in interest are engaged both together and individually thus a joint and several debt is one for which all the debtors may be sued together or either of them individually. -- Joint stock, stock held in company. -- Joint-stock company (Law), a species of partnership, consisting generally of a large number of members, having a capital divided, or agreed to be divided, into shares, the shares owned by any member being usually transferable without the consent of the rest. -- Joint tenancy (Law), a tenure by two or more persons of estate by unity of interest, title, time, and possession, under which the survivor takes the whole. Blackstone. -- Joint tenant (Law), one who holds an estate by joint tenancy.\n\n1. To unite by a joint or joints; to fit together; to prepare so as to fit together; as, to joint boards. Pierced through the yielding planks of jointed wood. Pope. 2. To join; to connect; to unite; to combine. Jointing their force 'gainst Cæsar. Shak. 3. To provide with a joint or joints; to articulate. The fingers are jointed together for motion. Ray. 4. To separate the joints; of; to divide at the joint or joints; to disjoint; to cut up into joints, as meat. \"He joints the neck. Dryden. Quartering, jointing, seething, and roasting. Holland.\n\nTo fit as if by joints; to coalesce as joints do; as, the stones joint, neatly."}