{"word":"judge","definition":"1. (Law)  A public officer who is invested with authority to hear and determine litigated causes, and to administer justice between parties in courts held for that purpose. The parts of a judge in hearing are four: to direct the evidence; to moderate length, repetition, or impertinency of speech; to recapitulate, select, and collate the material points of that which hath been said; and to give the rule or sentence. Bacon. 2. One who has skill, knowledge, or experience, sufficient to decide on the merits of a question, or on the quality or value of anything; one who discerns properties or relations with skill and readiness; a connoisseur; an expert; a critic. A man who is no judge of law may be a good judge of poetry, or eloquence, or of the merits of a painting. Dryden. 3. A person appointed to decide in aas, a judge in a horse race. 4. (Jewish Hist.)  One of supreme magistrates, with both civil and military powers, who governed Israel for more than four hundred years. 5. pl.  The title of the seventh book of the Old Testament; the Book of Judges. Judge Advocate (Mil. & Nav.), a person appointed to act as prosecutor at a court-martial; he acts as the representative of the government, as the responsible adviser of the court, and also, to a certain extent, as counsel for the accused, when he has no other counsel. -- Judge-Advocate General, in the United States, the title of two officers, one attached to the War Department and having the rank of brigadier general, the other attached to the Navy Department and having the rank of colonel of marines or captain in the navy. The first is chief of the Bureau of Military Justice of the army, the other performs a similar duty for the navy. In England, the designation of a member of the ministry who is the legal adviser of the secretary of state for war, and supreme judge of the proceedings of courts-martial. Syn. -- Judge, Umpire, Arbitrator, Referee. A judge, in the legal sense, is a magistrate appointed to determine questions of law. An umpire is a person selected to decide between two or more who contend for a prize. An arbitrator is one chosen to allot to two contestants their portion of a claim, usually on grounds of equity and common sense. A referee is one to whom a case is referred for final adjustment. Arbitrations and references are sometimes voluntary, sometimes appointed by a court.\n\n1. To hear and determine, as in causes on trial; to decide as a judge; to give judgment; to pass sentence. The Lord judge between thee and me. Gen. xvi. 5. Father, who art judge Of all things made, and judgest only right! Milton. 2. To assume the right to pass judgment on another; to sit in judgment or commendation; to criticise or pass adverse judgment upon others. See Judge, v. t., 3. Forbear to judge, for we are sinners all. Shak. 3. To compare facts or ideas, and perceive their relations and attributes, and thus distinguish truth from falsehood; to determine; to discern; to distinguish; to form an opinion about. Judge not according to the appearance. John vii. 24. She is wise if I can judge of her. Shak.\n\n1. To hear and determine by authority, as a case before a court, or a controversy between two parties. \"Chaos [shall] judge the strife.\" Milton. 2. To examine and pass sentence on; to try; to doom. God shall judge the righteous and the wicked. Eccl. iii. 7. To bring my whole cause 'fore his holiness, And to be judged by him. Shak. 3. To arrogate judicial authority over; to sit in judgment upon; to be censorious toward. Judge not, that ye be not judged. Matt. vii. 1. 4. To determine upon or deliberation; to esteem; to think; to reckon. If ye have judged me to be faithful to the Lord. Acts xvi. 15. 5. To exercise the functions of a magistrate over; to govern. [Obs.] Make us a king to judge us. 1 Sam. viii. 5."}