{"word":"justice","definition":"1. The quality of being just; conformity to the principles of righteousness and rectitude in all things; strict performance of moral obligations; practical conformity to human or divine law; integrity in the dealings of men with each other; rectitude; equity; uprightness. Justice and judgment are the haditation of thy throne. Ps. ixxxix. 11. The king-becoming graces, As justice, verity, temperance, stableness, . . . I have no relish of them. Shak. 2. Conformity to truth and reality in expressing opinions and in conduct; fair representation of facts respecting merit or demerit; honesty; fidelity; impartiality; as, the justice of a description or of a judgment; historical justice. 3. The rendering to every one his due or right; just treatment; requital of desert; merited reward or punishment; that which is due to one's conduct or motives. This even-handed justice Commends the ingredients of our poisoned chalice To our own lips. Shak. 4. Agreeableness to right; equity; justness; as, the justice of a claim. 5. A person duly commissioned to hold courts, or to try and decide controversies and administer justice. Note: This title is given to the judges of the common law courts in England and in the United States, and extends to judicial officers and magistrates of every grade. Bed of justice. See under Bed. -- Chief justice. See in the Vocabulary. -- Justice of the peace (Law), a judicial officer or subordinate magistrate appointed for the conservation of the peace in a specified district, with other incidental powers specified in his commission. In the United States a justice of the peace has jurisdiction to adjudicate certain minor cases, commit offenders, etc. Syn. -- Equity; law; right; rectitude; honesty; integrity; uprightness; fairness; impartiality. -- Justice, Equity, Law. Justice and equity are the same; but human laws, though designed to secure justice, are of necessity imperfect, and hence what is strictly legal is at times far from being equitable or just. Here a court of equity comes in to redress the grievances. It does so, as distinguished from courts of law; and as the latter are often styled courts of justice, some have fancied that there is in this case a conflict between justice and equity. The real conflict is against the working of the law; this a court of equity brings into accordance with the claims of justice. It would be an unfortunate use of language which should lead any one to imagine he might have justice on his side while practicing iniquity (inequity). Justice, Rectitude. Rectitude, in its widest sense, is one of the most comprehensive words in our language, denoting absolute conformity to the rule of right in principle and practice. Justice refers more especially to the carrying out of law, and has been considered by moralists as of three kinds: (1) Commutative justice, which gives every man his own property, including things pledged by promise. (2) Distributive justice, which gives every man his exact deserts. (3) General justice, which carries out all the ends of law, though not in every case through the precise channels of commutative or distributive justice; as we see often done by a parent or a ruler in his dealings with those who are subject to his control.\n\nTo administer justice to. [Obs.] Bacon."}