{"word":"knight","definition":"1. A young servant or follower; a military attendant. [Obs.] 2. (a) In feudal times, a man-at-arms serving on horseback and admitted to a certain military rank with special ceremonies, including an oath to protect the distressed, maintain the right, and live a stainless life. (b) One on whom knighthood, a dignity next below that of baronet, is conferred by the sovereign, entitling him to be addressed as Sir; as, Sir John. [Eng.] Hence: (c) A champion; a partisan; a lover. \"Give this ring to my true knight.\" Shak \"In all your quarrels will I be your knight.\" Tennyson. Knights, by their oaths, should right poor ladies' harms. Shak. Note: Formerly, when a knight's name was not known, it was customary to address him as Sir Knight. The rank of a knight is not hereditary. 3. A piece used in the game of chess, usually bearing a horse's head. 4. A playing card bearing the figure of a knight; the knave or jack. [Obs.] Carpet knight. See under Carpet. -- Knight of industry. See Chevalier d'industrie, under Chevalier. -- Knight of Malta, Knight of Rhodes, Knight of St. John of Jerusalem. See Hospitaler. -- Knight of the post, one who gained his living by giving false evidence on trials, or false bail; hence, a sharper in general. Nares. \"A knight of the post, . . . quoth he, for so I am termed; a fellow that will swear you anything for twelve pence.\" -- Nash. -- Knight of the shire, in England, one of the representatives of a county in Parliament, in distinction from the representatives of cities and boroughs. -- Knights commanders, Knights grand cross, different classes of the Order of the Bath. See under Bath, and Companion. Knights of labor, a secret organization whose professed purpose is to secure and maintain the rights of workingmen as respects their relations to their employers. [U. S.] -- Knights of Pythias, a secret order, founded in Washington, d.C., in 1864, for social and charitable purposes. -- Knights of the Round Table, knights belonging to an order which, according to the legendary accounts, was instituted by the mythical King Arthur. They derived their common title from the table around which they sat on certain solemn days. Brande & C.\n\nTo dub or create (one) a knight; -- done in England by the sovereign only, who taps the kneeling candidate with a sword, saying: Rise, Sir ---. A soldier, by the honor-giving hand Of Cknighted in the field. Shak."}