{"word":"knock","definition":"1. To drive or be driven against something; to strike against something; to clash; as, one heavy body knocks against another. Bacon. 2. To strike or beat with something hard or heavy; to rap; as, to knock with a club; to knock on the door. For harbor at a thousand doors they knocked. Dryden. Seek, and ye shall find; knock, and it shall be opened unto you. Matt. vii. 7. To knock about, to go about, taking knocks or rough usage; to wander about; to saunter. [Colloq.] \"Knocking about town.\" W. Irving. -- To knock up, to fail of strength; to become wearied or worn out, as with labor; to give out. \"The horses were beginning to knock up under the fatigue of such severe service.\" De Quincey. -- To knock off, to cease, as from work; to desist. -- To knock under, to yield; to submit; to acknowledge one's self conquered; -- an expression probably borrowed from the practice of knocking under the table with the knuckles, when conquered. \"Colonel Esmond knocked under to his fate.\" Thackeray.\n\n1. To strike with something hard or heavy; to move by striking; to drive (a thing) against something; as, to knock a ball with a bat; to knock the head against a post; to knock a lamp off the table. When heroes knock their knotty heads together. Rowe. 2. To strike for admittance; to rap upon, as a door. Master, knock the door hard. Shak. To knock down. (a) To strike down; to fell; to prostrate by a blow or by blows; as, to knock down an assailant. (b) To assign to a bidder at an auction, by a blow or knock; to knock off. -- To knock in the head, or on the head, to stun or kill by a blow upon the head; hence, to put am end to; to defeat, as a scheme or project; to frustrate; to quash. [Colloq.] -- To knock off. (a) To force off by a blow or by beating. (b) To assign to a bidder at an auction, by a blow on the counter. (c) To leave off (work, etc.). [Colloq.] -- To knock out, to force out by a blow or by blows; as, to knock out the brains. -- To knock up. (a) To arouse by knocking. (b) To beat or tire out; to fatigue till unable to do more; as, the men were entirely knocked up. [Colloq.] \"The day being exceedingly hot, the want of food had knocked up my followers.\" Petherick. (c) (Bookbinding) To make even at the edges, or to shape into book form, as printed sheets.\n\n1. A blow; a stroke with something hard or heavy; a jar. 2. A stroke, as on a door for admittance; a rap. \" A knock at the door.\" Longfellow. A loud cry or some great knock. Holland. Knock off, a device in a knitting machine to remove loops from the needles."}