{"word":"labor","definition":"1. Physical toil or bodily exertion, especially when fatiguing, irksome, or unavoidable, in distinction from sportive exercise; hard, muscular effort directed to some useful end, as agriculture, manufactures, and like; servile toil; exertion; work. God hath set Labor and rest, as day and night, to men Successive. Milton. 2. Intellectual exertion; mental effort; as, the labor of compiling a history. 3. That which requires hard work for its accomplishment; that which demands effort. Being a labor of so great a difficulty, the exact performance thereof we may rather wish than look for. Hooker. 4. Travail; the pangs and efforts of childbirth. The queen's in labor, They say, in great extremity; and feared She'll with the labor end. Shak. 5. Any pang or distress. Shak. 6. (Naut.)  The pitching or tossing of a vessel which results in the straining of timbers and rigging. 7. Etym: [Sp.]  A measure of land in Mexico and Texas, equivalent to an area of 177 Bartlett. Syn. -- Work; toil; drudgery; task; exertion; effort; industry; painstaking. See Toll.\n\n1. To exert muscular strength; to exert one's strength with painful effort, particularly in servile occupations; to work; to toil. Adam, well may we labor still to dress This garden. Milton. 2. To exert one's powers of mind in the prosecution of any design; to strive; to take pains. 3. To be oppressed with difficulties or disease; to do one's work under conditions which make it especially hard, wearisome; to move slowly, as against opposition, or under a burden; to be burdened; -- often with under, and formerly with of. The stone that labors up the hill. Granville. The line too labors,and the words move slow. Pope. To cure the disorder under which he labored. Sir W. Scott. Come unto me, all ye that labor and are heavy laden, and I will give you rest. Matt. xi. 28 4. To be in travail; to suffer the pangs of childbirth. 5. (Naut.)  To pitch or roll heavily, as a ship in a turbulent sea. Totten.\n\n1. To work at; to work; to till; to cultivate by toil. The most excellent lands are lying fallow, or only labored by children. W. Tooke. 2. To form or fabricate with toil, exertion, or care. \"To labor arms for Troy.\" Dryden. 3. To prosecute, or perfect, with effort; to urge streas, to labor a point or argument. 4. To belabor; to beat. [Obs.] Dryden."}