{"word":"law","definition":"1. In general, a rule of being or of conduct, established by an authority able to enforce its will; a controlling regulation; the mode or order according to which an agent or a power acts. Note: A law may be universal or particular, written or unwritten, published or secret. From the nature of the highest laws a degree of permanency or stability is always implied; but the power which makes a law, or a superior power, may annul or change it. These are the statutes and judgments and law, which the Lord made. Lev. xxvi. 46. The law of thy God, and the law of the King. Ezra vii. 26. As if they would confine the Interminable . . . Who made our laws to bind us, not himself. Milton. His mind his kingdom, and his will his law. Cowper. 2. In morals: The will of God as the rule for the disposition and conduct of all responsible beings toward him and toward each other; a rule of living, conformable to righteousness; the rule of action as obligatory on the conscience or moral nature. 3. The Jewish or Mosaic code, and that part of Scripture where it is written, in distinction from the gospel; hence, also, the Old Testament. What things soever the law saith, it saith to them who are under the law . . . But now the righteousness of God without the law is manifested, being witnessed by the law and the prophets. Rom. iii. 19, 21. 4. In human government: (a) An organic rule, as a constitution or charter, establishing and defining the conditions of the existence of a state or other organized community. (b) Any edict, decree, order, ordinance, statute, resolution, judicial, decision, usage, etc., or recognized, and enforced, by the controlling authority. 5. In philosophy and physics: A rule of being, operation, or change, so certain and constant that it is conceived of as imposed by the will of God or by some controlling authority; as, the law of gravitation; the laws of motion; the law heredity; the laws of thought; the laws of cause and effect; law of self-preservation. 6. In matematics: The rule according to which anything, as the change of value of a variable, or the value of the terms of a series, proceeds; mode or order of sequence. 7. In arts, works, games, etc.: The rules of construction, or of procedure, conforming to the conditions of success; a principle, maxim; or usage; as, the laws of poetry, of architecture, of courtesy, or of whist. 8. Collectively, the whole body of rules relating to one subject, or emanating from one source; -- including usually the writings pertaining to them, and judicial proceedings under them; as, divine law; English law; Roman law; the law of real property; insurance law. 9. Legal science; jurisprudence; the principles of equity; applied justice. Reason is the life of the law; nay, the common law itself is nothing else but reason. Coke. Law is beneficence acting by rule. Burke. And sovereign Law, that state's collected will O'er thrones and globes elate, Sits empress, crowning good, repressing ill. Sir W. Jones. 10. Trial by the laws of the land; judicial remedy; litigation; as, to go law. When every case in law is right. Shak. He found law dear and left it cheap. Brougham. 11. An oath, as in the presence of a court. [Obs.] See Wager of law, under Wager. Avogadro's law (Chem.), a fundamental conception, according to which, under similar conditions of temperature and pressure, all gases and vapors contain in the same volume the same number of ultimate molecules; -- so named after Avogadro, an Italian scientist. Sometimes called Ampère's law. -- Bode's law (Astron.), an approximative empirical expression of the distances of the planets from the sun, as follows: -- Mer. Ven. Earth. Mars. Aste. Jup. Sat. Uran. Nep. 4 4 4 4 4 4 4 4 4 0 3 6 12 24 48 96 192 384 -- -- -- -- -- -- -- --- ---4 7 10 16 28 52 100 196 388 5.9 7.3 10 15.2 27.4 52 95.4 192 300 where each distance (line third) is the sum of 4 and a multiple of 3 by the series 0, 1, 2, 4, 8, etc., the true distances being given in the lower line. -- Boyle's law (Physics), an expression of the fact, that when an elastic fluid is subjected to compression, and kept at a constant temperature, the product of the pressure and volume is a constant quantity, i. e., the volume is inversely proportioned to the pressure; -- known also as Mariotte's law, and the law of Boyle and Mariotte. -- Brehon laws. See under Brehon. -- Canon law, the body of ecclesiastical law adopted in the Christian Church, certain portions of which (for example, the law of marriage as existing before the Council of Tent) were brought to America by the English colonists as part of the common law of the land. Wharton. -- Civil law, a term used by writers to designate Roman law, with modifications thereof which have been made in the different countries into which that law has been introduced. The civil law, instead of the common law, prevails in the State of Louisiana. Wharton. -- Commercial law. See Law merchant (below). -- Common law. See under Common. -- Criminal law, that branch of jurisprudence which relates to crimes. -- Ecclesiastical law. See under Ecclesiastical. -- Grimm's law (Philol.), a statement (propounded by the German philologist Jacob Grimm) of certain regular changes which the primitive Indo-European mute consonants, so-called (most plainly seen in Sanskrit and, with some changes, in Greek and Latin), have undergone in the Teutonic languages. Examples: Skr. bhatr, L. frater, E. brother, G. bruder; L. tres, E. three, G. drei, Skr. go, E. cow, G. kuh; Skr. dha to put, Gr. ti-qe`-nai, E. do, OHG, tuon, G. thun. -- Kepler's laws (Astron.), three important laws or expressions of the order of the planetary motions, discovered by John Kepler. They are these: (1) The orbit of a planet with respect to the sun is an ellipse, the sun being in one of the foci. (2) The areas swept over by a vector drawn from the sun to a planet are proportioned to the times of describing them. (3) The squares of the times of revolution of two planets are in the ratio of the cubes of their mean distances. -- Law binding, a plain style of leather binding, used for law books; -- called also law calf. -- Law book, a book containing, or treating of, laws. -- Law calf. See Law binding (above). -- Law day. (a) Formerly, a day of holding court, esp. a court-leet. (b) The day named in a mortgage for the payment of the money to secure which it was given. [U. S.] -- Law French, the dialect of Norman, which was used in judicial proceedings and law books in England from the days of William the Conqueror to the thirty-sixth year of Edward III. -- Law language, the language used in legal writings and forms. -- Law Latin. See under Latin. -- Law lords, peers in the British Parliament who have held high judicial office, or have been noted in the legal profession. -- Law merchant, or Commercial law, a system of rules by which trade and commerce are regulated; -- deduced from the custom of merchants, and regulated by judicial decisions, as also by enactments of legislatures. -- Law of Charles (Physics), the law that the volume of a given mass of gas increases or decreases, by a definite fraction of its value for a given rise or fall of temperature; -- sometimes less correctly styled Gay Lussac's law, or Dalton's law. -- Law of nations. See International law, under International. -- Law of nature. (a) A broad generalization expressive of the constant action, or effect, of natural conditions; as, death is a law of nature; self-defense is a law of nature. See Law, 4. (b) A term denoting the standard, or system, of morality deducible from a study of the nature and natural relations of human beings independent of supernatural revelation or of municipal and social usages. -- Law of the land, due process of law; the general law of the land. -- Laws of honor. See under Honor. -- Laws of motion (Physics), three laws defined by Sir Isaac Newton: (1) Every body perseveres in its state of rest or of moving uniformly in a straight line, except so far as it is made to change that state by external force. (2) Change of motion is proportional to the impressed force, and takes place in the direction in which the force is impressed. (3) Reaction is always equal and opposite to action, that is to say, the actions of two bodies upon each other are always equal and in opposite directions. -- Marine law, or Maritime law, the law of the sea; a branch of the law merchant relating to the affairs of the sea, such as seamen, ships, shipping, navigation, and the like. Bouvier. -- Mariotte's law. See Boyle's law (above). -- Martial law.See under Martial. -- Military law, a branch of the general municipal law, consisting of rules ordained for the government of the military force of a state in peace and war, and administered in courts martial. Kent. Warren's Blackstone. -- Moral law,the law of duty as regards what is right and wrong in the sight of God; specifically, the ten commandments given by Moses. See Law, 2. -- Mosaic, or Ceremonial, law. (Script.) See Law, 3. -- Municipal, or Positive, law, a rule prescribed by the supreme power of a state, declaring some right, enforcing some duty, or prohibiting some act; -- distinguished from international and constitutional law. See Law, 1. -- Periodic law. (Chem.) See under Periodic. -- Roman law, the system of principles and laws found in the codes and treatises of the lawmakers and jurists of ancient Rome, and incorporated more or less into the laws of the several European countries and colonies founded by them. See Civil law (above). -- Statute law, the law as stated in statutes or positive enactments of the legislative body. -- Sumptuary law. See under Sumptuary. -- To go to law, to seek a settlement of any matter by bringing it before the courts of law; to sue or prosecute some one. -- To take, or have, the law of, to bring the law to bear upon; as, to take the law of one's neighbor. Addison. -- Wager of law. See under Wager. Syn. -- Justice; equity. -- Law, Statute, Common law, Regulation, Edict, Decree. Law is generic, and, when used with reference to, or in connection with, the other words here considered, denotes whatever is commanded by one who has a right to require obedience. A statute is a particular law drawn out in form, and distinctly enacted and proclaimed. Common law is a rule of action founded on long usage and the decisions of courts of justice. A regulation is a limited and often, temporary law, intended to secure some particular end or object. An edict is a command or law issued by a sovereign, and is peculiar to a despotic government. A decree is a permanent order either of a court or of the executive government. See Justice.\n\nSame as Lawe, v. t. [Obs.]\n\nAn exclamation of mild surprise. [Archaic or Low]"}