{"word":"lay","definition":"of Lie, to recline.\n\n1. Of or pertaining to the laity, as distinct from the clergy; as, a lay person; a lay preacher; a lay brother. 2. Not educated or cultivated; ignorant.[Obs.] 3. Not belonging to, or emanating from, a particular profession; unprofessional; as, a lay opinion regarding the nature of a disease. Lay baptism (Eccl.), baptism administered by a lay person. F. G. Lee. -- Lay brother (R. C. Ch.), one received into a convent of monks under the three vows, but not in holy orders. -- Lay clerk (Eccl.), a layman who leads the responses of the congregation, etc., in the church service. Hook. -- Lay days (Com.), time allowed in a charter party for taking in and discharging cargo. McElrath. -- Lay elder. See 2d Elder, 3, note.\n\nThe laity; the common people. [Obs.] The learned have no more privilege than the lay. B. Jonson.\n\nA meadow. See Lea. [Obs.] Dryden.\n\n1. Faith; creed; religious profession. [Obs.] Of the sect to which that he was born He kept his lay, to which that he was sworn. Chaucer. 2. A law. [Obs.] \"Many goodly lays.\" Spenser. 3. An obligation; a vow. [Obs.] They bound themselves by a sacred lay and oath. Holland.\n\n1. A song; a simple lyrical poem; a ballad. Spenser. Sir W. Scott. 2. A melody; any musical utterance. The throstle cock made eke his lay. Chaucer.\n\n1. To cause to lie down, to be prostrate, or to lie against something; to put or set down; to deposit; as, to lay a book on the table; to lay a body in the grave; a shower lays the dust. A stone was brought, and laid upon the mouth of the den. Dan. vi. 17. Soft on the flowery herb I found me laid. Milton. 2. To place in position; to establish firmly; to arrange with regularity; to dispose in ranks or tiers; as, to lay a corner stone; to lay bricks in a wall; to lay the covers on a table. 3. To prepare; to make ready; to contrive; to provide; as, to lay a snare, an ambush, or a plan. 4. To spread on a surface; as, to lay plaster or paint. 5. To cause to be still; to calm; to allay; to suppress; to exorcise, as an evil spirit. After a tempest when the winds are laid. Waller. 6. To cause to lie dead or dying. Brave Cæneus laid Ortygius on the plain, The victor Cæneus was by Turnus slain. Dryden. 7. To deposit, as a wager; to stake; to risk. I dare lay mine honor He will remain so. Shak. 8. To bring forth and deposit; as, to lay eggs. 9. To apply; to put. She layeth her hands to the spindle. Prov. xxxi. 19. 10. To impose, as a burden, suffering, or punishment; to assess, as a tax; as, to lay a tax on land. The Lord hath laid on him the iniquity of us all. Is. Iiii. 6. 11. To impute; to charge; to allege. God layeth not folly to them. Job xxiv. 12. Lay the fault on us. Shak. 12. To impose, as a command or a duty; as, to lay commands on one. 13. To present or offer; as, to lay an indictment in a particular county; to lay a scheme before one. 14. (Law)  To state; to allege; as, to lay the venue. Bouvier. 15. (Mil.)  To point; to aim; as, to lay a gun. 16. (Rope Making)  To put the strands of (a rope, a cable, etc.) in their proper places and twist or unite them; as, to lay a cable or rope. 17. (Print.) (a) To place and arrange (pages) for a form upon the imposing stone. (b) To place (new type) properly in the cases. To lay asleep, to put sleep; to make unobservant or careless. Bacon. -- To lay bare, to make bare; to strip. And laid those proud roofs bare to summer's rain. Byron. -- To lay before, to present to; to submit for consideration; as, the papers are laid before Congress. -- To lay by. (a) To save. (b) To discard. Let brave spirits . . . not be laid by. Bacon. -- To lay by the heels, to put in the stocks. Shak. -- To lay down. (a) To stake as a wager. (b) To yield; to relinquish; to surrender; as, to lay down one's life; to lay down one's arms. (c) To assert or advance, as a proposition or principle. -- To lay forth. (a) To extend at length; (reflexively) to exert one's self; to expatiate. [Obs.] (b) To lay out (as a corpse). [Obs.] Shak. -- To lay hands on, to seize. -- To lay hands on one's self, or To lay violent hands on one's self, to injure one's self; specif., to commit suicide. -- To lay heads together, to consult. -- To lay hold of, or To lay hold on, to seize; to catch. -- To lay in, to store; to provide. -- To lay it on, to apply without stint. Shak. -- To lay on, to apply with force; to inflict; as, to lay on blows. -- To lay on load, to lay on blows; to strike violently. [Obs. or Archaic] -- To lay one's self out, to strive earnestly. No selfish man will be concerned to lay out himself for the good of his country. Smalridge. -- To lay one's self open to, to expose one's self to, as to an accusation. -- To lay open, to open; to uncover; to expose; to reveal. -- To lay over, to spread over; to cover. -- To lay out. (a) To expend. Macaulay. (b) To display; to discover. (c) To plan in detail; to arrange; as, to lay out a garden. (d) To prepare for burial; as, to lay out a corpse. (e) To exert; as, to lay out all one's strength. -- To lay siege to. (a) To besiege; to encompass with an army. (b) To beset pertinaciously. -- To lay the course (Naut.), to sail toward the port intended without jibing. -- To lay the land (Naut.), to cause it to disappear below the horizon, by sailing away from it. -- To lay to (a) To charge upon; to impute. (b) To apply with vigor. (c) To attack or harass. [Obs.] Knolles. (d) (Naut.) To check the motion of (a vessel) and cause it to be stationary. -- To lay to heart, to feel deeply; to consider earnestly. -- To lay under, to subject to; as, to lay under obligation or restraint. -- To lay unto. (a) Same as To lay to (above). (b) To put before. Hos. xi. 4. -- To lay up. (a) To store; to reposit for future use. (b) To confine; to disable. (c) To dismantle, and retire from active service, as a ship. -- To lay wait for, to lie in ambush for. -- To lay waste, to destroy; to make desolate; as, to lay waste the land. Syn. -- See Put, v. t., and the Note under 4th Lie.\n\n1. To produce and deposit eggs. 2. (Naut.)  To take a position; to come or go; as, to lay forward; to lay aloft. 3. To lay a wager; to bet. To lay about, or To lay about one, to strike vigorously in all directions. J. H. Newman. -- To lay at, to strike or strike at. Spenser. -- To lay for, to prepare to capture or assault; to lay wait for. [Colloq.] Bp Hall. -- To lay in for, to make overtures for; to engage or secure the possession of. [Obs.] \"I have laid in for these.\" Dryden. -- To lay on, to strike; to beat; to attack. Shak. -- To lay out, to purpose; to plan; as, he lays out to make a journey.\n\n1. That which lies or is laid or is conceived of as having been laid or placed in its position; a row; a stratum; a layer; as, a lay of stone or wood. Addison. A viol should have a lay of wire strings below. Bacon. Note: The lay of a rope is right-handed or left-handed according to the hemp or strands are laid up. See Lay, v. t., 16. The lay of land is its topographical situation, esp. its slope and its surface features. 2. A wager. \"My fortunes against any lay worth naming.\" 3. (a) A job, price, or profit. [Prov. Eng.] Wright. (b) A share of the proceeds or profits of an enterprise; as, when a man ships for a whaling voyage, he agrees for a certain lay. [U. S.] 4. (Textile Manuf.) (a) A measure of yarn; a les. See 1st Lea (a). (b) The lathe of a loom. See Lathe, 8. 5. A plan; a scheme. [Slang] Dickens. Lay figure. (a) A jointed model of the human body that may be put in any attitude; -- used for showing the disposition of drapery, etc. (b) A mere puppet; one who serves the will of others without independent volition. -- Lay race, that part of a lay on which the shuttle travels in weaving; -- called also shuttle race."}