{"word":"league","definition":"1. A measure of length or distance, varying in different countries from about 2.4 to 4.6 English statute miles of 5.280 feet each, and used (as a land measure) chiefly on the continent of Europe, and in the Spanish parts of America. The marine league of England and the United States is equal to three marine, or geographical, miles of 6080 feet each. Note: The English land league is equal to three English statute miles. The Spanish and French leagues vary in each country according to usage and the kind of measurement to which they are applied. The Dutch and German leagues contain about four geographical miles, or about 4.6 English statute miles. 2. A stone erected near a public road to mark the distance of a league. [Obs.]\n\nAn alliance or combination of two or more nations, parties, or persons, for the accomplishment of a purpose which requires a continued course of action, as for mutual defense, or for furtherance of commercial, religious, or political interests, etc. And let there be 'Twixt us and them no league, nor amity. Denham. Note: A league may be offensive or defensive, or both; offensive, when the parties agree to unite in attacking a common enemy; defensive, when they agree to a mutual defense of each other against an enemy. The Holy League, an alliance of Roman Catholics formed in 1576 by influence of the Duke of Guise for the exclusion of Protestants from the throne of France. -- Solemn League and Covenant. See Covenant,2. -- The land league, an association, organized in Dublin in 1879, to promote the interests of the Irish tenantry, its avowed objects being to secure fixity of tenure fair rent, and free sale of the tenants' interest. It was declared illegal by Parliament, but vigorous prosecutions have failed to suppress it. Syn. -- Alliance; confederacy; confederation; coalition; combination; compact; coöperation.\n\nTo unite in a league or confederacy; to combine for mutual support; to confederate South.\n\nTo join in a league; to cause to combine for a joint purpose; to combine; to unite; as, common interests will league heterogeneous elements."}