{"word":"leave","definition":"To send out leaves; to leaf; -- often with out. G. Fletcher.\n\nTo raise; to levy. [Obs.] An army strong she leaved. Spenser.\n\n1. Liberty granted by which restraint or illegality is removed; permission; allowance; license. David earnestly asked leave of me. 1 Sam. xx. 6. No friend has leave to bear away the dead. Dryden. 2. The act of leaving or departing; a formal parting; a leaving; farewell; adieu; -- used chiefly in the phrase, to take leave, i. e., literally, to take permission to go. A double blessing is a'double grace; Occasion smiles upon a second leave. Shak. And Paul after this tarried there yet a good while, and then took his leave of the brethren. Acts xviii. 18. French leave. See under French. Syn. -- See Liberty.\n\n1. To withdraw one's self from; to go away from; to depart from; as, to leave the house. Therefore shall a man leave his father and his mother, and shall cleave unto his wife. Gen. ii. 24. 2. To let remain unremoved or undone; to let stay or continue, in distinction from what is removed or changed. If grape gatherers come to thee, would they not leave some gleaning grapes Jer. xlix. 9. These ought ye to have done, and not to leave the other undone. Matt. xxiii. 23. Besides it leaveth a suspicion, as if more might be said than is expressed. Bacon. 3. To cease from; to desist from; to abstain from. Now leave complaining and begin your tea. Pope. 4. To desert; to abandon; to forsake; hence, to give up; to relinquish. Lo, we have left all, and have followed thee. Mark x. 28. The heresies that men do leave. Shak. 5. To let be or do without interference; as, I left him to his reflections; I leave my hearers to judge. I will leave you now to your gossiplike humor. Shak. 6. To put; to place; to deposit; to deliver; to commit; to submit -- with a sense of withdrawing one's self from; as, leave your hat in the hall; we left our cards; to leave the matter to arbitrators. Leave there thy gift before the altar and go thy way. Matt. v. 24. The foot That leaves the print of blood where'er it walks. Shak. 7. To have remaining at death; hence, to bequeath; as, he left a large estate; he left a good name; he left a legacy to his niece. To leave alone. (a) To leave in solitude. (b) To desist or refrain from having to do with; as, to leave dangerous chemicals alone. -- To leave off. (a) To desist from; to forbear; to stop; as, to leave off work at six o'clock. (b) To cease wearing or using; to omit to put in the usual position; as, to leave off a garment; to leave off the tablecloth. (c) To forsake; as, to leave off a bad habit. -- To leave out, to omit; as, to leave out a word or name in writing. -- To leave to one's self, to let (one) be alone; to cease caring for (one). Syn. - To quit; depart from; forsake; abandon; relinquish; deliver; bequeath; give up; forego; resign; surrender; forbear. See Quit.\n\n1. To depart; to set out. [Colloq.] By the time I left for Scotland. Carlyle. 2. To cease; to desist; to leave off. \"He . . . began at the eldest, and left at the youngest.\" Gen. xliv. 12. To leave off, to cease; to desist; to stop. Leave off, and for another summons wait. Roscommon."}