{"word":"letter","definition":"One who lets or permits; one who lets anything for hire.\n\nOne who retards or hinders. [Archaic.]\n\n1. A mark or character used as the representative of a sound, or of an articulation of the human organs of speech; a first element of written language. And a superscription also was written over him in letters of Greek, and Latin, and Hebrew. Luke xxiii. 38. 2. A written or printed communication; a message expressed in intelligible characters on something adapted to conveyance, as paper, parchment, etc.; an epistle. The style of letters ought to be free, easy, and natural. Walsh. 3. A writing; an inscription. [Obs.] None could expound what this letter meant. Chaucer. 4. Verbal expression; literal statement or meaning; exact signification or requirement. We must observe the letter of the law, without doing violence to the reason of the law and the intention of the lawgiver. Jer. Taylor. I broke the letter of it to keep the sense. Tennyson. 5. (Print.)  A single type; type, collectively; a style of type. Under these buildings . . . was the king's printing house, and that famous letter so much esteemed. Evelyn. 6. pl.  Learning; erudition; as, a man of letters. 7. pl.  A letter; an epistle. [Obs.] Chaucer. Dead letter, Drop letter, etc. See under Dead, Drop, etc. -- Letter book, a book in which copies of letters are kept. -- Letter box, a box for the reception of letters to be mailed or delivered. -- Letter carrier, a person who carries letters; a postman; specif., an officer of the post office who carries letters to the persons to whom they are addressed, and collects letters to be mailed. -- Letter cutter, one who engraves letters or letter punches. -- Letter lock, a lock that can not be opened when fastened, unless certain movable lettered rings or disks forming a part of in are in such a position (indicated by a particular combination of the letters) as to permit the bolt to be withdrawn. A strange lock that opens with AMEN. Beau. & Fl. -- Letter paper, paper for writing letters on; especially, a size of paper intermediate between note paper and foolscap. See Paper. -- Letter punch, a steel punch with a letter engraved on the end, used in making the matrices for type. -- Letters of administration (Law), the instrument by which an administrator or administratrix is authorized to administer the goods and estate of a deceased person. -- Letter of attorney, Letter of credit, etc. See under Attorney, Credit, etc. -- Letter of license, a paper by which creditors extend a debtor's time for paying his debts. -- Letters close or clause (Eng. Law.), letters or writs directed to particular persons for particular purposes, and hence closed or sealed on the outside; -- distinguished from letters patent. Burrill. -- Letters of orders (Eccl.), a document duly signed and sealed, by which a bishop makes it known that he has regularly ordained a certain person as priest, deacon, etc. -- Letters patent, overt, or open (Eng. Law), a writing executed and sealed, by which power and authority are granted to a person to do some act, or enjoy some right; as, letters patent under the seal of England. -- Letter-sheet envelope, a stamped sheet of letter paper issued by the government, prepared to be folded and sealed for transmission by mail without an envelope. -- Letters testamentary (Law), an instrument granted by the proper officer to an executor after probate of a will, authorizing him to act as executor. -- Letter writer. (a) One who writes letters. (b) A machine for copying letters. (c) A book giving directions and forms for the writing of letters.\n\nTo impress with letters; to mark with letters or words; as, a book gilt and lettered."}