{"word":"like","definition":"1. Having the same, or nearly the same, appearance, qualities, or characteristics; resembling; similar to; similar; alike; -- often with in and the particulars of the resemblance; as, they are like each other in features, complexion, and many traits of character. 'The as like you As cherry is to cherry. Shak. Like master, like man. Old Prov. He giveth snow like wool; he scattereth the hoar-frost like ashes. Ps. cxlvii. 16. Note: To, which formerly often followed like, is now usually omitted. 2. Equal, or nearly equal; as, fields of like extent. More clergymen were impoverished by the late war than ever in the like space before. Sprat. 3. Having probability; affording probability; probable; likely. [Likely is more used now.] Shak. But it is like the jolly world about us will scoff at the paradox of these practices. South. Many were not easy to be governed, nor like to conform themselves to strict rules. Clarendon. 4. Inclined toward; disposed to; as, to feel like taking a walk. Had like (followed by the infinitive), had nearly; came little short of. Had like to have been my utter overthrow. Sir W. Raleigh Ramona had like to have said the literal truth, . . . but recollected herself in time. Mrs. H. H. Jackson. Like figures (Geom.), similar figures. Note: Like is used as a suffix, converting nouns into adjectives expressing resemblance to the noun; as, manlike, like a man; childlike, like a child; godlike, like a god, etc. Such compounds are readily formed whenever convenient, and several, as crescentlike, serpentlike, hairlike, etc., are used in this book, although, in some cases, not entered in the vocabulary. Such combinations as bell-like, ball-like, etc., are hyphened.\n\n1. That which is equal or similar to another; the counterpart; an exact resemblance; a copy. He was a man, take him for all in all, I shall not look upon his like again. Shak. 2. A liking; a preference; inclination; -- usually in pl.; as, we all have likes and dislikes.\n\n1. In a manner like that of; in a manner similar to; as, do not act like him. He maketh them to stagger like a drunken man. Job xii. 25. Note: Like, as here used, is regarded by some grammarians as a preposition. 2. In a like or similar manner. Shak. Like as a father pitieth his children, so the Lord pitieth them that fear him. Ps. ciii. 13. 3. Likely; probably. \"Like enough it will.\" Shak.\n\n1. To suit; to please; to be agreeable to. [Obs.] Cornwall him liked best, therefore he chose there. R. of Gloucester. I willingly confess that it likes me much better when I find virtue in a fair lodging than when I am bound to seek it in an ill-favored creature. Sir P. Sidney. 2. To be pleased with in a moderate degree; to approve; to take satisfaction in; to enjoy. He proceeded from looking to liking, and from liking to loving. Sir P. Sidney. 3. To liken; to compare.[Obs.] Like me to the peasant boys of France. Shak.\n\n1. To be pleased; to choose. He may either go or stay, as he best likes. Locke. 2. To have an appearance or expression; to look; to seem to be (in a specified condition). [Obs.] You like well, and bear your years very well. Shak. 3. To come near; to avoid with difficulty; to escape narrowly; as, he liked to have been too late. Cf. Had like, under Like, a. [Colloq.] He probably got his death, as he liked to have done two years ago, by viewing the troops for the expedition from the wall of Kensington Garden. Walpole. To like of, to be pleased with. [Obs.] Massinger."}