{"word":"lily","definition":"1. (Bot.)  A plant and flower of the genus Lilium, endogenous bulbous plants, having a regular perianth of six colored pieces, six stamens, and a superior three-celled ovary. Note: There are nearly fifty species, all found in the North Temperate zone. Lilium candidum and L. longiflorum are the common white lilies of gardens; L. Philadelphicum is the wild red lily of the Atlantic States. L. Chalcedonicum is supposed to be the \"lily of the field\" in our Lord's parable; L. auratum is the great gold-banded lily of Japan. 2. (Bot.)  A name given to handsome flowering plants of several genera, having some resemblance in color or form to a true lily, as Pancratium, Crinum, Amaryllis, Nerine, etc. 3. That end of a compass needle which should point to the north; -- so called as often ornamented with the figure of a lily or fleur-de- lis. But sailing further, it veers its lily to the west. Sir T. Browne. African lily (Bot.), the blue-flowered Agapanthus umbellatus. -- Atamasco lily (Bot.), a plant of the genus Zephyranthes (Z. Atamasco), having a white and pink funnelform perianth, with six petal-like divisions resembling those of a lily. Gray. -- Blackberry lily (Bot.), the Pardanthus Chinensis, the black seeds of which form a dense like a blackberry. -- Bourbon lily (Bot.), Lilium candidum. See Illust. -- Butterfly lily. (Bot.) Same as Mariposa lily, in the Vocabulary. -- Lily daffodil (Bot.), a plant of the genus Narcissus, and its flower. -- Lily encrinite (Paleon.), a fossil encrinite, esp. Encrinus liliiformis. See Encrinite. -- Lily hyacinth (Bot.), a plant of the genus Hyacinthus. -- Lily iron, a kind of harpoon with a detachable head of peculiar shape, used in capturing swordfish. -- Lily of the valley (Bot.), a low perennial herb (Convallaria majalis), having a raceme of nodding, fragrant, white flowers. -- Lily pad, the large floating leaf of the water lily. [U. S.] Lowell. -- Tiger lily (Bot.), Lilium tigrinum, the sepals of which are blotched with black. -- Turk's-cap lily (Bot.) Lilium Martagon, a red lily with recurved sepals; also, the similar American lily, L. superbum. -- Water lily (Bot.), the Nymphæa, a plant with floating roundish leaves, and large flowers having many petals, usually white, but sometimes pink, red, blue, or yellow. [See Illust. of Nymphæa.]"}