{"word":"little","definition":"1. Small in size or extent; not big; diminutive; -- opposed to big or large; as, a little body; a little animal; a little piece of ground; a little hill; a little distance; a little child. He sought to see Jesus who he was; and could not for the press, because he was little of stature. Luke xix. 3. 2. Short in duration; brief; as, a little sleep. Best him enough: after a little time, I'll beat him too. Shak. 3. Small in quantity or amount; not much; as, a little food; a little air or water. Conceited of their little wisdoms, and doting upon their own fancies. Barrow. 4. Small in dignity, power, or importance; not great; insignificant; contemptible. When thou wast little in thine own sight, wast thou not made the head of the tribes I Sam. xv. 17. 5. Small in force or efficiency; not strong; weak; slight; inconsiderable; as, little attention or exertion;little effort; little care or diligence. By sad experiment I know How little weight my words with thee can find. Milton. 6. Small in extent of views or sympathies; narrow; shallow; contracted; mean; illiberal; ungenerous. The long-necked geese of the world that are ever hissing dispraise, Because their natures are little. Tennyson. Little chief. (Zoöl.) See Chief hare. -- Little finger, the fourth and smallest finger of the hand. -- Little go (Eng. Universities), a public examination about the middle of the course, which as less strict and important than the final one; -- called also smalls. Cf. Great go, under Great. Thackeray. -- Little hours (R. C. Ch.), the offices of prime, tierce, sext, and nones. Vespers and compline are sometimes included. -- Little ones, young children. The men, and the women, and the little ones. Deut. ii. 34.\n\n1. That which is little; a small quantity, amount, space, or the like. Much was in little writ. Dryden. There are many expressions, which carrying with them no clear ideas, are like to remove but little of my ignorance. Locke. 2. A small degree or scale; miniature. \" His picture in little.\" Shak. A little, to or in a small degree; to a limited extent; somewhat; for a short time. \" Stay a little.\" Shak. The painter flattered her a little. Shak. -- By little and little, or Little by little, by slow degrees; piecemeal; gradually.\n\nIn a small quantity or degree; not much; slightly; somewhat; -- often with a preceding it. \" The poor sleep little.\" Otway."}