{"word":"log","definition":"A Hebrew measure of liquids, containing 2.37 gills. W. H. Ward.\n\n1. A bulky piece of wood which has not been shaped by hewing or sawing. 2. Etym: [Prob. the same word as in sense 1; cf. LG. log, lock, Dan. log, Sw. logg.] (Naut.)  An apparatus for measuring the rate of a ship's motion through the water. Note: The common log consists of the log-chip, or logship, often exclusively called the log, and the log line, the former being commonly a thin wooden quadrant of five or six inches radius, loaded with lead on the arc to make it float with the point up. It is attached to the log line by cords from each corner. This line is divided into equal spaces, called knots, each bearing the same proportion to a mile that half a minute does to an hour. The line is wound on a reel which is so held as to let it run off freely. When the log is thrown, the log-chip is kept by the water from being drawn forward, and the speed of the ship is shown by the number of knots run out in half a minute. There are improved logs, consisting of a piece of mechanism which, being towed astern, shows the distance actually gone through by the ship, by means of the revolutions of a fly, which are registered on a dial plate. 3. Hence: The record of the rate of ship's speed or of her daily progress; also, the full nautical record of a ship's cruise or voyage; a log slate; a log book. 4. A record and tabulated statement of the work done by an engine, as of a steamship, of the coal consumed, and of other items relating to the performance of machinery during a given time. 5. (Mining)  A weight or block near the free end of a hoisting rope to prevent it from being drawn through the sheave. Log board (Naut.), a board consisting of two parts shutting together like a book, with columns in which are entered the direction of the wind, course of the ship, etc., during each hour of the day and night. These entries are transferred to the log book. A folding slate is now used instead. -- Log book, or Logbook (Naut.), a book in which is entered the daily progress of a ship at sea, as indicated by the log, with notes on the weather and incidents of the voyage; the contents of the log board. Log cabin, Log house, a cabin or house made of logs. -- Log canoe, a canoe made by shaping and hollowing out a single log. -- Log glass (Naut.), a small sandglass used to time the running out of the log line. -- Log line (Naut.), a line or cord about a hundred and fifty fathoms long, fastened to the log-chip. See Note under 2d Log, n., 2. -- Log perch (Zoöl.), an ethiostomoid fish, or darter (Percina caprodes); -- called also hogfish and rockfish. -- Log reel (Naut.), the reel on which the log line is wound. -- Log slate. (Naut.) See Log board (above). -- Rough log (Naut.), a first draught of a record of the cruise or voyage. -- Smooth log (Naut.), a clean copy of the rough log. In the case of naval vessels this copy is forwarded to the proper officer of the government. -- To heave the log (Naut.), to cast the log-chip into the water; also, the whole process of ascertaining a vessel's speed by the log.\n\n, To enter in a ship's log book; as, to log the miles run. J. F. Cooper.\n\n1. To engage in the business of cutting or transporting logs for timber; to get out logs. [U.S.] 2. To move to and fro; to rock. [Obs.]"}