{"word":"lose","definition":"1. To part with unintentionally or unwillingly, as by accident, misfortune, negligence, penalty, forfeit, etc.; to be deprived of; as, to lose money from one's purse or pocket, or in business or gaming; to lose an arm or a leg by amputation; to lose men in battle. Fair Venus wept the sad disaster Of having lost her favorite dove. Prior. 2. To cease to have; to possess no longer; to suffer diminution of; as, to lose one's relish for anything; to lose one's health. If the salt hath lost his savor, wherewith shall it be salted Matt. v. 13. 3. Not to employ; to employ ineffectually; to throw away; to waste; to squander; as, to lose a day; to lose the benefits of instruction. The unhappy have but hours, and these they lose. Dryden. 4. To wander from; to miss, so as not to be able to and; to go astray from; as, to lose one's way. He hath lost his fellows. Shak 5. To ruin; to destroy; as destroy; as, the ship was lost on the ledge. The woman that deliberates is lost. Addison. 6. To be deprived of the view of; to cease to see or know the whereabouts of; as, he lost his companion in the crowd. Like following life thro' creatures you dissect, You lose it in the moment you detect. Pope . 7. To fail to obtain or enjoy; to fail to gain or win; hence, to fail to catch with the mind or senses; to miss; as, I lost a part of what he said. He shall in no wise lose his reward. Matt. x. 42. I fought the battle bravely which I lost, And lost it but to Macedonians. Dryden. 8. To cause to part with; to deprive of. [R.] How should you go about to lose him a wife he loves with so much passion Sir W. Temple. 9. To prevent from gaining or obtaining. O false heart ! thou hadst almost betrayed me to eternal flames, and lost me this glory. Baxter. To lose ground, to fall behind; to suffer gradual loss or disadvantage. -- To lose heart, to lose courage; to become timid. \"The mutineers lost heart.\" Macaulay. -- To lose one's head, to be thrown off one's balance; to lose the use of one's good sense or judgment. In the excitement of such a discovery, many scholars lost their heads. Whitney. -- To lose one's self. (a) To forget or mistake the bearing of surrounding objects; as, to lose one's self in a great city. (b) To have the perceptive and rational power temporarily suspended; as, we lose ourselves in sleep. -- To lose sight of. (a) To cease to see; as, to lose sight of the land. (b) To overlook; to forget; to fail to perceive; as, he lost sight of the issue.\n\nTo suffer loss, disadvantage, or defeat; to be worse off, esp. as the result of any kind of contest. We 'll . . . hear poor rogues Talk of court news; and we'll talk with them too, Who loses and who wins; who's in, who's out. Shak."}