{"word":"mail","definition":"A spot. [Obs.]\n\n1. A small piece of money; especially, an English silver half-penny of the time of Henry V. [Obs.] [Written also maile, and maille.] 2. Rent; tribute. [Obs., except in certain compounds and phrases, as blackmail, mails and duties, etc.] Mail and duties (Scots Law), the rents of an estate, in whatever form paid.\n\n1. A flexible fabric made of metal rings interlinked. It was used especially for defensive armor. Chaucer. Chain mail, Coat of mail. See under Chain, and Coat. 2. Hence generally, armor, or any defensive covering. 3. (Naut.)  A contrivance of interlinked rings, for rubbing off the loose hemp on lines and white cordage. 4. (Zoöl.)  Any hard protective covering of an animal, as the scales and plates of reptiles, shell of a lobster, etc. We . . . strip the lobster of his scarlet mail. Gay.\n\n1. To arm with mail. 2. To pinion. [Obs.]\n\n1. A bag; a wallet. [Obs.] Chaucer. 2. The bag or bags with the letters, papers, papers, or other matter contained therein, conveyed under public authority from one post office to another; the whole system of appliances used by government in the conveyance and delivery of mail matter. There is a mail come in to-day, with letters dated Hague. Tatler. 3. That which comes in the mail; letters, etc., received through the post office. 4. A trunk, box, or bag, in which clothing, etc., may be carried. [Obs.] Sir W. Scott. Mail bag, a bag in which mailed matter is conveyed under public authority. -- Mail boat, a boat that carries the mail. -- Mail catcher, an iron rod, or other contrivance, attached to a railroad car for catching a mail bag while the train is in motion. -- Mail guard, an officer whose duty it is to guard the public mails. [Eng.] -- Mail train, a railroad train carrying the mail.\n\nTo deliver into the custody of the postoffice officials, or place in a government letter box, for transmission by mail; to post; as, to mail a letter. [U. S.] Note: In the United States to mail and to post are both in common use; as, to mail or post a letter. In England post is the commoner usage."}