{"word":"main","definition":"1. A hand or match at dice. Prior. Thackeray. 2. A stake played for at dice. [Obs.] Shak. 3. The largest throw in a match at dice; a throw at dice within given limits, as in the game of hazard. 4. A match at cockfighting. \"My lord would ride twenty miles . . . to see a main fought.\" Thackeray. 5. A main-hamper. [Obs.] Ainsworth.\n\n1. Strength; force; might; violent effort. [Obs., except in certain phrases.] There were in this battle of most might and main. R. of Gl. He 'gan advance, With huge force, and with importable main. Spenser. 2. The chief or principal part; the main or most important thing. [Obs., except in special uses.] Resolved to rest upon the title of Lancaster as the main, and to use the other two . . . but as supporters. Bacon. 3. Specifically: (a) The great sea, as distinguished from an arm, bay, etc. ; the high sea; the ocean. \"Struggling in the main.\" Dryden. (b) The continent, as distinguished from an island; the mainland. \"Invaded the main of Spain.\" Bacon. (c) principal duct or pipe, as distinguished from lesser ones; esp. (Engin.), a principal pipe leading to or from a reservoir; as, a fire main. Forcing main, the delivery pipe of a pump. -- For the main, or In the main, for the most part; in the greatest part. -- With might and main, or With all one's might and main, with all one's strength; with violent effort. With might and main they chased the murderous fox. Dryden.\n\n1. Very or extremely strong. [Obs.] That current with main fury ran. Daniel. 2. Vast; huge. [Obs.] \"The main abyss.\" Milton. 3. Unqualified; absolute; entire; sheer. [Obs.] \"It's a man untruth.\" Sir W. Scott. 4. Principal; chief; first in size, rank, importance, etc. Our main interest is to be happy as we can. Tillotson. 5. Important; necessary. [Obs.] That which thou aright Believest so main to our success, I bring. Milton. By main force, by mere force or sheer force; by violent effort; as, to subdue insurrection by main force. That Maine which by main force Warwick did win. Shak. -- By main strength, by sheer strength; as, to lift a heavy weight by main strength. -- Main beam (Steam Engine), working beam. -- Main boom (Naut.), the boom which extends the foot of the mainsail in a fore and aft vessel. -- Main brace. (a) (Mech.) The brace which resists the chief strain. Cf. Counter brace. (b) (Naut.) The brace attached to the main yard. -- Main center (Steam Engine), a shaft upon which a working beam or side lever swings. -- Main chance. See under Chance. -- Main couple (Arch.), the principal truss in a roof. -- Main deck (Naut.), the deck next below the spar deck; the principal deck. -- Main keel (Naut.), the principal or true keel of a vessel, as distinguished from the false keel. Syn. -- Principal; chief; leading; cardinal; capital.\n\nVery extremely; as, main heavy. \"I'm main dry.\" Foote. [Obs. or Low]"}