{"word":"make","definition":"A companion; a mate; often, a husband or a wife. [Obs.] For in this world no woman is Worthy to be my make. Chaucer.\n\n1. To cause to exist; to bring into being; to form; to produce; to frame; to fashion; to create. Hence, in various specific uses or applications: (a) To form of materials; to cause to exist in a certain form; to construct; to fabricate. He . . . fashioned it with a graving tool, after he had made it a molten calf. Ex. xxxii. 4. (b) To produce, as something artificial, unnatural, or false; -- often with up; as, to make up a story. And Art, with her contending, doth aspire To excel the natural with made delights. Spenser. (c) To bring about; to bring forward; to be the cause or agent of; to effect, do, perform, or execute; -- often used with a noun to form a phrase equivalent to the simple verb that corresponds to such noun; as, to make complaint, for to complain; to make record of, for to record; to make abode, for to abide, etc. Call for Samson, that he may make us sport. Judg. xvi. 25. Wealth maketh many friends. Prov. xix. 4. I will neither plead my age nor sickness in excuse of the faults which I have made. Dryden. (d) To execute with the requisite formalities; as, to make a bill, note, will, deed, etc. (e) To gain, as the result of one's efforts; to get, as profit; to make acquisition of; to have accrue or happen to one; as, to make a large profit; to make an error; to make a loss; to make money. He accuseth Neptune unjustly who makes shipwreck a second time. Bacon. (f) To find, as the result of calculation or computation; to ascertain by enumeration; to find the number or amount of, by reckoning, weighing, measurement, and the like; as, he made the distance of; to travel over; as, the ship makes ten knots an hour; he made the distance in one day. (h) To put a desired or desirable condition; to cause to thrive. Who makes or ruins with a smile or frown. Dryden. 2. To cause to be or become; to put into a given state verb, or adjective; to constitute; as, to make known; to make public; to make fast. Who made thee a prince and a judge over us Ex. ii. 14. See, I have made thee a god to Pharaoh. Ex. vii. 1. Note: When used reflexively with an adjective, the reflexive pronoun is often omitted; as, to make merry; to make bold; to make free, etc. 3. To cause to appear to be; to constitute subjectively; to esteem, suppose, or represent. He is not that goose and ass that Valla would make him. Baker. 4. To require; to constrain; to compel; to force; to cause; to occasion; -- followed by a noun or pronoun and infinitive. Note: In the active voice the to of the infinitive is usually omitted. I will make them hear my words. Deut. iv. 10. They should be made to rise at their early hour. Locke. 5. To become; to be, or to be capable of being, changed or fashioned into; to do the part or office of; to furnish the material for; as, he will make a good musician; sweet cider makes sour vinegar; wool makes warm clothing. And old cloak makes a new jerkin. Shak. 6. To compose, as parts, ingredients, or materials; to constitute; to form; to amount to. The heaven, the air, the earth, and boundless sea, Make but one temple for the Deity. Waller. 7. To be engaged or concerned in. [Obs.] Gomez, what makest thou here, with a whole brotherhood of city bailiffs Dryden. 8. To reach; to attain; to arrive at or in sight of. \"And make the Libyan shores.\" Dryden. They that sail in the middle can make no land of either side. Sir T. Browne. To make a bed, to prepare a bed for being slept on, or to put it in order. -- To make a card (Card Playing), to take a trick with it. -- To make account. See under Account, n. -- To make account of, to esteem; to regard. -- To make away. (a) To put out of the way; to kill; to destroy. [Obs.] If a child were crooked or deformed in body or mind, they made him away. Burton. (b) To alienate; to transfer; to make over. [Obs.] Waller. -- To make believe, to pretend; to feign; to simulate. -- To make bold, to take the liberty; to venture. -- To make the cards (Card Playing), to shuffle the pack. -- To make choice of, to take by way of preference; to choose. -- To make danger, to make experiment. [Obs.] Beau. & Fl. -- To make default (Law), to fail to appear or answer. -- To make the doors, to shut the door. [Obs.] Make the doors upon a woman's wit, and it will out at the casement. Shak. - To make free with. See under Free, a. -- To make good. See under Good. -- To make head, to make headway. -- To make light of. See under Light, a. -- To make little of. (a) To belittle. (b) To accomplish easily. -- To make love to. See under Love, n. -- To make meat, to cure meat in the open air. [Colloq. Western U. S.] -- To make merry, to feast; to be joyful or jovial. -- To make much of, to treat with much consideration,, attention, or fondness; to value highly. -- To make no bones. See under Bone, n. -- To make no difference, to have no weight or influence; to be a matter of indifference. -- To make no doubt, to have no doubt. -- To make no matter, to have no weight or importance; to make no difference. -- To make oath (Law), to swear, as to the truth of something, in a prescribed form of law. -- To make of. (a) To understand or think concerning; as, not to know what to make of the news. (b) To pay attention to; to cherish; to esteem; to account. \"Makes she no more of me than of a slave.\" Dryden. -- To make one's law (Old Law), to adduce proof to clear one's self of a charge. -- To make out. (a) To find out; to discover; to decipher; as, to make out the meaning of a letter. (b) To prove; to establish; as, the plaintiff was unable to make out his case. (c) To make complete or exact; as, he was not able to make out the money. -- To make over, to transfer the title of; to convey; to alienate; as, he made over his estate in trust or in fee. -- To make sail. (Naut.) (a) To increase the quantity of sail already extended. (b) To set sail. -- To make shift, to manage by expedients; as, they made shift to do without it. [Colloq.]. -- To make sternway, to move with the stern foremost; to go or drift backward. -- To make strange, to act in an unfriendly manner or as if surprised; to treat as strange; as, to make strange of a request or suggestion. -- To make suit to, to endeavor to gain the favor of; to court. -- To make sure. See under Sure. -- To make up. (a) To collect into a sum or mass; as, to make up the amount of rent; to make up a bundle or package. (b) To reconcile; to compose; as, to make up a difference or quarrel. (c) To supply what is wanting in; to complete; as, a dollar is wanted to make up the stipulated sum. (d) To compose, as from ingredients or parts; to shape, prepare, or fabricate; as, to make up a mass into pills; to make up a story. He was all made up of love and charms! Addison. (e) To compensate; to make good; as, to make up a loss. (f) To adjust, or to arrange for settlement; as, to make up accounts. (g) To dress and paint for a part, as an actor; as, he was well made up. -- To make up a face, to distort the face as an expression of pain or derision. -- To make up one's mind, to reach a mental determination; to resolve. -- To make water. (a) (Naut.) To leak. (b) To urinate. -- To make way, or To make one's way. (a) To make progress; to advance. (b) To open a passage; to clear the way. -- To make words, to multiply words.\n\n1. To act in a certain manner; to have to do; to manage; to interfere; to be active; -- often in the phrase to meddle or make. [Obs.] A scurvy, jack-a-nape priest to meddle or make. Shak. 2. To proceed; to tend; to move; to go; as, he made toward home; the tiger made at the sportsmen. Note: Formerly, authors used to make on, to make forth, to make about; but these phrases are obsolete. We now say, to make at, to make away, to make for, to make off, to make toward, etc. 3. To tend; to contribute; to have effect; -- with for or against; as, it makes for his advantage. M. Arnold. Follow after the things which make for peace. Rom. xiv. 19. Considerations infinite Do make against it. Shak. 4. To increase; to augment; to accrue. 5. To compose verses; to write poetry; to versify. [Archaic] Chaucer. Tennyson. To solace him some time, as I do when I make. P. Plowman. To make as if, or To make as though, to pretend that; to make show that; to make believe (see under Make, v. t.). Joshua and all Israel made as if they were beaten before them, and fled. Josh. viii. 15. My lord of London maketh as though he were greatly displeased with me. Latimer. -- To make at, to go toward hastily, or in a hostile manner; to attack. -- To make away with. (a) To carry off. (b) To transfer or alienate; hence, to spend; to dissipate. (c) To kill; to destroy. -- To make off, to go away suddenly. -- To make out, to succeed; to be able at last; to make shift; as, he made out to reconcile the contending parties. -- To make up, to become reconciled or friendly. -- To make up for, to compensate for; to supply an equivalent for. -- To make up to. (a) To approach; as, a suspicious boat made up to us. (b) To pay addresses to; to make love to. -- To make up with, to become reconciled to. [Colloq.] -- To make with, to concur or agree with. Hooker.\n\nStructure, texture, constitution of parts; construction; shape; form. It our perfection of so frail a make As every plot can undermine and shake Dryden. On the make,bent upon making great profits; greedy of gain. [Low, U. S.]"}