{"word":"mark","definition":"A license of reprisals. See Marque.\n\n1. An old weight and coin. See Marc. \"Lend me a mark.\" Chaucer. 2. The unit of monetary account of the German Empire, equal to 23.8 cents of United States money; the equivalent of one hundred pfennigs. Also, a silver coin of this value.\n\n1. A visible sign or impression made or left upon anything; esp., a line, point, stamp, figure, or the like, drawn or impressed, so as to attract the attention and convey some information or intimation; a token; a trace. The Lord set a mark upon Cain, lest any finding him should kill him. Gen. iv. 15. 2. Specifically: (a) A character or device put on an article of merchandise by the maker to show by whom it was made; a trade-mark. (b) A character (usually a cross) made as a substitute for a signature by one who can not write. The mark of the artisan is found upon the most ancient fabrics that have come to light. Knight. 3. A fixed object serving for guidance, as of a ship, a traveler, a surveyor, etc.; as, a seamark, a landmark. 4. A trace, dot, line, imprint, or discoloration, although not regarded as a token or sign; a scratch, scar, stain, etc.; as, this pencil makes a fine mark. I have some marks of yours upon my pate. Shak. 5. An evidence of presence, agency, or influence; a significative token; a symptom; a trace; specifically, a permanent impression of one's activity or character. The confusion of tongues was a mark of separation. Bacon. 6. That toward which a missile is directed; a thing aimed at; what one seeks to hit or reach. France was a fairer mark to shoot at than Ireland. Davies. Whate'er the motive, pleasure is the mark. Young. 7. Attention, regard, or respect. As much in mock as mark. Shak. 8. Limit or standard of action or fact; as, to be within the mark; to come up to the mark. 9. Badge or sign of honor, rank, or official station. In the official marks invested, you Anon do meet the Senate. Shak. 10. Preëminence; high position; as, particians of mark; a fellow of no mark. 11. (Logic)  A characteristic or essential attribute; a differential. 12. A number or other character used in registring; as, examination marks; a mark for tardiness. 13. Image; likeness; hence, those formed in one's image; children; descendants. [Obs.] \"All the mark of Adam.\" Chaucer. 14. (Naut.)  One of the bits of leather or colored bunting which are placed upon a sounding line at intervals of from two to five fathoms. The unmarked fathoms are called \"deeps.\" A man of mark, a conspicuous or eminent man. -- To make one's mark. (a) To sign, as a letter or other writing, by making a cross or other mark. (b) To make a distinct or lasting impression on the public mind, or on affairs; to gain distinction. Syn. -- Impress; impression; stamp; print; trace; vestige; track; characteristic; evidence; proof; token; badge; indication; symptom.\n\n1. To put a mark upon; to affix a significant mark to; to make recognizable by a mark; as, to mark a box or bale of merchandise; to mark clothing. 2. To be a mark upon; to designate; to indicate; -- used literally and figuratively; as, this monument marks the spot where Wolfe died; his courage and energy marked him for a leader. 3. To leave a trace, scratch, scar, or other mark, upon, or any evidence of action; as, a pencil marks paper; his hobnails marked the floor. 4. To keep account of; to enumerate and register; as, to mark the points in a game of billiards or cards. 5. To notice or observe; to give attention to; to take note of; to remark; to heed; to regard. \"Mark the perfect man.\" Ps. xxxvii. 37. To mark out. (a) To designate, as by a mark; to select; as, the ringleaders were marked out for punishment. (b) To obliterate or cancel with a mark; as, to mark out an item in an account. -- To mark time (Mil.), to keep the time of a marching step by moving the legs alternately without advancing. Syn. -- To note; remark; notice; observe; regard; heed; show; evince; indicate; point out; betoken; denote; characterize; stamp; imprint; impress; brand.\n\nTo take particular notice; to observe critically; to note; to remark. Mark, I pray you, and see how this man seeketh maschief. 1 Kings xx. 7."}