{"word":"market","definition":"1. A meeting together of people, at a stated time and place, for the purpose of traffic (as in cattle, provisions, wares, etc.) by private purchase and sale, and not by auction; as, a market is held in the town every week. He is wit's peddler; and retails his wares At wakes, and wassails, meetings, markets, fairs. Shak. Three women and a goose make a market. Old Saying. 2. A public place (as an open space in a town) or a large building, where a market is held; a market place or market house; esp., a place where provisions are sold. There is at Jerusalem by the sheep market a pool. John v. 2. 3. An opportunity for selling anything; demand, as shown by price offered or obtainable; a town, region, or country, where the demand exists; as, to find a market for one's wares; there is no market for woolen cloths in that region; India is a market for English goods. There is a third thing to be considered: how a market can be created for produce, or how production can be limited to the capacities of the market. J. S. Mill. 4. Exchange, or purchase and sale; traffic; as, a dull market; a slow market. 5. The price for which a thing is sold in a market; market price. Hence: Value; worth. What is a man If his chief good and market of his time Be but to sleep and feed Shak. 6. (Eng. Law)  The privelege granted to a town of having a public market. Note: Market is often used adjectively, or in forming compounds of obvious meaning; as, market basket, market day, market folk, market house, marketman, market place, market price, market rate, market wagon, market woman, and the like. Market beater, a swaggering bully; a noisy braggart. [Obs.] Chaucer. -- Market bell, a bell rung to give notice that buying and selling in a market may begin. [Eng.] Shak. -- Market cross, a cross set up where a market is held. Shak. -- Market garden, a garden in which vegetables are raised for market. -- Market gardening, the raising of vegetables for market. -- Market place, an open square or place in a town where markets or public sales are held. -- Market town, a town that has the privilege of a stated public market.\n\nTo deal in a market; to buy or sell; to make bargains for provisions or goods.\n\nTo expose for sale in a market; to traffic in; to sell in a market, and in an extended sense, to sell in any manner; as, most of the farmes have marketed their crops. Industrious merchants meet, and market there The world's collected wealth. Southey."}