{"word":"marshal","definition":"1. Originally, an officer who had the care of horses; a groom. [Obs.] 2. An officer of high rank, charged with the arrangement of ceremonies, the conduct of operations, or the like; as, specifically: (a) One who goes before a prince to declare his coming and provide entertainment; a harbinger; a pursuivant. (b) One who regulates rank and order at a feast or any other assembly, directs the order of procession, and the like. (c) The chief officer of arms, whose duty it was, in ancient times, to regulate combats in the lists. Johnson. (d) (France) The highest military officer. In other countries of Europe a marshal is a military officer of high rank, and called field marshal. (e) (Am. Law) A ministerial officer, appointed for each judicial district of the United States, to execute the process of the courts of the United States, and perform various duties, similar to those of a sheriff. The name is also sometimes applied to certain police officers of a city. Earl marshal of England, the eighth officer of state; an honorary title, and personal, until made hereditary in the family of the Duke of Norfolk. During a vacancy in the office of high constable, the earl marshal has jurisdiction in the court of chivalry. Brande & C. -- Earl marshal of Scotland, an officer who had command of the cavalry under the constable. This office was held by the family of Keith, but forfeited by rebellion in 1715. -- Knight marshal, or Marshal of the King's house, formerly, in England, the marshal of the king's house, who was authorized to hear and determine all pleas of the Crown, to punish faults committed within the verge, etc. His court was called the Court of Marshalsea. -- Marshal of the Queen's Bench, formerly the title of the officer who had the custody of the Queen's bench prison in Southwark. Mozley & W.\n\n1. To dispose in order; to arrange in a suitable manner; as, to marshal troops or an army. And marshaling the heroes of his name As, in their order, next to light they came. Dryden. 2. To direct, guide, or lead. Thou marshalest me the way that I was going. Shak. 3. (Her.)  To dispose in due order, as the different quarterings on an escutcheon, or the different crests when several belong to an achievement."}