{"word":"marsh","definition":"A tract of soft wet land, commonly covered partially or wholly with water; a fen; a swamp; a morass. [Written also marish.] Marsh asphodel (Bot.), a plant (Nartheeium ossifragum) with linear equitant leaves, and a raceme of small white flowers; -- called also bog asphodel. -- Marsh cinquefoil (Bot.), a plant (Potentilla palustris) having purple flowers, and found growing in marshy places; marsh five- finger. -- Marsh elder. (Bot.) (a) The guelder-rose or cranberry tree (Viburnum Opulus). (b) In the United States, a composite shrub growing in salt marshes (Iva frutescens). -- Marsh five-finger. (Bot.) See Marsh cinquefoil (above). -- Marsh gas. (Chem.) See under Gas. -- Marsh grass (Bot.), a genus (Spartina) of coarse grasses growing in marshes; -- called also cord grass. The tall S. cynosuroides is not good for hay unless cut very young. The low S. juncea is a common component of salt hay. -- Marsh harrier (Zoöl.), a European hawk or harrier (Circus æruginosus); -- called also marsh hawk, moor hawk, moor buzzard, puttock. -- Marsh hawk. (Zoöl.) (a) A hawk or harrier (Circus cyaneus), native of both America and Europe. The adults are bluish slate above, with a white rump. Called also hen harrier, and mouse hawk. (b) The marsh harrier. -- Marsh hen (Zoöl.), a rail; esp., Rallus elegans of fresh-water marshes, and R. longirostris of salt-water marshes. -- Marsh mallow (Bot.), a plant of the genus Althæa ( A. officinalis) common in marshes near the seashore, and whose root is much used in medicine as a demulcent. -- Marsh marigold. (Bot.) See in the Vocabulary. -- Marsh pennywort (Bot.), any plant of the umbelliferous genus Hydrocotyle; low herbs with roundish leaves, growing in wet places; - - called also water pennywort. -- Marsh quail (Zoöl.), the meadow lark. -- Marsh rosemary (Bot.), a plant of the genus Statice (S. Limonium), common in salt marshes. Its root is powerfully astringent, and is sometimes used in medicine. Called also sea lavender. -- Marsh samphire (Bot.), a plant (Salicornia herbacea) found along seacoasts. See Glasswort. -- Marsh St. John's-wort (Bot.), an American herb (Elodes Virginica) with small opposite leaves and flesh-colored flowers. -- Marsh tea. (Bot.). Same as Labrador tea. -- Marsh trefoil. (Bot.) Same as Buckbean. -- Marsh wren (Zoöl.), any species of small American wrens of the genus Cistothorus, and allied genera. They chiefly inhabit salt marshes."}