{"word":"mass","definition":"1. (R. C. Ch.)  The sacrifice in the sacrament of the Eucharist, or the consecration and oblation of the host. 2. (Mus.)  The portions of the Mass usually set to music, considered as a musical composition; -- namely, the Kyrie, the Gloria, the Credo, the Sanctus, and the Agnus Dei, besides sometimes an Offertory and the Benedictus. Canon of the Mass. See Canon. -- High Mass, Mass with incense, music, the assistance of a deacon, subdeacon, etc. -- Low Mass, Mass which is said by the priest through-out, without music. -- Mass bell, the sanctus bell. See Sanctus. -- Mass book, the missal or Roman Catholic service book.\n\nTo celebrate Mass. [Obs.] Hooker.\n\n1. A quantity of matter cohering together so as to make one body, or an aggregation of particles or things which collectively make one body or quantity, usually of considerable size; as, a mass of ore, metal, sand, or water. If it were not for these principles, the bodies of the earth, planets, comets, sun, and all things in them, would grow cold and freeze, and become inactive masses. Sir I. Newton. A deep mass of continual sea is slower stirred To rage. Savile. 2. (Phar.)  A medicinal substance made into a cohesive, homogeneous lump, of consistency suitable for making pills; as, blue mass. 3. A large quantity; a sum. All the mass of gold that comes into Spain. Sir W. Raleigh. He had spent a huge mass of treasure. Sir J. Davies. 4. Bulk; magnitude; body; size. This army of such mass and charge. Shak. 5. The principal part; the main body. Night closed upon the pursuit, and aided the mass of the fugitives in their escape. Jowett (Thucyd.). 6. (Physics)  The quantity of matter which a body contains, irrespective of its bulk or volume. Note: Mass and weight are often used, in a general way, as interchangeable terms, since the weight of a body is proportional to its mass (under the same or equal gravitative forces), and the mass is usually ascertained from the weight. Yet the two ideas, mass and weight, are quite distinct. Mass is the quantity of matter in a body; weight is the comparative force with which it tends towards the center of the earth. A mass of sugar and a mass of lead are assumed to be equal when they show an equal weight by balancing each other in the scales. Blue mass. See under Blue. -- Mass center (Geom.), the center of gravity of a triangle. -- Mass copper, native copper in a large mass. -- Mass meeting, a large or general assembly of people, usually a meeting having some relation to politics. -- The masses, the great body of the people, as contrasted with the higher classes; the populace.\n\nTo form or collect into a mass; to form into a collective body; to bring together into masses; to assemble. But mass them together and they are terrible indeed. Coleridge."}