{"word":"master","definition":"A vessel having (so many) masts; -- used only in compounds; as, a two-master.\n\n1. A male person having another living being so far subject to his will, that he can, in the main, control his or its actions; -- formerly used with much more extensive application than now. (a) The employer of a servant. (b) The owner of a slave. (c) The person to whom an apprentice is articled. (d) A sovereign, prince, or feudal noble; a chief, or one exercising similar authority. (e) The head of a household. (f) The male head of a school or college. (g) A male teacher. (h) The director of a number of persons performing a ceremony or sharing a feast. (i) The owner of a docile brute, -- especially a dog or horse. (j) The controller of a familiar spirit or other supernatural being. 2. One who uses, or controls at will, anything inanimate; as, to be master of one's time. Shak. Master of a hundred thousand drachms. Addison. We are masters of the sea. Jowett (Thucyd. ). 3. One who has attained great skill in the use or application of anything; as, a master of oratorical art. Great masters of ridicule. Maccaulay. No care is taken to improve young men in their own language, that they may thoroughly understand and be masters of it. Locke. 4. A title given by courtesy, now commonly pronounced mìster, except when given to boys; -- sometimes written Mister, but usually abbreviated to Mr. 5. A young gentleman; a lad, or small boy. Where there are little masters and misses in a house, they are impediments to the diversions of the servants. Swift. 6. (Naut.)  The commander of a merchant vessel; -- usually called captain. Also, a commissioned officer in the navy ranking next above ensign and below lieutenant; formerly, an officer on a man-of-war who had immediate charge, under the commander, of sailing the vessel. 7. A person holding an office of authority among the Freemasons, esp. the presiding officer; also, a person holding a similar office in other civic societies. Little masters, certain German engravers of the 16th century, so called from the extreme smallness of their prints. -- Master in chancery, an officer of courts of equity, who acts as an assistant to the chancellor or judge, by inquiring into various matters referred to him, and reporting thereon to the court. -- Master of arts, one who takes the second degree at a university; also, the degree or title itself, indicated by the abbreviation M. A., or A. M. -- Master of the horse, the third great officer in the British court, having the management of the royal stables, etc. In ceremonial cavalcades he rides next to the sovereign. -- Master of the rolls, in England, an officer who has charge of the rolls and patents that pass the great seal, and of the records of the chancery, and acts as assistant judge of the court. Bouvier. Wharton. -- Past master, one who has held the office of master in a lodge of Freemasons or in a society similarly organized. -- The old masters, distinguished painters who preceded modern painters; especially, the celebrated painters of the 16th and 17th centuries. -- To be master of one's self, to have entire self-control; not to be governed by passion. -- To be one's own master, to be at liberty to act as one chooses without dictation from anybody. Note: Master, signifying chief, principal, masterly, superior, thoroughly skilled, etc., is often used adjiectively or in compounds; as, master builder or master-builder, master chord or master-chord, master mason or master-mason, master workman or master-workman, master mechanic, master mind, master spirit, master passion, etc. Throughout the city by the master gate. Chaucer. Master joint (Geol.), a quarryman's term for the more prominent and extended joints traversing a rock mass. -- Master key, a key adapted to open several locks differing somewhat from each other; figuratively, a rule or principle of general application in solving difficulties. -- Master lode (Mining), the principal vein of ore. -- Master mariner, an experienced and skilled seaman who is certified to be competent to command a merchant vessel. -- Master sinew (Far.), a large sinew that surrounds the hough of a horse, and divides it from the bone by a hollow place, where the windgalls are usually seated. -- Master singer. See Mastersinger. -- Master stroke, a capital performance; a masterly achievement; a consummate action; as, a master stroke of policy. -- Master tap (Mech.), a tap for forming the thread in a screw cutting die. -- Master touch. (a) The touch or skill of a master. Pope. (b) Some part of a performance which exhibits very skillful work or treatment. \"Some master touches of this admirable piece.\" Tatler. -- Master work, the most important work accomplished by a skilled person, as in architecture, literature, etc.; also, a work which shows the skill of a master; a masterpiece. -- Master workman, a man specially skilled in any art, handicraft, or trade, or who is an overseer, foreman, or employer.\n\n1. To become the master of; to subject to one's will, control, or authority; to conquer; to overpower; to subdue. Obstinacy and willful neglects must be mastered, even though it cost blows. Locke. 2. To gain the command of, so as to understand or apply; to become an adept in; as, to master a science. 3. To own; to posses. [Obs.] The wealth That the world masters. Shak.\n\nTo be skillful; to excel. [Obs.]"}