{"word":"meadow","definition":"1. A tract of low or level land producing grass which is mown for hay; any field on which grass is grown for hay. 2. Low land covered with coarse grass or rank herbage near rives and in marshy places by the sea; as, the salt meadows near Newark Bay.\n\nOf or pertaining to a meadow; of the nature of a meadow; produced, growing, or living in, a meadow. \"Fat meadow ground.\" Milton. Note: For many names of plants compounded with meadow, see the particular word in the Vocabulary. Meadow beauty. (Bot.) Same as Deergrass. -- Meadow foxtail (Bot.), a valuable pasture grass (Alopecurus pratensis) resembling timothy, but with softer spikes. -- Meadow grass (Bot.), a name given to several grasses of the genus Poa, common in meadows, and of great value for nay and for pasture. See Grass. -- Meadow hay, a coarse grass, or true sedge, growing in uncultivated swamp or river meadow; -- used as fodder or bedding for cattle, packing for ice, etc. [Local, U. S.] -- Meadow hen. (Zoöl.) (a) The American bittern. See Stake-driver. (b) The American coot (Fulica). (c) The clapper rail. -- Meadow lark (Zoöl.), any species of Sturnella, a genus of American birds allied to the starlings. The common species (S. magna) has a yellow breast with a black crescent. -- Meadow mouse (Zoöl.), any mouse of the genus Arvicola, as the common American species A. riparia; -- called also field mouse, and field vole. -- Meadow mussel (Zoöl.), an American ribbed mussel (Modiola plicatula), very abundant in salt marshes. -- Meadow ore (Min.), bog-iron ore , a kind of limonite. -- Meadow parsnip. (Bot.) See under Parsnip. -- Meadow pink. (Bot.) See under Pink. -- Meadow pipit (Zoöl.), a small singing bird of the genus Anthus, as A. pratensis, of Europe. -- Meadow rue (Bot.), a delicate early plant, of the genus Thalictrum, having compound leaves and numerous white flowers. There are many species. -- Meadow saffron. (Bot.) See under Saffron. -- Meadow sage. (Bot.) See under Sage. -- Meadow saxifrage (Bot.), an umbelliferous plant of Europe (Silaus pratensis), somewhat resembling fennel. -- Meadow snipe (Zoöl.), the common or jack snipe."}