{"word":"mendelian character","definition":"A character which obeys Mendel's law in regard to its hereditary transmission. MENDEL'S LAW Men\"del's law.  A principle governing the inheritance of many characters in animals and plants, discovered by Gregor J. Mendel (Austrian Augustinian abbot, 1822-84) in breeding experiments with peas. He showed that the height, color, and other characters depend on the presence of determinating factors behaving as units. In any given germ cell each of these is either present or absent. The following example (using letters as symbols of the determining factors and hence also of the individuals possessing them) shows the operation of the law: Tallness being due to a factor T, a tall plant, arising by the union in fertilization of two germ cells both bearing this factor, is TT; a dwarf, being without T, is tt. Crossing these, crossbreeds, Tt, result (called generation F1). In the formation of the germ cells of these crossbreeds a process of segregation occurs such that germ cells, whether male or female, are produced of two kinds, T and t, in equal numbers. The T cells bear the factor \"tallness,\" the t cells are devoid of it. The offspring, generation F2, which arise from the chance union of these germ cells in pairs, according to the law of probability, are therefore on an average in the following proportions: 1 TT : 2 Tt : 1 tt; and thus plants pure in tallness (TT) and dwarfness (tt), as well as crossbreeds (Tt), are formed by the interbreeding of crossbreeds. Frequently, as in this example, owning to what is called the dominance of a factor, the operation of Mendel's law may be complicated by the fact that when a dominant factor (as T) occurs with its allelomorph (as t), called recessive, in the crossbreed Tt, the individual Tt is itself indistinguishable from the pure form TT. Generation F1, containing only the Tt form, consists entirely of dominants (tall plants) and generation F2 consists of three dominants (2 Tt, 1 TT) to one dwarf (tt), which, displaying the feature suppressed in F1, is called recessive. Such qualitative and numerical regularity has been proved to exist in regard to very diverse qualities or characters which compose living things, both wild and domesticated, such as colors of flowers, of hair or eyes, patterns, structure, chemical composition, and power of resisting certain diseases. The diversity of forms produced in crossbreeding by horticulturists and fanciers generally results from a process of analytical variation or recombination of the factors composing the parental types. Purity of type consequently acquires a specific meaning. An individual is pure in respect of a given character when it results from the union of two sexual cells both bearing that character, or both without it."}