{"word":"meridian","definition":"1. Being at, or pertaining to, midday; belonging to, or passing through, the highest point attained by the sun in his diurnal course. \"Meridian hour.\" Milton. Tables ... to find the altitude meridian. Chaucer. 2. Pertaining to the highest point or culmination; as, meridian splendor.\n\n1. Midday; noon. 2. Hence: The highest point, as of success, prosperity, or the like; culmination. I have touched the highest point of all my greatness, And from that full meridian of my glory I haste now to my setting. Shak. 3. (Astron.)  A great circle of the sphere passing through the poles of the heavens and the zenith of a given place. It is crossed by the sun at midday. 4. (Geog.)  A great circle on the surface of the earth, passing through the poles and any given place; also, the half of such a circle included between the poles. Note: The planes of the geographical and astronomical meridians coincide. Meridians, on a map or globe, are lines drawn at certain intervals due north and south, or in the direction of the poles. Calculated for, or fitted to, or adapted to, the meridian of, suited to the local circumstances, capabilities, or special requirements of. All other knowledge merely serves the concerns of this life, and is fitted to the meridian thereof. Sir M. Hale. -- First meridian, the meridian from which longitudes are reckoned. The meridian of Greenwich is the one commonly employed in calculations of longitude by geographers, and in actual practice, although in various countries other and different meridians, chiefly those which pass through the capitals of the countries, are occasionally used; as, in France, the meridian of Paris; in the United States, the meridian of Washington, etc. -- Guide meridian (Public Land Survey), a line, marked by monuments, running North and South through a section of country between other more carefully established meridians called principal meridians, used for reference in surveying. [U.S.] -- Magnetic meridian, a great circle, passing through the zenith and coinciding in direction with the magnetic needle, or a line on the earth's surface having the same direction. -- Meridian circle (Astron.), an instrument consisting of a telescope attached to a large graduated circle and so mounted that the telescope revolves like the transit instrument in a meridian plane. By it the right ascension and the declination of a star may be measured in a single observation. -- Meridian instrument (Astron.), any astronomical instrument having a telescope that rotates in a meridian plane. -- Meridian of a globe, or Brass meridian, a graduated circular ring of brass, in which the artificial globe is suspended and revolves."}