{"word":"metal","definition":"1. (Chem.)  An elementary substance, as sodium, calcium, or copper, whose oxide or hydroxide has basic rather than acid properties, as contrasted with the nonmetals, or metalloids. No sharp line can be drawn between the metals and nonmetals, and certain elements partake of both acid and basic qualities, as chromium, manganese, bismuth, etc. Note: Popularly, the name is applied to certain hard, fusible metals, as gold, silver, copper, iron, tin, lead, zinc, nickel, etc., and also to the mixed metals, or metallic alloys, as brass, bronze, steel, bell metal, etc. 2. Ore from which a metal is derived; -- so called by miners. Raymond. 3. A mine from which ores are taken. [Obs.] Slaves . . . and persons condemned to metals. Jer. Taylor. 4. The substance of which anything is made; material; hence, constitutional disposition; character; temper. Not till God make men of some other metal than earth. Shak. 5. Courage; spirit; mettle. See Mettle. Shak. Note: The allusion is to the temper of the metal of a sword blade. Skeat. 6. The broken stone used in macadamizing roads and ballasting railroads. 7. The effective power or caliber of guns carried by a vessel of war. 8. Glass in a state of fusion. Knight. 9. pl.  The rails of a railroad. [Eng.] Base metal (Chem.), any one of the metals, as iron, lead, etc., which are readily tarnished or oxidized, in contrast with the noble metals. In general, a metal of small value, as compared with gold or silver. -- Fusible metal (Metal.), a very fusible alloy, usually consisting of bismuth with lead, tin, or cadmium. -- Heavy metals (Chem.), the metallic elements not included in the groups of the alkalies, alkaline earths, or the earths; specifically, the heavy metals, as gold, mercury, platinum, lead, silver, etc. -- Light metals (Chem.), the metallic elements of the alkali and alkaline earth groups, as sodium, lithium, calcium, magnesium, etc.; also, sometimes, the metals of the earths, as aluminium. -- Muntz metal, an alloy for sheathing and other purposes, consisting of about sixty per cent of copper, and forty of zinc. Sometimes a little lead is added. It is named from the inventor. -- Prince's metal (Old Chem.), an alloy resembling brass, consisting of three parts of copper to one of zinc; -- also called Prince Rupert's metal.\n\nTo cover with metal; as, to metal a ship's bottom; to metal a road."}