{"word":"mine","definition":"See Mien. [Obs.]\n\nBelonging to me; my. Used as a pronominal to me; my. Used as a pronominal adjective in the predicate; as, \"Vengeance is mine; I will repay.\" Rom. xii. 19. Also, in the old style, used attributively, instead of my, before a noun beginning with a vowel. I kept myself from mine iniquity. Ps. xviii. 23. Note: Mine is often used absolutely, the thing possessed being understood; as, his son is in the army, mine in the navy. When a man deceives me once, says the Italian proverb, it is his fault; when twice, it is mine. Bp. Horne. This title honors me and mine. Shak. She shall have me and mine. Shak.\n\n1. To dig a mine or pit in the earth; to get ore, metals, coal, or precious stones, out of the earth; to dig in the earth for minerals; to dig a passage or cavity under anything in order to overthrow it by explosives or otherwise. 2. To form subterraneous tunnel or hole; to form a burrow or lodge in the earth; as, the mining cony.\n\n1. To dig away, or otherwise remove, the substratum or foundation of; to lay a mine under; to sap; to undermine; hence, to ruin or destroy by slow degrees or secret means. They mined the walls. Hayward. Too lazy to cut down these immense trees, the spoilers... had mined them, and placed a quantity of gunpowder in the cavity. Sir W. Scott. 2. To dig into, for ore or metal. Lead veins have been traced... but they have not been mined. Ure. 3. To get, as metals, out of the earth by digging. The principal ore mined there is the bituminous cinnabar. Ure.\n\n1. A subterranean cavity or passage; especially: (a) A pit or excavation in the earth, from which metallic ores, precious stones, coal, or other mineral substances are taken by digging; -- distinguished from the pits from which stones for architectural purposes are taken, and which are called quarries. (b) (Mil.) A cavity or tunnel made under a fortification or other work, for the purpose of blowing up the superstructure with some explosive agent. 2. Any place where ore, metals, or precious stones are got by digging or washing the soil; as, a placer mine.gold mine 3. Fig.: A rich source of wealth or other good. Shak. Mine dial, a form of magnetic compass used by miners. -- Mine pig, pig iron made wholly from ore; in distinction from cinder pig, which is made from ore mixed with forge or mill cinder. Raymond."}