{"word":"minute","definition":"1. The sixtieth part of an hour; sixty seconds. (Abbrev. m.; as, 4 h. 30 m.) Four minutes, that is to say, minutes of an hour. Chaucer. 2. The sixtieth part of a degree; sixty seconds (Marked thus (`); as, 10ยบ 20`.) 3. A nautical or a geographic mile. 4. A coin; a half farthing. [Obs.] Wyclif (Mark xii. 42) 5. A very small part of anything, or anything very small; a jot; a tittle. [Obs.] Minutes and circumstances of his passion. Jer. Taylor. 6. A point of time; a moment. I go this minute to attend the king. Dryden. 7. The memorandum; a record; a note to preserve the memory of anything; as, to take minutes of a contract; to take minutes of a conversation or debate. 8. (Arch.)  A fixed part of a module. See Module. Note: Different writers take as the minute one twelfth, one eighteenth, one thirtieth, or one sixtieth part of the module.\n\nOf or pertaining to a minute or minutes; occurring at or marking successive minutes. Minute bell, a bell tolled at intervals of a minute, as to give notice of a death or a funeral. -- Minute book, a book in which written minutes are entered. -- Minute glass, a glass measuring a minute or minutes by the running of sand. -- Minute gun, a discharge of a cannon repeated every minute as a sign of distress or mourning. -- Minute hand, the long hand of a watch or clock, which makes the circuit of the dial in an hour, and marks the minutes.\n\nTo set down a short sketch or note of; to jot down; to make a minute or a brief summary of. The Empress of Russia, with her own hand, minuted an edict for universal tolerance. Bancroft.\n\n1. Very small; little; tiny; fine; slight; slender; inconsiderable. \"Minute drops.\" Milton. 2. Attentive to small things; paying attention to details; critical; particular; precise; as, a minute observer; minute observation. Syn. -- Little; diminutive; fine; critical; exact; circumstantial; particular; detailed. -- Minute, Circumstantial, Particular. A circumstantial account embraces all the leading events; a particular account includes each event and movement, though of but little importance; a minute account goes further still, and omits nothing as to person, time, place, adjuncts, etc."}