{"word":"mole","definition":"1. A spot; a stain; a mark which discolors or disfigures. [Obs.] Piers Plowman. 2. A spot, mark, or small permanent protuberance on the human body; esp., a spot which is dark-colored, from which commonly issue one or more hairs.\n\nA mass of fleshy or other more or less solid matter generated in the uterus.\n\nA mound or massive work formed of masonry or large stones, etc., laid in the sea, often extended either in a right line or an arc of a circle before a port which it serves to defend from the violence of the waves, thus protecting ships in a harbor; also, sometimes, the harbor itself. Brande & C.\n\n1. (Zoöl.)  Any insectivore of the family Talpidæ. They have minute eyes and ears, soft fur, and very large and strong fore feet. Note: The common European mole, or moldwarp (Talpa Europæa), is noted for its extensive burrows. The common American mole, or shrew mole (Scalops aquaticus), and star-nosed mole (Condylura cristata) have similar habits. Note: In the Scriptures, the name is applied to two unindentified animals, perhaps the chameleon and mole rat. 2. A plow of peculiar construction, for forming underground drains. [U.S.] Duck mole. See under Duck. -- Golden mole. See Chrysochlore. -- Mole cricket (Zoöl.), an orthopterous insect of the genus Gryllotalpa, which excavates subterranean galleries, and throws up mounds of earth resembling those of the mole. It is said to do damage by injuring the roots of plants. The common European species (Gryllotalpa vulgaris), and the American (G. borealis), are the best known. -- Mole rat (Zoöl.), any one of several species of Old World rodents of the genera Spalax, Georychus, and several allied genera. They are molelike in appearance and habits, and their eyes are small or rudimentary. -- Mole shrew (Zoöl.), any one of several species of short-tailed American shrews of the genus Blarina, esp. B. brevicauda. -- Water mole, the duck mole.\n\n1. To form holes in, as a mole; to burrow; to excavate; as, to mole the earth. 2. To clear of molehills. [Prov. Eng.] Pegge."}