{"word":"moment","definition":"1. A minute portion of time; a point of time; an instant; as, at thet very moment. In a moment, in the twinkling of an eye. 1 Cor. xv. 52. 2. Impulsive power; force; momentum. The moments or quantities of motion in bodies. Berkley. Touch, with lightest moment of impulse, His free will. Milton. 3. Importance, as in influence or effect; consequence; weight or value; consideration. Matters of great moment. Shak. It is an abstruse speculation, but also of far less moment and consequence of us than the others. Bentley. 4. An essential element; a deciding point, fact, or consideration; an essential or influential circumstance. 5. (Math.)  An infinitesimal change in a varying quantity; an increment or decrement. [Obs.] 6. (Mech.)  Tendency, or measure of tendency, to produce motion, esp. motion about a fixed point or axis. Moment of a couple (Mech.), the product of either of its forces into the perpendicular distance between them. -- Moment of a force. (Mech.) (a) With respect to a point, the product of the intensity of the force into the perpendicular distance from the point to the line of direction of the force. (b) With respect to a line, the product of that component of the force which is perpendicular to the plane passing through the line and the point of application of the force, into the shortest distance between the line and this point. (c) With respect to a plane that is parallel to the force, the product of the force into the perpendicular distance of its point of application from the plane. -- Moment of inertia, of a rotating body, the sum of the mass of each particle of matter of the body into the square of its distance from the axis of rotation; -- called also moment of rotation and moment of the mass. -- Statical moment, the product of a force into its leverage; the same as moment of a force with respect to a point, line, etc. -- Virtual moment. See under Virtual. Syn. -- Instant; twinkling; consequence; weight; force; value; consideration; signification; avail."}