{"word":"money","definition":"1. A piece of metal, as gold, silver, copper, etc., coined, or stamped, and issued by the sovereign authority as a medium of exchange in financial transactions between citizens and with government; also, any number of such pieces; coin. To prevent such abuses, ... it has been found necessary ... to affix a public stamp upon certain quantities of such particular metals, as were in those countries commonly made use of to purchase goods. Hence the origin of coined money, and of those public offices called mints. A. Smith. 2. Any written or stamped promise, certificate, or order, as a government note, a bank note, a certificate of deposit, etc., which is payable in standard coined money and is lawfully current in lieu of it; in a comprehensive sense, any currency usually and lawfully employed in buying and selling. Note: Whatever, among barbarous nations, is used as a medium of effecting exchanges of property, and in the terms of which values are reckoned, as sheep, wampum, copper rings, quills of salt or of gold dust, shovel blades, etc., is, in common language, called their money. 3. In general, wealth; property; as, he has much money in land, or in stocks; to make, or lose, money. The love of money is a root of all kinds of evil. 1 Tim vi. 10 (Rev. Ver. ). Money bill (Legislation), a bill for raising revenue. -- Money broker, a broker who deals in different kinds of money; one who buys and sells bills of exchange; -- called also money changer. -- Money cowrie (Zoöl.), any one of several species of Cypræa (esp. C. moneta) formerly much used as money by savage tribes. See Cowrie. -- Money of account, a denomination of value used in keeping accounts, for which there may, or may not, be an equivalent coin; e.g., the mill is a money of account in the United States, but not a coin. -- Money order, an order for the payment of money; specifically, a government order for the payment of money, issued at one post office as payable at another; -- called also postal money order. -- Money scrivener, a person who produces the loan of money to others. [Eng.] -- Money spider, Money spinner (Zoöl.), a small spider; -- so called as being popularly supposed to indicate that the person upon whom it crawls will be fortunate in money matters. -- Money's worth, a fair or full equivalent for the money which is paid. -- A piece of money, a single coin. -- Ready money, money held ready for payment, or actually paid, at the time of a transaction; cash. -- To make money, to gain or acquire money or property; to make a profit in dealings.\n\nTo supply with money. [Obs.]"}