{"word":"more","definition":"A hill. [Prov. Eng.] Halliwell.\n\nA root. [Obs.] Chaucer.\n\n1. Greater; superior; increased; as: (a) Greater in quality, amount, degree, quality, and the like; with the singular. He gat more money. Chaucer. If we procure not to ourselves more woe. Milton. Note: More, in this sense, was formerly used in connection with some other qualifying word, -- a, the, this, their, etc., -- which now requires the substitution of greater, further, or the like, for more. Whilst sisters nine, which dwell on Parnasse height, Do make them music for their more delight. Spenser. The more part knew not wherefore they were come together. Acts xix. 32. Wrong not that wrong with a more contempt. Shak. (b) Greater in number; exceeding in numbers; -- with the plural. The people of the children of Israel are more and mighter than we. Ex. i. 9. 2. Additional; other; as, he wept because there were no more words to conquer. With open arms received one poet more. Pope.\n\n1. A greater quantity, amount, or number; that which exceeds or surpasses in any way what it is compared with. And the children of Israel did so, and gathered, some more, some less. Ex. xvi. 17. 2. That which is in addition; something other and further; an additional or greater amount. They that would have more and more can never have enough. L'Estrange. O! That pang where more than madness lies. Byron. Any more. (a) Anything or something additional or further; as, I do not need any more. (b) Adverbially: Further; beyond a certain time; as, do not think any more about it. -- No more, not anything more; nothing in addition. -- The more and less, the high and low. [Obs.] Shak. \"All cried, both less and more.\" Chaucer.\n\n1. In a greater quantity; in or to a greater extent or degree. (a) With a verb or participle. Admiring more The riches of Heaven's pavement. Milton. (b) With an adjective or adverb (instead of the suffix -er) to form the comparative degree; as, more durable; more active; more sweetly. Happy here, and more happy hereafter. Bacon. Note: Double comparatives were common among writers of the Elizabeth period, and for some time later; as, more brighter; more dearer. The duke of Milan And his more braver daughter. Shak. 2. In addition; further; besides; again. Yet once more, Oye laurels, and once more, Ye myrtles brown, with ivy never sere, I come to pluck your berries harsh and crude. Milton. More and more, with continual increase. \"Amon trespassed more and more.\" 2 Chron. xxxiii. 23. -- The more, to a greater degree; by an added quantity; for a reason already specified. -- The more -- the more, by how much more -- by so much more. \"The more he praised in himself, the more he seems to suspect that in very deed it was not in him.\" Milton. -- To be no more, to have ceased to be; as, Cassius is no more; Troy is no more. Those oracles which set the world in flames, Nor ceased to burn till kingdoms were no more. Byron.\n\nTo make more; to increase. [Obs.] Gower."}