{"word":"mouth","definition":"1. The opening through which an animal receives food; the aperture between the jaws or between the lips; also, the cavity, containing the tongue and teeth, between the lips and the pharynx; the buccal cavity. 2. Hence:  An opening affording entrance or exit; orifice; aperture; as: (a) The opening of a vessel by which it is filled or emptied, charged or discharged; as, the mouth of a jar or pitcher; the mouth of the lacteal vessels, etc. (b) The opening or entrance of any cavity, as a cave, pit, well, or den. (c) The opening of a piece of ordnance, through which it is discharged. (d) The opening through which the waters of a river or any stream are discharged. (e) The entrance into a harbor. 3. (Saddlery)  The crosspiece of a bridle bit, which enters the mouth of an animal. 4. A principal speaker; one who utters the common opinion; a mouthpiece. Every coffeehouse has some particular statesman belonging to it, who is the mouth of the street where he lives. Addison. 5. Cry; voice. [Obs.] Dryden. 6. Speech; language; testimony. That in the mouth of two or three witnesses every word may be established. Matt. xviii. 16. 7. A wry face; a grimace; a mow. Counterfeit sad looks, Make mouths upon me when I turn my back. Shak. Down in the mouth, chapfallen; of dejected countenance; depressed; discouraged. [Obs. or Colloq.] -- Mouth friend, one who professes friendship insincerely. Shak. -- Mouth glass, a small mirror for inspecting the mouth or teeth. -- Mouth honor, honor given in words, but not felt. Shak. -- Mouth organ. (Mus.) (a) Pan's pipes. See Pandean. (b) An harmonicon. -- Mouth pipe, an organ pipe with a lip or plate to cut the escaping air and make a sound. -- To stop the mouth, to silence or be silent; to put to shame; to confound. The mouth of them that speak lies shall be stopped. Ps. lxiii. 11. Whose mouths must be stopped. Titus i. 11.\n\n1. To take into the mouth; to seize or grind with the mouth or teeth; to chew; to devour. Dryden. 2. To utter with a voice affectedly big or swelling; to speak in a strained or unnaturally sonorous manner. \"Mouthing big phrases.\" Hare. Mouthing out his hollow oes and aes. Tennyson. 3. To form or cleanse with the mouth; to lick, as a bear her cub. Sir T. Browne. 4. To make mouths at. [R.] R. Blair.\n\n1. To speak with a full, round, or loud, affected voice; to vociferate; to rant. I'll bellow out for Rome, and for my country, And mouth at Cæsar, till I shake the senate. Addison. 2. To put mouth to mouth; to kiss. [R.] Shak. 3. To make grimaces, esp. in ridicule or contempt. Well I know, when I am gone, How she mouths behind my back. Tennyson."}