{"word":"musk","definition":"1. A substance of a reddish brown color, and when fresh of the consistence of honey, obtained from a bag being behind the navel of the male musk deer. It has a slightly bitter taste, but is specially remarkable for its powerful and enduring odor. It is used in medicine as a stimulant antispasmodic. The term is also applied to secretions of various other animals, having a similar odor. 2. (Zoöl.)  The musk deer. See Musk deer (below). 3. The perfume emitted by musk, or any perfume somewhat similar. 4. (Bot.) (a) The musk plant (Mimulus moschatus). (b) A plant of the genus Erodium (E. moschatum); -- called also musky heron's-bill. (c) A plant of the genus Muscari; grape hyacinth. Musk beaver (Zoöl.), muskrat (1). -- Musk beetle (Zoöl.), a European longicorn beetle (Aromia moschata), having an agreeable odor resembling that of attar of roses. -- Musk cat. See Bondar. -- Musk cattle (Zoöl.), musk oxen. See Musk ox (below). -- Musk deer (Zoöl.), a small hornless deer (Moschus moschiferus), which inhabits the elevated parts of Central Asia. The upper canine teeth of the male are developed into sharp tusks, curved downward. The male has scent bags on the belly, from which the musk of commerce is derived. The deer is yellow or red-brown above, whitish below. The pygmy musk deer are chevrotains, as the kanchil and napu. -- Musk duck. (Zoöl.) (a) The Muscovy duck. (b) An Australian duck (Biziura lobata). -- Musk lorikeet (Zoöl.), the Pacific lorikeet (Glossopsitta australis) of Australia. -- Musk mallow (Bot.), a name of two malvaceous plants: (a) A species of mallow (Malva moschata), the foliage of which has a faint musky smell. (b) An Asiatic shrub. See Abelmosk. -- Musk orchis (Bot.), a European plant of the Orchis family (Herminium Minorchis); -- so called from its peculiar scent. -- Musk ox (Zoöl.), an Arctic hollow-horned ruminant (Ovibos moschatus), now existing only in America, but found fossil in Europe and Asia. It is covered with a thick coat of fine yellowish wool, and with long dark hair, which is abundant and shaggy on the neck and shoulders. The full-grown male weighs over four hundred pounds. -- Musk parakeet. (Zoöl.) Same as Musk lorikeet (above). -- Musk pear (Bot.), a fragrant kind of pear much resembling the Seckel pear. -- Musk plant (Bot.), the Mimulus moschatus, a plant found in Western North America, often cultivated, and having a strong musky odor. -- Musk root (Bot.), the name of several roots with a strong odor, as that of the nard (Nardostachys Jatamansi) and of a species of Angelica. -- Musk rose (Bot.), a species of rose (Rosa moschata), having peculiarly fragrant white blossoms. -- Musk seed (Bot.), the seed of a plant of the Mallow family (Hibiscus moschatus), used in perfumery and in flavoring. See Abelmosk. -- Musk sheep (Zoöl.), the musk ox. -- Musk shrew (Zoöl.), a shrew (Sorex murinus), found in India. It has a powerful odor of musk. Called also sondeli, and mondjourou. -- Musk thistle (Bot.), a species of thistle (Carduus nutans), having fine large flowers, and leaves smelling strongly of musk. -- Musk tortoise, Musk turtle (Zoöl.), a small American fresh-water tortoise (Armochelys, or Ozotheca, odorata), which has a distinct odor of musk; -- called also stinkpot.\n\nTo perfume with musk."}