{"word":"muster","definition":"1. Something shown for imitation; a pattern. [Obs.] 2. A show; a display. [Obs.] Piers Plowman. 3. An assembling or review of troops, as for parade, verification of numbers, inspection, exercise, or introduction into service. The hurried muster of the soldiers of liberty. Hawthorne. See how in warlike muster they appear, In rhombs, and wedges, and half-moons, and wings. Milton. 4. The sum total of an army when assembled for review and inspection; the whole number of effective men in an army. And the muster was thirty thousands of men. Wyclif. Ye publish the musters of your own bands, and proclaim them to amount of thousands. Hooker. 5. Any assemblage or display; a gathering. Of the temporal grandees of the realm, mentof their wives and daughters, the muster was great and splendid. Macaulay. Muster book, a book in which military forces are registred. -- Muster file, a muster roll. -- Muster master (Mil.), one who takes an account of troops, and of their equipment; a mustering officer; an inspector. [Eng.] -- Muster roll (Mil.), a list or register of all the men in a company, troop, or regiment, present or accounted for on the day of muster. -- To pass muster, to pass through a muster or inspection without censure. Such excuses will not pass muster with God. South.\n\n1. To collect and display; to assemble, as troops for parade, inspection, exercise, or the like. Spenser. 2. Hence: To summon together; to enroll in service; to get together. \"Mustering all its force.\" Cowper. All the gay feathers he could muster. L'Estrange. To muster troops into service (Mil.), to inspect and enter troops on the muster roll of the army. -- To muster troops out of service (Mil.), to register them for final payment and discharge. -- To muster up, to gather up; to succeed in obtaining; to obtain with some effort or difficulty. One of those who can muster up sufficient sprightliness to engage in a game of forfeits. Hazlitt.\n\nTo be gathered together for parade, inspection, exercise, or the like; to come together as parts of a force or body; as, his supporters mustered in force. \"The mustering squadron.\" Byron."}