{"word":"mute","definition":"To cast off; to molt. Have I muted all my feathers Beau. & Fl.\n\nTo eject the contents of the bowels; -- said of birds. B. Jonson.\n\nThe dung of birds. Hudibras.\n\n1. Not speaking; uttering no sound; silent. All the heavenly choir stood mute, And silence was in heaven. Milton. Note: In law a prisoner is said to stand mute, when, upon being arranged, he makes no answer, or does not plead directly, or will not put himself on trial. 2. Incapable of speaking; dumb. Dryden. 3. Not uttered; unpronounced; silent; also, produced by complete closure of the mouth organs which interrupt the passage of breath; -- said of certain letters. See 5th Mute, 2. 4. Not giving a ringing sound when struck; -- said of a metal. Mute swan (Zoöl.), a European wild white swan (Cygnus gibbus), which produces no loud notes. Syn. -- Silent; dumb; speechless. -- Mute, Silent, Dumb. One is silent who does not speak; one is dumb who can not, for want of the proper organs; as, a dumb beast, etc.; and hence, figuratively, we speak of a person as struck dumb with astonishment, etc. One is mute who is held back from speaking by some special cause; as, he was mute through fear; mute astonishment, etc. Such is the case with most of those who never speak from childhood; they are not ordinarily dumb, but mute because they are deaf, and therefore never learn to talk; and hence their more appropriate name is deaf-mutes. They spake not a word; But, like dumb statues, or breathing stones, Gazed each on other. Shak. All sat mute, Pondering the danger with deep thoughts. Milton.\n\n1. One who does not speak, whether from physical inability, unwillingness, or other cause. Specifically: (a) One who, from deafness, either congenital or from early life, is unable to use articulate language; a deaf-mute. (b) A person employed by undertakers at a funeral. (c) A person whose part in a play does not require him to speak. (d) Among the Turks, an officer or attendant who is selected for his place because he can not speak. 2. (Phon.)  A letter which represents no sound; a silent letter; also, a close articulation; an element of speech formed by a position of the mouth organs which stops the passage of the breath; as, p, b, d, k, t. 3. (Mus.)  A little utensil made of brass, ivory, or other material, so formed that it can be fixed in an erect position on the bridge of a violin, or similar instrument, in order to deaden or soften the tone."}