{"word":"native","definition":"1. Arising by birth; having an origin; born. [Obs.] Anaximander's opinion is, that the gods are native, rising and vanishing again in long periods of times. Cudworth. 2. Of or pertaining to one's birth; natal; belonging to the place or the circumstances in which one is born; -- opposed to foreign; as, native land, language, color, etc. 3. Born in the region in which one lives; as, a native inhabitant, race; grown or originating in the region where used or sold; not foreign or imported; as, native oysters, or strawberries. 4. Original; constituting the original substance of anything; as, native dust. Milton. 5. Conferred by birth; derived from origin; born with one; inherent; inborn; not acquired; as, native genius, cheerfulness, simplicity, rights, etc. Courage is native to you. Jowett (Thucyd. ). 6. Naturally related; cognate; connected (with). [R.] the head is not more native to the heart, ... Than is the throne of Denmark to thy father. Shak. 7. (Min.) (a) Found in nature uncombined with other elements; as, native silver. (b) Found in nature; not artificial; as native sodium chloride. Native American party. See under American, a. -- Native bear (Zoöl.), the koala. -- Native bread (Bot.), a large underground fungus, of Australia (Mylitta australis), somewhat resembling a truffle, but much larger. -- Native devil. (Zoöl.) Same as Tasmanian devil, under Devil. -- Native hen (Zoöl.), an Australian rail (Tribonyx Mortierii). -- Native pheasant. (Zoöl.) See Leipoa. -- Native rabbit (Zoöl.), an Australian marsupial (Perameles lagotis) resembling a rabbit in size and form. -- Native sloth (Zoöl.), the koala. -- Native thrush (Zoöl.), an Australian singing bird (Pachycephala olivacea); -- called also thickhead. -- Native turkey (Zoöl.), the Australian bustard (Choriotis australis); -- called also bebilya. Syn. -- Natural; natal; original; congential. -- Native, Natural, Natal. natural refers to the nature of a thing, or that which springs therefrom; native, to one's birth or origin; as, a native country, language, etc.; natal, to the circumstances of one's birth; as, a natal day, or star. Native talent is that which is inborn; natural talent is that which springs from the structure of the mind. Native eloquence is the result of strong innate emotion; natural eloquence is opposed to that which is studied or artifical.\n\n1. One who, or that which, is born in a place or country referred to; a denizen by birth; an animal, a fruit, or vegetable, produced in a certain region; as, a native of France. 2. (Stock Breeding)  Any of the live stock found in a region, as distinguished from such as belong to pure and distinct imported breeds. [U.S.]"}