{"word":"near","definition":"1. At a little distance, in place, time, manner, or degree; not remote; nigh. My wife! my traitress! let her not come near me. Milton. 2. Nearly; almost; well-nigh. \"Near twenty years ago.\" Shak. \"Near a fortnight ago.\" Addison. Near about the yearly value of the land. Locke. 3. Closely; intimately. Shak. Far and near, at a distance and close by; throughout a whole region. -- To come near to, to want but little of; to approximate to. \"Such a sum he found would go near to ruin him.\" Addison. -- Near the wind (Naut.), close to the wind; closehauled.\n\n1. Not far distant in time, place, or degree; not remote; close at hand; adjacent; neighboring; nigh. \"As one near death.\" Shak. He served great Hector, and was ever near, Not with his trumpet only, but his spear. Dryden. 2. Closely connected or related. She is thy father's near kinswoman. Lev. xviii. 12. 3. Close to one's interests, affection, etc.; touching, or affecting intimately; intimate; dear; as, a near friend. 4. Close to anything followed or imitated; not free, loose, or rambling; as, a version near to the original. 5. So as barely to avoid or pass injury or loss; close; narrow; as, a near escape. 6. Next to the driver, when he is on foot; in the Unted States, on the left of an animal or a team; as, the near ox; the near leg. See Off side, under Off, a. 7. Immediate; direct; close; short. \"The nearest way.\" Milton. 8. Close-fisted; parsimonious. [Obs. or Low, Eng.] Note: Near may properly be followed by to before the thing approached'; but more frequently to is omitted, and the adjective or the adverb is regarded as a preposition. The same is also true of the word nigh. Syn. -- Nigh; close; adjacent; proximate; contiguous; present; ready; intimate; dear.\n\nAdjacent to; close by; not far from; nigh; as, the ship sailed near the land. See the Note under near, a.\n\nTo approach; to come nearer; as, the ship neared the land.\n\nTo draw near; to approach. A speck, a mist, a shape, I wist! And still it neared, and neared. Coleridge."}