{"word":"negative","definition":"1. Denying; implying, containing, or asserting denial, negation or refusal; returning the answer no to an inquiry or request; refusing assent; as, a negative answer; a negative opinion; -- opposed to Ant: affirmative. If thou wilt confess, Or else be impudently negative. Shak. Denying me any power of a negative voice. Eikon Basilike. Something between an affirmative bow and a negative shake. Dickens. 2. Not positive; without affirmative statement or demonstration; indirect; consisting in the absence of something; privative; as, a negative argument; a negative morality; negative criticism. There in another way of denying Christ, ... which is negative, when we do not acknowledge and confess him. South. 3. (Logic)  Asserting absence of connection between a subject and a predicate; as, a negative proposition. 4. (Photog.)  Of or pertaining to a picture upon glass or other material, in which the lights and shades of the original, and the relations of right and left, are reversed. 5. (Chem.)  Metalloidal; nonmetallic; -- contracted with positive or basic; as, the nitro group is negative. Note: This word, derived from electro-negative, is now commonly used in a more general sense, when acidiferous is the intended signification. Negative crystal. (a) A cavity in a mineral mass, having the form of a crystal. (b) A crystal which has the power of negative double refraction. See refraction. -- negative electricity (Elec.), the kind of electricity which is developed upon resin or ebonite when rubbed, or which appears at that pole of a voltaic battery which is connected with the plate most attacked by the exciting liquid; -- formerly called resinous electricity. Opposed to Ant: positive electricity. Formerly, according to Franklin's theory of a single electric fluid, negative electricity was supposed to be electricity in a degree below saturation, or the natural amount for a given body. see Electricity. -- Negative eyepiece. (Opt.) see under Eyepiece. -- Negative quantity (Alg.), a quantity preceded by the negative sign, or which stands in the relation indicated by this sign to some other quantity. See Negative sign (below). -- Negative rotation, right-handed rotation. See Right-handed, 3. -- Negative sign, the sign -, or minus (opposed in signification to +, or Ant: plus), indicating that the quantity to which it is prefixed is to be subtracted from the preceding quantity, or is to be reckoned from zero or cipher in the opposite direction to that of quanties having the sign plus either expressed or understood; thus, in a - b, b is to be substracted from a, or regarded as opposite to it in value; and -10° on a thermometer means 10° below the zero of the scale.\n\n1. A proposition by which something is denied or forbidden; a conception or term formed by prefixing the negative particle to one which is positive; an opposite or contradictory term or conception. This is a known rule in divinity, that there is no command that runs in negatives but couches under it a positive duty. South. 2. A word used in denial or refusal; as, not, no. Note: In Old England two or more negatives were often joined together for the sake of emphasis, whereas now such expressions are considered ungrammatical, being chiefly heard in iliterate speech. A double negative is now sometimes used as nearly or quite equivalent to an affirmative. No wine ne drank she, neither white nor red. Chaucer. These eyes that never did nor never shall So much as frown on you. Shak. 3. The refusal or withholding of assents; veto. If a kind without his kingdom be, in a civil sense, nothing, then ... his negative is as good as nothing. Milton. 4. That side of a question which denies or refuses, or which is taken by an opposing or denying party; the relation or position of denial or opposition; as, the question was decided in the negative. 5. (Photog.)  A picture upon glass or other material, in which the light portions of the original are represented in some opaque material (usually reduced silver), and the dark portions by the uncovered and transparent or semitransparent ground of the picture. Note: A negative is chiefly used for producing photographs by means of the sun's light passing through it and acting upon sensitized paper, thus producing on the paper a positive picture. 6. (Elect.)  The negative plate of a voltaic or electrolytic cell. Negative pregnant (Law), a negation which implies an affirmation.\n\n1. To prove unreal or intrue; to disprove. The omission or infrequency of such recitals does not negative the existence of miracles. Paley. 2. To reject by vote; to refuse to enact or sanction; as, the Senate negatived the bill. 3. To neutralize the force of; to counteract."}