{"word":"night","definition":"1. That part of the natural day when the sun is beneath the horizon, or the time from sunset to sunrise; esp., the time between dusk and dawn, when there is no light of the sun, but only moonlight, starlight, or artificial light. And God called the light Day, and the darkness he called Night. Gen. i. 5. 2. Hence: (a) Darkness; obscurity; concealment. Nature and nature's laws lay hid in night. Pope. (b) Intellectual and moral darkness; ignorance. (c) A state of affliction; adversity; as, a dreary night of sorrow. (d) The period after the close of life; death. She closed her eyes in everlasting night. Dryden. (e) A lifeless or unenlivened period, as when nature seems to sleep. \"Sad winter's night\". Spenser. Note: Night is sometimes used, esp. with participles, in the formation of self-explaining compounds; as, night-blooming, night- born, night-warbling, etc. Night by night, Night after night, nightly; many nights. So help me God, as I have watched the night, Ay, night by night, in studying good for England. Shak. -- Night bird. (Zoöl.) (a) The moor hen (Gallinula chloropus). (b) The Manx shearwater (Puffinus Anglorum). -- Night blindness. (Med.) See Hemeralopia. -- Night cart, a cart used to remove the contents of privies by night. -- Night churr, (Zoöl.), the nightjar. -- Night crow, a bird that cries in the night. -- Night dog, a dog that hunts in the night, -- used by poachers. -- Night fire. (a) Fire burning in the night. (b) Ignis fatuus; Will-o'-the-wisp; Jask-with-a-lantern. -- Night flyer (Zoöl.), any creature that flies in the night, as some birds and insects. -- night glass, a spyglass constructed to concentrate a large amount of light, so as see objects distinctly at night. Totten. -- Night green, iodine green. -- Night hag, a witch supposed to wander in the night. -- Night hawk (Zoöl.), an American bird (Chordeiles Virginianus), allied to the goatsucker. It hunts the insects on which it feeds toward evening, on the wing, and often, diving down perpendicularly, produces a loud whirring sound, like that of a spinning wheel. Also sometimes applied to the European goatsuckers. It is called also bull bat. -- Night heron (Zoöl.), any one of several species of herons of the genus Nycticorax, found in various parts of the world. The best known species is Nycticorax griseus, or N. nycticorax, of Europe, and the American variety (var. nævius). The yellow-crowned night heron (Nycticorax violaceus) inhabits the Southern States. Called also qua- bird, and squawk. -- Night house, a public house, or inn, which is open at night. -- Night key, a key for unfastening a night latch. -- Night latch, a kind of latch for a door, which is operated from the outside by a key. -- Night monkey (Zoöl.), an owl monkey. -- night moth (Zoöl.), any one of the noctuids. -- Night parrot (Zoöl.), the kakapo. -- Night piece, a painting representing some night scene, as a moonlight effect, or the like. -- Night rail, a loose robe, or garment, worn either as a nightgown, or over the dress at night, or in sickness. [Obs.] -- Night raven (Zoöl.), a bird of ill omen that cries in the night; esp., the bittern. -- Night rule. (a) A tumult, or frolic, in the night; -- as if a corruption, of night revel. [Obs.] (b) Such conduct as generally rules, or prevails, at night. What night rule now about this haunted grove Shak. -- Night sight. (Med.) See Nyctolopia. -- Night snap, a night thief. [Cant] Beau. & Fl. -- Night soil, human excrement; -- so called because in cities it is collected by night and carried away for manure. -- Night spell, a charm against accidents at night. -- Night swallow (Zoöl.), the nightjar. -- Night walk, a walk in the evening or night. -- Night walker. (a) One who walks in his sleep; a somnambulist; a noctambulist. (b) One who roves about in the night for evil purposes; specifically, a prostitute who walks the streets. -- Night walking. (a) Walking in one's sleep; somnambulism; noctambulism. (b) Walking the streets at night with evil designs. -- Night warbler (Zoöl.), the sedge warbler (Acrocephalus phragmitis); -- called also night singer. [prov. Eng.] -- Night watch. (a) A period in the night, as distinguished by the change of watch. (b) A watch, or guard, to aford protection in the night. -- Night watcher, one who watches in the night; especially, one who watches with evil designs. -- Night witch. Same as Night hag, above."}