{"word":"nose","definition":"1. (Anat.)  The prominent part of the face or anterior extremity of the head containing the nostrils and olfactory cavities; the olfactory organ. See Nostril, and Olfactory organ under Olfactory. 2. The power of smelling; hence, scent. We are not offended with a dog for a better nose than his master. Collier. 3. A projecting end or beak at the front of an object; a snout; a nozzle; a spout; as, the nose of a bellows; the nose of a teakettle. Nose bit (Carp.), a bit similar to a gouge bit, but having a cutting edge on one side of its boring end. -- Nose hammer (Mach.), a frontal hammer. -- Nose hole (Glass Making), a small opening in a furnace, before which a globe of crown glass is held and kept soft at the beginning of the flattening process. -- Nose key (Carp.), a fox wedge. -- Nose leaf (Zoöl.), a thin, broad, membranous fold of skin on the nose of many species of bats. It varies greatly in size and form. -- Nose of wax, fig., a person who is pliant and easily influenced. \"A nose of wax to be turned every way.\" Massinger -- Nose piece, the nozzle of a pipe, hose, bellows, etc.; the end piece of a microscope body, to which an objective is attached. -- To hold, put, or bring one's nose to the grindstone. See under Grindstone. -- To lead by the nose, to lead at pleasure, or to cause to follow submissively; to lead blindly, as a person leads a beast. Shak. -- To put one's nose out of joint, to humiliate one's pride, esp. by supplanting one in the affections of another. [Slang] -- To thrust one's nose into, to meddle officiously in. -- To wipe one's nose of, to deprive of; to rob. [Slang]\n\n1. To smell; to scent; hence, to track, or trace out. 2. To touch with the nose; to push the nose into or against; hence, to interfere with; to treat insolently. Lambs . . . nosing the mother's udder. Tennyson. A sort of national convention, dubious in its nature . . . nosed Parliament in the very seat of its authority. Burke. 3. To utter in a nasal manner; to pronounce with a nasal twang; as, to nose a prayer. [R.] Cowley.\n\n1. To smell; to sniff; to scent. Audubon. 2. To pry officiously into what does not concern one."}