{"word":"number","definition":"1. That which admits of being counted or reckoned; a unit, or an aggregate of units; a numerable aggregate or collection of individuals; an assemblage made up of distinct things expressible by figures. 2. A collection of many individuals; a numerous assemblage; a multitude; many. Ladies are always of great use to the party they espouse, and never fail to win over numbers. Addison. 3. A numeral; a word or character denoting a number; as, to put a number on a door. 4. Numerousness; multitude. Number itself importeth not much in armies where the people are of weak courage. Bacon. 5. The state or quality of being numerable or countable. Of whom came nations, tribes, people, and kindreds out of number. 2 Esdras iii. 7. 6. Quantity, regarded as made up of an aggregate of separate things. 7. That which is regulated by count; poetic measure, as divisions of time or number of syllables; hence, poetry, verse; -- chiefly used in the plural. I lisped in numbers, for the numbers came. Pope. 8. (Gram.)  The distinction of objects, as one, or more than one (in some languages, as one, or two, or more than two), expressed (usually) by a difference in the form of a word; thus, the singular number and the plural number are the names of the forms of a word indicating the objects denoted or referred to by the word as one, or as more than one. 9. (Math.)  The measure of the relation between quantities or things of the same kind; that abstract species of quantity which is capable of being expressed by figures; numerical value. Abstract number, Abundant number, Cardinal number, etc. See under Abstract, Abundant, etc. -- In numbers, in numbered parts; as, a book published in numbers.\n\n1. To count; to reckon; to ascertain the units of; to enumerate. If a man can number the dust of the earth, then shall thy seed also be numbered. Gen. xiii. 16. 2. To reckon as one of a collection or multitude. He was numbered with the transgressors. Is. liii. 12. 3. To give or apply a number or numbers to; to assign the place of in a series by order of number; to designate the place of by a number or numeral; as, to number the houses in a street, or the apartments in a building. 4. To amount; to equal in number; to contain; to consist of; as, the army numbers fifty thousand. Thy tears can not number the dead. Campbell. Numbering machine, a machine for printing consecutive numbers, as on railway tickets, bank bills, etc. Syn. -- To count; enumerate; calculate; tell."}