{"word":"oak","definition":"1. (Bot.)  Any tree or shrub of the genus Quercus. The oaks have alternate leaves, often variously lobed, and staminate flowers in catkins. The fruit is a smooth nut, called an acorn, which is more or less inclosed in a scaly involucre called the cup or cupule. There are now recognized about three hundred species, of which nearly fifty occur in the United States, the rest in Europe, Asia, and the other parts of North America, a very few barely reaching the northern parts of South America and Africa. Many of the oaks form forest trees of grand proportions and live many centuries. The wood is usually hard and tough, and provided with conspicuous medullary rays, forming the silver grain. 2. The strong wood or timber of the oak. Note: Among the true oaks in America are: Barren oak, or Black-jack, Q. nigra. -- Basket oak, Q. Michauxii. -- Black oak, Q. tinctoria: -- called also yellow or quercitron oak. -- Bur oak (see under Bur.), Q. macrocarpa; -- called also over-cup or mossy-cup oak. -- Chestnut oak, Q. Prinus and Q. densiflora. -- Chinquapin oak (see under Chinquapin), Q. prinoides. -- Coast live oak, Q. agrifolia, of California; -- also called enceno. -- Live oak (see under Live), Q. virens, the best of all for shipbuilding; also, Q. Chrysolepis, of California. -- Pin oak. Same as Swamp oak. -- Post oak, Q. obtusifolia. -- Red oak, Q. rubra. -- Scarlet oak, Q. coccinea. -- Scrub oak, Q. ilicifolia, Q. undulata, etc. -- Shingle oak, Q. imbricaria. -- Spanish oak, Q. falcata. -- Swamp Spanish oak, or Pin oak, Q. palustris. -- Swamp white oak, Q. bicolor. -- Water oak, Q. aguatica. -- Water white oak, Q. lyrata. -- Willow oak, Q. Phellos. Among the true oaks in Europe are: Bitter oak, or Turkey oak, Q. Cerris (see Cerris). -- Cork oak, Q. Suber. -- English white oak, Q. Robur. -- Evergreen oak, Holly oak, or Holm oak, Q. Ilex. -- Kermes oak, Q. coccifera. -- Nutgall oak, Q. infectoria. Note: Among plants called oak, but not of the genus Quercus, are: African oak, a valuable timber tree (Oldfieldia Africana). -- Australian, or She, oak, any tree of the genus Casuarina (see Casuarina). -- Indian oak, the teak tree (see Teak). -- Jerusalem oak. See under Jerusalem. -- New Zealand oak, a sapindaceous tree (Alectryon excelsum). -- Poison oak, the poison ivy. See under Poison. -- Silky, or Silk-bark, oak, an Australian tree (Grevillea robusta). Green oak, oak wood colored green by the growth of the mycelium of certain fungi. -- Oak apple, a large, smooth, round gall produced on the leaves of the American red oak by a gallfly (Cynips confluens). It is green and pulpy when young. -- Oak beauty (Zoöl.), a British geometrid moth (Biston prodromaria) whose larva feeds on the oak. -- Oak gall, a gall found on the oak. See 2d Gall. -- Oak leather (Bot.), the mycelium of a fungus which forms leatherlike patches in the fissures of oak wood. -- Oak pruner. (Zoöl.) See Pruner, the insect. -- Oak spangle, a kind of gall produced on the oak by the insect Diplolepis lenticularis. -- Oak wart, a wartlike gall on the twigs of an oak. -- The Oaks, one of the three great annual English horse races (the Derby and St. Leger being the others). It was instituted in 1779 by the Earl of Derby, and so called from his estate. -- To sport one's oak, to be \"not at home to visitors,\" signified by closing the outer (oaken) door of one's rooms. [Cant, Eng. Univ.]"}