{"word":"objective","definition":"1. Of or pertaining to an object. 2. (Metaph.)  Of or pertaining to an object; contained in, or having the nature or position of, an object; outward; external; extrinsic; -- an epithet applied to whatever ir exterior to the mind, or which is simply an object of thought or feeling, and opposed to subjective. In the Middle Ages, subject meant substance, and has this sense in Descartes and Spinoza: sometimes, also, in Reid. Subjective is used by William of Occam to denote that which exists independent of mind; objective, what is formed by the mind. This shows what is meant by realitas objectiva in Descartes. Kant and Fichte have inverted the meanings. Subject, with them, is the mind which knows; object, that which is known; subjective, the varying conditions of the knowing mind; objective, that which is in the constant nature of the thing known. Trendelenburg. Objective means that which belongs to, or proceeds from, the object known, and not from the subject knowing, and thus denotes what is real, in opposition to that which is ideal -- what exists in nature, in contrast to what exists merely in the thought of the individual. Sir. W. Hamilton. Objective has come to mean that which has independent exostence or authority, apart from our experience or thought. Thus, moral law is said to have objective authority, that is, authority belonging to itself, and not drawn from anything in our nature. Calderwood (Fleming's Vocabulary). 3. (Gram.)  Pertaining to, or designating, the case which follows a transitive verb or a preposition, being that case in which the direct object of the verb is placed. See Accusative, n. Note: The objective case is frequently used without a governing word, esp. in designations of time or space, where a preposition, as at, in, on, etc., may be supplied. My troublous dream [on] this night make me sad. Shak. To write of victories [in or for] next year. Hudibras. Objective line (Perspective), a line drawn on the geometrical plane which is represented or sought to be represented. -- Objective plane (Perspective), any plane in the horizontal plane that is represented. -- Objective point, the point or result to which the operations of an army are directed. By extension, the point or purpose to which anything, as a journey or an argument, is directed. Syn. -- Objective, Subjective. Objective is applied to things exterior to the mind, and objects of its attention; subjective, to the operations of the mind itself. Hence, an objective motive is some outward thing awakening desire; a subjective motive is some internal feeling or propensity. Objective views are those governed by outward things; subjective views are produced or modified by internal feeling. Sir Walter Scott's poetry is chiefly objective; that of Wordsworth is eminently subjective. In the philosophy of mind, subjective denotes what is to be referred to the thinking subject, the ego; objective what belongs to the object of thought, the non-ego. Sir. W. Hamilton\n\n1. (Gram.)  The objective case. 2. An object glass. See under Object, n. 3. Same as Objective point, under Objective, a."}