{"word":"oblique","definition":"1. Not erect or perpendicular; neither parallel to, nor at right angles from, the base; slanting; inclined. It has a direction oblique to that of the former motion. Cheyne. 2. Not straightforward; indirect; obscure; hence, disingenuous; underhand; perverse; sinister. The love we bear our friends... Hath in it certain oblique ends. Drayton. This mode of oblique research, when a more direct one is denied, we find to be the only one in our power. De Quincey. Then would be closed the restless, oblique eye. That looks for evil, like a treacherous spy. Wordworth. 3. Not direct in descent; not following the line of father and son; collateral. His natural affection in a direct line was strong, in an oblique but weak. Baker. Oblique angle, Oblique ascension, etc. See under Angle,Ascension, etc. -- Oblique arch (Arch.), an arch whose jambs are not at right angles with the face, and whose intrados is in consequence askew. -- Oblique bridge, a skew bridge. See under Bridge, n. -- Oblique case (Gram.), any case except the nominative. See Case, n. -- Oblique circle (Projection), a circle whose plane is oblique to the axis of the primitive plane. -- Oblique fire (Mil.), a fire the direction of which is not perpendicular to the line fired at. -- Oblique flank (Fort.), that part of the curtain whence the fire of the opposite bastion may be discovered. Wilhelm. -- Oblique leaf. (Bot.) (a) A leaf twisted or inclined from the normal position. (b) A leaf having one half different from the other. -- Oblique line (Geom.), a line that, meeting or tending to meet another, makes oblique angles with it. -- Oblique motion (Mus.), a kind of motion or progression in which one part ascends or descends, while the other prolongs or repeats the same tone, as in the accompanying example. -- Oblique muscle (Anat.), a muscle acting in a direction oblique to the mesial plane of the body, or to the associated muscles; -- applied especially to two muscles of the eyeball. -- Oblique narration. See Oblique speech. -- Oblique planes (Dialing), planes which decline from the zenith, or incline toward the horizon. -- Oblique sailing (Naut.), the movement of a ship when she sails upon some rhumb between the four cardinal points, making an oblique angle with the meridian. -- Oblique speech (Rhet.), speech which is quoted indirectly, or in a different person from that employed by the original speaker. -- Oblique sphere (Astron. & Geog.), the celestial or terrestrial sphere when its axis is oblique to the horizon of the place; or as it appears to an observer at any point on the earth except the poles and the equator. -- Oblique step (Mil.), a step in marching, by which the soldier, while advancing, gradually takes ground to the right or left at an angle of about 25º. It is not now practiced. Wilhelm. -- Oblique system of coördinates (Anal. Geom.), a system in which the coördinate axes are oblique to each other.\n\nAn oblique line.\n\n1. To deviate from a perpendicular line; to move in an oblique direction. Projecting his person towards it in a line which obliqued from the bottom of his spine. Sir. W. Scott. 2. (Mil.)  To march in a direction oblique to the line of the column or platoon; -- formerly accomplished by oblique steps, now by direct steps, the men half-facing either to the right or left."}