{"word":"oil","definition":"Any one of a great variety of unctuous combustible substances, not miscible with water; as, olive oil, whale oil, rock oil, etc. They are of animal, vegetable, or mineral origin and of varied composition, and they are variously used for food, for solvents, for anointing, lubrication, illumination, etc. By extension, any substance of an oily consistency; as, oil of vitriol. Note: The mineral oils are varieties of petroleum. See Petroleum. The vegetable oils are of two classes, essential oils (see under Essential), and natural oils which in general resemble the animal oils and fats. Most of the natural oils and the animal oils and fats consist of ethereal salts of glycerin, with a large number of organic acids, principally stearic, oleic, and palmitic, forming respectively stearin, olein, and palmitin. Stearin and palmitin prevail in the solid oils and fats, and olein in the liquid oils. Mutton tallow, beef tallow, and lard are rich in stearin, human fat and palm oil in palmitin, and sperm and cod-liver oils in olein. In making soaps, the acids leave the glycerin and unite with the soda or potash. Animal oil, Bone oil, Dipple's oil, etc. (Old Chem.), a complex oil obtained by the distillation of animal substances, as bones. See Bone oil, under Bone. -- Drying oils, Essential oils. (Chem.) See under Drying, and Essential. -- Ethereal oil of wine, Heavy oil of wine. (Chem.) See under Ethereal. -- Fixed oil. (Chem.) See under Fixed. -- Oil bag (Zoöl.), a bag, cyst, or gland in animals, containing oil. -- Oil beetle (Zoöl.), any beetle of the genus Meloe and allied genera. When disturbed they emit from the joints of the legs a yellowish oily liquor. Some species possess vesicating properties, and are used instead of cantharides. -- Oil box, or Oil cellar (Mach.), a fixed box or reservoir, for lubricating a bearing; esp., the box for oil beneath the journal of a railway-car axle. -- Oil cake. See under Cake. -- Oil cock, a stopcock connected with an oil cup. See Oil cup. -- Oil color. (a) A paint made by grinding a coloring substance in oil. (b) Such paints, taken in a general sense. -- Oil cup, a cup, or small receptacle, connected with a bearing as a lubricator, and usually provided with a wick, wire, or adjustable valve for regulating the delivery of oil. -- Oil engine, a gas engine worked with the explosive vapor of petroleum. -- Oil gas, inflammable gas procured from oil, and used for lighting streets, houses, etc. -- Oil gland. (a) (Zoöl.) A gland which secretes oil; especially in birds, the large gland at the base of the tail. (b) (Bot.) A gland, in some plants, producing oil. -- Oil green, a pale yellowish green, like oil. -- Oil of brick, empyreumatic oil obtained by subjecting a brick soaked in oil to distillation at a high temperature, -- used by lapidaries as a vehicle for the emery by which stones and gems are sawn or cut. Brande & C. -- Oil of talc, a nostrum made of calcined talc, and famous in the 17th century as a cosmetic. [Obs.] B. Jonson. -- Oil of vitriol (Chem.), strong sulphuric acid; -- so called from its oily consistency and from its forming the vitriols or sulphates. -- Oil of wine, . -- Oil painting. (a) The art of painting in oil colors. (b) Any kind of painting of which the pigments are originally ground in oil. -- Oil palm (Bot.), a palm tree whose fruit furnishes oil, esp. Elæis Guineensis. See Elæis. -- Oil sardine (Zoöl.), an East Indian herring (Clupea scombrina), valued for its oil. -- Oil shark (Zoöl.) (a) The liver shark. (b) The tope. -- Oil still, a still for hydrocarbons, esp. for petroleum. -- Oil test, a test for determining the temperature at which petroleum oils give off vapor which is liable to explode. -- Oil tree. (Bot.) (a) A plant of the genus Ricinus (R. communis), from the seeds of which castor oil is obtained. (b) An Indian tree, the mahwa. See Mahwa. (c) The oil palm. -- To burn the midnight oil, to study or work late at night. -- Volatle oils. See Essential oils, under Essential.\n\nTo smear or rub over with oil; to lubricate with oil; to anoint with oil."}