{"word":"on","definition":"The general signification of on is situation, motion, or condition with respect to contact or support beneath; as: -- 1. At, or in contact with, the surface or upper part of a thing, and supported by it; placed or lying in contact with the surface; as, the book lies on the table, which stands on the floor of a house on an island. I stood on the bridge at midnight. Longfellow. 2. To or against the surface of; -- used to indicate the motion of a thing as coming or falling to the surface of another; as, rain falls on the earth. Whosoever shall fall on this stone shall be broken. Matt. xxi. 44. 3. Denoting performance or action by contact with the surface, upper part, or outside of anything; hence, by means of; with; as, to play on a violin or piano. Hence, figuratively, to work on one's feelings; to make an impression on the mind. 4. At or near; adjacent to; -- indicating situation, place, or position; as, on the one hand, on the other hand; the fleet is on the American coast. 5. In addition to; besides; -- indicating multiplication or succession in a series; as, heaps on heaps; mischief on mischief; loss on loss; thought on thought. Shak. 6. Indicating dependence or reliance; with confidence in; as, to depend on a person for assistance; to rely on; hence, indicating the ground or support of anything; as, he will promise on certain conditions; to bet on a horse. 7. At or in the time of; during; as, on Sunday we abstain from labor. See At (synonym). 8. At the time of, conveying some notion of cause or motive; as, on public occasions, the officers appear in full dress or uniform. Hence, in consequence of, or following; as, on the ratification of the treaty, the armies were disbanded. 9. Toward; for; -- indicating the object of some passion; as, have pity or compassion on him. 10. At the peril of, or for the safety of. \"Hence, on thy life.\" Dryden. 11. By virtue of; with the pledge of; -- denoting a pledge or engagement, and put before the thing pledged; as, he affirmed or promised on his word, or on his honor. 12. To the account of; -- denoting imprecation or invocation, or coming to, falling, or resting upon; as, on us be all the blame; a curse on him. His blood be on us and on our children. Matt. xxvii. 25. 13. In reference or relation to; as, on our part expect punctuality; a satire on society. 14. Of. [Obs.] \"Be not jealous on me.\" Shak. Or have we eaten on the insane root That takes the reason prisoner Shak. Note: Instances of this usage are common in our older writers, and are sometimes now heard in illiterate speech. 15. Occupied with; in the performance of; as, only three officers are on duty; on a journey. 16. In the service of; connected with; of the number of; as, he is on a newspaper; on a committee. Note: On and upon are in general interchangeable. In some applications upon is more euphonious, and is therefore to be preferred; but in most cases on is preferable. On a bowline. (Naut.) Same as Closehauled. -- On a wind, or On the wind (Naut.), sailing closehauled. -- On a sudden. See under Sudden. -- On board, On draught, On fire, etc. See under Board, Draught, Fire, etc. -- On it, On't, of it. [Obs. or Colloq.] Shak. -- On shore, on land; to the shore. -- On the road, On the way, On the wing, etc. See under Road, Way, etc. -- On to, upon; on; to; -- sometimes written as one word, onto, and usually called a colloquialism; but it may be regarded in analogy with into. They have added the -en plural form on to an elder plural. Earle. We see the strength of the new movement in the new class of ecclesiastics whom it forced on to the stage. J. R. Green.\n\n1. Forward, in progression; onward; -- usually with a verb of motion; as, move on; go on. \"Time glides on.\" Macaulay. The path is smooth that leadeth on to danger. Shak. 2. Forward, in succession; as, from father to son, from the son to the grandson, and so on. 3. In continuance; without interruption or ceasing; as, sleep on, take your ease; say on; sing on. 4. Adhering; not off; as in the phrase, \"He is neither on nor off,\" that is, he is not steady, he is irresolute. 5. Attached to the body, as clothing or ornament, or for use. \"I have boots on.\" B. Gonson. He put on righteousness as a breastplate. Is. lix. 17. 6. In progress; proceeding; as, a game is on. Note: On is sometimes used as an exclamation, or a command to move or proceed, some verb being understood; as, on, comrades; that is, go on, move on. On and on, continuously; for a long time together. \"Toiling on and on and on.\" Longfellow."}