{"word":"ordinary","definition":"1. According to established order; methodical; settled; regular. \"The ordinary forms of law.\" Addison. 2. Common; customary; usual. Shak. Method is not less reguisite in ordinary conversation that in writing. Addison. 3. Of common rank, quality, or ability; not distinguished by superior excellence or beauty; hence, not distinguished in any way; commonplace; inferior; of little merit; as, men of ordinary judgment; an ordinary book. An ordinary lad would have acquired little or no useful knowledge in such a way. Macaulay. Ordinary seaman (Naut.), one not expert or fully skilled, and hence ranking below an able seaman. Syn. -- Normal; common; usual; customary. See Normal. -- Ordinary, Common. A thing is common in which many persons share or partake; as, a common practice. A thing is ordinary when it is apt to come round in the regular common order or succession of events.\n\n1. (Law) (a) (Roman Law) An officer who has original jurisdiction in his own right, and not by deputation. (b) (Eng. Law)  One who has immediate jurisdiction in matters ecclesiastical; an ecclesiastical judge; also, a deputy of the bishop, or a clergyman appointed to perform divine service for condemned criminals and assist in preparing them for death. (c) (Am. Law) A judicial officer, having generally the powers of a judge of probate or a surrogate. 2. The mass; the common run. [Obs.] I see no more in you than in the ordinary Of nature's salework. Shak. 3. That which is so common, or continued, as to be considered a settled establishment or institution. [R.] Spain had no other wars save those which were grown into an ordinary. Bacon. 4. Anything which is in ordinary or common use. Water buckets, wagons, cart wheels, plow socks, and other ordinaries. Sir W. Scott. 5. A dining room or eating house where a meal is prepared for all comers, at a fixed price for the meal, in distinction from one where each dish is separately charged; a table d'hôte; hence, also, the meal furnished at such a dining room. Shak. All the odd words they have picked up in a coffeehouse, or a gaming ordinary, are produced as flowers of style. Swift. He exacted a tribute for licenses to hawkers and peddlers and to ordinaries. Bancroft. 6. (Her.)  A charge or bearing of simple form, one of nine or ten which are in constant use. The bend, chevron, chief, cross, fesse, pale, and saltire are uniformly admitted as ordinaries. Some authorities include bar, bend sinister, pile, and others. See Subordinary. In ordinary. (a) In actual and constant service; statedly attending and serving; as, a physician or chaplain in ordinary. An ambassador in ordinary is one constantly resident at a foreign court. (b) (Naut.) Out of commission and laid up; -- said of a naval vessel. -- Ordinary of the Mass (R. C. Ch.), the part of the Mass which is the same every day; -- called also the canon of the Mass."}