{"word":"organic","definition":"1. (Biol.)  Of or pertaining to an organ or its functions, or to objects composed of organs; consisting of organs, or containing them; as, the organic structure of animals and plants; exhibiting characters peculiar to living organisms; as, organic bodies, organic life, organic remains. Cf. Inorganic. 2. Produced by the organs; as, organic pleasure. [R.] 3. Instrumental; acting as instruments of nature or of art to a certain destined function or end. [R.] Those organic arts which enable men to discourse and write perspicuously. Milton. 4. Forming a whole composed of organs. Hence: Of or pertaining to a system of organs; inherent in, or resulting from, a certain organization; as, an organic government; his love of truth was not inculcated, but organic. 5. Pertaining to, or denoting, any one of the large series of substances which, in nature or origin, are connected with vital processes, and include many substances of artificial production which may or may not occur in animals or plants; -- contrasted with Ant: inorganic. Note: The principles of organic and inorganic chemistry are identical; but the enormous number and the completeness of related series of organic compounds, together with their remarkable facility of exchange and substitution, offer an illustration of chemical reaction and homology not to be paralleled in inorganic chemistry. Organic analysis (Chem.), the analysis of organic compounds, concerned chiefly with the determination of carbon as carbon dioxide, hydrogen as water, oxygen as the difference between the sum of the others and 100 per cent, and nitrogen as free nitrogen, ammonia, or nitric oxide; -- formerly called ultimate analysis, in distinction from proximate analysis. -- Organic chemistry. See under Chemistry. -- Organic compounds. (Chem.) See Carbon compounds, under Carbon. -- Organic description of a curve (Geom.), the description of a curve on a plane by means of instruments. Brande & C. -- Organic disease (Med.), a disease attended with morbid changes in the structure of the organs of the body or in the composition of its fluids; -- opposed to functional disease. -- Organic electricity. See under Electricity. -- Organic law or laws, a law or system of laws, or declaration of principles fundamental to the existence and organization of a political or other association; a constitution. -- Organic stricture (Med.), a contraction of one of the natural passages of the body produced by structural changes in its walls, as distinguished from a spasmodic stricture, which is due to muscular contraction."}