{"word":"organ","definition":"1. An instrument or medium by which some important action is performed, or an important end accomplished; as, legislatures, courts, armies, taxgatherers, etc., are organs of government. 2. (Biol.)  A natural part or structure in an animal or a plant, capable of performing some special action (termed its function), which is essential to the life or well-being of the whole; as, the heart, lungs, etc., are organs of animals; the root, stem, foliage, etc., are organs of plants. Note: In animals the organs are generally made up of several tissues, one of which usually predominates, and determines the principal function of the organ. Groups of organs constitute a system. See System. 3. A component part performing an essential office in the working of any complex machine; as, the cylinder, valves, crank, etc., are organs of the steam engine. 4. A medium of communication between one person or body and another; as, the secretary of state is the organ of communication between the government and a foreign power; a newspaper is the organ of its editor, or of a party, sect, etc. 5. Etym: [Cf. AS. organ, fr. L. organum.] (Mus.)  A wind instrument containing numerous pipes of various dimensions and kinds, which are filled with wind from a bellows, and played upon by means of keys similar to those of a piano, and sometimes by foot keys or pedals; -- formerly used in the plural, each pipe being considired an organ. The deep, majestic, solemn organs blow. Pope. Note: Chaucer used the form orgon as a plural. The merry orgon . . . that in the church goon [go]. Barrel organ, Choir organ, Great organ, etc. See under Barrel, Choir, etc. -- Cabinet organ (Mus.), an organ of small size, as for a chapel or for domestic use; a reed organ. -- Organ bird (Zoöl.), a Tasmanian crow shrike (Gymnorhina organicum). It utters discordant notes like those of a hand organ out of tune. -- Organ fish (Zoöl.), the drumfish. -- Organ gun. (Mil.) Same as Orgue (b). -- Organ harmonium (Mus.), an harmonium of large capacity and power. -- Organ of Gorti (Anat.), a complicated structure in the cochlea of the ear, including the auditory hair cells, the rods or fibers of Corti, the membrane of Corti, etc. See Note under Ear. -- Organ pipe. See Pipe, n., 1. -- Organ-pipe coral. (Zoöl.) See Tubipora. -- Organ point (Mus.), a passage in which the tonic or dominant is sustained continuously by one part, while the other parts move.\n\nTo supply with an organ or organs; to fit with organs; to organize. [Obs.] Thou art elemented and organed for other apprehensions. Bp. Mannyngham."}