{"word":"other","definition":"Either; -- used with other or or for its correlative (as either . . . or are now used). [Obs.] Other of chalk, other of glass. Chaucer.\n\n1. Different from that which, or the one who, has been specified; not the same; not identical; additional; second of two. Each of them made other for to win. Chaucer. Whosoever shall smite thee on thy right cheek, turn to him the other also. Matt. v. 39. 2. Not this, but the contrary; opposite; as, the other side of a river. 3. Alternate; second; -- used esp. in connection with every; as, every other day, that is, each alternate day, every second day. 4. Left, as opposed to right. [Obs.] A distaff in her other hand she had. Spenser. Note: Other is a correlative adjective, or adjective pronoun, often in contrast with one, some, that, this, etc. The one shall be taken, and the other left. Matt. xxiv. 4 And some fell among thorns . . . but other fell into good ground. Matt. xiii. 7, 8. It is also used, by ellipsis, with a noun, expressed or understood. To write this, or to design the other. Dryden. It is written with the indefinite article as one word, another; is used with each, indicating a reciprocal action or relation; and is employed absolutely, or eliptically for other thing, or other person, in which case it may have a plural. The fool and the brutish person perish, and leave their wealth to others. Ps. xlix. 10. If he is trimming, others are true. Thackeray. Other is sometimes followed by but, beside, or besides; but oftener by than. No other but such a one as he. Coleridge. Other lords beside thee have had dominion over us. Is. xxvi. 13. For other foundation can no man lay than that is laid. 1 Cor. iii. 11. The whole seven years of . . . ignominy had been little other than a preparation for this very hour. Hawthorne. Other some, some others. [Obs. or Prov. Eng.] -- The other day, at a certain time past, not distant, but indefinite; not long ago; recently; rarely, the third day past. Bind my hair up: as't was yesterday No, nor t' other day. B. Jonson.\n\nOtherwise. \"It shall none other be.\" Chaucer. \"If you think other.\" Shak."}