{"word":"over","definition":"1. Above, or higher than, in place or position, with the idea of covering; -- opposed to Ant: under; as, clouds are over our heads; the smoke rises over the city. The mercy seat that is over the testimony. Ex. xxx. 6. Over them gleamed far off the crimson banners of morning. Longfellow. 2. Across; from side to side of; -- implying a passing or moving, either above the substance or thing, or on the surface of it; as, a dog leaps over a stream or a table. Certain lakes . . . poison birds which fly over them. Bacon. 3. Upon the surface of, or the whole surface of; hither and thither upon; throughout the whole extent of; as, to wander over the earth; to walk over a field, or over a city. 4. Above; -- implying superiority in excellence, dignity, condition, or value; as, the advantages which the Christian world has over the heathen. Swift. 5. Above in authority or station; -- implying government, direction, care, attention, guard, responsibility, etc.; -- opposed to Ant: under. Thou shalt be over my house. Gen. xli. 40. I will make thee rules over many things. Matt. xxv. 23. Dost thou not watch over my sin Job xiv. 16. His tender mercies are over all his works. Ps. cxlv. 9. 6. Across or during the time of; from beginning to end of; as, to keep anything over night; to keep corn over winter. 7. Above the perpendicular height or length of, with an idea of measurement; as, the water, or the depth of water, was over his head, over his shoes. 8. Beyond; in excess of; in addition to; more than; as, it cost over five dollars. \"Over all this.\" Chaucer. 9. Above, implying superiority after a contest; in spite of; notwithstanding; as, he triumphed over difficulties; the bill was passed over the veto. Note: Over, in poetry, is often contracted into o'er. Note: Over his signature (or name) is a substitute for the idiomatic English form, under his signature (name, hand and seal, etc.), the reference in the latter form being to the authority under which the writing is made, executed, or published, and not the place of the autograph, etc. Over all (Her.), placed over or upon other bearings, and therefore hinding them in part; -- said of a charge. -- Over head and ears, beyond one's depth; completely; wholly; hopelessly; as, over head and ears in debt. [Colloq.] -- Over the left. See under Left. -- To run over (Mach.), to have rotation in such direction that the crank pin traverses the upper, or front, half of its path in the forward, or outward, stroke; -- said of a crank which drives, or is driven by, a reciprocating piece.\n\n1. From one side to another; from side to side; across; crosswise; as, a board, or a tree, a foot over, i. e., a foot in diameter. 2. From one person or place to another regarded as on the opposite side of a space or barrier; -- used with verbs of motion; as, to sail over to England; to hand over the money; to go over to the enemy. \"We will pass over to Gibeah.\" Judges xix. 12. Also, with verbs of being: At, or on, the opposite side; as, the boat is over. 3. From beginning to end; throughout the course, extent, or expanse of anything; as, to look over accounts, or a stock of goods; a dress covered over with jewels. 4. From inside to outside, above or across the brim. Good measure, pressed down . . . and running over. Luke vi. 38. 5. Beyond a limit; hence, in excessive degree or quantity; superfluously; with repetition; as, to do the whole work over. \"So over violent.\" Dryden. He that gathered much had nothing over. Ex. xvi. 18. 6. In a manner to bring the under side to or towards the top; as, to turn (one's self) over; to roll a stone over; to turn over the leaves; to tip over a cart. 7. At an end; beyond the limit of continuance; completed; finished. \"Their distress was over.\" Macaulay. \"The feast was over.\" Sir W. Scott. Note: Over, out, off, and similar adverbs, are often used in the predicate with the sense and force of adjectives, agreeing in this respect with the adverbs of place, here, there, everywhere, nowhere; as, the games were over; the play is over; the master was out; his hat is off. Note: Over is much used in composition, with the same significations that it has as a separate word; as in overcast, overflow, to cast or flow so as to spread over or cover; overhang, to hang above; overturn, to turn so as to bring the underside towards the top; overact, overreach, to act or reach beyond, implying excess or superiority. All over. (a) Over the whole; upon all parts; completely; as, he is spatterd with mud all over. (b) Wholly over; at an end; as, it is all over with him. -- Over again, once more; with repetition; afresh; anew. Dryden. -- Over against, opposite; in front. Addison. -- Over and above, in a manner, or degree, beyond what is supposed, defined, or usual; besides; in addition; as, not over and above well. \"He . . . gained, over and above, the good will of all people.\" L' Estrange. -- Over and over, repeatedly; again and again. -- To boil over. See under Boil, v. i. -- To come it over, To do over, To give over, etc. See under Come, Do, Give, etc. -- To throw over, to abandon; to betray. Cf. To throw overboard, under Overboard.\n\nUpper; covering; higher; superior; also, excessive; too much or too great; -- chiefly used in composition; as, overshoes, overcoat, over-garment, overlord, overwork, overhaste.\n\nA certain number of balls (usually four) delivered successively from behind ine wicket, after which the ball is bowled from behing the other wicket as many times, the fielders changing places."}