{"word":"palm","definition":"1. (Anat.)  The inner and somewhat concave part of the hand between the bases of the fingers and the wrist. Clench'd her fingers till they bit the palm. Tennyson. 2. A lineal measure equal either to the breadth of the hand or to its length from the wrist to the ends of the fingers; a hand; -- used in measuring a horse's height. Note: In Greece, the palm was reckoned at three inches. The Romans adopted two measures of this name, the lesser palm of 2.91 inches, and the greater palm of 8.73 inches. At the present day, this measure varies in the most arbitrary manner, being different in each country, and occasionally varying in the same. Internat. Cyc. 3. (Sailmaking)  A metallic disk, attached to a strap, and worn the palm of the hand, -- used to push the needle through the canvas, in sewing sails, etc. 4. (Zoöl.)  The broad flattened part of an antler, as of a full-grown fallow deer; -- so called as resembling the palm of the hand with its protruding fingers. 5. (Naut.)  The flat inner face of an anchor fluke.\n\n1. (Bot.)  Any endogenous tree of the order Palmæ or Palmaceæ; a palm tree. Note: Palms are perennial woody plants, often of majestic size. The trunk is usually erect and rarely branched, and has a roughened exterior composed of the persistent bases of the leaf stalks. The leaves are borne in a terminal crown, and are supported on stout, sheathing, often prickly, petioles. They are usually of great size, and are either pinnately or palmately many-cleft. There are about one thousand species known, nearly all of them growing in tropical or semitropical regions. The wood, petioles, leaves, sap, and fruit of many species are invaluable in the arts and in domestic economy. Among the best known are the date palm, the cocoa palm, the fan palm, the oil palm, the wax palm, the palmyra, and the various kinds called cabbage palm and palmetto. 2. A branch or leaf of the palm, anciently borne or worn as a symbol of victory or rejoicing. A great multitude . . . stood before the throne, and before the Lamb, clothed with white robes, and palme in their hands. Rev. vii. 9. 3. Hence: Any symbol or token of superiority, success, or triumph; also, victory; triumph; supremacy. \"The palm of martyrdom.\" Chaucer. So get the start of the majestic world And bear the palm alone. Shak. Molucca palm (Bot.), a labiate herb from Asia (Molucella lævis), having a curious cup-shaped calyx. -- Palm cabbage, the terminal bud of a cabbage palm, used as food. -- Palm cat (Zoöl.), the common paradoxure. -- Palm crab (Zoöl.), the purse crab. -- Palm oil, a vegetable oil, obtained from the fruit of several species of palms, as the African oil palm (Elæis Guineensis), and used in the manufacture of soap and candles. See Elæis. -- Palm swift (Zoöl.), a small swift (Cypselus Btassiensis) which frequents the palmyra and cocoanut palms in India. Its peculiar nest is attached to the leaf of the palmyra palm. -- Palm toddy. Same as Palm wine. -- Palm weevil (Zoöl.), any one of mumerous species of very large weevils of the genus Rhynchophorus. The larvæ bore into palm trees, and are called palm borers, and grugru worms. They are considered excellent food. -- Palm wine, the sap of several species of palms, especially, in India, of the wild date palm (Phoenix sylvestrix), the palmyra, and the Caryota urens. When fermented it yields by distillation arrack, and by evaporation jaggery. Called also palm toddy. -- Palm worm, or Palmworm. (Zoöl.) (a) The larva of a palm weevil. (b) A centipede.\n\n1. To handle. [Obs.] Prior. 2. To manipulate with, or conceal in, the palm of the hand; to juggle. They palmed the trick that lost the game. Prior. 3. To impose by frand, as by sleight of hand; to put by unfair means; -- usually with off. For you may palm upon us new for old. Dryden."}