{"word":"paradise","definition":"1. The garden of Eden, in which Adam and Eve were placed after their creation. 2. The abode of sanctified souls after death. To-day shalt thou be with me in paradise. Luke xxiii. 43. It sounds to him like her mother's voice, Singing in Paradise. Longfellow. 3. A place of bliss; a region of supreme felicity or delight; hence, a state of happiness. The earth Shall be all paradise. Milton. Wrapt in the very paradise of some creative vision. Beaconsfield. 4. (Arch.)  An open space within a monastery or adjoining a church, as the space within a cloister, the open court before a basilica, etc. 5. A churchyard or cemetery. [Obs.] Oxf. Gloss. Fool's paradise. See under Fool, and Limbo. -- Grains of paradise. (Bot.) See Melequeta pepper, under Pepper. -- Paradise bird. (Zoöl.) Same as Bird of paradise. Among the most beautiful species are the superb (Lophorina superba); the magnificent (Diphyllodes magnifica); and the six-shafted paradise bird (Parotia sefilata). The long-billed paradise birds (Epimachinæ) also include some highly ornamental species, as the twelve-wired paradise bird (Seleucides alba), which is black, yellow, and white, with six long breast feathers on each side, ending in long, slender filaments. See Bird of paradise in the Vocabulary. -- Paradise fish (Zoöl.), a beautiful fresh-water Asiatic fish (Macropodus viridiauratus) having very large fins. It is often kept alive as an ornamental fish. -- Paradise flycatcher (Zoöl.), any flycatcher of the genus Terpsiphone, having the middle tail feathers extremely elongated. The adult male of T. paradisi is white, with the head glossy dark green, and crested. -- Paradise grackle (Zoöl.), a very beautiful bird of New Guinea, of the genus Astrapia, having dark velvety plumage with brilliant metallic tints. -- Paradise nut (Bot.), the sapucaia nut. See Sapucaia nut. [Local, U. S.] -- Paradise whidah bird. (Zoöl.) See Whidah.\n\nTo affect or exalt with visions of felicity; to entrance; to bewitch. [R.] Marston."}