{"word":"partridge","definition":"1. Any one of numerous species of small gallinaceous birds of the genus Perdix and several related genera of the family Perdicidæ, of the Old World. The partridge is noted as a game bird. Full many a fat partrich had he in mew. Chaucer. Note: The common European, or gray, partridge (Perdix cinerea) and the red-legged partridge (Caccabis rubra) of Southern Europe and Asia are well-known species. 2. Any one of several species of quail-like birds belonging to Colinus, and allied genera. [U.S.] Note: Among them are the bobwhite (Colinus Virginianus) of the Eastern States; the plumed, or mountain, partridge (Oreortyx pictus) of California; the Massena partridge (Cyrtonyx Montezumæ); and the California partridge (Callipepla Californica). 3. The ruffed grouse (Bonasa umbellus). [New Eng.] Bamboo partridge (Zoöl.), a spurred partridge of the genus Bambusicola. Several species are found in China and the East Indies. -- Night partridge (Zoöl.), the woodcock. [Local, U.S.] -- Painted partridge (Zoöl.), a francolin of South Africa (Francolinus pictus). -- Partridge berry. (Bot.) (a) The scarlet berry of a trailing american plant (Mitchella repens) of the order Rubiaceæ, having roundish evergreen leaves, and white fragrant flowers sometimes tinged with purple, growing in pairs with the ovaries united, and producing the berries which remain over winter; also, the plant itself. (b) The fruit of the creeping wintergreen (Gaultheria procumbens); also, the plant itself. -- Partridge dove (Zoöl.) Same as Mountain witch, under Mountain. -- Partridge pea (Bot.), a yellow-flowered leguminous herb (Cassia Chamæcrista), common in sandy fields in the Eastern United States. -- Partridge shell (Zoöl.), a large marine univalve shell (Dolium perdix), having colors variegated like those of the partridge. -- Partridge wood (a) A variegated wood, much esteemed for cabinetwork. It is obtained from tropical America, and one source of it is said to be the leguminous tree Andira inermis. Called also pheasant wood. (b) A name sometimes given to the dark-colored and striated wood of some kind of palm, which is used for walking sticks and umbrella handles. -- Sea partridge (Zoöl.), an Asiatic sand partridge (Ammoperdix Bonhami); -- so called from its note. -- Snow partridge (Zoöl.), a large spurred partridge (Lerwa nivicola) which inhabits the high mountains of Asia. -- Spruce partridge. See under Spruce. -- Wood partridge, or Hill partridge (Zoöl.), any small Asiatic partridge of the genus Arboricola."}