{"word":"party","definition":"1. A part or portion. [Obs.] \"The most party of the time.\" Chaucer. 2. A number of persons united in opinion or action, as distinguished from, or opposed to, the rest of a community or association; esp., one of the parts into which a people is divided on questions of public policy. Win the noble Brutus to our party. Shak. The peace both parties want is like to last. Dryden. 3. A part of a larger body of company; a detachment; especially (Mil.), a small body of troops dispatched on special service. 4. A number of persons invited to a social entertainment; a select company; as, a dinner party; also, the entertainment itself; as, to give a party. 5. One concerned or interested in an affair; one who takes part with others; a participator; as, he was a party to the plot; a party to the contract. 6. The plaintiff or the defendant in a lawsuit, whether an individual, a firm, or corporation; a litigant. The cause of both parties shall come before the judges. Ex. xxii. 9. 7. Hence, any certain person who is regarded as being opposed or antagonistic to another. It the jury found that the party slain was of English race, it had been adjudged felony. Sir J. Davies. 8. Cause; side; interest. Have you nothing said Upon this Party 'gainst the Duke of Albany Shak. 9. A person; as, he is a queer party. [Now accounted a vulgarism.] Note: \"For several generations, our ancestors largely employed party for person; but this use of the word, when it appeared to be reviving, happened to strike, more particularly, the fancy of the vulgar; and the consequence has been, that the polite have chosen to leave it in their undisputed possession.\" Fitzed. Hall. Party jury (Law), a jury composed of different parties, as one which is half natives and half foreigners. -- Party man, a partisan. Swift. -- Party spirit, a factious and unreasonable temper, not uncommonly shown by party men. Whately. -- Party verdict, a joint verdict. Shak. -- Party wall. (a) (Arch.) A wall built upon the dividing line between two adjoining properties, usually having half its thickness on each property. (b) (Law) A wall that separates adjoining houses, as in a block or row.\n\n1. (Her.)  Parted or divided, as in the direction or form of one of the ordinaries; as, an escutcheon party per pale. 2. Partial; favoring one party. I will be true judge, and not party. Chaucer. Charter party. See under Charter.\n\nPartly. [Obs.] Chaucer."}