{"word":"pass","definition":"1. To go; to move; to proceed; to be moved or transferred from one point to another; to make a transit; -- usually with a following adverb or adverbal phrase defining the kind or manner of motion; as, to pass on, by, out, in, etc.; to pass swiftly, directly, smoothly, etc.; to pass to the rear, under the yoke, over the bridge, across the field, beyond the border, etc. \"But now pass over [i.e., pass on].\" Chaucer. On high behests his angels to and fro Passed frequent. Milton. Sweet sounds rose slowly through their mouths, And from their bodies passed. Coleridge. 2. To move or be transferred from one state or condition to another; to change possession, condition, or circumstances; to undergo transition; as, the business has passed into other hands. Others, dissatisfied with what they have, . . . pass from just to unjust. Sir W. Temple. 3. To move beyond the range of the senses or of knowledge; to pass away; hence, to disappear; to vanish; to depart; specifically, to depart from life; to die. Disturb him not, let him pass paceably. Shak. Beauty is a charm, but soon the charm will pass. Dryden. The passing of the sweetest soul That ever looked with human eyes. Tennyson. 4. To move or to come into being or under notice; to come and go in consciousness; hence, to take place; to occur; to happen; to come; to occur progressively or in succession; to be present transitorly. So death passed upon all men. Rom. v. 12. Our own consciousness of what passes within our own mind. I. Watts. 5. To go by or glide by, as time; to elapse; to be spent; as, their vacation passed pleasantly. Now the time is far passed. Mark vi. 35 6. To go from one person to another; hence, to be given and taken freely; as, clipped coin will not pass; to obtain general acceptance; to be held or regarded; to circulate; to be current; -- followed by for before a word denoting value or estimation. \"Let him pass for a man.\" Shak. False eloquence passeth only where true is not understood. Felton. This will not pass for a fault in him. Atterbury. 7. To advance through all the steps or stages necessary to validity or effectiveness; to be carried through a body that has power to sanction or reject; to receive legislative sanction; to be enacted; as, the resolution passed; the bill passed both houses of Congress. 8. To go through any inspection or test successfully; to be approved or accepted; as, he attempted the examination, but did not expect to pass. 9. To be suffered to go on; to be tolerated; hence, to continue; to live alogn. \"The play may pass.\" Shak. 10. To go unheeded or neglected; to proceed without hindrance or opposition; as, we let this act pass. 11. To go beyond bounds; to surpass; to be in excess. [Obs.] \"This passes, Master Ford.\" Shak. 12. To take heed; to care. [Obs.] As for these silken-coated slaves, I pass not. Shak. 13. To go through the intestines. Arbuthnot. 14. (Law)  To be conveyed or transferred by will, deed, or other instrument of conveyance; as, an estate passes by a certain clause in a deed. Mozley & W. 15. (Fencing)  To make a lunge or pass; to thrust. 16. (Card Playing)  To decline to play in one's turn; in euchre, to decline to make the trump. She would not play, yet must not pass. Prior. To bring to pass, To come to pass. See under Bring, and Come. -- To pass away, to disappear; to die; to vanish. \"The heavens shall pass away.\" 2 Pet. iii. 10. \"I thought to pass away before, but yet alive I am.\" Tennyson. -- To pass by, to go near and beyond a certain person or place; as, he passed by as we stood there. -- To pass into, to change by a gradual transmission; to blend or unite with. -- To pass on, to proceed. -- To pass on or upon. (a) To happen to; to come upon; to affect. \"So death passed upon all men.\" Rom. v. 12. \"Provided no indirect act pass upon our prayers to define them.\" Jer. Taylor. (b) To determine concerning; to give judgment or sentence upon. \"We may not pass upon his life.\" Shak. -- To pass off, to go away; to cease; to disappear; as, an agitation passes off. -- To pass over, to go from one side or end to the other; to cross, as a river, road, or bridge.\n\n1. In simple, transitive senses; as: (a) To go by, beyond, over, through, or the like; to proceed from one side to the other of; as, to pass a house, a stream, a boundary, etc. (b) Hence:  To go from one limit to the other of; to spend; to live through; to have experience of; to undergo; to suffer. \"To pass commodiously this life.\" Milton. She loved me for the dangers I had passed. Shak. (c) To go by without noticing; to omit attention to; to take no note of; to disregard. Please you that I may pass This doing. Shak. I pass their warlike pomp, their proud array. Dryden. (d) To transcend; to surpass; to excel; to exceed. And strive to pass . . . Their native music by her skillful art. Spenser. Whose tender power Passes the strength of storms in their most desolate hour. Byron. (e) To go successfully through, as an examination, trail, test, etc.; to obtain the formal sanction of, as a legislative body; as, he passed his examination; the bill passed the senate. 2. In causative senses: as: (a) To cause to move or go; to send; to transfer from one person, place, or condition to another; to transmit; to deliver; to hand; to make over; as, the waiter passed bisquit and cheese; the torch was passed from hand to hand. I had only time to pass my eye over the medals. Addison. Waller passed over five thousand horse and foot by Newbridge. Clarendon. (b) To cause to pass the lips; to utter; to pronounce; hence, to promise; to pledge; as, to pass sentence. Shak. Father, thy word is passed. Milton. (c) To cause to advance by stages of progress; to carry on with success through an ordeal, examination, or action; specifically, to give legal or official sanction to; to ratify; to enact; to approve as valid and just; as, he passed the bill through the committee; the senate passed the law. (e) To put in circulation; to give currency to; as, to pass counterfeit money. \"Pass the happy news.\" Tennyson. (f) To cause to obtain entrance, admission, or conveyance; as, to pass a person into a theater, or over a railroad. 3. To emit from the bowels; to evacuate. 4. (Naut.)  To take a turn with (a line, gasket, etc.), as around a sail in furling, and make secure. 5. (Fencing)  To make, as a thrust, punto, etc. Shak. Passed midshipman. See under Midshipman. -- To pass a dividend, to omit the declaration and payment of a dividend at the time when due. -- To pass away, to spend; to waste. \"Lest she pass away the flower of her age.\" Ecclus. xlii. 9. -- To pass by. (a) To disregard; to neglect. (b) To excuse; to spare; to overlook. -- To pass off, to impose fraudulently; to palm off. \"Passed himself off as a bishop.\" Macaulay. -- To pass (something) on or upon (some one), to put upon as a trick or cheat; to palm off. \"She passed the child on her husband for a boy.\" Dryden. -- To pass over, to overlook; not to note or resent; as, to pass over an affront.\n\n1. An opening, road, or track, available for passing; especially, one through or over some dangerous or otherwise impracticable barrier; a passageway; a defile; a ford; as, a mountain pass. \"Try not the pass!\" the old man said. Longfellow. 2. (Fencing)  A thrust or push; an attempt to stab or strike an adversary. Shak. 3. A movement of the hand over or along anything; the manipulation of a mesmerist. 4. (Rolling Metals)  A single passage of a bar, rail, sheet, etc., between the rolls. 5. State of things; condition; predicament. Have his daughters brought him to this pass. Shak. Matters have been brought to this pass. South. 6. Permission or license to pass, or to go and come; a psssport; a ticket permitting free transit or admission; as, a railroad or theater pass; a military pass. A ship sailing under the flag and pass of an enemy. Kent. 7. Fig.: a thrust; a sally of wit. Shak. 8. Estimation; character. [Obs.] Common speech gives him a worthy pass. Shak. 9. Etym: [Cf. Passus.]  A part; a division. [Obs.] Chaucer. Pass boat (Naut.), a punt, or similar boat. -- Pass book. (a) A book in which a trader enters articles bought on credit, and then passes or sends it to the purchaser. (b) See Bank book. -- Pass box (Mil.), a wooden or metallic box, used to carry cartridges from the service magazine to the piece. -- Pass check, a ticket of admission to a place of entertainment, or of readmission for one who goes away in expectation of returning."}