{"word":"passion","definition":"1. A suffering or enduring of imposed or inflicted pain; any suffering or distress (as, a cardiac passion); specifically, the suffering of Christ between the time of the last supper and his death, esp. in the garden upon the cross. \"The passions of this time.\" Wyclif (Rom. viii. 18). To whom also he showed himself alive after his passion, by many infallible proofs. Acts i. 3. 2. The state of being acted upon; subjection to an external agent or influence; a passive condition; -- opposed to action. A body at rest affords us no idea of any active power to move, and, when set is motion, it is rather a passion than an action in it. Locke. 3. Capacity of being affected by external agents; susceptibility of impressions from external agents. [R.] Moldable and not moldable, scissible and not scissible, and many other passions of matter. Bacon. 4. The state of the mind when it is powerfully acted upon and influenced by something external to itself; the state of any particular faculty which, under such conditions, becomes extremely sensitive or uncontrollably excited; any emotion or sentiment (specifically, love or anger) in a state of abnormal or controlling activity; an extreme or inordinate desire; also, the capacity or susceptibility of being so affected; as, to be in a passion; the passions of love, hate, jealously, wrath, ambition, avarice, fear, etc.; a passion for war, or for drink; an orator should have passion as well as rhetorical skill. \"A passion fond even to idolatry.\" Macaulay. \"Her passion is to seek roses.\" Lady M. W. Montagu. We also are men of like passions with you. Acts xiv. 15. The nature of the human mind can not be sufficiently understood, without considering the affections and passions, or those modifications or actions of the mind consequent upon the apprehension of certain objects or events in which the mind generally conceives good or evil. Hutcheson. The term passion, and its adverb passionately, often express a very strong predilection for any pursuit, or object of taste -- a kind of enthusiastic fondness for anything. Cogan. The bravery of his grief did put me Into a towering passion. Shak. The ruling passion, be it what it will, The ruling passion conquers reason still. Pope. Who walked in every path of human life, Felt every passion. Akenside. When statesmen are ruled by faction and interest, they can have no passion for the glory of their country. Addison. 5. Disorder of the mind; madness. [Obs.] Shak. 6. Passion week. See Passion week, below. R. of Gl. Passion flower (Bot.), any flower or plant of the genus Passiflora; -- so named from a fancied resemblance of parts of the flower to the instruments of our Savior's crucifixion. Note: The flowers are showy, and the fruit is sometimes highly esteemed (see Granadilla, and Maypop). The roots and leaves are generally more or less noxious, and are used in medicine. The plants are mostly tendril climbers, and are commonest in the warmer parts of America, though a few species are Asiatic or Australian. Passion music (Mus.), originally, music set to the gospel narrative of the passion of our Lord; after the Reformation, a kind of oratorio, with narrative, chorals, airs, and choruses, having for its theme the passion and crucifixion of Christ. -- Passion play, a mystery play, in which the scenes connected with the passion of our Savior are represented dramatically. -- Passion Sunday (Eccl.), the fifth Sunday in Lent, or the second before Easter. -- Passion Week, the last week but one in Lent, or the second week preceding Easter. \"The name of Passion week is frequently, but improperly, applied to Holy Week.\" Shipley. Syn. -- Passion, Feeling, Emotion. When any feeling or emotion completely masters the mind, we call it a passion; as, a passion for music, dress, etc.; especially is anger (when thus extreme) called passion. The mind, in such cases, is considered as having lost its self- control, and become the passive instrument of the feeling in question.\n\nTo give a passionate character to. [R.] Keats.\n\nTo suffer pain or sorrow; to experience a passion; to be extremely agitated. [Obs.] \"Dumbly she passions, frantically she doteth.\" Shak."}