{"word":"patent","definition":"1. Note: (Oftener pronounced pat\"ent in this sense)  Open; expanded; evident; apparent; unconcealed; manifest; public; conspicuous. He had received instructions, both patent and secret. Motley. 2. Open to public perusal; -- said of a document conferring some right or privilege; as, letters patent. See Letters patent, under 3d Letter. 3. Appropriated or protected by letters patent; secured by official authority to the exclusive possession, control, and disposal of some person or party; patented; as, a patent right; patent medicines. Madder . . . in King Charles the First's time, was made a patent commodity. Mortimer. 4. (Bot.)  Spreading; forming a nearly right angle with the steam or branch; as, a patent leaf. Patent leather, a varnished or lacquered leather, used for boots and shoes, and in carriage and harness work. -- Patent office, a government bureau for the examination of inventions and the granting of patents. -- Patent right. (a) The exclusive right to an invention, and the control of its manufacture. (b) (Law) The right, granted by the sovereign, of exclusive control of some business of manufacture, or of the sale of certain articles, or of certain offices or prerogatives. -- Patent rolls, the registers, or records, of patents.\n\n1. A letter patent, or letters patent; an official document, issued by a sovereign power, conferring a right or privilege on some person or party. Specifically: (a) A writing securing to an invention. (b) A document making a grant and conveyance of public lands. Four other gentlemen of quality remained mentioned in that patent. Fuller. Note: In the United States, by the act of 1870, patents for inventions are issued for seventeen years, without the privilege of renewal except by act of Congress. 2. The right or privilege conferred by such a document; hence, figuratively, a right, privilege, or license of the nature of a patent. If you are so fond over her iniquity, give her patent to offend. Shak.\n\nTo grant by patent; to make the subject of a patent; to secure or protect by patent; as, to patent an invention; to patent public lands."}