{"word":"pay","definition":"To cover, as bottom of a vessel, a seam, a spar, etc., with tar or pitch, or waterproof composition of tallow, resin, etc.; to smear.\n\n1. To satisfy, or content; specifically, to satisfy (another person) for service rendered, property delivered, etc.; to discharge one's obligation to; to make due return to; to compensate; to remunerate; to recompense; to requite; as, to pay workmen or servants. May no penny ale them pay [i. e., satisfy]. P. Plowman. [She] pays me with disdain. Dryden. 2. Hence, figuratively: To compensate justly; to requite according to merit; to reward; to punish; to retort or retaliate upon. For which, or pay me quickly, or I'll pay you. B. Jonson. 3. To discharge, as a debt, demand, or obligation, by giving or doing what is due or required; to deliver the amount or value of to the person to whom it is owing; to discharge a debt by delivering (money owed). \"Pay me that thou owest.\" Matt. xviii. 28. Have patience with me, and I will pay thee all. Matt. xviii. 26. If they pay this tax, they starve. Tennyson. 4. To discharge or fulfill, as a duy; to perform or render duty, as that which has been promised. This day have I paid my vows. Prov. vii. 14. 5. To give or offer, without an implied obligation; as, to pay attention; to pay a visit. Not paying me a welcome. Shak. To pay off. (a) To make compensation to and discharge; as, to pay off the crew of a ship. (b) To allow (a thread, cord, etc.) to run off; to unwind. -- To pay one's duty, to render homage, as to a sovereign or other superior. -- To pay out (Naut.), to pass out; hence, to slacken; to allow to run out; as, to pay out more cable. See under Cable. -- To pay the piper, to bear the cost, expense, or trouble. [Colloq.]\n\nTo give a recompense; to make payment, requital, or satisfaction; to discharge a debt. The wicked borroweth, and payeth not again. Ps. xxxvii. 21. 2. Hence, to make or secure suitable return for expense or trouble; to be remunerative or profitable; to be worth the effort or pains required; as, it will pay to ride; it will pay to wait; politeness always pays. To pay for. (a) To make amends for; to atone for; as, men often pay for their mistakes with loss of property or reputation, sometimes with life. (b) To give an equivalent for; to bear the expense of; to be mulcted on account of. 'T was I paid for your sleeps; I watched your wakings. Beau. & Fl. -- To pay off. Etym: [Etymol. uncertain.] (Naut.) To fall to leeward, as the head of a vessel under sail. -- To pay on. Etym: [Etymol. uncertain.] To beat with vigor; to redouble blows. [Colloq.] -- To pay round Etym: [Etymol. uncertain.] (Naut.) To turn the ship's head.\n\n1. Satisfaction; content. Chaucer. 2. An equivalent or return for money due, goods purchased, or services performed; salary or wages for work or service; compensation; recompense; payment; hire; as, the pay of a clerk; the pay of a soldier. Where only merit constant pay receives. Pope. There is neither pay nor plunder to be got. L'Estrange. Full pay, the whole amount of wages or salary; maximum pay; especially, the highest pay or allowance to civil or military officers of a certain rank, without deductions. -- Half pay. See under Half. -- Pay day, the day of settlement of accounts. -- Pay dirt (Mining), earth which yields a profit to the miner. [Western U.S.] -- Pay office, a place where payment is made. -- Pay roll, a roll or list of persons entitled to payment, with the amounts due."}