{"word":"pearl","definition":"A fringe or border. [Obs.] -- v. t.  To fringe; to border. [Obs.] See Purl. Pearl stitch. See Purl stitch, under Purl.\n\n1. (Zoöl.)  A shelly concretion, usually rounded, and having a brilliant luster, with varying tints, found in the mantle, or between the mantle and shell, of certain bivalve mollusks, especially in the pearl oysters and river mussels, and sometimes in certain univalves. It is usually due to a secretion of shelly substance around some irritating foreign particle. Its substance is the same as nacre, or mother-of-pearl. Pearls which are round, or nearly round, and of fine luster, are highly esteemed as jewels, and compare in value with the precious stones. 2. Hence, figuratively, something resembling a pearl; something very precious. I see thee compassed with thy kingdom's pearl. Shak. And those pearls of dew she wears. Milton. 3. Nacre, or mother-of-pearl. 4. (Zoöl.)  A fish allied to the turbot; the brill. 5. (Zoöl.)  A light-colored tern. 6. (Zoöl.)  One of the circle of tubercles which form the bur on a deer's antler. 7. A whitish speck or film on the eye. [Obs.] Milton. 8. A capsule of gelatin or similar substance containing some liquid for medicinal application, as ether. 9. (Print.)  A size of type, between agate and diamond. * This line is printed in the type called pearl. Ground pearl. (Zoöl.) See under Ground. -- Pearl barley, kernels of barley, ground so as to form small, round grains. -- Pearl diver, one who dives for pearl oysters. -- Pearl edge, an edge of small loops on the side of some kinds of ribbon; also, a narrow kind of thread edging to be sewed on lace. -- Pearl eye, cataract. [R.] -- Pearl gray, a very pale and delicate blue-gray color. -- Pearl millet, Egyptian millet (Penicillaria spicata). -- Pearl moss. See Carrageen. -- Pearl moth (Zoöl.), any moth of the genus Margaritia; -- so called on account of its pearly color. -- Pearl oyster (Zoöl.), any one of several species of large tropical marine bivalve mollusks of the genus Meleagrina, or Margaritifera, found in the East Indies (especially at Ceylon), in the Persian Gulf, on the coast of Australia, and on the Pacific coast of America. Called also pearl shell, and pearl mussel. -- Pearl powder. See Pearl white, below. -- Pearl sago, sago in the form of small pearly grains. -- Pearl sinter (Min.), fiorite. -- Pearl spar (Min.), a crystallized variety of dolomite, having a pearly luster. -- Pearl white. (a) Basic bismuth nitrate, or bismuth subchloride; - - used chiefly as a cosmetic. (b) A variety of white lead blued with indigo or Berlin blue.\n\nOf or pertaining to pearl or pearls; made of pearls, or of mother-of-pearl.\n\n1. To set or adorn with pearls, or with mother-of-pearl. Used also figuratively. 2. To cause to resemble pearls; to make into small round grains; as, to pearl barley.\n\n1. To resemble pearl or pearls. 2. To give or hunt for pearls; as, to go pearling."}