{"word":"period","definition":"1. A portion of time as limited and determined by some recurring phenomenon, as by the completion of a revolution of one of the heavenly bodies; a division of time, as a series of years, months, or days, in which something is completed, and ready to recommence and go on in the same order; as, the period of the sun, or the earth, or a comet. 2. Hence: A stated and recurring interval of time; more generally, an interval of time specified or left indefinite; a certain series of years, months, days, or the like; a time; a cycle; an age; an epoch; as, the period of the Roman republic. How by art to make plants more lasting than their ordinary period. Bacon. 3. (Geol.)  One of the great divisions of geological time; as, the Tertiary period; the Glacial period. See the Chart of Geology. 4. The termination or completion of a revolution, cycle, series of events, single event, or act; hence, a limit; a bound; an end; a conclusion. Bacon. So spake the archangel Michael; then paused, As at the world's great period. Milton. Evils which shall never end till eternity hath a period. Jer. Taylor. This is the period of my ambition. Shak. 5. (Rhet.)  A complete sentence, from one full stop to another; esp., a well-proportioned, harmonious sentence. \"Devolved his rounded periods.\" Tennyson. Periods are beautiful when they are not too long. B. Johnson. Note: The period, according to Heyse, is a compound sentence consisting of a protasis and apodosis; according to Becker, it is the appropriate form for the coördinate propositions related by antithesis or causality. Gibbs. 6. (Print.)  The punctuation point [.] that marks the end of a complete sentence, or of an abbreviated word. 7. (Math.)  One of several similar sets of figures or terms usually marked by points or commas placed at regular intervals, as in numeration, in the extraction of roots, and in circulating decimals. 8. (Med.)  The time of the exacerbation and remission of a disease, or of the paroxysm and intermission. 9. (Mus.)  A complete musical sentence. The period, the present or current time, as distinguished from all other times. Syn. -- Time; date; epoch; era; age; duration; limit; bound; end; conclusion; determination.\n\nTo put an end to. [Obs.] Shak.\n\nTo come to a period; to conclude. [Obs.] \"You may period upon this, that,\" etc. Felthman."}