{"word":"periodical","definition":"1. Of or pertaining to a period or periods, or to division by periods. The periodicaltimes of all the satellites. Sir J. Herschel. 2. Performed in a period, or regular revolution; proceeding in a series of successive circuits; as, the periodical motion of the planets round the sun. 3. Happening, by revolution, at a stated time; returning regularly, after a certain period of time; acting, happening, or appearing, at fixed intervals; recurring; as, periodical epidemics. The periodic return of a plant's flowering. Henslow. To influence opinion through the periodical press. Courthope. 4. (Rhet.)  Of or pertaining to a period; constituting a complete sentence. Periodic comet (Astron.), a comet that moves about the sun in an elliptic orbit; a comet that has been seen at two of its approaches to the sun. -- Periodic function (Math.), a function whose values recur at fixed intervals as the variable uniformly increases. The trigonomertic functions, as sin x, tan x, etc., are periodic functions. Exponential functions are also periodic, having an imaginary period, and the elliptic functions have not only a real but an imaginary period, and are hence called doubly periodic. -- Periodic law (Chem.), the generalization that the properties of the chemical elements are periodic functions of their atomic wieghts. \"In other words, if the elements are grouped in the order of their atomic weights, it will be found that nearly the same properties recur periodically throughout the entire series.\" The following tabular arrangement of the atomic weights shows the regular recurrence of groups (under I., II., III., IV., etc.), each consisting of members of the same natural family. The gaps in the table indicate the probable existence of unknown elements. TABLE OF THE PERIODIC LAW OF THE CHEMICAL ELEMENTS (The vertical columns contain the periodic groups) Series1{ 2{ 3{ 4{ 5{ 6{ 7{ 8{ 9{ 10{ 11{ 12{ --------------------------------------------------------- -----|I. II. III. IV. V. VI. VII. VIII. | RH4 RH3 RH3 RH |R2O RO R3O3 RO2 R2O5 RO3 R2O7 RO4 ----------------------------------------------- ---------------H 1 Li 7 Na 23 K 39 (Cu) 63 Rb 85.2 (Ag) (108) Cs 133 (-) (-) (Au) (197) (-) ----------------------------------------------\n\nA magazine or other publication which appears at stated or regular intervals."}