{"word":"pheasant","definition":"1. (Zoöl.)  Any one of numerous species of large gallinaceous birds of the genus Phasianus, and many other genera of the family Phasianidæ, found chiefly in Asia. Note: The common, or English, pheasant (Phasianus Colchicus) is now found over most of temperate Europe, but was introduced from Asia. The ring-necked pheasant (P. torquatus) and the green pheasant (P. versicolor) have been introduced into Oregon. The golden pheasant (Thaumalea picta) is one of the most beautiful species. The silver pheasant (Euplocamus nychthemerus) of China, and several related species from Southern Asia, are very beautiful. 2. (Zoöl.)  The ruffed grouse. [Southern U.S.] Note: Various other birds are locally called pheasants, as the lyre bird, the leipoa, etc. Fireback pheasant. See Fireback. -- Gold, or Golden, pheasant (Zoöl.), a Chinese pheasant (Thaumalea picta), having rich, varied colors. The crest is amber-colored, the rump is golden yellow, and the under parts are scarlet. -- Mountain pheasant (Zoöl.), the ruffed grouse. [Local, U.S.] -- Pheasant coucal (Zoöl.), a large Australian cuckoo (Centropus phasianus). The general color is black, with chestnut wings and brown tail. Called also pheasant cuckoo. The name is also applied to other allied species. -- Pheasant duck. (Zoöl.) (a) The pintail. (b) The hooded merganser. -- Pheasant parrot (Zoöl.), a large and beautiful Australian parrakeet (Platycercus Adelaidensis). The male has the back black, the feathers margined with yellowish blue and scarlet, the quills deep blue, the wing coverts and cheeks light blue, the crown, sides of the neck, breast, and middle of the belly scarlet. -- Pheasant's eye. (Bot.) (a) A red-flowered herb (Adonis autumnalis) of the Crowfoot family; -- called also pheasant's-eye Adonis. (b) The garden pink (Dianthus plumarius); -- called also Pheasant's-eye pink. -- Pheasant shell (Zoöl.), any marine univalve shell of the genus Phasianella, of which numerous species are found in tropical seas. The shell is smooth and usually richly colored, the colors often forming blotches like those of a pheasant. -- Pheasant wood. (Bot.) Same as Partridge wood (a), under Partridge. -- Sea pheasant (Zoöl.), the pintail. -- Water pheasant. (Zoöl.) (a) The sheldrake. (b) The hooded merganser."}