{"word":"pick","definition":"1. To throw; to pitch. [Obs.] As high as I could pick my lance. Shak. 2. To peck at, as a bird with its beak; to strike at with anything pointed; to act upon with a pointed instrument; to pierce; to prick, as with a pin. 3. To separate or open by means of a sharp point or points; as, to pick matted wool, cotton, oakum, etc. 4. To open (a lock) as by a wire. 5. To pull apart or away, especially with the fingers; to pluck; to gather, as fruit from a tree, flowers from the stalk, feathers from a fowl, etc. 6. To remove something from with a pointed instrument, with the fingers, or with the teeth; as, to pick the teeth; to pick a bone; to pick a goose; to pick a pocket. Did you pick Master Slender's purse Shak. He picks clean teeth, and, busy as he seems With an old tavern quill, is hungry yet. Cowper. 7. To choose; to select; to separate as choice or desirable; to cull; as, to pick one's company; to pick one's way; -- often with out. \"One man picked out of ten thousand.\" Shak. 8. To take up; esp., to gather from here and there; to collect; to bring together; as, to pick rags; -- often with up; as, to pick up a ball or stones; to pick up information. 9. To trim. [Obs.] Chaucer. To pick at, to tease or vex by pertinacious annoyance. -- To pick a bone with. See under Bone. -- To pick a thank, to curry favor. [Obs.] Robynson (More's Utopia). -- To pick off. (a) To pluck; to remove by picking. (b) To shoot or bring down, one by one; as, sharpshooters pick off the enemy. -- To pick out. (a) To mark out; to variegate; as, to pick out any dark stuff with lines or spots of bright colors. (b) To select from a number or quantity. -- To pick to pieces, to pull apart piece by piece; hence [Colloq.], to analyze; esp., to criticize in detail. -- To pick a quarrel, to give occasion of quarrel intentionally. -- To pick up. (a) To take up, as with the fingers. (b) To get by repeated efforts; to gather here and there; as, to pick up a livelihood; to pick up news.(c) to acquire (an infectious disease); as, to pick up a cold on the airplane. (d) To meet (a person) and induce to accompany one; as, to pick up a date at the mall. [See several other defs in MW10]\n\n1. To eat slowly, sparingly, or by morsels; to nibble. Why stand'st thou picking Is thy palate sore Dryden. 2. To do anything nicely or carefully, or by attending to small things; to select something with care. 3. To steal; to pilfer. \"To keep my hands from picking and stealing.\" Book of Com. Prayer. To pick up, to improve by degrees; as, he is picking up in health or business. [Colloq. U.S.]\n\n1. A sharp-pointed tool for picking; -- often used in composition; as, a toothpick; a picklock. 2. (Mining & Mech.)  A heavy iron tool, curved and sometimes pointed at both ends, wielded by means of a wooden handle inserted in the middle, -- used by quarrymen, roadmakers, etc.; also, a pointed hammer used for dressing millstones. 3. A pike or spike; the sharp point fixed in the center of a buckler. [Obs.] \"Take down my buckler . . . and grind the pick on 't.\" Beau. & Fl. 4. Choice; right of selection; as, to have one's pick. France and Russia have the pick of our stables. Ld. Lytton. 5. That which would be picked or chosen first; the best; as, the pick of the flock. 6. (Print.)  A particle of ink or paper imbedded in the hollow of a letter, filling up its face, and occasioning a spot on a printed sheet. MacKellar. 7. (Painting)  That which is picked in, as with a pointed pencil, to correct an unevenness in a picture. 8. (Weawing)  The blow which drives the shuttle, -- the rate of speed of a loom being reckoned as so many picks per minute; hence, in describing the fineness of a fabric, a weft thread; as, so many picks to an inch. Pick dressing (Arch.), in cut stonework, a facing made by a pointed tool, leaving the surface in little pits or depressions. -- Pick hammer, a pick with one end sharp and the other blunt, used by miners."}