{"word":"piece","definition":"1. A fragment or part of anything separated from the whole, in any manner, as by cutting, splitting, breaking, or tearing; a part; a portion; as, a piece of sugar; to break in pieces. Bring it out piece by piece. Ezek. xxiv. 6. 2. A definite portion or quantity, as of goods or work; as, a piece of broadcloth; a piece of wall paper. 3. Any one thing conceived of as apart from other things of the same kind; an individual article; a distinct single effort of a series; a definite performance; especially: (a) A literary or artistic composition; as, a piece of poetry, music, or statuary. (b) A musket, gun, or cannon; as, a battery of six pieces; a following piece. (c) A coin; as, a sixpenny piece; -- formerly applied specifically to an English gold coin worth 22 shillings. (d) A fact; an item; as, a piece of news; a piece of knowledge. 4. An individual; -- applied to a person as being of a certain nature or quality; often, but not always, used slightingly or in contempt. \"If I had not been a piece of a logician before I came to him.\" Sir P. Sidney. Thy mother was a piece of virtue. Shak. His own spirit is as unsettled a piece as there is in all the world. Coleridge. a piece of cake, a task easily accomplished. a piece of work, a disparaging term for a person considered to have an excess of some undesirable quality; esp. difficult or eccentric person. Piece of ass vulgar term for a woman, considered as a partner in sexual intercourse 5. (Chess)  One of the superior men, distinguished from a pawn. 6. A castle; a fortified building. [Obs.] Spenser. Of a piece, of the same sort, as if taken from the same whole; like; -- sometimes followed by with. Dryden. -- Piece of eight, the Spanish piaster, formerly divided into eight reals. -- To give a piece of one's mind to, to speak plainly, bluntly, or severely to (another). Tackeray. -- Piece broker, one who buys shreds and remnants of cloth to sell again. -- Piece goods, goods usually sold by pieces or fixed portions, as shirtings, calicoes, sheetings, and the like.\n\n1. To make, enlarge, or repair, by the addition of a piece or pieces; to patch; as, to piece a garment; -- often with out. Shak. 2. To unite; to join; to combine. Fuller. His adversaries . . . pieced themselves together in a joint opposition against him. Fuller.\n\nTo unite by a coalescence of parts; to fit together; to join. \"It pieced better.\" Bacon."}