{"word":"pigeon","definition":"1. (Zoöl.)  Any bird of the order Columbæ, of which numerous species occur in nearly all parts of the world. Note: The common domestic pigeon, or dove, was derived from the Old World rock pigeon (Columba livia). It has given rise to numerous very remarkable varieties, such as the carrier, fantail, nun, pouter, tumbler, etc. The common wild pigeons of the Eastern United States are the passenger pigeon, and the Carolina dove. See under Passenger, and Dove. See, also, Fruit pigeon, Ground pigeon, Queen pigeon, Stock pigeon, under Fruit, Ground, etc. 2. An unsuspected victim of sharpers; a gull. [Slang] Blue pigeon (Zoöl.), an Australian passerine bird (Graucalus melanops); -- called also black-faced crow. -- Green pigeon (Zoöl.), any one of numerous species of Old World pigeons belonging to the family Treronidæ. -- Imperial pigeon (Zoöl.), any one of the large Asiatic fruit pigeons of the genus Carpophada. -- Pigeon berry (Bot.), the purplish black fruit of the pokeweed; also, the plant itself. See Pokeweed. -- Pigeon English Etym: [perhaps a corruption of business English], an extraordinary and grotesque dialect, employed in the commercial cities of China, as the medium of communication between foreign merchants and the Chinese. Its base is English, with a mixture of Portuguese and Hindoostanee. Johnson's Cyc. -- Pigeon grass (Bot.), a kind of foxtail grass (Setaria glauca), of some value as fodder. The seeds are eagerly eaten by pigeons and other birds. -- Pigeon hawk. (Zoöl.) (a) A small American falcon (Falco columbarius). The adult male is dark slate-blue above, streaked with black on the back; beneath, whitish or buff, streaked with brown. The tail is banded. (b) The American sharp-shinned hawk (Accipiter velox, or fuscus). -- Pigeon hole. (a) A hole for pigeons to enter a pigeon house. (b) See Pigeonhole. (c) pl. An old English game, in which balls were rolled through little arches. Halliwell. -- Pigeon house, a dovecote. -- Pigeon pea (Bot.), the seed of Cajanus Indicus; a kind of pulse used for food in the East and West Indies; also, the plant itself. -- Pigeon plum (Bot.), the edible drupes of two West African species of Chrysobalanus (C. ellipticus and C. luteus). -- Pigeon tremex. (Zoöl.) See under Tremex. -- Pigeon wood (Bot.), a name in the West Indies for the wood of several very different kinds of trees, species of Dipholis, Diospyros, and Coccoloba. -- Pigeon woodpecker (Zoöl.), the flicker. -- Prairie pigeon. (Zoöl.) (a) The upland plover. (b) The golden plover. [Local, U.S.]\n\nTo pluck; to fleece; to swindle by tricks in gambling. [Slang] Smart. He's pigeoned and undone. Observer."}