{"word":"pilot","definition":"1. (Naut.)  One employed to steer a vessel; a helmsman; a steersman. Dryden. 2. Specifically, a person duly qualified, and licensed by authority, to conduct vessels into and out of a port, or in certain waters, for a fixed rate of fees. 3. Figuratively: A guide; a director of another through a difficult or unknown course. 4. An instrument for detecting the compass error. 5. The cowcatcher of a locomotive. [U.S.] Pilot balloon, a small balloon sent up in advance of a large one, to show the direction and force of the wind. -- Pilot bird. (Zoöl.) (a) A bird found near the Caribbee Islands; - - so called because its presence indicates to mariners their approach to these islands. Crabb. (b) The black-bellied plover. [Local, U.S.] -- Pilot boat, a strong, fast-sailing boat used to carry and receive pilots as they board and leave vessels. -- Pilot bread, ship biscuit. -- Pilot cloth, a coarse, stout kind of cloth for overcoats. -- Pilot engine, a locomotive going in advance of a train to make sure that the way is clear. -- Pilot fish. (Zoöl) (a) A pelagic carangoid fish (Naucrates ductor); -- so named because it is often seen in company with a shark, swimming near a ship, on account of which sailors imagine that it acts as a pilot to the shark. (b) The rudder fish (Seriola zonata). -- Pilot jack, a flag or signal hoisted by a vessel for a pilot. -- Pilot jacket, a pea jacket. -- Pilot nut (Bridge Building), a conical nut applied temporarily to the threaded end of a pin, to protect the thread and guide the pin when it is driven into a hole. Waddell. -- Pilot snake (Zoöl.) (a) A large North American snake (Coluber obsoleus). It is lustrous black, with white edges to some of the scales. Called also mountain black snake. (b) The pine snake. -- Pilot whale. (Zoöl.) Same as Blackfish, 1.\n\n1. To direct the course of, as of a ship, where navigation is dangerous. 2. Figuratively: To guide, as through dangers or difficulties. \"The art of piloting a state.\" Berkeley."}