{"word":"pin","definition":"To peen.\n\nTo inclose; to confine; to pen; to pound.\n\n1. A piece of wood, metal, etc., generally cylindrical, used for fastening separate articles together, or as a support by which one article may be suspended from another; a peg; a bolt. With pins of adamant And chains they made all fast. Milton. 2. Especially, a small, pointed and headed piece of brass or other wire (commonly tinned), largely used for fastening clothes, attaching papers, etc. 3. Hence, a thing of small value; a trifle. He . . . did not care a pin for her. Spectator. 4. That which resembles a pin in its form or use; as: (a) A peg in musical instruments, for increasing or relaxing the tension of the strings. (b) A linchpin. (c) A rolling-pin. (d) A clothespin. (e) (Mach.) A short shaft, sometimes forming a bolt, a part of which serves as a journal. See Illust. of Knuckle joint, under Knuckle. (f) (Joinery) The tenon of a dovetail joint. 5. One of a row of pegs in the side of an ancient drinking cup to mark how much each man should drink. 6. The bull's eye, or center, of a target; hence, the center. [Obs.] \"The very pin of his heart cleft.\" Shak. 7. Mood; humor. [Obs.] \"In merry pin.\" Cowper. 8. (Med.)  Caligo. See Caligo. Shak. 9. An ornament, as a brooch or badge, fastened to the clothing by a pin; as, a Masonic pin. 10. The leg; as, to knock one off his pins. [Slang] Banking pin (Horol.), a pin against which a lever strikes, to limit its motion. -- Pin drill (Mech.), a drill with a central pin or projection to enter a hole, for enlarging the hole, or for sinking a recess for the head of a bolt, etc.; a counterbore. -- Pin grass. (Bot.) See Alfilaria. -- Pin hole, a small hole made by a pin; hence, any very small aperture or perforation. -- Pin lock, a lock having a cylindrical bolt; a lock in which pins, arranged by the key, are used instead of tumblers. -- Pin money, an allowance of money, as that made by a husband to his wife, for private and personal expenditure. -- Pin rail (Naut.), a rail, usually within the bulwarks, to hold belaying pins. Sometimes applied to the fife rail. Called also pin rack. -- Pin wheel. (a) A contrate wheel in which the cogs are cylindrical pins. (b) (Fireworks) A small coil which revolves on a common pin and makes a wheel of yellow or colored fire.\n\nTo fasten with, or as with, a pin; to join; as, to pin a garment; to pin boards together. \"Aa if she would pin her to her heart.\" Shak. To pin one's faith upon, to depend upon; to trust to."}