{"word":"pit","definition":"1. A large cavity or hole in the ground, either natural or artificial; a cavity in the surface of a body; an indentation; specifically: (a) The shaft of a coal mine; a coal pit. (b) A large hole in the ground from which material is dug or quarried; as, a stone pit; a gravel pit; or in which material is made by burning; as, a lime pit; a charcoal pit. (c) A vat sunk in the ground; as, a tan pit. Tumble me into some loathsome pit. Shak. 2. Any abyss; especially, the grave, or hades. Back to the infernal pit I drag thee chained. Milton. He keepth back his soul from the pit. Job xxxiii. 18. 3. A covered deep hole for entrapping wild beasts; a pitfall; hence, a trap; a snare. Also used figuratively. The anointed of the Lord was taken in their pits. Lam. iv. 20. 4. A depression or hollow in the surface of the human body; as: (a) The hollow place under the shoulder or arm; the axilla, or armpit. (b) See Pit of the stomach (below). (c) The indentation or mark left by a pustule, as in smallpox. 5. Formerly, that part of a theater, on the floor of the house, below the level of the stage and behind the orchestra; now, in England, commonly the part behind the stalls; in the United States, the parquet; also, the occupants of such a part of a theater. 6. An inclosed area into which gamecocks, dogs, and other animals are brought to fight, or where dogs are trained to kill rats. \"As fiercely as two gamecocks in the pit.\" Locke. 7. Etym: [Cf. D. pit, akin to E. pith.] (Bot.) (a) The endocarp of a drupe, and its contained seed or seeds; a stone; as, a peach pit; a cherry pit, etc. (b) A depression or thin spot in the wall of a duct. Cold pit (Hort.), an excavation in the earth, lined with masonry or boards, and covered with glass, but not artificially heated, -- used in winter for the storing and protection of half-hardly plants, and sometimes in the spring as a forcing bed. -- Pit coal, coal dug from the earth; mineral coal. -- Pit frame, the framework over the shaft of a coal mine. -- Pit head, the surface of the ground at the mouth of a pit or mine. -- Pit kiln, an oven for coking coal. -- Pit martin (Zoöl.), the bank swallow. [Prov. Eng.] -- Pit of the stomach (Anat.), the depression on the middle line of the epigastric region of the abdomen at the lower end of the sternum; the infrasternal depression. -- Pit saw (Mech.), a saw worked by two men, one of whom stands on the log and the other beneath it. The place of the latter is often in a pit, whence the name. -- Pit viper (Zoöl.), any viperine snake having a deep pit on each side of the snout. The rattlesnake and copperhead are examples. -- Working pit (Min.), a shaft in which the ore is hoisted and the workmen carried; -- in distinction from a shaft used for the pumps.\n\n1. To place or put into a pit or hole. They lived like beasts, and were pitted like beasts, tumbled into the grave. T. Grander. 2. To mark with little hollows, as by various pustules; as, a face pitted by smallpox. 3. To introduce as an antagonist; to set forward for or in a contest; as, to pit one dog against another."}