{"word":"pitch","definition":"1. A thick, black, lustrous, and sticky substance obtained by boiling down tar. It is used in calking the seams of ships; also in coating rope, canvas, wood, ironwork, etc., to preserve them. He that toucheth pitch shall be defiled therewith. Ecclus. xiii. 1. 2. (Geol.)  See Pitchstone. Amboyna pitch, the resin of Dammara australis. See Kauri. -- Burgundy pitch. See under Burgundy. -- Canada pitch, the resinous exudation of the hemlock tree (Abies Canadensis); hemlock gum. -- Jew's pitch, bitumen. -- Mineral pitch. See Bitumen and Asphalt. -- Pitch coal (Min.), bituminous coal. -- Pitch peat (Min.), a black homogeneous peat, with a waxy luster. -- Pitch pine (Bot.), any one of several species of pine, yielding pitch, esp. the Pinus rigida of North America.\n\n1. To cover over or smear with pitch. Gen. vi. 14. 2. Fig.: To darken; to blacken; to obscure. The welkin pitched with sullen could. Addison.\n\n1. To throw, generally with a definite aim or purpose; to cast; to hurl; to toss; as, to pitch quoits; to pitch hay; to pitch a ball. 2. To thrust or plant in the ground, as stakes or poles; hence, to fix firmly, as by means of poles; to establish; to arrange; as, to pitch a tent; to pitch a camp. 3. To set, face, or pave with rubble or undressed stones, as an embankment or a roadway. Knight. 4. To fix or set the tone of; as, to pitch a tune. 5. To set or fix, as a price or value. [Obs.] Shak. Pitched battle, a general battle; a battle in which the hostile forces have fixed positions; -- in distinction from a skirmish. -- To pitch into, to attack; to assault; to abuse. [Slang]\n\n1. To fix or place a tent or temporary habitation; to encamp. \"Laban with his brethren pitched in the Mount of Gilead.\" Gen. xxxi. 25. 2. To light; to settle; to come to rest from flight. The tree whereon they [the bees] pitch. Mortimer. 3. To fix one's choise; -- with on or upon. Pitch upon the best course of life, and custom will render it the more easy. Tillotson. 4. To plunge or fall; esp., to fall forward; to decline or slope; as, to pitch from a precipice; the vessel pitches in a heavy sea; the field pitches toward the east. Pitch and pay, an old aphorism which inculcates ready-money payment, or payment on delivery of goods. Shak.\n\n1. A throw; a toss; a cast, as of something from the hand; as, a good pitch in quoits. Pitch and toss, a game played by tossing up a coin, and calling \"Heads or tails;\" hence: To play pitch and toss with (anything), to be careless or trust to luck about it. \"To play pitch and toss with the property of the country.\" G. Eliot. -- Pitch farthing. See Chuck farthing, under 5th Chuck. 2. (Cricket)  That point of the ground on which the ball pitches or lights when bowled. 3. A point or peak; the extreme point or degree of elevation or depression; hence, a limit or bound. Driven headlong from the pitch of heaven, down Into this deep. Milton. Enterprises of great pitch and moment. Shak. To lowest pitch of abject fortune. Milton. He lived when learning was at its highest pitch. Addison. The exact pitch, or limits, where temperance ends. Sharp. 4. Height; stature. [Obs.] Hudibras. 5. A descent; a fall; a thrusting down. 6. The point where a declivity begins; hence, the declivity itself; a descending slope; the degree or rate of descent or slope; slant; as, a steep pitch in the road; the pitch of a roof. 7. (Mus.)  The relative acuteness or gravity of a tone, determined by the number of vibrations which produce it; the place of any tone upon a scale of high and low. Note: Musical tones with reference to absolute pitch, are named after the first seven letters of the alphabet; with reference to relative pitch, in a series of tones called the scale, they are called one, two, three, four, five, six, seven, eight. Eight is also one of a new scale an octave higher, as one is eight of a scale an octave lower. 8. (Mining)  The limit of ground set to a miner who receives a share of the ore taken out. 9. (Mech.) (a) The distance from center to center of any two adjacent teeth of gearing, measured on the pitch line; -- called also circular pitch. (b) The length, measured along the axis, of a complete turn of the thread of a screw, or of the helical lines of the blades of a screw propeller. (c) The distance between the centers of holes, as of rivet holes in boiler plates. Concert pitch (Mus.), the standard of pitch used by orchestras, as in concerts, etc. -- Diametral pitch (Gearing), the distance which bears the same relation to the pitch proper, or circular pitch, that the diameter of a circle bears to its circumference; it is sometimes described by the number expressing the quotient obtained by dividing the number of teeth in a wheel by the diameter of its pitch circle in inches; as, 4 pitch, 8 pitch, etc. -- Pitch chain, a chain, as one made of metallic plates, adapted for working with a sprocket wheel. -- Pitch line, or Pitch circle (Gearing), an ideal line, in a toothed gear or rack, bearing such a relation to a corresponding line in another gear, with which the former works, that the two lines will have a common velocity as in rolling contact; it usually cuts the teeth at about the middle of their height, and, in a circular gear, is a circle concentric with the axis of the gear; the line, or circle, on which the pitch of teeth is measured. -- Pitch of a roof (Arch.), the inclination or slope of the sides expressed by the height in parts of the span; as, one half pitch; whole pitch; or by the height in parts of the half span, especially among engineers; or by degrees, as a pitch of 30°, of 45°, etc.; or by the rise and run, that is, the ratio of the height to the half span; as, a pitch of six rise to ten run. Equilateral pitch is where the two sloping sides with the span form an equilateral triangle. -- Pitch of a plane (Carp.), the slant of the cutting iron. -- Pitch pipe, a wind instrument used by choristers in regulating the pitch of a tune. -- Pitch point (Gearing), the point of contact of the pitch lines of two gears, or of a rack and pinion, which work together."}