{"word":"plain","definition":"To lament; to bewail; to complain. [Archaic & Poetic] Milton. We with piteous heart unto you pleyne. Chaucer.\n\nTo lament; to mourn over; as, to plain a loss. [Archaic & Poetic] Sir J. Harrington.\n\n1. Without elevations or depressions; flat; level; smooth; even. See Plane. The crooked shall be made straight, and the rough places plain. Isa. xl. 4. 2. Open; clear; unencumbered; equal; fair. Our troops beat an army in plain fight. Felton. 3. Not intricate or difficult; evident; manifest; obvious; clear; unmistakable. \"'T is a plain case.\" Shak. 4. (a) Void of extraneous beauty or ornament; without conspicious embellishment; not rich; simple. (b) Not highly cultivated; unsophisticated; free from show or pretension; simple; natural; homely; common. \"Plain yet pious Christians.\" Hammond. \"The plain people.\" A. Lincoln. (c) Free from affectation or disguise; candid; sincere; artless; honest; frank. \"An honest mind, and plain.\" Shak. (d) Not luxurious; not highly seasoned; simple; as, plain food. (e) Without beauty; not handsome; homely; as, a plain woman. (f) Not variegated, dyed, or figured; as, plain muslin. (g) Not much varied by modulations; as, a plain tune. Plain battle, open battle; pitched battle. [Obs.] Chaucer. -- Plain chant (Mus.) Same as Plain song, below. -- Plain chart (Naut.), a chart laid down on Mercator's projection. -- Plain dealer. (a) One who practices plain dealing. (b) A simpleton. [Obs.] Shak. -- Plain dealing. See under Dealing. -- Plain molding (Join.), molding of which the surfaces are plain figures. -- Plain sewing, sewing of seams by simple and common stitches, in distinct from fancy work, embroidery, etc.; -- distinguished also from designing and fitting garments. -- Plain song. (a) The Gregorian chant, or canto fermo; the prescribed melody of the Roman Catholic service, sung in unison, in tones of equal length, and rarely extending beyond the compass of an octave. (b) A simple melody. -- Plain speaking, plainness or bluntness of speech. Syn. -- Level; flat; smooth; open; artless; unaffected; undisguised; frank; sincere; honest; candid; ingenuous; unembellished; downright; blunt; clear; simple; distinct; manifest; obvious; apparent. See Manifest.\n\nIn a plain manner; plainly. \"To speak short and pleyn.\" Chaucer. \"To tell you plain.\" Shak.\n\n1. Level land; usually, an open field or a broad stretch of land with an even surface, or a surface little varied by inequalities; as, the plain of Jordan; the American plains, or prairies. Descending fro the mountain into playn. Chaucer. Him the Ammonite Worshiped in Rabba and her watery plain. Milton. 2. A field of battle. [Obs.] Arbuthnot. Lead forth my soldiers to the plain. Shak.\n\n1. To plane or level; to make plain or even on the surface. [R.] We would rake Europe rather, plain the East. Wither. 2. To make plain or manifest; to explain. What's dumb in show, I'll plain in speech. Shak."}