{"word":"plane","definition":"Any tree of the genus Platanus. Note: The Oriental plane (Platanus orientalis) is a native of Asia. It rises with a straight, smooth, branching stem to a great height, with palmated leaves, and long pendulous peduncles, sustaining several heads of small close-sitting flowers. The seeds are downy, and collected into round, rough, hard balls. The Occidental plane (Platanus occidentalis), which grows to a great height, is a native of North America, where it is popularly called sycamore, buttonwood, and buttonball, names also applied to the California species (Platanus racemosa).\n\nWithout elevations or depressions; even; level; flat; lying in, or constituting, a plane; as, a plane surface. Note: In science, this word (instead of plain) is almost exclusively used to designate a flat or level surface. Plane angle, the angle included between two straight lines in a plane. -- Plane chart, Plane curve. See under Chart and Curve. -- Plane figure, a figure all points of which lie in the same plane. If bounded by straight lines it is a rectilinear plane figure, if by curved lines it is a curvilinear plane figure. -- Plane geometry, that part of geometry which treats of the relations and properties of plane figures. -- Plane problem, a problem which can be solved geometrically by the aid of the right line and circle only. -- Plane sailing (Naut.), the method of computing a ship's place and course on the supposition that the earth's surface is a plane. -- Plane scale (Naut.), a scale for the use of navigators, on which are graduated chords, sines, tangents, secants, rhumbs, geographical miles, etc. -- Plane surveying, surveying in which the curvature of the earth is disregarded; ordinary field and topographical surveying of tracts of moderate extent. -- Plane table, an instrument used for plotting the lines of a survey on paper in the field. -- Plane trigonometry, the branch of trigonometry in which its principles are applied to plane triangles.\n\n1. (Geom.)  A surface, real or imaginary, in which, if any two points are taken, the straight line which joins them lies wholly in that surface; or a surface, any section of which by a like surface is a straight line; a surface without curvature. 2. (Astron.)  An ideal surface, conceived as coinciding with, or containing, some designated astronomical line, circle, or other curve; as, the plane of an orbit; the plane of the ecliptic, or of the equator. 3. (Mech.)  A block or plate having a perfectly flat surface, used as a standard of flatness; a surface plate. 4. (Joinery)  A tool for smoothing boards or other surfaces of wood, for forming moldings, etc. It consists of a smooth-soled stock, usually of wood, from the under side or face of which projects slightly the steel cutting edge of a chisel, called the iron, which inclines backward, with an apperture in front for the escape of shavings; as, the jack plane; the smoothing plane; the molding plane, etc. Objective plane (Surv.), the horizontal plane upon which the object which is to be delineated, or whose place is to be determined, is supposed to stand. -- Perspective plane. See Perspective. -- Plane at infinity (Geom.), a plane in which points infinitely distant are conceived as situated. -- Plane iron, the cutting chisel of a joiner's plane. -- Plane of polarization. (Opt.) See Polarization. -- Plane of projection. (a) The plane on which the projection is made, corresponding to the perspective plane in perspective; -- called also principal plane. (b) (Descriptive Geom.) One of the planes to which points are referred for the purpose of determining their relative position in space. -- Plane of refraction or reflection (Opt.), the plane in which lie both the incident ray and the refracted or reflected ray.\n\n1. To make smooth; to level; to pare off the inequalities of the surface of, as of a board or other piece of wood, by the use of a plane; as, to plane a plank. 2. To efface or remove. He planed away the names . . . written on his tables. Chaucer. 3. Figuratively, to make plain or smooth. [R.] What student came but that you planed her path. Tennyson."}