{"word":"plant","definition":"1. A vegetable; an organized living being, generally without feeling and voluntary motion, and having, when complete, a root, stem, and leaves, though consisting sometimes only of a single leafy expansion, or a series of cellules, or even a single cellule. Note: Plants are divided by their structure and methods of reproduction into two series, phænogamous or flowering plants, which have true flowers and seeds, and cryptogamous or flowerless plants, which have no flowers, and reproduce by minute one-celled spores. In both series are minute and simple forms and others of great size and complexity. As to their mode of nutrition, plants may be considered as self-supporting and dependent. Self-supporting plants always contain chlorophyll, and subsist on air and moisture and the matter dissolved in moisture, and as a general rule they excrete oxygen, and use the carbonic acid to combine with water and form the material for their tissues. Dependent plants comprise all fungi and many flowering plants of a parasitic or saprophytic nature. As a rule, they have no chlorophyll, and subsist mainly or wholly on matter already organized, thus utilizing carbon compounds already existing, and not excreting oxygen. But there are plants which are partly dependent and partly self-supporting. The movements of climbing plants, of some insectivorous plants, of leaves, stamens, or pistils in certain plants, and the ciliary motion of zoöspores, etc., may be considered a kind of voluntary motion. 2. A bush, or young tree; a sapling; hence, a stick or staff. \"A plant of stubborn oak.\" Dryden. 3. The sole of the foot. [R.] \"Knotty legs and plants of clay.\" B. Jonson. 4. (Com.)  The whole machinery and apparatus employed in carrying on a trade or mechanical business; also, sometimes including real estate, and whatever represents investment of capital in the means of carrying on a business, but not including material worked upon or finished products; as, the plant of a foundry, a mill, or a railroad. 5. A plan; an artifice; a swindle; a trick. [Slang] It was n't a bad plant, that of mine, on Fikey. Dickens. 6. (Zoöl.) (a) An oyster which has been bedded, in distinction from one of natural growth. (b) A young oyster suitable for transplanting. [Local, U.S.] Plant bug (Zoöl.), any one of numerous hemipterous insects which injure the foliage of plants, as Lygus lineolaris, which damages wheat and trees. -- Plant cutter (Zoöl.), a South American passerine bird of the genus Phytotoma, family Phytotomidæ. It has a serrated bill with which it cuts off the young shoots and buds of plants, often doing much injury. -- Plant louse (Zoöl.), any small hemipterous insect which infests plants, especially those of the families Aphidæ and Psyllidæ; an aphid.\n\n1. To put in the ground and cover, as seed for growth; as, to plant maize. 2. To set in the ground for growth, as a young tree, or a vegetable with roots. Thou shalt not plant thee a grove of any trees. Deut. xvi. 21. 3. To furnish, or fit out, with plants; as, to plant a garden, an orchard, or a forest. 4. To engender; to generate; to set the germ of. It engenders choler, planteth anger. Shak. 5. To furnish with a fixed and organized population; to settle; to establish; as, to plant a colony. Planting of countries like planting of woods. Bacon. 6. To introduce and establish the principles or seeds of; as, to plant Christianity among the heathen. 7. To set firmly; to fix; to set and direct, or point; as, to plant cannon against a fort; to plant a standard in any place; to plant one's feet on solid ground; to plant one's fist in another's face. 8. To set up; to install; to instate. We will plant some other in the throne. Shak.\n\nTo perform the act of planting. I have planted; Apollos watered. 1 Cor. iii. 6."}