{"word":"pledge","definition":"1. (Law)  The transfer of possession of personal property from a debtor to a creditor as security for a debt or engagement; also, the contract created between the debtor and creditor by a thing being so delivered or deposited, forming a species of bailment; also, that which is so delivered or deposited; something put in pawn. Note: Pledge is ordinarily confined to personal property; the title or ownership does not pass by it; possession is essential to it. In all these points it differs from a mortgage [see Mortgage]; and in the last, from the hypotheca of the Roman law. See Hypotheca. Story. Kent. 2. (Old Eng. Law)  A person who undertook, or became responsible, for another; a bail; a surety; a hostage. \"I am Grumio's pledge.\" Shak. 3. A hypothecation without transfer of possession. 4. Anything given or considered as a security for the performance of an act; a guarantee; as, mutual interest is the best pledge for the performance of treaties. \"That voice, their liveliest pledge of hope.\" Milton. 5. A promise or agreement by which one binds one's self to do, or to refrain from doing, something; especially, a solemn promise in writing to refrain from using intoxicating liquors or the like; as, to sign the pledge; the mayor had made no pledges. 6. A sentiment to which assent is given by drinking one's health; a toast; a health. Dead pledge. Etym: [A translation of LL. mortuum vadium.] (Law) A mortgage. See Mortgage. -- Living pledge. Etym: [A translation of LL. vivum vadium.] (Law) The conveyance of an estate to another for money borrowed, to be held by him until the debt is paid out of the rents and profits. -- To hold in pledge, to keep as security. -- To put in pledge, to pawn; to give as security. Syn. -- See Earnest.\n\n1. To deposit, as a chattel, in pledge or pawn; to leave in possession of another as security; as, to pledge one's watch. 2. To give or pass as a security; to guarantee; to engage; to plight; as, to pledge one's word and honor. We mutually pledge to each other our lives, our fortunes, and our sacred honor. The Declaration of Independence. 3. To secure performance of, as by a pledge. [Obs.] To pledge my vow, I give my hand. Shak. 4. To bind or engage by promise or declaration; to engage solemnly; as, to pledge one's self. 5. To invite another to drink, by drinking of the cup first, and then handing it to him, as a pledge of good will; hence, to drink the health of; to toast. Pledge me, my friend, and drink till thou be'st wise. Cowley."}