{"word":"plot","definition":"1. A small extent of ground; a plat; as, a garden plot. Shak. 2. A plantation laid out. [Obs.] Sir P. Sidney. 3. (Surv.)  A plan or draught of a field, farm, estate, etc., drawn to a scale.\n\nTo make a plot, map, pr plan, of; to mark the position of on a plan; to delineate. This treatise plotteth down Cornwall as it now standeth. Carew.\n\n1. Any scheme, stratagem, secret design, or plan, of a complicated nature, adapted to the accomplishment of some purpose, usually a treacherous and mischievous one; a conspiracy; an intrigue; as, the Rye-house Plot. I have overheard a plot of death. Shak. O, think what anxious moments pass between The birth of plots and their last fatal periods! Addison. 2. A share in such a plot or scheme; a participation in any stratagem or conspiracy. [Obs.] And when Christ saith. Who marries the divorced commits adultery, it is to be understood, if he had any plot in the divorce. Milton. 3. Contrivance; deep reach thought; ability to plot or intrigue. [Obs.] \"A man of much plot.\" Denham. 4. A plan; a purpose. \"No other plot in their religion but serve Got and save their souls.\" Jer. Taylor. 5. In fiction, the story of a play, novel, romance, or poem, comprising a complication of incidents which are gradually unfolded, sometimes by unexpected means. If the plot or intrigue must be natural, and such as springs from the subject, then the winding up of the plot must be a probable consequence of all that went before. Pope. Syn. -- Intrigue; stratagem; conspiracy; cabal; combination; contrivance.\n\n1. To form a scheme of mischief against another, especially against a government or those who administer it; to conspire. Shak. The wicked plotteth against the just. Ps. xxxvii. 12. 2. To contrive a plan or stratagem; to scheme. The prince did plot to be secretly gone. Sir H. Wotton.\n\nTo plan; to scheme; to devise; to contrive secretly. \"Plotting an unprofitable crime.\" Dryden. \"Plotting now the fall of others.\" Milton"}