{"word":"plum","definition":"1. (Bot.)  The edible drupaceous fruit of the Prunus domestica, and of several other species of Prunus; also, the tree itself, usually called plum tree. The bullace, the damson, and the numerous varieties of plum, of our gardens, although growing into thornless trees, are believed to be varieties of the blackthorn, produced by long cultivation. G. Bentham. are in bold format, like collocations. Note: Two or three hundred varieties of plums derived from the Prunus domestica are described; among them the greengage, the Orleans, the purple gage, or Reine Claude Violette, and the German prune, are some of the best known. Note: Among the true plums are; Beach plum, the Prunus maritima, and its crimson or purple globular drupes, -- Bullace plum. See Bullace. -- Chickasaw plum, the American Prunus Chicasa, and its round red drupes. -- Orleans plum, a dark reddish purple plum of medium size, much grown in England for sale in the markets. -- Wild plum of America, Prunus Americana, with red or yellow fruit, the original of the Iowa plum and several other varieties. Among plants called plum, but of other genera than Prunus, are; Australian plum, Cargillia arborea and C. australis, of the same family with the persimmon. -- Blood plum, the West African Hæmatostaphes Barteri. -- Cocoa plum, the Spanish nectarine. See under Nectarine. -- Date plum. See under Date. -- Gingerbread plum, the West African Parinarium macrophyllum. -- Gopher plum, the Ogeechee lime. -- Gray plum, Guinea plum. See under Guinea. -- Indian plum, several species of Flacourtia. 2. A grape dried in the sun; a raisin. 3. A handsome fortune or property; formerly, in cant language, the sum of £100,000 sterling; also, the person possessing it. Plum bird, Plum budder (Zoöl.), the European bullfinch. -- Plum gouger (Zoöl.), a weevil, or curculio (Coccotorus scutellaris), which destroys plums. It makes round holes in the pulp, for the reception of its eggs. The larva bores into the stone and eats the kernel. -- Plum weevil (Zoöl.), an American weevil which is very destructive to plums, nectarines cherries, and many other stone fruits. It lays its eggs in crescent-shaped incisions made with its jaws. The larva lives upon the pulp around the stone. Called also turk, and plum curculio. See Illust. under Curculio."}