{"word":"poker","definition":"1. One who pokes. 2. That which pokes or is used in poking, especially a metal bar or rod used in stirring a fire of coals. 3. A poking-stick. Decker. 4. (Zoöl.)  The poachard. [Prov. Eng.] Poker picture, a picture formed in imitation of bisterwashed drawings, by singeing the surface of wood with a heated poker or other iron. Fairholt.\n\nA game at cards derived from brag, and first played about 1835 in the Southwestern United States. Johnson's Cyc. Note: A poker hand is played with a poker deck, composed of fifty-two cards, of thirteeen values, each card value being represented once in each of four \"suits\", namely spades, hearts, diamonds, and clubs. The game is played in many variations, but almost invariably the stage of decision as to who wins occurs when each player has five cards (or chooses five cards from some larger number available to him). The winner usually is the player with the highest-valued hand, but, in some variations, the winner may be the player with the lowest-valued hand. The value of a hand is ranked by hand types, representing the relationships of the cards to each other. [The hand types are ranked by the probability of receiving such a hand when dealt five cards.] Within each hand type the value is also ranked by the values of the cards. The hand types are labeled, in decreasing value: five of a kind; royal flush; straight flush; four of a kind; full house (coll. full boat, or boat); flush; straight; three of a kind; two pairs; one pair; and, when the contending players have no hands of any of the above types, the player with the highest-valued card wins -- if there is a tie, the next-highest-valued card of the tied players determines the winner, and so on. If two players have the same type of hand, the value of the cards within each type determines the winner; thus, if two players both have three of a kind (and no other player has a higher type of hand), the player whose three matched cards have the highest card value is the winner.\n\nAny imagined frightful object, especially one supposed to haunt the darkness; a bugbear. [Colloq. U. S.]"}