{"word":"polarization","definition":"1. The act of polarizing; the state of being polarized, or of having polarity. 2. (Opt.)  A peculiar affection or condition of the rays of light or heat, in consequence of which they exhibit different properties in different directions. Note: If a beam of light, which has been reflected from a plate of unsilvered glass at an angle of about 56°, be received upon a second plate of glass similar to the former, and at the same angle of incidence, the light will be readily reflected when the two planes of incidence are parallel to each other, but will not be reflected when the two planes of incidence are perpendicular to each other. The light has, therefore, acquired new properties by reflection from the first plate of glass, and is called polarized light, while the modification which the light has experienced by this reflection is called polarization. The plane in which the beam of light is reflected from the first mirror is called the plane of polarization. The angle of polarization is the angle at which a beam of light must be reflected, in order that the polarization may be the most complete. The term polarization was derived from the theory of emission, and it was conceived that each luminous molecule has two poles analogous to the poles of a magnet; but this view is not now held. According to the undulatory theory, ordinary light is produced by vibrations transverse or perpendicular to the direction of the ray, and distributed as to show no distinction as to any particular direction. But when, by any means, these, vibrations are made to take place in one plane, the light is said to be plane polarized. If only a portion of the vibrations lie in one plane the ray is said to be partially polarized. Light may be polarized by several methods other than by reflection, as by refraction through most crystalline media, or by being transmitted obliquely through several plates of glass with parallel faces. If a beam of polarized light be transmitted through a crystal of quartz in the direction of its axis, the plane of polarization will be changed by an angle proportional to the thickness of the crystal. This phenomenon is called rotatory polarization. A beam of light reflected from a metallic surface, or from glass surfaces under certain peculiar conditions, acquires properties still more complex, its vibrations being no longer rectilinear, but circular, or elliptical. This phenomenon is called circular or elliptical polarization. 3. (Elec.)  An effect produced upon the plates of a voltaic battery, or the electrodes in an electrolytic cell, by the deposition upon them of the gases liberated by the action of the current. It is chiefly due to the hydrogen, and results in an increase of the resistance, and the setting up of an opposing electro-motive force, both of which tend materially to weaken the current of the battery, or that passing through the cell."}