{"word":"poll","definition":"A parrot; -- familiarly so called.\n\nOne who does not try for honors, but is content to take a degree merely; a passman. [Cambridge Univ., Eng.]\n\n1. The head; the back part of the head. \"All flaxen was his poll.\" Shak. 2. A number or aggregate of heads; a list or register of heads or individuals. We are the greater poll, and in true fear They gave us our demands. Shak. The muster file, rotten and sound, upon my life, amounts not to fifteen thousand poll. Shak. 3. Specifically, the register of the names of electors who may vote in an election. 4. The casting or recording of the votes of registered electors; as, the close of the poll. All soldiers quartered in place are to remove . . . and not to return till one day after the poll is ended. Blackstone. 5. pl.  The place where the votes are cast or recorded; as, to go to the polls. 6. The broad end of a hammer; the but of an ax. 7. (Zoöl.)  The European chub. See Pollard, 3 (a). Poll book, a register of persons entitled to vote at an election. -- Poll evil (Far.), an inflammatory swelling or abscess on a horse's head, confined beneath the great ligament of the neck. -- Poll pick (Mining), a pole having a heavy spike on the end, forming a kind of crowbar. -- Poll tax, a tax levied by the head, or poll; a capitation tax.\n\n1. To remove the poll or head of; hence, to remove the top or end of; to clip; to lop; to shear; as, to poll the head; to poll a tree. When he [Absalom] pollled his head. 2 Sam. xiv. 26. His death did so grieve them that they polled themselves; they clipped off their horse and mule's hairs. Sir T. North. 2. To cut off; to remove by clipping, shearing, etc.; to mow or crop; -- sometimes with off; as, to poll the hair; to poll wool; to poll grass. Who, as he polled off his dart's head, so sure he had decreed That all the counsels of their war he would poll off like it. Chapman. 3. To extort from; to plunder; to strip. [Obs.] Which polls and pills the poor in piteous wise. Spenser. 4. To impose a tax upon. [Obs.] 5. To pay as one's personal tax. The man that polled but twelve pence for his head. Dryden. 6. To enter, as polls or persons, in a list or register; to enroll, esp. for purposes of taxation; to enumerate one by one. Polling the reformed churches whether they equalize in number those of his three kingdoms. Milton. 7. To register or deposit, as a vote; to elicit or call forth, as votes or voters; as, he polled a hundred votes more than his opponent. And poll for points of faith his trusty vote. Tickell. 8. (Law)  To cut or shave smooth or even; to cut in a straight line without indentation; as, a polled deed. See Dee. Burrill. To poll a jury, to call upon each member of the jury to answer individually as to his concurrence in a verdict which has been rendered.\n\nTo vote at an election. Beaconsfield."}