{"word":"pool","definition":"1. A small and rather deep collection of (usually) fresh water, as one supplied by a spring, or occurring in the course of a stream; a reservoir for water; as, the pools of Solomon. Wyclif. Charity will hardly water the ground where it must first fill a pool. Bacon. The sleepy pool above the dam. Tennyson. 2. A small body of standing or stagnant water; a puddle. \"The filthy mantled pool beyond your cell.\" Shak.\n\n1. The stake played for in certain games of cards, billiards, etc.; an aggregated stake to which each player has contributed a snare; also, the receptacle for the stakes. 2. A game at billiards, in which each of the players stakes a certain sum, the winner taking the whole; also, in public billiard rooms, a game in which the loser pays the entrance fee for all who engage in the game; a game of skill in pocketing the balls on a pool table. Note: This game is played variously, but commonly with fifteen balls, besides one cue ball, the contest being to drive the most balls into the pockets. He plays pool at the billiard houses. Thackeray. 3. In rifle shooting, a contest in which each competitor pays a certain sum for every shot he makes, the net proceeds being divided among the winners. 4. Any gambling or commercial venture in which several persons join. 5. A combination of persons contributing money to be used for the purpose of increasing or depressing the market price of stocks, grain, or other commodities; also, the aggregate of the sums so contributed; as, the pool took all the wheat offered below the limit; he put $10,000 into the pool. 6. (Railroads)  A mutual arrangement between competing lines, by which the receipts of all are aggregated, and then distributed pro rata according to agreement. 7. (Law)  An aggregation of properties or rights, belonging to different people in a community, in a common fund, to be charged with common liabilities. Pin pool, a variety of the game of billiards in which small wooden pins are set up to be knocked down by the balls. -- Pool ball, one of the colored ivory balls used in playing the game at billiards called pool. -- Pool snipe (Zoöl.), the European redshank. [Prov. Eng.] -- Pool table, a billiard table with pockets.\n\nTo put together; to contribute to a common fund, on the basis of a mutual division of profits or losses; to make a common interest of; as, the companies pooled their traffic. Finally, it favors the poolingof all issues. U. S. Grant.\n\nTo combine or contribute with others, as for a commercial, speculative, or gambling transaction."}