{"word":"position","definition":"1. The state of being posited, or placed; the manner in which anything is placed; attitude; condition; as, a firm, an inclined, or an upright position. We have different prospects of the same thing, according to our different positions to it. Locke. 2. The spot where a person or thing is placed or takes a place; site; place; station; situation; as, the position of man in creation; the fleet changed its position. 3. Hence: The ground which any one takes in an argument or controversy; the point of view from which any one proceeds to a discussion; also, a principle laid down as the basis of reasoning; a proposition; a thesis; as, to define one's position; to appear in a false position. Let not the proof of any position depend on the positions that follow, but always on those which go before. I. Watts. 4. Relative place or standing; social or official rank; as, a person of position; hence, office; post; as, to lose one's position. 5. (Arith.)  A method of solving a problem by one or two suppositions; -- called also the rule of trial and error. Angle of position (Astron.), the angle which any line (as that joining two stars) makes with another fixed line, specifically with a circle of declination. -- Double position (Arith.), the method of solving problems by proceeding with each of two assumed numbers, according to the conditions of the problem, and by comparing the difference of the results with those of the numbers, deducing the correction to be applied to one of them to obtain the true result. -- Guns of position (Mil.), heavy fieldpieces, not designed for quick movements. -- Position finder (Mil.), a range finder. See under Range. -- Position micrometer, a micrometer applied to the tube of an astronomical telescope for measuring angles of position in the field of view. -- Single position (Arith.), the method of solving problems, in which the result obtained by operating with an assumed number is to the true result as the number assumed is to the number required. -- Strategic position (Mil.), a position taken up by an army or a large detachment of troops for the purpose of checking or observing an opposing force. Syn. -- Situation; station; place; condition; attitude; posture; proposition; assertion; thesis.\n\nTo indicate the position of; to place. [R.] Encyc. Brit."}