{"word":"pot","definition":"1. A metallic or earthen vessel, appropriated to any of a great variety of uses, as for boiling meat or vegetables, for holding liquids, for plants, etc.; as, a quart pot; a flower pot; a bean pot. 2. An earthen or pewter cup for liquors; a mug. 3. The quantity contained in a pot; a potful; as, a pot of ale. \"Give her a pot and a cake.\" De Foe. 4. A metal or earthenware extension of a flue above the top of a chimney; a chimney pot. 5. A crucible; as, a graphite pot; a melting pot. 6. A wicker vessel for catching fish, eels, etc. 7. A perforated cask for draining sugar. Knight. 8. A size of paper. See Pott. Jack pot. See under 2d Jack. -- Pot cheese, cottage cheese. See under Cottage. -- Pot companion, a companion in drinking. -- Pot hanger, a pothook. -- Pot herb, any plant, the leaves or stems of which are boiled for food, as spinach, lamb's-quarters, purslane, and many others. -- Pot hunter, one who kills anything and everything that will help to fill has bag; also, a hunter who shoots game for the table or for the market. -- Pot metal. (a) The metal from which iron pots are made, different from common pig iron. (b) An alloy of copper with lead used for making large vessels for various purposes in the arts. Ure. (c) A kind of stained glass, the colors of which are incorporated with the melted glass in the pot. Knight. -- Pot plant (Bot.), either of the trees which bear the monkey-pot. -- Pot wheel (Hydraul.), a noria. -- To go to pot, to go to destruction; to come to an end of usefulness; to become refuse. [Colloq.] Dryden. J. G. Saxe.\n\nTo place or inclose in pots; as: (a) To preserve seasoned in pots. \"Potted fowl and fish.\" Dryden. (b) To set out or cover in pots; as, potted plants or bulbs. (c) To drain; as, to pot sugar, by taking it from the cooler, and placing it in hogsheads, etc., having perforated heads, through which the molasses drains off. B. Edwards. (d) (Billiards) To pocket.\n\nTo tipple; to drink. [Obs. or Prov. Eng.] It is less labor to plow than to pot it. Feltham."}