{"word":"potato","definition":"(a) A plant (Solanum tuberosum) of the Nightshade family, and its esculent farinaceous tuber, of which there are numerous varieties used for food. It is native of South America, but a form of the species is found native as far north as New Mexico. (b) The sweet potato (see below). Potato beetle, Potato bug. (Zoöl.) (a) A beetle (Doryphora decemlineata) which feeds, both in the larval and adult stages, upon the leaves of the potato, often doing great damage. Called also Colorado potato beetle, and Doryphora. See Colorado beetle. (b) The Lema trilineata, a smaller and more slender striped beetle which feeds upon the potato plant, bur does less injury than the preceding species. -- Potato fly (Zoöl.), any one of several species of blister beetles infesting the potato vine. The black species (Lytta atrata), the striped (L. vittata), and the gray (L. cinerea, or Fabricii) are the most common. See Blister beetle, under Blister. -- Potato rot, a disease of the tubers of the potato, supposed to be caused by a kind of mold (Peronospora infestans), which is first seen upon the leaves and stems. -- Potato weevil (Zoöl.), an American weevil (Baridius trinotatus) whose larva lives in and kills the stalks of potato vines, often causing serious damage to the crop. -- Potato whisky, a strong, fiery liquor, having a hot, smoky taste, and rich in amyl alcohol (fusel oil); it is made from potatoes or potato starch. -- Potato worm (Zoöl.), the large green larva of a sphinx, or hawk moth (Macrosila quinquemaculata); -- called also tomato worm. See Illust. under Tomato. -- Seaside potato (Bot.), Ipomoea Pes-Capræ, a kind of morning-glory with rounded and emarginate or bilobed leaves. [West Indies] -- Sweet potato (Bot.), a climbing plant (Ipomoea Balatas) allied to the morning-glory. Its farinaceous tubers have a sweetish taste, and are used, when cooked, for food. It is probably a native of Brazil, but is cultivated extensively in the warmer parts of every continent, and even as far north as New Jersey. The name potato was applied to this plant before it was to the Solanum tuberosum, and this is the \"potato\" of the Southern United States. -- Wild potato. (Bot.) (a) A vine (Ipomoea pandurata) having a pale purplish flower and an enormous root. It is common in sandy places in the United States. (b) A similar tropical American plant (I. fastigiata) which it is thought may have been the original stock of the sweet potato."}