{"word":"prick","definition":"1. That which pricks, penetrates, or punctures; a sharp and slender thing; a pointed instrument; a goad; a spur, etc.; a point; a skewer. Pins, wooden pricks, nails, sprigs of rosemary. Shak. It is hard for thee to kick against the pricks. Acts ix. 5. 2. The act of pricking, or the sensation of being pricked; a sharp, stinging pain; figuratively, remorse. \"The pricks of conscience.\" A. Tucker. 3. A mark made by a pointed instrument; a puncture; a point. Hence: (a) A point or mark on the dial, noting the hour. [Obs.] \"The prick of noon.\" Shak. (b) The point on a target at which an archer aims; the mark; the pin. \"They that shooten nearest the prick.\" Spenser. (c) A mark denoting degree; degree; pitch. [Obs.] \"To prick of highest praise forth to advance.\" Spenser. (d) A mathematical point; -- regularly used in old English translations of Euclid. (e) The footprint of a hare. [Obs.] 4. (Naut.)  A small roll; as, a prick of spun yarn; a prick of tobacco.\n\n1. To pierce slightly with a sharp-pointed instrument or substance; to make a puncture in, or to make by puncturing; to drive a fine point into; as, to prick one with a pin, needle, etc.; to prick a card; to prick holes in paper. 2. To fix by the point; to attach or hang by puncturing; as, to prick a knife into a board. Sir I. Newton. The cooks prick it [a slice] on a prong of iron. Sandys. 3. To mark or denote by a puncture; to designate by pricking; to choose; to mark; -- sometimes with off. Some who are pricked for sheriffs. Bacon. Let the soldiers for duty be carefully pricked off. Sir W. Scott. Those many, then, shall die: their names are pricked. Shak. 4. To mark the outline of by puncturing; to trace or form by pricking; to mark by punctured dots; as, to prick a pattern for embroidery; to prick the notes of a musical composition. Cowper. 5. To ride or guide with spurs; to spur; to goad; to incite; to urge on; -- sometimes with on, or off. Who pricketh his blind horse over the fallows. Chaucer. The season pricketh every gentle heart. Chaucer. My duty pricks me on to utter that. Shak. 6. To affect with sharp pain; to sting, as with remorse. \"I was pricked with some reproof.\" Tennyson. Now when they heard this, they were pricked in their heart. Acts ii. 37. 7. To make sharp; to erect into a point; to raise, as something pointed; -- said especially of the ears of an animal, as a horse or dog; and usually followed by up; -- hence, to prick up the ears, to listen sharply; to have the attention and interest strongly engaged. \"The courser . . . pricks up his ears.\" Dryden. 8. To render acid or pungent. [Obs.] Hudibras. 9. To dress; to prink; -- usually with up. [Obs.] 10. (Naut) (a) To run a middle seam through, as the cloth of a sail. (b) To trace on a chart, as a ship's course. 11. (Far.) (a) To drive a nail into (a horse's foot), so as to cause lameness. (b) To nick.\n\n1. To be punctured; to suffer or feel a sharp pain, as by puncture; as, a sore finger pricks. 2. To spur onward; to ride on horseback. Milton. A gentle knight was pricking on the plain. Spenser. 3. To become sharp or acid; to turn sour, as wine. 4. To aim at a point or mark. Hawkins."}