{"word":"pride","definition":"A small European lamprey (Petromyzon branchialis); -- called also prid, and sandpiper.\n\n1. The quality or state of being proud; inordinate self-esteem; an unreasonable conceit of one's own superiority in talents, beauty, wealth, rank, etc., which manifests itself in lofty airs, distance, reserve, and often in contempt of others. Those that walk in pride he is able to abase. Dan. iv. 37. Pride that dines on vanity sups on contempt. Franklin. 2. A sense of one's own worth, and abhorrence of what is beneath or unworthy of one; lofty self-respect; noble self-esteem; elevation of character; dignified bearing; proud delight; -- in a good sense. Thus to relieve the wretched was his pride. Goldsmith. A people which takes no pride in the noble achievements of remote ancestors will never achieve anything worthy to be remembered with pride by remote descendants. Macaulay. 3. Proud or disdainful behavior or treatment; insolence or arrogance of demeanor; haughty bearing and conduct; insolent exultation; disdain. Let not the foot of pride come against me. Ps. xxxvi. 11. That hardly we escaped the pride of France. Shak. 4. That of which one is proud; that which excites boasting or self- gratulation; the occasion or ground of self-esteem, or of arrogant and presumptuous confidence, as beauty, ornament, noble character, children, etc. Lofty trees yclad with summer's pride. Spenser. I will cut off the pride of the Philistines. Zech. ix. 6. A bold peasantry, their country's pride. Goldsmith. 5. Show; ostentation; glory. Pride, pomp, and circumstance of glorious war. Shak. 6. Highest pitch; elevation reached; loftiness; prime; glory; as, to be in the pride of one's life. A falcon, towering in her pride of place. Shak. 7. Consciousness of power; fullness of animal spirits; mettle; wantonness; hence, lust; sexual desire; esp., an excitement of sexual appetite in a female beast. [Obs.] Pride of India, or Pride of China. (Bot.) See Margosa. -- Pride of the desert (Zoöl.), the camel. Syn. -- Self-exaltation; conceit; hauteur; haughtiness; lordliness; loftiness. -- Pride, Vanity. Pride is a high or an excessive esteem of one's self for some real or imagined superiority, as rank, wealth, talents, character, etc. Vanity is the love of being admired, praised, exalted, etc., by others. Vanity is an ostentation of pride; but one may have great pride without displaying it. Vanity, which is etymologically \"emptiness,\" is applied especially to the exhibition of pride in superficialities, as beauty, dress, wealth, etc.\n\nTo indulge in pride, or self-esteem; to rate highly; to plume; -- used reflexively. Bp. Hall. Pluming and priding himself in all his services. South.\n\nTo be proud; to glory. [R.]"}