{"word":"prime","definition":"1. First in order of time; original; primeval; primitive; primary. \"Prime forests.\" Tennyson. She was not the prime cause, but I myself. Milton. Note: In this sense the word is nearly superseded by primitive, except in the phrase prime cost. 2. First in rank, degree, dignity, authority, or importance; as, prime minister. \"Prime virtues.\" Dryden. 3. First in excellence; of highest quality; as, prime wheat; a prime quality of cloth. 4. Early; blooming; being in the first stage. [Poetic] His starry helm, unbuckled, showed him prime In manhood where youth ended. Milton. 5. Lecherous; lustful; lewd. [Obs.] Shak. 6. Marked or distinguished by a mark (') called a prime mark. Prime and ultimate ratio. (Math.). See Ultimate. -- Prime conductor. (Elec.) See under Conductor. -- Prime factor (Arith.), a factor which is a prime number. -- Prime figure (Geom.), a figure which can not be divided into any other figure more simple than itself, as a triangle, a pyramid, etc. -- Prime meridian (Astron.), the meridian from which longitude is reckoned, as the meridian of Greenwich or Washington. -- Prime minister, the responsible head of a ministry or executive government; applied particularly to that of England. -- Prime mover. (Mech.) (a) A natural agency applied by man to the production of power. Especially: Muscular force; the weight and motion of fluids, as water and air; heat obtained by chemical combination, and applied to produce changes in the volume and pressure of steam, air, or other fluids; and electricity, obtained by chemical action, and applied to produce alternation of magnetic force. (b) An engine, or machine, the object of which is to receive and modify force and motion as supplied by some natural source, and apply them to drive other machines; as a water wheel, a water- pressure engine, a steam engine, a hot-air engine, etc. (c) Fig.: The original or the most effective force in any undertaking or work; as, Clarkson was the prime mover in English antislavery agitation. -- Prime number (Arith.), a number which is exactly divisible by no number except itself or unity, as 5, 7, 11. -- Prime vertical (Astron.), the vertical circle which passes through the east and west points of the horizon. -- Prime-vertical dial, a dial in which the shadow is projected on the plane of the prime vertical. -- Prime-vertical transit instrument, a transit instrument the telescope of which revolves in the plane of the prime vertical, -- used for observing the transit of stars over this circle.\n\n1. The first part; the earliest stage; the beginning or opening, as of the day, the year, etc.; hence, the dawn; the spring. Chaucer. In the very prime of the world. Hooker. Hope waits upon the flowery prime. Waller. 2. The spring of life; youth; hence, full health, strength, or beauty; perfection. \"Cut off in their prime.\" Eustace. \"The prime of youth.\" Dryden. 3. That which is first in quantity; the most excellent portion; the best part. Give him always of the prime. Swift. 4. Etym: [F. prime, LL. prima (sc. hora). See Prime, a.]  The morning; specifically (R. C. Ch.), the first canonical hour, succeeding to lauds. Early and late it rung, at evening and at prime. Spenser. Note: Originally, prime denoted the first quarter of the artificial day, reckoned from 6 a. m. to 6 p. m. Afterwards, it denoted the end of the first quarter, that is, 9 a. a. Specifically, it denoted the first canonical hour, as now. Chaucer uses it in all these senses, and also in the sense of def. 1, above. They sleep till that it was pryme large. Chaucer. 5. (Fencing)  The first of the chief guards. 6. (Chem.)  Any number expressing the combining weight or equivalent of any particular element; -- so called because these numbers were respectively reduced to their lowest relative terms on the fixed standard of hydrogen as 1. [Obs. or Archaic] 7. (Arith.)  A prime number. See under Prime, a. 8. An inch, as composed of twelve seconds in the duodecimal system; - - denoted by [']. See 2d Inch, n., 1. Prime of the moon, the new moon at its first appearance.\n\n1. To apply priming to, as a musket or a cannon; to apply a primer to, as a metallic cartridge. 2. To lay the first color, coating, or preparation upon (a surface), as in painting; as, to prime a canvas, a wall. 3. To prepare; to make ready; to instruct beforehand; to post; to coach; as, to prime a witness; the boys are primed for mischief. [Colloq.] Thackeray. 4. To trim or prune, as trees. [Obs. or Prov. Eng.] 5. (Math.)  To mark with a prime mark. To prime a pump, to charge a pump with water, in order to put it in working condition.\n\n1. To be renewed, or as at first. [Obs.] Night's bashful empress, though she often wane, As oft repeats her darkness, primes again. Quarles . 2. To serve as priming for the charge of a gun. 3. To work so that foaming occurs from too violent ebullition, which causes water to become mixed with, and be carried along with, the steam that is formed; -- said of a steam boiler."}