{"word":"primary","definition":"1. First in order of time or development or in intention; primitive; fundamental; original. The church of Christ, in its primary institution. Bp. Pearson. These I call original, or primary, qualities of body. Locke. 2. First in order, as being preparatory to something higher; as, primary assemblies; primary schools. 3. First in dignity or importance; chief; principal; as, primary planets; a matter of primary importance. 4. (Geol.)  Earliest formed; fundamental. 5. (Chem.)  Illustrating, possessing, or characterized by, some quality or property in the first degree; having undergone the first stage of substitution or replacement. Primary alcohol (Organic Chem.), any alcohol which possess the group CH2.OH, and can be oxidized so as to form a corresponding aldehyde and acid having the same number of carbon atoms; -- distinguished from secondary and tertiary alcohols. -- Primary amine (Chem.), an amine containing the amido group, or a derivative of ammonia in which only one atom of hydrogen has been replaced by a basic radical; -- distinguished from secondary and tertiary amines. -- Primary amputation (Surg.), an amputation for injury performed as soon as the shock due to the injury has passed away, and before symptoms of inflammation supervene. -- Primary axis (Bot.), the main stalk which bears a whole cluster of flowers. -- Primary colors. See under Color. -- Primary meeting, a meeting of citizens at which the first steps are taken towards the nomination of candidates, etc. See Caucus. -- Primary pinna (Bot.), one of those portions of a compound leaf or frond which branch off directly from the main rhachis or stem, whether simple or compounded. -- Primary planets. (Astron.) See the Note under Planet. -- Primary qualities of bodies, such are essential to and inseparable from them. -- Primary quills (Zoöl.), the largest feathers of the wing of a bird; primaries. -- Primary rocks (Geol.), a term early used for rocks supposed to have been first formed, being crystalline and containing no organic remains, as granite, gneiss, etc.; -- called also primitive rocks. The terms Secondary, Tertiary, and Quaternary rocks have also been used in like manner, but of these the last two only are now in use. -- Primary salt (Chem.), a salt derived from a polybasic acid in which only one acid hydrogen atom has been replaced by a base or basic radical. -- Primary syphilis (Med.), the initial stage of syphilis, including the period from the development of the original lesion or chancre to the first manifestation of symptoms indicative of general constitutional infection. -- Primary union (Surg.), union without suppuration; union by the first intention.\n\n1. That which stands first in order, rank, or importance; a chief matter. 2. A primary meeting; a caucus. 3. (Zoöl.)  One of the large feathers on the distal joint of a bird's wing. See Plumage, and Illust. of Bird. 4. (Astron.)  A primary planet; the brighter component of a double star. See under Planet."}