{"word":"prize","definition":"1. That which is taken from another; something captured; a thing seized by force, stratagem, or superior power. I will depart my pris, or may prey, by deliberation. Chaucer. His own prize, Whom formerly he had in battle won. Spenser. 2. Hence, specifically; (a) (Law) Anything captured by a belligerent using the rights of war; esp., property captured at sea in virtue of the rights of war, as a vessel. Kent. Brande & C. (b) An honor or reward striven for in a competitive contest; anything offered to be competed for, or as an inducement to, or reward of, effort. I'll never wrestle for prize more. Shak. I fought and conquered, yet have lost the prize. Dryden. (c) That which may be won by chance, as in a lottery. 3. Anything worth striving for; a valuable possession held or in prospect. I press toward the mark for the prize of the high calling of God in Christ Jesus. Phil. iii. 14. 4. A contest for a reward; competition. [Obs.] Shak. 5. A lever; a pry; also, the hold of a lever. [Written also prise.] Prize court, a court having jurisdiction of all captures made in war on the high seas. Bouvier. -- Prize fight, an exhibition contest, esp. one of pugilists, for a stake or wager. -- Prize fighter, one who fights publicly for a reward; -- applied esp. to a professional boxer or pugilist. Pope. -- Prize fighting, fighting, especially boxing, in public for a reward or wager. -- Prize master, an officer put in charge or command of a captured vessel. -- Prize medal, a medal given as a prize. -- Prize money, a dividend from the proceeds of a captured vessel, etc., paid to the captors. -- Prize ring, the ring or inclosure for a prize fight; the system and practice of prize fighting. -- To make prize of, to capture. Hawthorne.\n\nTo move with a lever; to force up or open; to pry. [Written also prise.]\n\n1. To set or estimate the value of; to appraise; to price; to rate. A goodly price that I was prized at. Zech. xi. 13. I prize it [life] not a straw, but for mine honor. Shak. 2. To value highly; to estimate to be of great worth; to esteem. \"[I] do love, prize, honor you. \" Shak. I prized your person, but your crown disdain. Dryden.\n\nEstimation; valuation. [Obs.] Shak."}