{"word":"promise","definition":"1. In general, a declaration, written or verbal, made by one person to another, which binds the person who makes it to do, or to forbear to do, a specified act; a declaration which gives to the person to whom it is made a right to expect or to claim the performance or forbearance of a specified act. For if the inheritance be of the law, it is no more of promise: but God gave it to Abraham by promise. Gal. iii. 18. 2. (Law)  An engagement by one person to another, either in words or in writing, but properly not under seal, for the performance or nonperformance of some particular thing. The word promise is used to denote the mere engagement of a person, without regard to the consideration for it, or the corresponding duty of the party to whom it is made. Chitty. Parsons. Burrill. 3. That which causes hope, expectation, or assurance; especially, that which affords expectation of future distinction; as, a youth of great promise. Shak. My native country was full of youthful promise. W. Irving. 4. Bestowal, fulfillment, or grant of what is promised. He . . . commanded them that they should not depart from Jerusalem, but wait for the promise of the Father. Acts i. 4.\n\n1. To engage to do, give, make, or to refrain from doing, giving, or making, or the like; to covenant; to engage; as, to promise a visit; to promise a cessation of hostilities; to promise the payment of money. \"To promise aid.\" Shak. 2. To afford reason to expect; to cause hope or assurance of; as, the clouds promise rain. Milton. 3. To make declaration of or give assurance of, as some benefit to be conferred; to pledge or engage to bestow; as, the proprietors promised large tracts of land; the city promised a reward. Promised land. See Land of promise, under Land. -- To promise one's self. (a) To resolve; to determine; to vow. (b) To be assured; to have strong confidence. I dare promise myself you will attest the truth of all I have advanced. Rambler.\n\n1. To give assurance by a promise, or binding declaration. 2. To afford hopes or expectation; to give ground to expect good; rarely, to give reason to expect evil. Will not the ladies be afeard of the lion I fear it, I promise you. Shak."}