{"word":"proportion","definition":"1. The relation or adaptation of one portion to another, or to the whole, as respect magnitude, quantity, or degree; comparative relation; ratio; as, the proportion of the parts of a building, or of the body. The image of Christ, made after his own proportion. Ridley. Formed in the best proportions of her sex. Sir W. Scott. Documents are authentic and facts are true precisely in proportion to the support which they afford to his theory. Macaulay. 2. Harmonic relation between parts, or between different things of the same kind; symmetrical arrangement or adjustment; symmetry; as, to be out of proportion. \"Let us prophesy according to the proportion of faith.\" Rom. xii. 6. 3. The portion one receives when a whole is distributed by a rule or principle; equal or proper share; lot. Let the women . . . do the same things in their proportions and capacities. Jer. Taylor. 4. A part considered comparatively; a share. 5. (Math.) (a) The equality or similarity of ratios, especially of geometrical ratios; or a relation among quantities such that the quotient of the first divided by the second is equal to that of the third divided by the fourth; -- called also geometrical proportion, in distinction from arithmetical proportion, or that in which the difference of the first and second is equal to the difference of the third and fourth. Note: Proportion in the mathematical sense differs from ratio. Ratio is the relation of two quantities of the same kind, as the ratio of 5 to 10, or the ratio of 8 to 16. Proportion is the sameness or likeness of two such relations. Thus, 5 to 10 as 8 to 16; that is, 5 bears the same relation to 10 as 8 does to 16. Hence, such numbers are said to be in proportion. Proportion is expressed by symbols thus: a:b::c:d, or a:b = c:d, or a/b = c/d. (b) The rule of three, in arithmetic, in which the three given terms, together with the one sought, are proportional. Continued proportion, Inverse proportion, etc. See under Continued, Inverse, etc. -- Harmonical, or Musical, proportion, a relation of three or four quantities, such that the first is to the last as the difference between the first two is to the difference between the last two; thus, 2, 3, 6, are in harmonical proportion; for 2 is to 6 as 1 to 3. Thus, 24, 16, 12, 9, are harmonical, for 24:9::8:3. -- In proportion, according as; to the degree that. \"In proportion as they are metaphysically true, they are morally and politically false.\" Burke.\n\n1. To adjust in a suitable proportion, as one thing or one part to another; as, to proportion the size of a building to its height; to proportion our expenditures to our income. In the loss of an object we do not proportion our grief to the real value . . . but to the value our fancies set upon it. Addison. 2. To form with symmetry or suitableness, as the parts of the body. Nature had proportioned her without any fault. Sir P. Sidney. 3. To divide into equal or just shares; to apportion."}