{"word":"proper","definition":"1. Belonging to one; one's own; individual. \"His proper good\" [i. e., his own possessions]. Chaucer. \"My proper son.\" Shak. Now learn the difference, at your proper cost, Betwixt true valor and an empty boast. Dryden. 2. Belonging to the natural or essential constitution; peculiar; not common; particular; as, every animal has his proper instincts and appetites. Those high and peculiar attributes . . . which constitute our proper humanity. Coleridge. 3. Befitting one's nature, qualities, etc.; suitable in all respect; appropriate; right; fit; decent; as, water is the proper element for fish; a proper dress. The proper study of mankind is man. Pope. In Athens all was pleasure, mirth, and play, All proper to the spring, and sprightly May. Dryden. 4. Becoming in appearance; well formed; handsome. [Archaic] \"Thou art a proper man.\" Chaucer. Moses . . . was hid three months of his parents, because they saw he was a proper child. Heb. xi. 23. 5. Pertaining to one of a species, but not common to the whole; not appellative; -- opposed to common; as, a proper name; Dublin is the proper name of a city. 6. Rightly so called; strictly considered; as, Greece proper; the garden proper. 7. (Her.)  Represented in its natural color; -- said of any object used as a charge. In proper, individually; privately. [Obs.] Jer. Taylor. -- Proper flower or corolla (Bot.), one of the single florets, or corollets, in an aggregate or compound flower. -- Proper fraction (Arith.) a fraction in which the numerator is less than the denominator. -- Proper nectary (Bot.), a nectary separate from the petals and other parts of the flower. -- Proper noun (Gram.), a name belonging to an individual, by which it is distinguished from others of the same class; -- opposed to Ant: common noun; as, John, Boston, America. -- Proper perianth or involucre (Bot.), that which incloses only a single flower. -- Proper receptacle (Bot.), a receptacle which supports only a single flower or fructification.\n\nProperly; hence, to a great degree; very; as, proper good. [Colloq & Vulgar]"}