{"word":"pulse","definition":"Leguminous plants, or their seeds, as beans, pease, etc. If all the world Should, in a pet of temperance, feed on pulse. Milton.\n\n1. (Physiol.)  The beating or throbbing of the heart or blood vessels, especially of the arteries. Note: In an artery the pulse is due to the expansion and contraction of the elastic walls of the artery by the action of the heart upon the column of blood in the arterial system. On the commencement of the diastole of the ventricle, the semilunar valves are closed, and the aorta recoils by its elasticity so as to force part of its contents into the vessels farther onwards. These, in turn, as they already contain a certain quantity of blood, expand, recover by an elastic recoil, and transmit the movement with diminished intensity. Thus a series of movements, gradually diminishing in intensity, pass along the arterial system (see the Note under Heart). For the sake of convenience, the radial artery at the wrist is generally chosen to detect the precise character of the pulse. The pulse rate varies with age, position, sex, stature, physical and psychical influences, etc. 2. Any measured or regular beat; any short, quick motion, regularly repeated, as of a medium in the transmission of light, sound, etc.; oscillation; vibration; pulsation; impulse; beat; movement. The measured pulse of racing oars. Tennyson. When the ear receives any simple sound, it is struck by a single pulse of the air, which makes the eardrum and the other membranous parts vibrate according to the nature and species of the stroke. Burke. Pulse glass, an instrument consisting to a glass tube with terminal bulbs, and containing ether or alcohol, which the heat of the hand causes to boil; -- so called from the pulsating motion of the liquid when thus warmed. Pulse wave (Physiol.), the wave of increased pressure started by the ventricular systole, radiating from the semilunar valves over the arterial system, and gradually disappearing in the smaller branches. the pulse wave travels over the arterial system at the rate of about 29.5 feet in a second. H. N. Martin. -- To feel one's pulse. (a) To ascertain, by the sense of feeling, the condition of the arterial pulse. (b) Hence, to sound one's opinion; to try to discover one's mind.\n\nTo beat, as the arteries; to move in pulses or beats; to pulsate; to throb. Ray.\n\nTo drive by a pulsation; to cause to pulsate. [R.]"}