{"word":"quadrant","definition":"1. The fourth part; the quarter. [Obs.] Sir T. Browne. 2. (Geom.)  The quarter of a circle, or of the circumference of a circle, an arc of 90º, or one subtending a right angle at the center. 3. (Anal. (Geom.)  One of the four parts into which a plane is divided by the coördinate axes. The upper right-hand part is the first quadrant; the upper left-hand part the second; the lower left-hand part the third; and the lower right-hand part the fourth quadrant. 4. An instrument for measuring altitudes, variously constructed and mounted for different specific uses in astronomy, surveying, gunnery, etc., consisting commonly of a graduated arc of 90º, with an index or vernier, and either plain or telescopic sights, and usually having a plumb line or spirit level for fixing the vertical or horizontal direction. Gunner's quadrant, an instrument consisting of a graduated limb, with a plumb line or spirit level, and an arm by which it is applied to a cannon or mortar in adjusting it to the elevation required for attaining the desired range. -- Gunter's quadrant. See Gunter's quadrant, in the Vocabulary. Hadley's quadrant, a hand instrument used chiefly at sea to measure the altitude of the sun or other celestial body in ascertaining the vessel's position. It consists of a frame in the form of an octant having a graduated scale upon its arc, and an index arm, or alidade pivoted at its apex. Mirrors, called the index glass and the horizon glass, are fixed one upon the index arm and the other upon one side of the frame, respectively. When the instrument is held upright, the index arm may be swung so that the index glass will reflect an image of the sun upon the horizon glass, and when the reflected image of the sun coincides, to the observer's eye, with the horizon as seen directly through an opening at the side of the horizon glass, the index shows the sun's altitude upon the scale; -- more properly, but less commonly, called an octant. -- Quadrant of altitude, an appendage of the artificial globe, consisting of a slip of brass of the length of a quadrant of one of the great circles of the globe, and graduated. It may be fitted to the meridian, and being movable round to all points of the horizon, serves as a scale in measuring altitudes, azimuths, etc."}