{"word":"quail","definition":"1. To die; to perish; hence, to wither; to fade. [Obs.] Spenser. 2. To become quelled; to become cast down; to sink under trial or apprehension of danger; to lose the spirit and power of resistance; to lose heart; to give way; to shrink; to cower. The atheist power shall quail, and confess his fears. I. Taylor. Stouter hearts than a woman's have quailed in this terrible winter. Longfellow. Syn. -- to cower; flinch; shrink; quake; tremble; blench; succumb; yield.\n\nTo cause to fail in spirit or power; to quell; to crush; to subdue. [Obs.] Spenser.\n\nTo curdle; to coagulate, as milk. [Obs.] Holland.\n\n1. (Zoöl.)  Any gallinaceous bird belonging to Coturnix and several allied genera of the Old World, especially the common European quail (C. communis), the rain quail (C. Coromandelica) of India, the stubble quail (C. pectoralis), and the Australian swamp quail (Synoicus australis). 2. (Zoöl.)  Any one of several American partridges belonging to Colinus, Callipepla, and allied genera, especially the bobwhite (called Virginia quail, and Maryland quail), and the California quail (Calipepla Californica). 3. (Zoöl.)  Any one of numerous species of Turnix and allied genera, native of the Old World, as the Australian painted quail (Turnix varius). See Turnix. 4. A prostitute; -- so called because the quail was thought to be a very amorous bird.[Obs.] Shak. Bustard quail (Zoöl.), a small Asiatic quail-like bird of the genus Turnix, as T. taigoor, a black-breasted species, and the hill bustard quail (T. ocellatus). See Turnix. -- Button quail (Zoöl.), one of several small Asiatic species of Turnix, as T. Sykesii, which is said to be the smallest game bird of India. -- Mountain quail. See under Mountain. -- Quail call, a call or pipe for alluring quails into a net or within range. -- Quail dove (Zoöl.), any one of several American ground pigeons belonging to Geotrygon and allied genera. -- Quail hawk (Zoöl.), the New Zealand sparrow hawk (Hieracidea Novæ-Hollandiæ). -- Quail pipe. See Quail call, above. -- Quail snipe (Zoöl.), the dowitcher, or red-breasted snipe; -- called also robin snipe, and brown snipe. -- Sea quail (Zoöl.), the turnstone. [Local, U. S.]"}