{"word":"quantity","definition":"1. The attribute of being so much, and not more or less; the property of being measurable, or capable of increase and decrease, multiplication and division; greatness; and more concretely, that which answers the question \"How much\"; measure in regard to bulk or amount; determinate or comparative dimensions; measure; amount; bulk; extent; size. Hence, in specific uses: (a) (Logic) The extent or extension of a general conception, that is, the number of species or individuals to which it may be applied; also, its content or comprehension, that is, the number of its constituent qualities, attributes, or relations. (b) (Gram.) The measure of a syllable; that which determines the time in which it is pronounced; as, the long or short quantity of a vowel or syllable. (c) (Mus.) The relative duration of a tone. 2. That which can be increased, diminished, or measured; especially (Math.), anything to which mathematical processes are applicable. Note: Quantity is discrete when it is applied to separate objects, as in number; continuous, when the parts are connected, either in succession, as in time, motion, etc., or in extension, as by the dimensions of space, viz., length, breadth, and thickness. 3. A determinate or estimated amount; a sum or bulk; a certain portion or part; sometimes, a considerable amount; a large portion, bulk, or sum; as, a medicine taken in quantities, that is, in large quantities. The quantity of extensive and curious information which he had picked up during many months of desultory, but not unprofitable, study. Macaulay. Quantity of estate (Law), its time of continuance, or degree of interest, as in fee, for life, or for years. Wharton (Law Dict. ) -- Quantity of matter, in a body, its mass, as determined by its weight, or by its momentum under a given velocity. -- Quantity of motion (Mech.), in a body, the relative amount of its motion, as measured by its momentum, varying as the product of mass and velocity. -- Known quantities (Math.), quantities whose values are given. -- Unknown quantities (Math.), quantities whose values are sought."}