{"word":"quarrel","definition":"1. An arrow for a crossbow; -- so named because it commonly had a square head. [Obs.] To shoot with arrows and quarrel. Sir J. Mandeville. Two arblasts, . . . with windlaces and quarrels. Sir W. Scott. 2. (Arch.)  Any small square or quadrangular member; as: (a) A square of glass, esp. when set diagonally. (b) A small opening in window tracery, of which the cusps, etc., make the form nearly square. (c) A square or lozenge-shaped paving tile. 3. A glazier's diamond. Simmonds. 4. A four-sided cutting tool or chisel having a diamond-shaped end.\n\n1. A breach of concord, amity, or obligation; a falling out; a difference; a disagreement; an antagonism in opinion, feeling, or conduct; esp., an angry dispute, contest, or strife; a brawl; an altercation; as, he had a quarrel with his father about expenses. I will bring a sword upon you that shall avenge the quarrel of my covenant. Lev. xxvi. 25. On open seas their quarrels they debate. Dryden. 2. Ground of objection, dislike, difference, or hostility; cause of dispute or contest; occasion of altercation. Herodias had a quarrel against him, and would have killed him. Mark vi. 19. No man hath any quarrel to me. Shak. He thought he had a good quarrel to attack him. Holinshed. 3. Earnest desire or longing. [Obs.] Holland. To pick a quarrel. See under Pick, v. t. Syn. -- Brawl; broil; squabble; affray; feud; tumult; contest; dispute; altercation; contention; wrangle.\n\n1. To violate concord or agreement; to have a difference; to fall out; to be or become antagonistic. Our people quarrel with obedience. Shak. But some defect in her Did quarrel with the noblest grace she owed. Shak. 2. To dispute angrily, or violently; to wrangle; to scold; to altercate; to contend; to fight. Beasts called sociable quarrel in hunger and lust. Sir W. Temple. 3. To find fault; to cavil; as, to quarrel with one's lot. I will not quarrel with a slight mistake. Roscommon.\n\n1. To quarrel with. [R.] \"I had quarelled my brother purposely.\" B. Jonson. 2. To compel by a quarrel; as, to quarrel a man out of his estate or rights.\n\nOne who quarrels or wrangles; one who is quarrelsome. Shak."}