{"word":"queen","definition":"1. The wife of a king. 2. A woman who is the sovereign of a kingdom; a female monarch; as, Elizabeth, queen of England; Mary, queen of Scots. In faith, and by the heaven's quene. Chaucer. 3. A woman eminent in power or attractions; the highest of her kind; as, a queen in society; -- also used figuratively of cities, countries, etc. \" This queen of cities.\" \" Albion, queen of isles.\" Cowper. 4. The fertile, or fully developed, female of social bees, ants, and termites. 5 5, (Chess)  The most powerful, and except the king the most important, piece in a set of chessmen. 6. A playing card bearing the picture of a queen; as, the queen of spades.  A male homosexual, esp. one who is effeminate or dresses in women's clothing. Sometimes pejorative. Queen apple. Etym: [Cf. OE. quyne aple quince apple.] A kind of apple; a queening. \"Queen apples and red cherries.\" Spenser. -- Queen bee (Zoöl.), a female bee, especially the female of the honeybee. See Honeybee. -- Queen conch (Zoöl.), a very large West Indian cameo conch (Cassis cameo). It is much used for making cameos. -- Queen consort, the wife of a reigning king. Blackstone. -- Queen dowager, the widow of a king. -- Queen gold, formerly a revenue of the queen consort of England, arising from gifts, fines, etc. -- Queen mother, a queen dowager who is also mother of the reigning king or queen. -- Queen of May. See May queen, under May. -- Queen of the meadow (Bot.), a European herbaceous plant (Spiræa Ulmaria). See Meadowsweet. -- Queen of the prairie (Bot.), an American herb (Spiræa lobata) with ample clusters of pale pink flowers. -- Queen pigeon (Zoöl.), any one of several species of very large and handsome crested ground pigeons of the genus Goura, native of New Guinea and the adjacent islands. They are mostly pale blue, or ash- blue, marked with white, and have a large occipital crest of spatulate feathers. Called also crowned pigeon, goura, and Victoria pigeon. -- Queen regent, or Queen regnant, a queen reigning in her own right. -- Queen's Bench. See King's Bench. -- Queen's counsel, Queen's evidence. See King's counsel, King's evidence, under King. -- Queen's delight (Bot.), an American plant (Stillinqia sylvatica) of the Spurge family, having an herbaceous stem and a perennial woody root. -- Queen's metal (Metal.), an alloy somewhat resembling pewter or britannia, and consisting essentially of tin with a slight admixture of antimony, bismuth, and lead or copper. -- Queen's pigeon. (Zoöl.) Same as Queen pigeon, above. -- Queen's ware, glazed English earthenware of a cream color. -- Queen's yellow (Old Chem.), a heavy yellow powder consisting of a basic mercuric sulphate; -- formerly called turpetum minerale, or Turbith's mineral.\n\nTo act the part of a queen. Shak.\n\nTo make a queen (or other piece, at the player's discretion) of by moving it to the eighth row; as, to queen a pawn."}