{"word":"question","definition":"1. The act of asking; interrogation; inquiry; as, to examine by question and answer. 2. Discussion; debate; hence, objection; dispute; doubt; as, the story is true beyond question; he obeyed without question. There arose a question between some of John's disciples and the Jews about purifying. John iii. 25. It is to be to question, whether it be lawful for Christian princes to make an invasive war simply for the propagation of the faith. Bacon. 3. Examination with reference to a decisive result; investigation; specifically, a judicial or official investigation; also, examination under torture. Blackstone. He that was in question for the robbery. Shak. The Scottish privy council had power to put state prisoners to the question. Macaulay. 4. That which is asked; inquiry; interrogatory; query. But this question asked Puts me in doubt. Lives there who loves his pain Milton. 5. Hence, a subject of investigation, examination, or debate; theme of inquiry; matter to be inquired into; as, a delicate or doubtful question. 6. Talk; conversation; speech; speech.[Obs.] Shak. In question, in debate; in the course of examination or discussion; as, the matter or point in question. -- Leading question. See under Leading. -- Out of question, unquestionably. \"Out of question, 't is Maria's hand.\" Shak. -- Out of the question. See under Out. -- Past question, beyond question; certainly; undoubtedly; unquestionably. -- Previous question, a question put to a parliamentary assembly upon the motion of a member, in order to ascertain whether it is the will of the body to vote at once, without further debate, on the subject under consideration. Note: The form of the question is: \"Shall the main question be now put\" If the vote is in the affirmative, the matter before the body must be voted upon as it then stands, without further general debate or the submission of new amendments. In the House of Representatives of the United States, and generally in America, a negative decision operates to keep the business before the body as if the motion had not been made; but in the English Parliament, it operates to postpone consideration for the day, and until the subject may be again introduced. In American practice, the object of the motion is to hasten action, and it is made by a friend of the measure. In English practice, the object is to get rid of the subject for the time being, and the motion is made with a purpose of voting against it. Cushing. -- To beg the question. See under Beg. -- To the question, to the point in dispute; to the real matter under debate. Syn. -- Point; topic; subject.\n\n1. To ask questions; to inquire. He that questioneth much shall lean much. Bacon. 2. To argue; to converse; to dispute. [Obs.] I pray you, think you question with the Jew. Shak.\n\n1. To inquire of by asking questions; to examine by interrogatories; as, to question a witness. 2. To doubt of; to be uncertain of; to query. And most we question what we most desire. Prior. 3. To raise a question about; to call in question; to make objection to. \"But have power and right to question thy bold entrance on this place.\" Milton. 4. To talk to; to converse with. With many holiday and lady terms he questioned me. Shak. Syn. -- To ask; interrogate; catechise; doubt; controvert; dispute. -- Question, Inquire, Interrogate. To inquire is merely to ask for information, and implies no authority in the one who asks. To interrogate is to put repeated questions in a formal or systematic fashion to elicit some particular fact or facts. To question has a wider sense than to interrogate, and often implies an attitude of distrust or opposition on the part of the questioner."}