{"word":"rack","definition":"Same as Arrack.\n\nThe neck and spine of a fore quarter of veal or mutton.\n\nA wreck; destruction. [Obs., except in a few phrases.] Rack and ruin, destruction; utter ruin. [Colloq.] -- To go to rack, to perish; to be destroyed. [Colloq.] \"All goes to rack.\" Pepys.\n\nThin, flying, broken clouds, or any portion of floating vapor in the sky. Shak. The winds in the upper region, which move the clouds above, which we call the rack, . . . pass without noise. Bacon. And the night rack came rolling up. C. Kingsley.\n\nTo fly, as vapor or broken clouds.\n\nTo amble fast, causing a rocking or swaying motion of the body; to pace; -- said of a horse. Fuller.\n\nA fast amble.\n\nTo draw off from the lees or sediment, as wine. It is in common practice to draw wine or beer from the lees (which we call racking), whereby it will clarify much the sooner. Bacon. Rack vintage, wine cleansed and drawn from the lees. Cowell.\n\n1. An instrument or frame used for stretching, extending, retaining, or displaying, something. Specifically: (a) An engine of torture, consisting of a large frame, upon which the body was gradually stretched until, sometimes, the joints were dislocated; -- formerly used judicially for extorting confessions from criminals or suspected persons. During the troubles of the fifteenth century, a rack was introduced into the Tower, and was occasionally used under the plea of political necessity. Macaulay. (b) An instrument for bending a bow. (c) A grate on which bacon is laid. (d) A frame or device of various construction for holding, and preventing the waste of, hay, grain, etc., supplied to beasts. (e) A frame on which articles are deposited for keeping or arranged for display; as, a clothes rack; a bottle rack, etc. (f) (Naut.) A piece or frame of wood, having several sheaves, through which the running rigging passes; -- called also rack block. Also, a frame to hold shot. (g) (Mining) A frame or table on which ores are separated or washed. (h) A frame fitted to a wagon for carrying hay, straw, or grain on the stalk, or other bulky loads. (i) A distaff. 2. (Mech.)  A bar with teeth on its face, or edge, to work with those of a wheel, pinion, or worm, which is to drive it or be driven by it. 3. That which is extorted; exaction. [Obs.] Sir E. Sandys. Mangle rack. (Mach.) See under Mangle. n. -- Rack block. (Naut.) See def. 1 (f), above. -- Rack lashing, a lashing or binding where the rope is tightened, and held tight by the use of a small stick of wood twisted around. -- Rack rail (Railroads), a toothed rack, laid as a rail, to afford a hold for teeth on the driving wheel of locomotive for climbing steep gradients, as in ascending a mountain. -- Rack saw, a saw having wide teeth. -- Rack stick, the stick used in a rack lashing. -- To be on the rack, to suffer torture, physical or mental. -- To live at rack and manger, to live on the best at another's expense. [Colloq.] -- To put to the rack, to subject to torture; to torment. A fit of the stone puts a kingto the rack, and makes him as miserable as it does the meanest subject. Sir W. Temple.\n\n1. To extend by the application of force; to stretch or strain; specifically, to stretch on the rack or wheel; to torture by an engine which strains the limbs and pulls the joints. He was racked and miserably tormented. Pope. 2. To torment; to torture; to affect with extreme pain or anguish. Vaunting aloud but racked with deep despair. Milton. 3. To stretch or strain, in a figurative sense; hence, to harass, or oppress by extortion. The landlords there shamefully rack their tenants. Spenser. They [landlords] rack a Scripture simile beyond the true intent thereof. Fuller. Try what my credit can in Venice do; That shall be racked even to the uttermost. Shak. 4. (Mining)  To wash on a rack, as metals or ore. 5. (Naut.)  To bind together, as two ropes, with cross turns of yarn, marline, etc. To rack one's brains or wits, to exert them to the utmost for the purpose of accomplishing something. Syn. -- To torture; torment; rend; tear."}