{"word":"railroad","definition":"1. A road or way consisting of one or more parallel series of iron or steel rails, patterned and adjusted to be tracks for the wheels of vehicles, and suitably supported on a bed or substructure. Note: The modern railroad is a development and adaptation of the older tramway. 2. The road, track, etc., with al the lands, buildings, rolling stock, franchises, etc., pertaining to them and constituting one property; as, certain railroad has been put into the hands of a receiver. Note: Railway is the commoner word in England; railroad the commoner word in the United States. Note: In the following and similar phrases railroad and railway are used interchangeably: --Atmospheric railway, Elevated railway, etc. See under Atmospheric, Elevated, etc. -- Cable railway. See Cable road, under Cable. -- Perry railway, a submerged track on which an elevated platform runs, fro carrying a train of cars across a water course. -- Gravity railway, a railway, in a hilly country, on which the cars run by gravity down gentle slopes for long distances after having been hauled up steep inclines to an elevated point by stationary engines. -- Railway brake, a brake used in stopping railway cars or locomotives. -- Railway car, a large, heavy vehicle with flanged wheels fitted for running on a railway. [U.S.] -- Railway carriage, a railway passenger car. [Eng.] -- Railway scale, a platform scale bearing a track which forms part of the line of a railway, for weighing loaded cars. -- Railway slide. See Transfer table, under Transfer. -- Railway spine (Med.), an abnormal condition due to severe concussion of the spinal cord, such as occurs in railroad accidents. It is characterized by ataxia and other disturbances of muscular function, sensory disorders, pain in the back, impairment of general health, and cerebral disturbance, -- the symptoms often not developing till some months after the injury. -- Underground railroad or railway. (a) A railroad or railway running through a tunnel, as beneath the streets of a city. (b) Formerly, a system of coöperation among certain active antislavery people in the United States, by which fugitive slaves were secretly helped to reach Canada. Note: [In the latter sense railroad, and not railway, was used.] \"Their house was a principal entrepôt of the underground railroad.\" W. D. Howells."}