{"word":"rank","definition":"1. Luxuriant in growth; of vigorous growth; exuberant; grown to immoderate height; as, rank grass; rank weeds. And, behold, seven ears of corn came up upon one stalk, rank and good. Gen. xli. 5. 2. Raised to a high degree; violent; extreme; gross; utter; as, rank heresy. \"Rank nonsense.\" Hare. \"I do forgive thy rankest fault.\" Shak. 3. Causing vigorous growth; producing luxuriantly; very rich and fertile; as, rank land. Mortimer. 4. Strong-scented; rancid; musty; as, oil of a rank smell; rank- smelling rue. Spenser. 5. Strong to the taste. \"Divers sea fowls taste rank of the fish on which they feed.\" Boyle. 6. Inflamed with venereal appetite. [Obs.] Shak. Rank modus (Law), an excessive and unreasonable modus. See Modus, 3. -- To set (the iron of a plane, etc.) rank, to set so as to take off a thick shaving. Moxon.\n\nRankly; stoutly; violently. [Obs.] That rides so rank and bends his lance so fell. Fairfax.\n\n1. A row or line; a range; an order; a tier; as, a rank of osiers. Many a mountain nigh Rising in lofty ranks, and loftier still. Byron. 2. (Mil.)  A line of soldiers ranged side by side; -- opposed to file. See 1st File, 1 (a). Fierce, fiery warriors fought upon the clouds, In ranks and squadrons and right form of war. Shak. 3. Grade of official standing, as in the army, navy, or nobility; as, the rank of general; the rank of admiral. 4. An aggregate of individuals classed together; a permanent social class; an order; a division; as, ranks and orders of men; the highest and the lowest ranks of men, or of other intelligent beings. 5. Degree of dignity, eminence, or excellence; position in civil or social life; station; degree; grade; as, a writer of the first rank; a lawyer of high rank. These all are virtues of a meaner rank. Addison. 6. Elevated grade or standing; high degree; high social position; distinction; eminence; as, a man of rank. Rank and file. (a) (Mil.) The whole body of common soldiers, including also corporals. In a more extended sense, it includes sergeants also, excepting the noncommissioned staff. (b) See under 1st File. -- The ranks, the order or grade of common soldiers; as, to reduce a noncommissioned officer to the ranks. -- To fill the ranks, to supply the whole number, or a competent number. -- To take rank of, to have precedence over, or to have the right of taking a higher place than.pull rank, to insist on one's own prerogative or plan of action, by right of a higher rank than that of one suggesting a different plan\n\n1. To place abreast, or in a line. 2. To range in a particular class, order, or division; to class; also, to dispose methodically; to place in suitable classes or order; to classify. Ranking all things under general and special heads. I. Watts. Poets were ranked in the class of philosophers. Broome. Heresy is ranked with idolatry and witchcraft. Dr. H. More. 3. To take rank of; to outrank. [U.S.]\n\n1. To be ranged; to be set or disposed, an in a particular degree, class, order, or division. Let that one article rank with the rest. Shak. 2. To have a certain grade or degree of elevation in the orders of civil or military life; to have a certain degree of esteem or consideration; as, he ranks with the first class of poets; he ranks high in public estimation."}