{"word":"rat","definition":"1. (Zoöl.)  One of the several species of small rodents of the genus Mus and allied genera, larger than mice, that infest houses, stores, and ships, especially the Norway, or brown, rat (M. Alexandrinus). These were introduced into Anerica from the Old World. 2. A round and tapering mass of hair, or similar material, used by women to support the puffs and rolls of their natural hair. [Local, U.S.] 3. One who deserts his party or associates; hence, in the trades, one who works for lower wages than those prescribed by a trades union. [Cant] Note: \"It so chanced that, not long after the accession of the house of Hanover, some of the brown, that is the German or Norway, rats, were first brought over to this country (in some timber as is said); and being much stronger than the black, or, till then, the common, rats, they in many places quite extirpated the latter. The word (both the noun and the verb to rat) was first, as we have seen, leveled at the converts to the government of George the First, but has by degrees obtained a wide meaning, and come to be applied to any sudden and mercenary change in politics.\" Lord Mahon. Bamboo rat (Zoöl.), any Indian rodent of the genus Rhizomys. -- Beaver rat, Coast rat. (Zoöl.) See under Beaver and Coast. -- Blind rat (Zoöl.), the mole rat. -- Cotton rat (Zoöl.), a long-haired rat (Sigmodon hispidus), native of the Southern United States and Mexico. It makes its nest of cotton and is often injurious to the crop. -- Ground rat. See Ground Pig, under Ground. -- Hedgehog rat. See under Hedgehog. -- Kangaroo rat (Zoöl.), the potoroo. -- Norway rat (Zoöl.), the common brown rat. See Rat. -- Pouched rat. (Zoöl.) (a) See Pocket Gopher, under Pocket. (b) Any African rodent of the genus Cricetomys. Rat Indians (Ethnol.), a tribe of Indians dwelling near Fort Ukon, Alaska. They belong to Athabascan stock. -- Rat mole. (Zoöl.) See Mole rat, under Mole. -- Rat pit, an inclosed space into which rats are put to be killed by a dog for sport. -- Rat snake (Zoöl.), a large colubrine snake (Ptyas mucosus) very common in India and Ceylon. It enters dwellings, and destroys rats, chickens, etc. -- Spiny rat (Zoöl.), any South America rodent of the genus Echinomys. -- To smell a rat. See under Smell. -- Wood rat (Zoöl.), any American rat of the genus Neotoma, especially N. Floridana, common in the Southern United States. Its feet and belly are white.\n\n1. In English politics, to desert one's party from interested motives; to forsake one's associates for one's own advantage; in the trades, to work for less wages, or on other conditions, than those established by a trades union. Coleridge . . . incurred the reproach of having ratted, solely by his inability to follow the friends of his early days. De Quincey. 2. To catch or kill rats."}