{"word":"ray","definition":"1. To array. [Obs.] Sir T. More. 2. To mark, stain, or soil; to streak; to defile. [Obs.] \"The fifth that did it ray.\" Spenser.\n\nArray; order; arrangement; dress. [Obs.] And spoiling all her gears and goodly ray. Spenser.\n\n1. One of a number of lines or parts diverging from a common point or center, like the radii of a circle; as, a star of six rays. 2. (Bot.)  A radiating part of the flower or plant; the marginal florets of a compound flower, as an aster or a sunflower; one of the pedicels of an umbel or other circular flower cluster; radius. See Radius. 3. (Zoöl.) (a) One of the radiating spines, or cartilages, supporting the fins of fishes. (b) One of the spheromeres of a radiate, especially one of the arms of a starfish or an ophiuran. 4. (Physics) (a) A line of light or heat proceeding from a radiant or reflecting point; a single element of light or heat propagated continuously; as, a solar ray; a polarized ray. (b) One of the component elements of the total radiation from a body; any definite or limited portion of the spectrum; as, the red ray; the violet ray. See Illust. under Light. 5. Sight; perception; vision; -- from an old theory of vision, that sight was something which proceeded from the eye to the object seen. All eyes direct their rays On him, and crowds turn coxcombs as they gaze. Pope. 6. (Geom.)  One of a system of diverging lines passing through a point, and regarded as extending indefinitely in both directions. See Half-ray. Bundle of rays. (Geom.) See Pencil of rays, below. -- Extraordinary ray (Opt.), that one or two parts of a ray divided by double refraction which does not follow the ordinary law of refraction. -- Ordinary ray (Opt.) that one of the two parts of a ray divided by double refraction which follows the usual or ordinary law of refraction. -- Pencil of rays (Geom.), a definite system of rays. -- Ray flower, or Ray floret (Bot.), one of the marginal flowers of the capitulum in such composite plants as the aster, goldenrod, daisy, and sunflower. They have an elongated, strap-shaped corolla, while the corollas of the disk flowers are tubular and five-lobed. -- Ray point (Geom.), the common point of a pencil of rays. -- Röntgen ray ( (Phys.), a kind of ray generated in a very highly exhausted vacuum tube by the electrical discharge. It is capable of passing through many bodies opaque to light, and producing photographic and fluorescent effects by which means pictures showing the internal structure of opaque objects are made, called radiographs, or sciagraphs. So called from the discoverer, W. C. Röntgen. -- X ray, the Röntgen ray; -- so called by its discoverer because of its enigmatical character, x being an algebraic symbol for an unknown quantity.\n\n1. To mark with long lines; to streak. [Obs.] Chaucer. 2. Etym: [From Ray, n.]  To send forth or shoot out; to cause to shine out; as, to ray smiles. [R.] Thompson.\n\nTo shine, as with rays. Mrs. Browning.\n\n(a) Any one of numerous elasmobranch fishes of the order Raiæ, including the skates, torpedoes, sawfishes, etc. (b) In a restricted sense, any of the broad, flat, narrow-tailed species, as the skates and sting rays. See Skate. Bishop ray, a yellow-spotted, long-tailed eagle ray (Stoasodon nàrinari) of the Southern United States and the West Indies. -- Butterfly ray, a short-tailed American sting ray (Pteroplatea Maclura), having very broad pectoral fins. -- Devil ray. See Sea Devil. -- Eagle ray, any large ray of the family Myliobatidæ, or Ætobatidæ. The common European species (Myliobatis aquila) is called also whip ray, and miller. -- Electric ray, or Cramp ray, a torpedo. -- Starry ray, a common European skate (Raia radiata). -- Sting ray, any one of numerous species of rays of the family Trygonidæ having one or more large, sharp, barbed dorsal spines on the whiplike tail. Called also stingaree."}