{"word":"read","definition":"Rennet. See 3d Reed. [Prov. Eng.]\n\n1. To advise; to counsel. [Obs.] See Rede. Therefore, I read thee, get to God's word, and thereby try all doctrine. Tyndale. 2. To interpret; to explain; as, to read a riddle. 3. To tell; to declare; to recite. [Obs.] But read how art thou named, and of what kin. Spenser. 4. To go over, as characters or words, and utter aloud, or recite to one's self inaudibly; to take in the sense of, as of language, by interpreting the characters with which it is expressed; to peruse; as, to read a discourse; to read the letters of an alphabet; to read figures; to read the notes of music, or to read music; to read a book. Redeth [read ye] the great poet of Itaille. Chaucer. Well could he rede a lesson or a story. Chaucer. 5. Hence, to know fully; to comprehend. Who is't can read a woman Shak. 6. To discover or understand by characters, marks, features, etc.; to learn by observation. An armed corse did lie, In whose dead face he read great magnanimity. Spenser. Those about her From her shall read the perfect ways of honor. Shak. 7. To make a special study of, as by perusing textbooks; as, to read theology or law. To read one's self in, to read about the Thirty-nine Articles and the Declaration of Assent, -- required of a clergyman of the Church of England when he first officiates in a new benefice.\n\n1. To give advice or counsel. [Obs.] 2. To tell; to declare. [Obs.] Spenser. 3. To perform the act of reading; to peruse, or to go over and utter aloud, the words of a book or other like document. So they read in the book of the law of God distinctly, and gave the sense. Neh. viii. 8. 4. To study by reading; as, he read for the bar. 5. To learn by reading. I have read of an Eastern king who put a judge to death for an iniquitous sentence. Swift. 6. To appear in writing or print; to be expressed by, or consist of, certain words or characters; as, the passage reads thus in the early manuscripts. 7. To produce a certain effect when read; as, that sentence reads queerly. To read between the lines, to infer something different from what is plainly indicated; to detect the real meaning as distinguished from the apparent meaning.\n\n1. Saying; sentence; maxim; hence, word; advice; counsel. See Rede. [Obs.] 2. Etym: [Read, v.]  Reading. [Colloq.] Hume. One newswoman here lets magazines for a penny a read. Furnivall.\n\nimp. & p. p. of Read, v. t. & i.\n\nInstructed or knowing by reading; versed in books; learned. A poet . . . well read in Longinus. Addison."}