{"word":"ready","definition":"1. Prepared for what one is about to do or experience; equipped or supplied with what is needed for some act or event; prepared for immediate movement or action; as, the troops are ready to march; ready for the journey. \"When she redy was.\" Chaucer. 2. Fitted or arranged for immediate use; causing no delay for lack of being prepared or furnished. \"Dinner was ready.\" Fielding. My oxen and my fatlings are killed, and all things are ready: come unto the marriage. Matt. xxii. 4. 3. Prepared in mind or disposition; not reluctant; willing; free; inclined; disposed. I am ready not to be bound only, but also to die at Jerusalem, for the name of the Lord Jesus. Acts xxi. 13. If need be, I am ready to forego And quit. Milton. 4. Not slow or hesitating; quick in action or perception of any kind; dexterous; prompt; easy; expert; as, a ready apprehension; ready wit; a ready writer or workman. \"Ready in devising expedients.\" Macaulay. Gurth, whose temper was ready, through surly. Sir W. Scott. 5. Offering itself at once; at hand; opportune; convenient; near; easy. \"The readiest way.\" Milton. A sapling pine he wrenched from out the ground, The readiest weapon that his fury found. Dryden. 6. On the point; about; on the brink; near; -- with a following infinitive. My heart is ready to crack. Shak. 7. (Mil.)  A word of command, or a position, in the manual of arms, at which the piece is cocked and held in position to execute promptly the next command, which is, aim. All ready, ready in every particular; wholly equipped or prepared. \"[I] am all redy at your hest.\" Chaucer. -- Ready money, means of immediate payment; cash. \"'Tis all the ready money fate can give.\" Cowley. -- Ready reckoner, a book of tables for facilitating computations, as of interest, prices, etc. -- To make ready, to make preparation; to get in readiness. Syn. -- Prompt; expeditious; speedy; unhesitating; dexterous; apt; skilful; handy; expert; facile; easy; opportune; fitted; prepared; disposed; willing; free; cheerful. See Prompt.\n\nIn a state of preparation for immediate action; so as to need no delay. We ourselves will go ready armed. Num. xxxii. 17.\n\nReady money; cash; -- commonly with the; as, he was supplied with the ready. [Slang] Lord Strut was not flush in ready, either to go to law, or to clear old debts. Arbuthnot.\n\nTo dispose in order. [Obs.] Heywood."}