{"word":"real","definition":"A small Spanish silver coin; also, a denomination of money of account, formerly the unit of the Spanish monetary system. Note: A real of plate (coin) varied in value according to the time of its coinage, from 12real vellon, or money of account, was nearly equal to five cents, or 2\n\nRoyal; regal; kingly. [Obs.] \"The blood real of Thebes.\" Chaucer.\n\n1. Actually being or existing; not fictitious or imaginary; as, a description of real life. Whereat I waked, and found Before mine eyes all real, as the dream Had lively shadowed. Milton. 2. True; genuine; not artificial; counterfeit, or factitious; often opposed to ostensible; as, the real reason; real Madeira wine; real ginger. Whose perfection far excelled Hers in all real dignity. Milton. 5. Relating to things, not to persons. [Obs.] Many are perfect in men's humors that are not greatly capable of the real part of business. Bacon. 4. (Alg.)  Having an assignable arithmetical or numerical value or meaning; not imaginary. 5. (Law)  Pertaining to things fixed, permanent, or immovable, as to lands and tenements; as, real property, in distinction from personal or movable property. Chattels real (Law), such chattels as are annexed to, or savor of, the realty, as terms for years of land. See Chattel. -- Real action (Law), an action for the recovery of real property. -- Real assets (Law), lands or real estate in the hands of the heir, chargeable with the debts of the ancestor. -- Real composition (Eccl. Law), an agreement made between the owner of lands and the parson or vicar, with consent of the ordinary, that such lands shall be discharged from payment of tithes, in consequence of other land or recompense given to the parson in lieu and satisfaction thereof. Blackstone. -- Real estate or property, lands, tenements, and hereditaments; freehold interests in landed property; property in houses and land. Kent. Burrill. -- Real presence (R. C. Ch.), the actual presence of the body and blood of Christ in the eucharist, or the conversion of the substance of the bread and wine into the real body and blood of Christ; transubstantiation. In other churches there is a belief in a form of real presence, not however in the sense of transubstantiation. -- Real servitude, called also Predial servitude (Civil Law), a burden imposed upon one estate in favor of another estate of another proprietor. Erskine. Bouvier. Syn. -- Actual; true; genuine; authentic. -- Real, Actual. Real represents a thing to be a substantive existence; as, a real, not imaginary, occurrence. Actual refers to it as acted or performed; and, hence, when we wish to prove a thing real, we often say, \"It actually exists,\" \"It has actually been done.\" Thus its really is shown by its actually. Actual, from this reference to being acted, has recently received a new signification, namely, present; as, the actual posture of affairs; since what is now in action, or going on, has, of course, a present existence. An actual fact; a real sentiment. For he that but conceives a crime in thought, Contracts the danger of an actual fault. Dryden. Our simple ideas are all real; all agree to the reality of things. Locke.\n\nA realist. [Obs.] Burton."}