{"word":"rear","definition":"Early; soon. [Prov. Eng.] Then why does Cuddy leave his cot so rear! Gay.\n\n1. The back or hindmost part; that which is behind, or last on order; -- opposed to Ant: front. Nipped with the lagging rear of winter's frost. Milton. 2. Specifically, the part of an army or fleet which comes last, or is stationed behind the rest. When the fierce foe hung on our broken rear. Milton.\n\nBeing behind, or in the hindmost part; hindmost; as, the rear rank of a company. Rear admiral, an officer in the navy, next in rank below a vice admiral, and above a commodore. See Admiral. -- Rear front (Mil.), the rear rank of a body of troops when faced about and standing in that position. -- Rear guard (Mil.), the division of an army that marches in the rear of the main body to protect it; -- used also figuratively. -- Rear line (Mil.), the line in the rear of an army. -- Rear rank (Mil.), the rank or line of a body of troops which is in the rear, or last in order. -- Rear sight (Firearms), the sight nearest the breech. -- To bring up the rear, to come last or behind.\n\nTo place in the rear; to secure the rear of. [R.]\n\n1. To raise; to lift up; to cause to rise, become erect, etc.; to elevate; as, to rear a monolith. In adoration at his feet I fell Submiss; he reared me. Milton. It reareth our hearts from vain thoughts. Barrow. Mine [shall be] the first hand to rear her banner. Ld. Lytton. 2. To erect by building; to set up; to construct; as, to rear defenses or houses; to rear one government on the ruins of another. One reared a font of stone. Tennyson. 3. To lift and take up. [Obs. or R.] And having her from Trompart lightly reared, Upon his set the lovely load. Spenser. 4. To bring up to maturity, as young; to educate; to instruct; to foster; as, to rear offspring. He wants a father to protect his youth, And rear him up to virtue. Southern. 5. To breed and raise; as, to rear cattle. 6. To rouse; to strip up. [Obs.] And seeks the tusky boar to rear. Dryden. Syn. -- To lift; elevate; erect; raise, build; establish. See the Note under Raise, 3 (c).\n\nTo rise up on the hind legs, as a horse; to become erect. Rearing bit, a bit designed to prevent a horse from lifting his head when rearing. Knight."}