{"word":"recover","definition":"To cover again. Sir W. Scott.\n\n1. To get or obtain again; to get renewed possession of; to win back; to regain. David recovered all that the Amalekites had carried away. 1. Sam. xxx. 18. 2. To make good by reparation; to make up for; to retrieve; to repair the loss or injury of; as, to recover lost time. \"Loss of catel may recovered be.\" Chaucer. Even good men have many failings and lapses to lament and recover. Rogers. 3. To restore from sickness, faintness, or the like; to bring back to life or health; to cure; to heal. The wine in my bottle will recover him. Shak. 4. To overcome; to get the better of, -- as a state of mind or body. I do hope to recover my late hurt. Cowley. When I had recovered a little my first surprise. De Foe. 5. To rescue; to deliver. That they may recover themselves out of the snare of the devil, who are taken captive by him. 2. Tim. ii. 26. 6. To gain by motion or effort; to obtain; to reach; to come to. [Archaic] The forest is not three leagues off; If we recover that, we're sure enough. Shak. Except he could recover one of the Cities of Refuge he was to die. Hales. 7. (Law)  To gain as a compensation; to obtain in return for injury or debt; as, to recover damages in trespass; to recover debt and costs in a suit at law; to obtain title to by judgement in a court of law; as, to recover lands in ejectment or common recovery; to gain by legal process; as, to recover judgement against a defendant. Recover arms (Mil. Drill), a command whereby the piece is brought from the position of \"aim\" to that of \"ready.\" Syn. -- To regain; repossess; resume; retrieve; recruit; heal; cure.\n\n1. To regain health after sickness; to grow well; to be restored or cured; hence, to regain a former state or condition after misfortune, alarm, etc.; -- often followed by of or from; as, to recover from a state of poverty; to recover from fright. Go, inquire of Baal-zebub, the god of Ekron, whether I shall recover of this disease. 2 Kings i. 2. 2. To make one's way; to come; to arrive. [Obs.] With much ado the Christians recovered to Antioch. Fuller. 3. (Law)  To obtain a judgement; to succeed in a lawsuit; as, the plaintiff has recovered in his suit.\n\nRecovery. Sir T. Malory."}