{"word":"reduce","definition":"1. To bring or lead back to any former place or condition. [Obs.] And to his brother's house reduced his wife. Chapman. The sheep must of necessity be scattered, unless the great Shephered of souls oppose, or some of his delegates reduce and direct us. Evelyn. 2. To bring to any inferior state, with respect to rank, size, quantity, quality, value, etc.; to diminish; to lower; to degrade; to impair; as, to reduce a sergeant to the ranks; to reduce a drawing; to reduce expenses; to reduce the intensity of heat. \"An ancient but reduced family.\" Sir W. Scott. Nothing so excellent but a man may fasten upon something belonging to it, to reduce it. Tillotson. Having reduced Their foe to misery beneath their fears. Milton. Hester Prynne was shocked at the condition to which she found the clergyman reduced. Hawthorne. 3. To bring to terms; to humble; to conquer; to subdue; to capture; as, to reduce a province or a fort. 4. To bring to a certain state or condition by grinding, pounding, kneading, rubbing, etc.; as, to reduce a substance to powder, or to a pasty mass; to reduce fruit, wood, or paper rags, to pulp. It were but right And equal to reduce me to my dust. Milton. 5. To bring into a certain order, arrangement, classification, etc.; to bring under rules or within certain limits of descriptions and terms adapted to use in computation; as, to reduce animals or vegetables to a class or classes; to reduce a series of observations in astronomy; to reduce language to rules. 6. (Arith.) (a) To change, as numbers, from one denomination into another without altering their value, or from one denomination into others of the same value; as, to reduce pounds, shillings, and pence to pence, or to reduce pence to pounds; to reduce days and hours to minutes, or minutes to days and hours. (b) To change the form of a quantity or expression without altering its value; as, to reduce fractions to their lowest terms, to a common denominator, etc. 7. (Chem.)  To bring to the metallic state by separating from impurities; hence, in general, to remove oxygen from; to deoxidize; to combine with, or to subject to the action of, hydrogen; as, ferric iron is reduced to ferrous iron; or metals are reduced from their ores; -- opposed to Ant: oxidize. 8. (Med.)  To restore to its proper place or condition, as a displaced organ or part; as, to reduce a dislocation, a fracture, or a hernia. Reduced iron (Chem.), metallic iron obtained through deoxidation of an oxide of iron by exposure to a current of hydrogen or other reducing agent. When hydrogen is used the product is called also iron by hydrogen. -- To reduce an equation (Alg.), to bring the unknown quantity by itself on one side, and all the known quantities on the other side, without destroying the equation. -- To reduce an expression (Alg.), to obtain an equivalent expression of simpler form. -- To reduce a square (Mil.), to reform the line or column from the square. Syn. -- To diminish; lessen; decrease; abate; shorten; curtail; impair; lower; subject; subdue; subjugate; conquer."}