{"word":"reflection","definition":"1. The act of reflecting, or turning or sending back, or the state of being reflected. Specifically: (a) The return of rays, beams, sound, or the like, from a surface. See Angle of reflection, below. The eye sees not itself, But by reflection, by some other things. Shak. (b) The reverting of the mind to that which has already occupied it; continued consideration; meditation; contemplation; hence, also, that operation or power of the mind by which it is conscious of its own acts or states; the capacity for judging rationally, especially in view of a moral rule or standard. By reflection, . . . I would be understood to mean, that notice which the mind takes of its own operations, and the manner of them, by reason whereof there come to be ideas of these operations in the understanding. Locke. This delight grows and improves under thought and reflection. South. 2. Shining; brightness, as of the sun. [Obs.] Shak. 3. That which is produced by reflection. Specifically: (a) An image given back from a reflecting surface; a reflected counterpart. As the sun water we can bear, Yet not the sun, but his reflection, there. Dryden. (b) A part reflected, or turned back, at an angle; as, the reflection of a membrane. (c) Result of meditation; thought or opinion after attentive consideration or contemplation; especially, thoughts suggested by truth. Job's reflections on his once flourishing estate did at the same time afflict and encourage him. Atterbury. 4. Censure; reproach cast. He died; and oh! may no reflection shed Its poisonous venom on the royal dead. Prior. 5. (Physiol.)  The transference of an excitement from one nerve fiber to another by means of the nerve cells, as in reflex action. See Reflex action, under Reflex. Angle of reflection, the angle which anything, as a ray of light, on leaving a reflecting surface, makes with the perpendicular to the surface. -- Angle of total reflection. (Opt.) Same as Critical angle, under Critical. Syn. -- Meditation; contemplation; rumination; cogitation; consideration; musing; thinking."}