{"word":"refraction","definition":"1. The act of refracting, or the state of being refracted. 2. The change in the direction of ray of light, heat, or the like, when it enters obliquely a medium of a different density from that through which it has previously moved. Refraction out of the rarer medium into the denser, is made towards the perpendicular. Sir I. Newton. 3. (Astron.) (a) The change in the direction of a ray of light, and, consequently, in the apparent position of a heavenly body from which it emanates, arising from its passage through the earth's atmosphere; -- hence distinguished as atmospheric refraction, or astronomical refraction. (b) The correction which is to be deducted from the apparent altitude of a heavenly body on account of atmospheric refraction, in order to obtain the true altitude. Angle of refraction (Opt.), the angle which a refracted ray makes with the perpendicular to the surface separating the two media traversed by the ray. -- Conical refraction (Opt.), the refraction of a ray of light into an infinite number of rays, forming a hollow cone. This occurs when a ray of light is passed through crystals of some substances, under certain circumstances. Conical refraction is of two kinds; external conical refraction, in which the ray issues from the crystal in the form of a cone, the vertex of which is at the point of emergence; and internal conical refraction, in which the ray is changed into the form of a cone on entering the crystal, from which it issues in the form of a hollow cylinder. This singular phenomenon was first discovered by Sir W. R. Hamilton by mathematical reasoning alone, unaided by experiment. -- Differential refraction (Astron.), the change of the apparent place of one object relative to a second object near it, due to refraction; also, the correction required to be made to the observed relative places of the two bodies. -- Double refraction (Opt.), the refraction of light in two directions, which produces two distinct images. The power of double refraction is possessed by all crystals except those of the isometric system. A uniaxial crystal is said to be optically positive (like quartz), or optically negative (like calcite), or to have positive, or negative, double refraction, according as the optic axis is the axis of least or greatest elasticity for light; a biaxial crystal is similarly designated when the same relation holds for the acute bisectrix. -- Index of refraction. See under Index. -- Refraction circle (Opt.), an instrument provided with a graduated circle for the measurement of refraction. -- Refraction of latitude, longitude, declination, right ascension, etc., the change in the apparent latitude, longitude, etc., of a heavenly body, due to the effect of atmospheric refraction. -- Terrestrial refraction, the change in the apparent altitude of a distant point on or near the earth's surface, as the top of a mountain, arising from the passage of light from it to the eye through atmospheric strata of varying density."}