{"word":"register","definition":"1. A written account or entry; an official or formal enumeration, description, or record; a memorial record; a list or roll; a schedule. As you have one eye upon my follies, . . . turn another into the register of your own. Shak. 2. (Com.) (a) A record containing a list and description of the merchant vessels belonging to a port or customs district. (b) A certificate issued by the collector of customs of a port or district to the owner of a vessel, containing the description of a vessel, its name, ownership, and other material facts. It is kept on board the vessel, to be used as an evidence of nationality or as a muniment of title. 3. Etym: [Cf. LL. registrarius. Cf. Regisrar.]  One who registers or records; a registrar; a recorder; especially, a public officer charged with the duty of recording certain transactions or events; as, a register of deeds. 4. That which registers or records. Specifically: (a) (Mech.) A contrivance for automatically noting the performance of a machine or the rapidity of a process. (b) (Teleg.) The part of a telegraphic apparatus which records automatically the message received. (c) A machine for registering automatically the number of persons passing through a gateway, fares taken, etc.; a telltale. 5. A lid, stopper, or sliding plate, in a furnace, stove, etc., for regulating the admission of air to the fuel; also, an arrangement containing dampers or shutters, as in the floor or wall of a room or passage, or in a chimney, for admitting or excluding heated air, or for regulating ventilation. 6. (Print.) (a) The inner part of the mold in which types are cast. (b) The correspondence of pages, columns, or lines on the opposite or reverse sides of the sheet. (c) The correspondence or adjustment of the several impressions in a design which is printed in parts, as in chromolithographic printing, or in the manufacture of paper hangings. See Register, v. i. 2. 7. (Mus.) (a) The compass of a voice or instrument; a specified portion of the compass of a voice, or a series of vocal tones of a given compass; as, the upper, middle, or lower register; the soprano register; the tenor register. Note: In respect to the vocal tones, the thick register properly extends below from the F on the lower space of the treble staff. The thin register extends an octave above this. The small register is above the thin. The voice in the thick register is called the chest voice; in the thin, the head voice. Falsetto is a kind off voice, of a thin, shrull quality, made by using the mechanism of the upper thin register for tones below the proper limit on the scale. E. Behnke. (b) A stop or set of pipes in an organ. Parish register, A book in which are recorded the births, baptisms, marriages, deaths, and burials in a parish. Syn. -- List; catalogue; roll; record; archives; chronicle; annals. See List.\n\n1. T 2. To enroll; to enter in a list. Such follow him as shall be registered. Milton. Registered letter, a letter, the address of which is, on payment of a special fee, registered in the post office and the transmission and delivery of which are attended to with particular care.\n\n1. To enroll one's name in a register. 2. (Print.)  To correspond in ralative position; as, two pages, columns, etc. , register when the corresponding parts fall in the same line, or when line falls exactly upon line in reverse pages, or (as in chromatic printing) where the various colors of the design are printed consecutively, and perfect adjustment of parts is necessary."}