{"word":"remove","definition":"1. To move away from the position occupied; to cause to change place; to displace; as, to remove a building. Thou shalt not remove thy neighbor's landmark. Deut. xix. 14. When we had dined, to prevent the ladies' leaving us, I generally ordered the table to be removed. Goldsmith. 2. To cause to leave a person or thing; to cause to cease to be; to take away; hence, to banish; to destroy; to put an end to; to kill; as, to remove a disease. \"King Richard thus removed.\" Shak. 3. To dismiss or discharge from office; as, the President removed many postmasters. Note: See the Note under Remove, v. i.\n\nTo change place in any manner, or to make a change in place; to move or go from one residence, position, or place to another. Till Birnam wood remove to Dunsinane, I can not taint with fear. Shak. Note: The verb remove, in some of its application, is synonymous with move, but not in all. Thus we do not apply remove to a mere change of posture, without a change of place or the seat of a thing. A man moves his head when he turns it, or his finger when he bends it, but he does not remove it. Remove usually or always denotes a change of place in a body, but we never apply it to a regular, continued course or motion. We never say the wind or water, or a ship, removes at a certain rate by the hour; but we say a ship was removed from one place in a harbor to another. Move is a generic term, including the sense of remove, which is more generally applied to a change from one station or permanent position, stand, or seat, to another station.\n\n1. The act of removing; a removal. This place should be at once both school and university, not needing a remove to any other house of scholarship. Milton. And drags at each remove a lengthening chain. Goldsmith. 2. The transfer of one's business, or of one's domestic belongings, from one location or dwelling house to another; -- in the United States usually called a move. It is an English proverb that three removes are as bad as a fire. J. H. Newman. 3. The state of being removed. Locke. 4. That which is removed, as a dish removed from table to make room for something else. 5. The distance or space through which anything is removed; interval; distance; stage; hence, a step or degree in any scale of gradation; specifically, a division in an English public school; as, the boy went up two removes last year. A freeholder is but one remove from a legislator. Addison. 6. (Far.)  The act of resetting a horse's shoe. Swift."}