{"word":"rent","definition":"To rant. [R. & Obs.] Hudibras.\n\nimp. & p. p. of Rend.\n\n1. An opening made by rending; a break or breach made by force; a tear. See what a rent the envious Casca made. Shak. 2. Figuratively, a schim; a rupture of harmony; a separation; as, a rent in the church. Syn. -- Fissure; breach; disrupture; rupture; tear; diaceration; break; fracture.\n\nTo tear. See Rend. [Obs.] Chaucer.\n\n1. Incone; revenue. See Catel. [Obs.] \"Catel had they enough and rent.\" Chaucer. [Bacchus] a waster was and all his rent In wine and bordel he dispent. Gower. So bought an annual rent or two, And liv'd, just as you see I do. Pope. 2. Pay; reward; share; toll. [Obs.] Death, that taketh of high and low his rent. Chaucer. 3. (Law)  A certain periodical profit, whether in money, provisions, chattels, or labor, issuing out of lands and tenements in payment for the use; commonly, a certain pecuniary sum agreed upon between a tenant and his landlord, paid at fixed intervals by the lessee to the lessor, for the use of land or its appendages; as, rent for a farm, a house, a park, etc. Note: The term rent is also popularly applied to compensation for the use of certain personal chattles, as a piano, a sewing machine, etc. Black rent. See Blackmail, 3. -- Forehand rent, rent which is paid in advance; foregift. -- Rent arrear, rent in arrears; unpaid rent. Blackstone. -- Rent charge (Law), a rent reserved on a conveyance of land in fee simple, or granted out of lands by deed; -- so called because, by a covenant or clause in the deed of conveyance, the land is charged with a distress for the payment of it, Bouvier. -- Rent roll, a list or account of rents or income; a rental. -- Rent seck (Law), a rent reserved by deed, but without any clause of distress; barren rent. A power of distress was made incident to rent seck by Statue 4 George II. c. 28. -- Rent service (Eng. Law), rent reserved out of land held by fealty or other corporeal service; -- so called from such service being incident to it. -- White rent, a quitrent when paid in silver; -- opposed to black rent.\n\n1. To grant the possession and enjoyment of, for a rent; to lease; as, the owwner of an estate or house rents it. 2. To take and hold under an agreement to pay rent; as, the tennant rents an estate of the owner.\n\nTo be leased, or let for rent; as, an estate rents for five hundred dollars a year."}