{"word":"report","definition":"1. To refer. [Obs.] Baldwin, his son, . . . succeeded his father; so like unto him that we report the reader to the character of King Almeric, and will spare the repeating his description. Fuller. 2. To bring back, as an answer; to announce in return; to relate, as what has been discovered by a person sent to examine, explore, or investigate; as, a messenger reports to his employer what he has seen or ascertained; the committee reported progress. There is no man that may reporten all. Chaucer. 3. To give an account of; to relate; to tell; to circulate publicly, as a story; as, in the common phrase, it is reported. Shak. It is reported among the heathen, and Gashmu saith it, that thou and the Jews think to rebel. Neh. vi. 6. 4. To give an official account or statement of; as, a treasurer reperts the recepts and expenditures. 5. To return or repeat, as sound; to echo. [Obs. or R.] \"A church with windowss only form above, that reporteth the voice thirteen times.\" Bacon. 6. (Parliamentary Practice)  To return or present as the result of an examination or consideration of any matter officially referred; as, the committee reported the bill witth amendments, or reported a new bill, or reported the results of an inquiry. 7. To make minutes of, as a speech, or the doings of a public body; to write down from the lips of a speaker. 8. To write an account of for publication, as in a newspaper; as, to report a public celebration or a horse race. 9. To make a statement of the conduct of, especially in an unfavorable sense; as, to report a servant to his employer. To be reported, or To be reported of, to be spoken of; to be mentioned, whether favorably or unfavorably. Acts xvi. 2. -- To report one's self, to betake one's self, as to a superior or one to whom service is due, and be in readiness to receive orders or do service. Syn. -- To relate; narrate; tell; recite; describe.\n\n1. To make a report, or response, in respect of a matter inquired of, a duty enjoined, or information expected; as, the committee will report at twelve o'clock. 2. To furnish in writing an account of a speech, the proceedings at a meeting, the particulars of an occurrence, etc., for publication. 3. To present one's self, as to a superior officer, or to one to whom service is due, and to be in readiness for orders or to do service; also, to give information, as of one's address, condition, etc.; as, the officer reported to the general for duty; to report weekly by letter.\n\n1. That which is reported. Specifically: (a) An account or statement of the results of examination or inquiry made by request or direction; relation. \"From Thetis sent as spies to make report.\" Waller. (b) A story or statement circulating by common talk; a rumor; hence, fame; repute; reputation. It was a true report that I heard in mine own land of thy acts and of thy wisdom. 1 Kings x. 6. Cornelius the centurion, a just man, and . . . of good report among all the nation of the Jews. Acts x. 22. (c) Sound; noise; as, the report of a pistol or cannon. (d) An official statement of facts, verbal or written; especially, a statement in writing of proceedings and facts exhibited by an officer to his superiors; as, the reports of the heads af departments to Congress, of a master in chancery to the court, of committees to a legislative body, and the like. (e) An account or statement of a judicial opinion or decision, or of case argued and determined in a court of law, chancery, etc.; also, in the plural, the volumes containing such reports; as, Coke's Reports. (f) A sketch, or a fully written account, of a speech, debate, or the proceedings of a public meeting, legislative body, etc. 2. Rapport; relation; connection; reference. [Obs.] The corridors worse, having no report to the wings they join to. Evelyn. Syn. -- Account; relation; narration; detail; description; recital; narrative; story; rumor; hearsay."}