{"word":"reserve","definition":"1. To keep back; to retain; not to deliver, make over, or disclose. \"I have reserved to myself nothing.\" Shak. 2. Hence, to keep in store for future or special use; to withhold from present use for another purpose or time; to keep; to retain. Gen. xxvii. 35. Hast thou seen the treasures of the hail, which I have reserved against the time of trouble Job xxxviii. 22,23. Reserve your kind looks and language for private hours. Swift. 3. To make an exception of; to except. [R.]\n\n1. The act of reserving, or keeping back; reservation. However any one may concur in the general scheme, it is still with certain reserves and deviations. Addison. 2. That which is reserved, or kept back, as for future use. The virgins, besides the oil in their lamps, carried likewise a reserve in some other vessel for a continual supply. Tillotson. 3. That which is excepted; exception. Each has some darling lust, which pleads for a reserve. Rogers. 4. Restraint of freedom in words or actions; backwardness; caution in personal behavior. My soul, surprised, and from her sex disjoined, Left all reserve, and all the sex, behind. Prior. The clergyman's shy and sensitive reserve had balked this scheme. Hawthorne. 5. A tract of land reserved, or set apart, for a particular purpose; as, the Connecticut Reserve in Ohio, originally set apart for the school fund of Connecticut; the Clergy Reserves in Canada, for the support of the clergy. 6. (Mil.)  A body of troops in the rear of an army drawn up for battle, reserved to support the other lines as occasion may require; a force or body of troops kept for an exigency. 7. (Banking)  Funds kept on hand to meet liabilities. In reserve, in keeping for other or future use; in store; as, he has large quantities of wheat in reserve; he has evidence or arguments in reserve. -- Reserve air. (Physiol.) Same as Supplemental air, under Supplemental. Syn. -- Reservation; retention; limitation; backwardness; reservedness; coldness; restraint; shyness; coyness; modesty."}