{"word":"reverse","definition":"1. Turned backward; having a contrary or opposite direction; hence; opposite or contrary in kind; as, the reverse order or method. \"A vice reverse unto this.\" Gower. 2. Turned upside down; greatly disturbed. [Obs.] He found the sea diverse With many a windy storm reverse. Gower. 3. (Bot. & Zoöl.)  Reversed; as, a reverse shell. Reverse bearing (Surv.), the bearing of a back station as observed from the station next in advance. -- Reverse curve (Railways), a curve like the letter S, formed of two curves bending in opposite directions. -- Reverse fire (Mil.), a fire in the rear. -- Reverse operation (Math.), an operation the steps of which are taken in a contrary order to that in which the same or similar steps are taken in another operation considered as direct; an operation in which that is sought which in another operation is given, and that given which in the other is sought; as, finding the length of a pendulum from its time of vibration is the reverse operation to finding the time of vibration from the length.\n\n1. That which appears or is presented when anything, as a lance, a line, a course of conduct, etc., is reverted or turned contrary to its natural direction. He did so with the reverse of the lance. Sir W. Scott. 2. That which is directly opposite or contrary to something else; a contrary; an opposite. Chaucer. And then mistook reverse of wrong for right. Pope. To make everything the reverse of what they have seen, is quite as easy as to destroy. Burke. 3. The act of reversing; complete change; reversal; hence, total change in circumstances or character; especially, a change from better to worse; misfortune; a check or defeat; as, the enemy met with a reverse. The strange reverse of fate you see; I pitied you, now you may pity me. Dryden. By a reverse of fortune, Stephen becomes rich. Lamb. 4. The back side; as, the reverse of a drum or trench; the reverse of a medal or coin, that is, the side opposite to the Ant: obverse. See Obverse. 5. A thrust in fencing made with a backward turn of the hand; a backhanded stroke. [Obs.] Shak. 6. (Surg.)  A turn or fold made in bandaging, by which the direction of the bandage is changed.\n\n1. To turn back; to cause to face in a contrary direction; to cause to depart. And that old dame said many an idle verse, Out of her daughter's heart fond fancies to reverse. Spenser. 2. To cause to return; to recall. [Obs.] And to his fresh remembrance did reverse The ugly view of his deformed crimes. Spenser. 3. To change totally; to alter to the opposite. Reverse the doom of death. Shak. She reversed the conduct of the celebrated vicar of Bray. Sir W. Scott. 4. To turn upside down; to invert. A pyramid reversed may stand upon his point if balanced by admirable skill. Sir W. Temple. 5. Hence, to overthrow; to subvert. These can divide, and these reverse, the state. Pope. Custom . . . reverses even the distinctions of good and evil. Rogers. 6. (Law)  To overthrow by a contrary decision; to make void; to under or annual for error; as, to reverse a judgment, sentence, or decree. Reverse arms (Mil.), a position of a soldier in which the piece passes between the right elbow and the body at an angle of 45°, and is held as in the illustration. -- To reverse an engine or a machine, to cause it to perform its revolutions or action in the opposite direction. Syn. -- To overturn; overset; invert; overthrow; subvert; repeal; annul; revoke; undo.\n\n1. To return; to revert. [Obs.] Spenser. 2. To become or be reversed."}