{"word":"revolution","definition":"1. The act of revolving, or turning round on an axis or a center; the motion of a body round a fixed point or line; rotation; as, the revolution of a wheel, of a top, of the earth on its axis, etc. 2. Return to a point before occupied, or to a point relatively the same; a rolling back; return; as, revolution in an ellipse or spiral. That fear Comes thundering back, with dreadful revolution, On my defenseless head. Milton. 3. The space measured by the regular return of a revolving body; the period made by the regular recurrence of a measure of time, or by a succession of similar events. \"The short revolution of a day.\" Dryden. 4. (Astron.)  The motion of any body, as a planet or satellite, in a curved line or orbit, until it returns to the same point again, or to a point relatively the same; -- designated as the annual, anomalistic, nodical, sidereal, or tropical revolution, according as the point of return or completion has a fixed relation to the year, the anomaly, the nodes, the stars, or the tropics; as, the revolution of the earth about the sun; the revolution of the moon about the earth. Note: The term is sometimes applied in astronomy to the motion of a single body, as a planet, about its own axis, but this motion is usually called rotation. 5. (Geom.)  The motion of a point, line, or surface about a point or line as its center or axis, in such a manner that a moving point generates a curve, a moving line a surface (called a surface of revolution), and a moving surface a solid (called a solid of revolution); as, the revolution of a right-angled triangle about one of its sides generates a cone; the revolution of a semicircle about the diameter generates a sphere. 6. A total or radical change; as, a revolution in one's circumstances or way of living. The ability . . . of the great philosopher speedily produced a complete revolution throughout the department. Macaulay. 7. (Politics)  A fundamental change in political organization, or in a government or constitution; the overthrow or renunciation of one government, and the substitution of another, by the governed. The violence of revolutions is generally proportioned to the degree of the maladministration which has produced them. Macaulay. Note: When used without qualifying terms, the word is often applied specifically, by way of eminence, to: (a) The English Revolution in 1689, when William of Orange and Mary became the reigning sovereigns, in place of James II. (b) The American Revolution, beginning in 1775, by which the English colonies, since known as the United States, secured their independence. (c) The revolution in France in 1789, commonly called the French Revolution, the subsequent revolutions in that country being designated by their dates, as the Revolution of 1830, of 1848, etc."}