{"word":"ring","definition":"1. To cause to sound, especially by striking, as a metallic body; as, to ring a bell. 2. To make (a sound), as by ringing a bell; to sound. The shard-borne beetle, with his drowsy hums, Hath rung night's yawning peal. Shak. 3. To repeat often, loudly, or earnestly. To ring a peal, to ring a set of changes on a chime of bells. -- To ring the changes upon. See under Change. -- To ring in or out, to usher, attend on, or celebrate, by the ringing of bells; as, to ring out the old year and ring in the new. Tennyson. -- To ring the bells backward, to sound the chimes, reversing the common order; -- formerly done as a signal of alarm or danger. Sir W. Scott.\n\n1. To sound, as a bell or other sonorous body, particularly a metallic one. Now ringen trompes loud and clarion. Chaucer. Why ring not out the bells Shak. 2. To practice making music with bells. Holder. 3. To sound loud; to resound; to be filled with a With sweeter notes each rising temple rung. Pope. The hall with harp and carol rang. Tennyson. My ears still ring with noise. Dryden. 4. To continue to sound or vibrate; to resound. The assertion is still ringing in our ears. Burke. 5. To be filled with report or talk; as, the whole town rings with his fame.\n\n1. A sound; especially, the sound of vibrating metals; as, the ring of a bell. 2. Any loud sound; the sound of numerous voices; a sound continued, repeated, or reverberated. The ring of acclamations fresh in his ears. Bacon 3. A chime, or set of bells harmonically tuned. As great and tunable a ring of bells as any in the world. Fuller.\n\nA circle, or a circular line, or anything in the form of a circular line or hoop. 2. Specifically, a circular ornament of gold or other precious material worn on the finger, or attached to the ear, the nose, or some other part of the person; as, a wedding ring. Upon his thumb he had of gold a ring. Chaucer. The dearest ring in Venice will I give you. Shak. 3. A circular area in which races are or run or other sports are performed; an arena. Place me. O, place me in the dusty ring, Where youthful charioteers contened for glory. E. Smith. 4. An inclosed space in which pugilists fight; hence, figuratively, prize fighting. \"The road was an institution, the ring was an institution.\" Thackeray. 5. A circular group of persons. And hears the Muses in a Aye round about Jove's alter sing. Milton. 6. (Geom.) (a) The plane figure included between the circumferences of two concentric circles. (b) The solid generated by the revolution of a circle, or other figure, about an exterior straight line (as an axis) lying in the same plane as the circle or other figure. 7. (Astron. & Navigation)  An instrument, formerly used for taking the sun's altitude, consisting of a brass ring suspended by a swivel, with a hole at one side through which a solar ray entering indicated the altitude on the graduated inner surface opposite. 8. (Bot.)  An elastic band partly or wholly encircling the spore cases of ferns. See Illust. of Sporangium. 9. A clique; an exclusive combination of persons for a selfish purpose, as to control the market, distribute offices, obtain contracts, etc. The ruling ring at Constantinople. E. A. Freeman. Ring armor, armor composed of rings of metal. See Ring mail, below, and Chain mail, under Chain. -- Ring blackbird (Zoöl.), the ring ousel. -- Ring canal (Zoöl.), the circular water tube which surrounds the esophagus of echinoderms. -- Ring dotterel, or Ringed dotterel. (Zoöl.) See Dotterel, and Illust. of Pressiroster. -- Ring dropper, a sharper who pretends to have found a ring (dropped by himself), and tries to induce another to buy it as valuable, it being worthless. -- Ring fence. See under Fence. -- Ring finger, the third finger of the left hand, or the next the little finger, on which the ring is placed in marriage. -- Ring formula (Chem.), a graphic formula in the shape of a closed ring, as in the case of benzene, pyridine, etc. See Illust. under Benzene. -- Ring mail, a kind of mail made of small steel rings sewed upon a garment of leather or of cloth. -- Ring micrometer. (Astron.) See Circular micrometer, under Micrometer. -- Saturn's rings. See Saturn. -- Ring ousel. (Zoöl.) See Ousel. -- Ring parrot (Zoöl.), any one of several species of Old World parrakeets having a red ring around the neck, especially Palæornis torquatus, common in India, and P. Alexandri of Java. -- Ring plover. (Zoöl.) (a) The ringed dotterel. (b) Any one of several small American plovers having a dark ring around the neck, as the semipalmated plover (Ægialitis semipalmata). -- Ring snake (Zoöl.), a small harmless American snake (Diadophis punctatus) having a white ring around the neck. The back is ash- colored, or sage green, the belly of an orange red. -- Ring stopper. (Naut.) See under Stopper. -- Ring thrush (Zoöl.), the ring ousel. -- The prize ring, the ring in which prize fighters contend; prize fighters, collectively. -- The ring. (a) The body of sporting men who bet on horse races. [Eng.] (b) The prize ring.\n\n1. To surround with a ring, or as with a ring; to encircle. \"Ring these fingers.\" Shak. 2. (Hort.)  To make a ring around by cutting away the bark; to girdle; as, to ring branches or roots. 3. To fit with a ring or with rings, as the fingers, or a swine's snout.\n\nTo rise in the air spirally."}