{"word":"rose","definition":"imp. of Rise.\n\n1. A flower and shrub of any species of the genus Rosa, of which there are many species, mostly found in the morthern hemispere Note: Roses are shrubs with pinnate leaves and usually prickly stems. The flowers are large, and in the wild state have five petals of a color varying from deep pink to white, or sometimes yellow. By cultivation and hybridizing the number of petals is greatly increased and the natural perfume enhanced. In this way many distinct classes of roses have been formed, as the Banksia, Baurbon, Boursalt, China, Noisette, hybrid perpetual, etc., with multitudes of varieties in nearly every class. 2. A knot of ribbon formed like a rose; a rose knot; a rosette, esp. one worn on a shoe. Sha. 3. (Arch.)  A rose window. See Rose window, below. 4. A perforated nozzle, as of a pipe, spout, etc., for delivering water in fine jets; a rosehead; also, a strainer at the foot of a pump. 5. (Med.)  The erysipelas. Dunglison. 6. The card of the mariner's compass; also, a circular card with radiating lines, used in other instruments. 7. The color of a rose; rose-red; pink. 8. A diamond. See Rose diamond, below. Cabbage rose, China rose, etc. See under Cabbage, China, etc. -- Corn rose (Bot.) See Corn poppy, under Corn. -- Infantile rose (Med.), a variety of roseola. -- Jamaica rose. (Bot.) See under Jamaica. -- Rose acacia (Bot.), a low American leguminous shrub (Robinia hispida) with handsome clusters of rose-colored blossoms. -- Rose aniline. (Chem.) Same as Rosaniline. -- Rose apple (Bot.), the fruit of the tropical myrtaceous tree Eugenia Jambos. It is an edible berry an inch or more in diameter, and is said to have a very strong roselike perfume. -- Rose beetle. (Zoöl.) (a) A small yellowish or buff longlegged beetle (Macrodactylus subspinosus), which eats the leaves of various plants, and is often very injurious to rosebushes, apple trees, grapevines, etc. Called also rose bug, and rose chafer. (b) The European chafer. -- Rose bug. (Zoöl.) same as Rose beetle, Rose chafer. -- Rose burner, a kind of gas-burner producing a rose-shaped flame. -- Rose camphor (Chem.), a solid odorless substance which separates from rose oil. -- Rose campion. (Bot.) See under Campion. -- Rose catarrh (Med.), rose cold. -- Rose chafer. (Zoöl.) (a) A common European beetle (Cetonia aurata) which is often very injurious to rosebushes; -- called also rose beetle, and rose fly. (b) The rose beetle (a). -- Rose cold (Med.), a variety of hay fever, sometimes attributed to the inhalation of the effluvia of roses. See Hay fever, under Hay. -- Rose color, the color of a rose; pink; hence, a beautiful hue or appearance; fancied beauty, attractiveness, or promise. -- Rose de Pompadour, Rose du Barry, names succesively given to a delicate rose color used on Sèvres porcelain. -- Rose diamond, a diamond, one side of which is flat, and the other cut into twenty-four triangular facets in two ranges which form a convex face pointed at the top. Cf. Brilliant, n. -- Rose ear. See under Ear. -- Rose elder (Bot.), the Guelder-rose. -- Rose engine, a machine, or an appendage to a turning lathe, by which a surface or wood, metal, etc., is engraved with a variety of curved lines. Craig. -- Rose family (Bot.) the Roseceæ. See Rosaceous. -- Rose fever (Med.), rose cold. -- Rose fly (Zoöl.), a rose betle, or rose chafer. -- Rose gall (Zoöl.), any gall found on rosebushes. See Bedeguar. -- Rose knot, a ribbon, or other pliade band plaited so as to resemble a rose; a rosette. -- Rose lake, Rose madder, a rich tint prepared from lac and madder precipitated on an earthy basis. Fairholt. -- Rose mallow. (Bot.) (a) A name of several malvaceous plants of the genus Hibiscus, with large rose-colored flowers. (b) the hollyhock. -- Rose nail, a nail with a convex, faceted head. -- Rose noble, an ancient English gold coin, stamped with the figure of a rose, first struck in the reign of Edward III., and current at 6s. 8d. Sir W. Scott. -- Rose of China. (Bot.) See China rose (b), under China. -- Rose of Jericho (Bot.), a Syrian cruciferous plant (Anastatica Hierochuntica) which rolls up when dry, and expands again when moistened; -- called also resurrection plant. -- Rose of Sharon (Bot.), an ornamental malvaceous shrub (Hibiscus Syriacus). In the Bible the name is used for some flower not yet identified, perhaps a Narcissus, or possibly the great lotus flower. -- Rose oil (Chem.), the yellow essential oil extracted from various species of rose blossoms, and forming the chief part of attar of roses. -- Rose pink, a pigment of a rose color, made by dyeing chalk or whiting with a decoction of Brazil wood and alum; also, the color of the pigment. -- Rose quartz (Min.), a variety of quartz which is rose-red. -- Rose rash. (Med.) Same as Roseola. -- Rose slug (Zoöl.), the small green larva of a black sawfly (Selandria rosæ). These larvæ feed in groups on the parenchyma of the leaves of rosebushes, and are often abundant and very destructive. -- Rose window (Arch.), a circular window filled with ornamental tracery. Called also Catherine wheel, and marigold window. Cf. wheel window, under Wheel. -- Summer rose (Med.), a variety of roseola. See Roseola. -- Under the rose Etym: [a translation of L. sub rosa], in secret; privately; in a manner that forbids disclosure; -- the rose being among the ancients the symbol of secrecy, and hung up at entertainments as a token that nothing there said was to be divulged. -- Wars of the Roses (Eng. Hist.), feuds between the Houses of York and Lancaster, the white rose being the badge of the House of York, and the red rose of the House of Lancaster.\n\n1. To render rose-colored; to redden; to flush. [Poetic] \"A maid yet rosed over with the virgin crimson of modesty.\" Shak. 2. To perfume, as with roses. [Poetic] Tennyson."}