{"word":"rub","definition":"1. To subject (a body) to the action of something moving over its surface with pressure and friction, especially to the action of something moving back and forth; as, to rub the flesh with the hand; to rub wood with sandpaper. It shall be expedient, after that body is cleaned, to rub the body with a coarse linen cloth. Sir T. Elyot. 2. To move over the surface of (a body) with pressure and friction; to graze; to chafe; as, the boat rubs the ground. 3. To cause (a body) to move with pressure and friction along a surface; as, to rub the hand over the body. Two bones rubbed hard against one another. Arbuthnot. 4. To spread a substance thinly over; to smear. The smoothed plank, . . . New rubbed with balm. Milton. 5. To scour; to burnish; to polish; to brighten; to cleanse; -- often with up or over; as, to rub up silver. The whole business of our redemption is to rub over the defaced copy of the creation. South. 6. To hinder; to cross; to thwart. [R.] 'T is the duke's pleasure, Whose disposition, all the world well knows, Will not be rubbed nor stopped. Shak. To rub down. (a) To clean by rubbing; to comb or curry; as, to down a horse. (b) To reduce or remove by rubbing; as, to rub down the rough points. -- To rub off, to clean anything by rubbing; to separate by friction; as, to rub off rust. -- To rub out, to remove or separate by friction; to erase; to obliterate; as, to rub out a mark or letter; to rub out a stain. -- To rub up. (a) To burnish; to polish; to clean. (b) To excite; to awaken; to rouse to action; as, to rub up the memory.\n\n1. To move along the surface of a body with pressure; to grate; as, a wheel rubs against the gatepost. 2. To fret; to chafe; as, to rub upon a sore. 3. To move or pass with difficulty; as, to rub through woods, as huntsmen; to rub through the world. To rub along or on, to go on with difficulty; as, they manage, with strict economy, to rub along. [Colloq.]\n\n1. The act of rubbing; friction. 2. That which rubs; that which tends to hinder or obstruct motion or progress; hindrance; obstruction, an impediment; especially, a difficulty or obstruction hard to overcome; a pinch. Every rub is smoothed on our way. Shak. To sleep, perchance to dream; ay, there's the rub. Shak. Upon this rub, the English ambassadors thought fit to demur. Hayward. One knows not, certainly, what other rubs might have been ordained for us by a wise Providence. W. Besant. 3. Inequality of surface, as of the ground in the game of bowls; unevenness. Shak. 4. Something grating to the feelings; sarcasm; joke; as, a hard rub. 5. Imperfection; failing; fault. [Obs.] Beau. & Fl. 6. A chance. [Obs.] Flight shall leave no Greek a rub. Chapman. 7. A stone, commonly flat, used to sharpen cutting tools; a whetstone; -- called also rubstone. Rub iron, an iron guard on a wagon body, against which a wheel rubs when cramped too much."}