{"word":"ruff","definition":"(a) A game similar to whist, and the predecessor of it. Nares. (b) The act of trumping, especially when one has no card of the suit led.\n\nTo trump.\n\n1. A muslin or linen collar plaited, crimped, or fluted, worn formerly by both sexes, now only by women and children. Here to-morrow with his best ruff on. Shak. His gravity is much lessened since the late proclamation came out against ruffs; . . . they were come to that height of excess herein, that twenty shillings were used to be paid for starching of a ruff. Howell. 2. Something formed with plaits or flutings, like the collar of this name. I reared this flower; . . . Soft on the paper ruff its leaves I spread. Pope. 3. An exhibition of pride or haughtiness. How many princes . . . in the ruff of all their glory, have been taken down from the head of a conquering army to the wheel of the victor's chariot! L'Estrange. 4. Wanton or tumultuous procedure or conduct. [Obs.] To ruffle it out in a riotous ruff. Latimer. 5. (Mil.)  A low, vibrating beat of a drum, not so loud as a roll; a ruffle. 6. (Mach.)  A collar on a shaft ot other piece to prevent endwise motion. See Illust. of Collar. 7. (Zoöl.)  A set of lengthened or otherwise modified feathers round, or on, the neck of a bird. 8. (Zoöl.) (a) A limicoline bird of Europe and Asia (Pavoncella, or Philommachus, pugnax) allied to the sandpipers. The males during the breeding season have a large ruff of erectile feathers, variable in their colors, on the neck, and yellowish naked tubercles on the face. They are polygamous, and are noted for their pugnacity in the breeding season. The female is called reeve, or rheeve. (b) A variety of the domestic pigeon, having a ruff of its neck.\n\n1. To ruffle; to disorder. Spenser. 2. (Mil.)  To beat with the ruff or ruffle, as a drum. 3. (Hawking)  To hit, as the prey, without fixing it.\n\nA small freshwater European perch (Acerina vulgaris); -- called also pope, blacktail, and stone, or striped, perch."}