{"word":"run","definition":"1. To move, proceed, advance, pass, go, come, etc., swiftly, smoothly, or with quick action; -- said of things animate or inanimate. Hence, to flow, glide, or roll onward, as a stream, a snake, a wagon, etc.; to move by quicker action than in walking, as a person, a horse, a dog. Specifically: -- 2. Of voluntary or personal action: (a) To go swiftly; to pass at a swift pace; to hasten. \"Ha, ha, the fox!\" and after him they ran. Chaucer. (b) To flee, as from fear or danger. As from a bear a man would run for life. Shak. (c) To steal off; to depart secretly. My conscience will serve me to run from this jew. Shak. (d) To contend in a race; hence, to enter into a contest; to become a candidate; as, to run for Congress. Know ye not that they which run in a race run all, but one receiveth the prize So run, that ye may obtain. 1 Cor. ix. 24. (e) To pass from one state or condition to another; to come into a certain condition; -- often with in or into; as, to run into evil practices; to run in debt. Have I not cause to rave and beat my breast, to rend my heart with grief and run distracted Addison. (f) To exert continuous activity; to proceed; as, to run through life; to run in a circle. (g) To pass or go quickly in thought or conversation; as, to run from one subject to another. Virgil, in his first Georgic, has run into a set of precepts foreign to his subject. Addison. (h) To discuss; to continue to think or speak about something; -- with on. (i) To make numerous drafts or demands for payment, as upon a bank; - - with on. (j) To creep, as serpents. 3. Of involuntary motion: (a) To flow, as a liquid; to ascend or descend; to course; as, rivers run to the sea; sap runs up in the spring; her blood ran cold. (b) To proceed along a surface; to extend; to spread. The fire ran along upon the ground. Ex. ix. 23. (c) To become fluid; to melt; to fuse. As wax dissolves, as ice begins to run. Addison. Sussex iron ores run freely in the fire. Woodward. (d) To turn, as a wheel; to revolve on an axis or pivot; as, a wheel runs swiftly round. (e) To travel; to make progress; to be moved by mechanical means; to go; as, the steamboat runs regularly to Albany; the train runs to Chicago. (f) To extend; to reach; as, the road runs from Philadelphia to New York; the memory of man runneth not the contrary. She saw with joy the line immortal run, Each sire impressed, and glaring in his son. Pope. (g) To go back and forth from place to place; to ply; as, the stage runs between the hotel and the station. (h) To make progress; to proceed; to pass. As fast as our time runs, we should be very glad in most part of our lives that it ran much faster. Addison. (i) To continue in operation; to be kept in action or motion; as, this engine runs night and day; the mill runs six days in the week. When we desire anything, our minds run wholly on the good circumstances of it; when it is obtained, our minds run wholly on the bad ones. Swift. (j) To have a course or direction; as, a line runs east and west. Where the generally allowed practice runs counter to it. Locke. Little is the wisdom, where the flight So runs against all reason. Shak. (k) To be in form thus, as a combination of words. The king's ordinary style runneth, \"Our sovereign lord the king.\" Bp. Sanderson. (l) To be popularly known; to be generally received. Men gave them their own names, by which they run a great while in Rome. Sir W. Temple. Neither was he ignorant what report ran of himself. Knolle (m) To have growth or development; as, boys and girls run up rapidly. if the richness of the ground cause turnips to run to leaves. Mortimer. (n) To tend, as to an effect or consequence; to incline. A man's nature runs either to herbs or weeds. Bacon. Temperate climates run into moderate governments. Swift. (o) To spread and blend together; to unite; as, colors run in washing. In the middle of a rainbow the colors are . . . distinguished, but near the borders they run into one another. I. Watts. (p) To have a legal course; to be attached; to continue in force, effect, or operation; to follow; to go in company; as, certain covenants run with the land. Customs run only upon our goods imported or exported, and that but once for all; whereas interest runs as well upon our ships as goods, and must be yearly paid. Sir J. Child. (q) To continue without falling due; to hold good; as, a note has thirty days to run. (r) To discharge pus or other matter; as, an ulcer runs. (s) To be played on the stage a number of successive days or nights; as, the piece ran for six months. (t) (Naut.) To sail before the wind, in distinction from reaching or sailing closehauled; -- said of vessels. 4. Specifically, of horse: To move rapidly in a gait in which each leg acts in turn as a propeller and a supporter, and in which for an instant all the limbs are gathered in the air under the body. Stillman (The Horse in Motion). 5. (Athletics)  To move rapidly by springing steps so that there is an instant in each step when neither foot touches the ground; -- so distinguished from walking in athletic competition. As thing run, according to the usual order, conditions, quality, etc.; on the average; without selection or specification. -- To let run (Naut.), to allow to pass or move freely; to slacken or loosen. -- To run after, to pursue or follow; to search for; to endeavor to find or obtain; as to run after similies. Locke. -- To run away, to flee; to escape; to elope; to run without control or guidance. -- To run away with. (a) To convey away hurriedly; to accompany in escape or elopement. (b) To drag rapidly and with violence; as, a horse runs away with a carriage. -- To run down. (a) To cease to work or operate on account of the exhaustion of the motive power; -- said of clocks, watches, etc. (b) To decline in condition; as, to run down in health. -- To run down a coast, to sail along it. -- To run for an office, to stand as a candidate for an office. -- To run in or into. (a) To enter; to step in. (b) To come in collision with. -- To run in trust, to run in debt; to get credit. [Obs.] -- To run in with. (a) To close; to comply; to agree with. [R.] T. Baker. (b) (Naut.) To make toward; to near; to sail close to; as, to run in with the land. -- To run mad, To run mad after or on. See under Mad. -- To run on. (a) To be continued; as, their accounts had run on for a year or two without a settlement. (b) To talk incessantly. (c) To continue a course. (d) To press with jokes or ridicule; to abuse with sarcasm; to bear hard on. (e) (Print.) To be continued in the same lines, without making a break or beginning a new paragraph. -- To run out. (a) To come to an end; to expire; as, the lease runs out Michaelmas. (b) To extend; to spread. \"Insectile animals . . . run all out into legs.\" Hammond. (c) To expatiate; as, to run out into beautiful digressions. (d) To be wasted or exhausted; to become poor; to become extinct; as, an estate managed without economy will soon run out. And had her stock been less, no doubt She must have long ago run out. Dryden. -- To run over. (a) To overflow; as, a cup runs over, or the liquor runs over. (b) To go over, examine, or rehearse cursorily. (c) To ride or drive over; as, to run over a child. -- To run riot, to go to excess. -- To run through. (a) To go through hastily; as to run through a book. (b) To spend wastefully; as, to run through an estate. -- To run to seed, to expend or exhaust vitality in producing seed, as a plant; figuratively and colloquially, to cease growing; to lose vital force, as the body or mind. -- To run up, to rise; to swell; to grow; to increase; as, accounts of goods credited run up very fast. But these, having been untrimmed for many years, had run up into great bushes, or rather dwarf trees. Sir W. Scott. -- To run with. (a) To be drenched with, so that streams flow; as, the streets ran with blood. (b) To flow while charged with some foreign substance. \"Its rivers ran with gold.\" J. H. Newman.\n\n1. To cause to run (in the various senses of Run, v. i.); as, to run a horse; to run a stage; to run a machine; to run a rope through a block. 2. To pursue in thought; to carry in contemplation. To run the world back to its first original. South. I would gladly understand the formation of a soul, and run it up to its \"punctum saliens.\" Collier. 3. To cause to enter; to thrust; as, to run a sword into or through the body; to run a nail into the foot. You run your head into the lion's mouth. Sir W. Scott. Having run his fingers through his hair. Dickens. 4. To drive or force; to cause, or permit, to be driven. They ran the ship aground. Acts xxvii. 41. A talkative person runs himself upon great inconveniences by blabbing out his own or other's secrets. Ray. Others, accustomed to retired speculations, run natural philosophy into metaphysical notions. Locke. 5. To fuse; to shape; to mold; to cast; as, to run bullets, and the like. The purest gold must be run and washed. Felton. 6. To cause to be draw; to mark out; to indicate; to determine; as, to run a line. 7. To cause to pass, to evade, offical restrictions; to smuggle; -- said of contraband or dutiable goods. heavy impositions . . . are a strong temptation of running goods. Swift. 8. To go through or accomplish by running; as, to run a race; to run a certain career. 9. To cause to stand as a candidate for office; to support for office; as, to run some one for Congress. [Colloq. U.S.] 10. To encounter or incur, as a danger or risk; as, to run the risk of losing one's life. See To run the chance, below. \"He runneth two dangers.\" Bacon. 11. To put at hazard; to venture; to risk. He would himself be in the Highlands to receive them, and run his fortune with them. Clarendon. 12. To discharge; to emit; to give forth copiously; to be bathed with; as, the pipe or faucet runs hot water. At the base of Pompey's statua, Which all the while ran blood, great Cæsar fell. Shak. 13. To be charged with, or to contain much of, while flowing; as, the rivers ran blood. 14. To conduct; to manage; to carry on; as, to run a factory or a hotel. [Colloq. U.S.] 15. To tease with sarcasms and ridicule. [Colloq.] 16. To sew, as a seam, by passing the needle through material in a continuous line, generally taking a series of stitches on the needle at the same time. 17. To migrate or move in schools; -- said of fish; esp., to ascend a river in order to spawn. To run a blockade, to get to, or away from, a blockaded port in safety. -- To run down. (a) (Hunting) To chase till the object pursued is captured or exhausted; as, to run down, a stag. (b) (Naut.) To run against and sink, as a vessel. (c) To crush; to overthrow; to overbear. \"religion is run down by the license of these times.\" Berkeley. (d) To disparage; to traduce. F. W. Newman. -- To run hard. (a) To press in competition; as, to run one hard in a race. (b) To urge or press importunately. (c) To banter severely. -- To run into the ground, to carry to an absurd extreme; to overdo. [Slang, U.S.] -- To run off, to cause to flow away, as a charge of molten metal from a furnace. -- To run on (Print.), to carry on or continue, as the type for a new sentence, without making a break or commencing a new paragraph. -- To run out. (a) To thrust or push out; to extend. (b) To waste; to exhaust; as, to run out an estate. (c) (Baseball) To put out while running between two bases. -- To run the chances, or one's chances, to encounter all the risks of a certain course. -- To run through, to transfix; to pierce, as with a sword. \"[He] was run through the body by the man who had asked his advice.\" Addison. -- To run up. (a) To thrust up, as anything long and slender. (b) To increase; to enlarge by additions, as an account.run up a bill (c) To erect hastily, as a building.\n\n1. The act of running; as, a long run; a good run; a quick run; to go on the run. 2. A small stream; a brook; a creek. 3. That which runs or flows in the course of a certain operation, or during a certain time; as, a run of must in wine making; the first run of sap in a maple orchard. 4. A course; a series; that which continues in a certain course or series; as, a run of good or bad luck. They who made their arrangements in the first run of misadventure . . . put a seal on their calamities. Burke. 5. State of being current; currency; popularity. it is impossible for detached papers to have a general run, or long continuance, if not diversified with humor. Addison. 6. Continued repetition on the stage; -- said of a play; as, to have a run of a hundred successive nights. A canting, mawkish play . . . had an immense run. Macaulay. 7. A continuing urgent demand; especially, a pressure on a bank or treasury for payment of its notes. 8. A range or extent of ground for feeding stock; as, a sheep run. Howitt. 9. (Naut.) (a) The aftermost part of a vessel's hull where it narrows toward the stern, under the quarter (b) The distance sailed by a ship; as, a good run; a run of fifty miles. (c) A voyage; as, run to China. 10. A pleasure excursion; a trip. [Colloq.] A think of giving her a run in London. Dickens. 11. (Mining)  The horizontal distance to which a drift may be carried, either by license of the proprietor of a mine or by the nature of the formation; also, the direction which a vein of ore or other substance takes. 12. (Mus.)  A roulade, or series of running tones. 13. (Mil.)  The greatest degree of swiftness in marching. It is executed upon the same principles as the double-quick, but with greater speed. 14. The act of migrating, or ascending a river to spawn; -- said of fish; also, an assemblage or school of fishes which migrate, or ascend a river for the purpose of spawning. 15. In baseball, a complete circuit of the bases made by a player, which enables him to score one; in cricket, a passing from one wicket to the other, by which one point is scored; as, a player made three runs; the side went out with two hundred runs. The \"runs\" are made from wicket to wicket, the batsmen interchanging ends at each run. R. A. Proctor. 16. A pair or set of millstones. At the long run, now, commonly, In the long run, in or during the whole process or course of things taken together; in the final result; in the end; finally. [Man] starts the inferior of the brute animals, but he surpasses them in the long run. J. H. Newman. -- Home run. (a) A running or returning toward home, or to the point from which the start was made. Cf. Home stretch. (b) (Baseball) See under Home. -- The run, or The common run, etc., ordinary persons; the generality or average of people or things; also, that which ordinarily occurs; ordinary current, course, or kind. I saw nothing else that is superior to the common run of parks. Walpole. Burns never dreamed of looking down on others as beneath him, merely because he was conscious of his own vast superiority to the common run of men. Prof. Wilson. His whole appearance was something out of the common run. W. Irving. -- To let go by the run (Naut.), to loosen and let run freely, as lines; to let fall without restraint, as a sail.\n\n1. Melted, or made from molten material; cast in a mold; as, run butter; run iron or lead. 2. Smuggled; as, run goods. [Colloq.] Miss Edgeworth. Run steel, malleable iron castings. See under Malleable. Raymond."}