{"word":"rust","definition":"1. (Chem.)  The reddish yellow coating formed on iron when exposed to moist air, consisting of ferric oxide or hydroxide; hence, by extension, any metallic film of corrosion. 2. (Bot.)  A minute mold or fungus forming reddish or rusty spots on the leaves and stems of cereal and other grasses (Trichobasis Rubigo- vera), now usually believed to be a form or condition of the corn mildew (Puccinia graminis). As rust, it has solitary reddish spores; as corn mildew, the spores are double and blackish. Note: Rust is also applied to many other minute fungi which infest vegetation, such as the species of Ustilago, Uredo, and Lecythea. 3. That which resembles rust in appearance or effects. Specifically: (a) A composition used in making a rust joint. See Rust joint, below. (b) Foul matter arising from degeneration; as, rust on salted meat. (c) Corrosive or injurious accretion or influence. Sacred truths cleared from all rust and dross of human mixtures. Eikon Basilike. Note: Rust is used in the formation of compounds of obvious meaning; as, rust-colored, rust-consumed, rust-eaten, and the like. Rust joint, a joint made between surfaces of iron by filling the space between them with a wet mixture of cast-iron borings, sal ammoniac, and sulphur, which by oxidation becomes hard, and impervious to steam, water, etc. -- Rust mite (Zoöl.), a minute mite (Phytopius oleivorus) which, by puncturing the rind, causes the rust-colored patches on oranges.\n\n1. To contract rust; to be become oxidized. If gold ruste, what shall iron do Chaucer. Our armors now may rust. Dryden. 2. To be affected with the parasitic fungus called rust; also, to acquire a rusty appearance. as plants. 3. Fig.: To degenerate in idleness; to become dull or impaired by inaction. Must I rust in Egypt never more Appear in arms, and be the chief of Greece Dryden.\n\n1. To cause to contract rust; to corrode with rust; to affect with rust of any kind. Keep up your bright swords, for the dew will rust them. Shak. 2. Fig.: To impair by time and inactivity. Johmson."}