{"word":"saddle","definition":"1. A seat for a rider, -- usually made of leather, padded to span comfortably a horse's back, furnished with stirrups for the rider's feet to rest in, and fastened in place with a girth; also, a seat for the rider on a bicycle or tricycle. 2. A padded part of a harness which is worn on a horse's back, being fastened in place with a girth. It serves various purposes, as to keep the breeching in place, carry guides for the reins, etc. 3. A piece of meat containing a part of the backbone of an animal with the ribs on each side; as, a saddle of mutton, of venison, etc. 4. (Naut.)  A block of wood, usually fastened to some spar, and shaped to receive the end of another spar. 5. (Mach.)  A part, as a flange, which is hollowed out to fit upon a convex surface and serve as a means of attachment or support. 6. (Zoöl.)  The clitellus of an earthworm. 7. (Arch.)  The threshold of a door, when a separate piece from the floor or landing; -- so called because it spans and covers the joint between two floors. Saddle bar (Arch.), one the small iron bars to which the lead panels of a glazed window are secured. Oxf. Gloss. -- Saddle gall (Far.), a sore or gall upon a horse's back, made by the saddle. -- Saddle girth, a band passing round the body of a horse to hold the saddle in its place. -- saddle horse, a horse suitable or trained for riding with a saddle. -- Saddle joint, in sheet-metal roofing, a joint formed by bending up the edge of a sheet and folding it downward over the turned-up edge of the next sheet. -- Saddle roof (Arch.), a roof having two gables and one ridge; -- said of such a roof when used in places where a different form is more common; as, a tower surmounted by a saddle roof. Called also saddleback roof. -- Saddle shell (Zoöl.), any thin plicated bivalve shaell of the genera Placuna and Anomia; -- so called from its shape. Called also saddle oyster.\n\n1. To put a saddle upon; to equip (a beast) for riding. \"saddle my horse.\" Shak. Abraham rose up early saddled his ass. Gen. xxii. 3. 2. Hence: To fix as a charge or burden upon; to load; to encumber; as, to saddle a town with the expense of bridges and highways."}