{"word":"safety","definition":"1. The condition or state of being safe; freedom from danger or hazard; exemption from hurt, injury, or loss. Up led by thee, Into the heaven I have presumed, An earthly guest . . . With like safety guided down, Return me to my native element. Milton. 2. Freedom from whatever exposes one to danger or from libility to cause danger or harm; safeness; hence, the quality of making safe or secure, or of giving confidence, justifying trust, insuring against harm or loss, etc. Would there were any safety in thy sex, That I might put a thousand sorrows off. Beau. & Fl. 3. Preservation from escape; close custody. Imprison him, . . . Deliver him to safety; and return. Shak. 4. (Football)  Same as Safety touchdown, below. Safety arch (Arch.), a discharging arch. See under Discharge, v. t. -- Safety belt, a belt made of some buoyant material, or which is capable of being inflated, so as to enable a person to float in water; a life preserver. -- Safety buoy, a buoy to enable a person to float in water; a safety belt. -- Safety cage (Mach.), a cage for an elevator or mine lift, having appliances to prevent it from dropping if the lifting rope should break. -- Safety lamp. (Mining) See under Lamp. -- Safety match, a match which can be ignited only on a surface specially prepared for the purpose. -- Safety pin, a pin made in the form of a clasp, with a guard covering its point so that it will not prick the wearer. -- safety plug. See Fusible plug, under Fusible. -- Safety switch. See Switch. -- Safety touchdown (Football), the act or result of a player's touching to the ground behind his own goal line a ball which received its last impulse from a man on his own side; -- distinguished from touchback. See Touchdown. -- Safety tube (Chem.), a tube to prevent explosion, or to control delivery of gases by an automatic valvular connection with the outer air; especially, a bent funnel tube with bulbs for adding those reagents which produce unpleasant fumes or violent effervescence. -- Safety valve, a valve which is held shut by a spring or weight and opens automatically to permit the escape of steam, or confined gas, water, etc., from a boiler, or other vessel, when the pressure becomes too great for safety; also, sometimes, a similar valve opening inward to admit air to a vessel in which the pressure is less than that of the atmosphere, to prevent collapse."}