{"word":"sage","definition":"(a) A suffriticose labiate plant (Salvia officinalis) with grayish green foliage, much used in flavoring meats, etc. The name is often extended to the whole genus, of which many species are cultivated for ornament, as the scarlet sage, and Mexican red and blue sage. (b) The sagebrush. Meadow sage (Bot.), a blue-flowered species of salvia (S. pratensis) growing in meadows in Europe. -- Sage cheese, cheese flavored with sage, and colored green by the juice of leaves of spanish and other plants which are added to the milk. -- Sage cock (Zoöl.), the male of the sage grouse; in a more general sense, the specific name of the sage grouse. -- Sage green, of a dull grayish green color, like the leaves of garden sage. -- Sage grouse (Zoöl.), a very large American grouse (Centrocercus urophasianus), native of the dry sagebrush plains of Western North America. Called also cock of the plains. The male is called sage cock, and the female sage hen. -- Sage hare, or Sage rabbit (Zoöl.), a species of hare (Lepus Nuttalli, or artemisia) which inhabits the regions of Western North America and lives among sagebrush. By recent writers it is considered to be merely a variety of the common cottontail, or wood rabbit. -- Sage hen (Zoöl.), the female of the sage grouse. Sage sparrow (Zoöl.), a small sparrow (Amphispiza Belli, var Nevadensis) which inhabits the dry plains of the Rocky Mountain region, living among sagebrush. -- Sage thrasher (Zoöl.), a singing bird (Oroscoptes montanus) which inhabits the sagebrush plains of Western North America. -- Sage willow (Bot.), a species of willow (Salix tristis) forming a low bush with nearly sessile grayish green leaves.\n\n1. Having nice discernment and powers of judging; prudent; grave; sagacious. All you sage counselors, hence! Shak. 2. Proceeding from wisdom; well judged; shrewd; well adapted to the purpose. Commanders, who, cloaking their fear under show of sage advice, counseled the general to retreat. Milton. 3. Grave; serious; solemn. [R.] \"[Great bards.] in sage and solemn tunes have sung.\" Milton. Syn. -- Wise; sagacious; sapient; grave; prudent; judicious.\n\nA wise man; a man of gravity and wisdom; especially, a man venerable for years, and of sound judgment and prudence; a grave philosopher. At his birth a star, Unseen before in heaven, proclaims him come, And guides the Eastern sages. Milton."}