{"word":"sail","definition":"1. An extent of canvas or other fabric by means of which the wind is made serviceable as a power for propelling vessels through the water. Behoves him now both sail and oar. Milton. 2. Anything resembling a sail, or regarded as a sail. 3. A wing; a van. [Poetic] Like an eagle soaring To weather his broad sails. Spenser . 4. the extended surface of the arm of a windmill. 5. A sailing vessel; a vessel of any kind; a craft. Note: In this sense, the plural has usually the same forms as the singular; as, twenty sail were in sight. 6. A passage by a sailing vessel; a journey or excursion upon the water. Note: Sails are of two general kinds, fore-and-aft sails, and square sails. Square sails are always bent to yards, with their foot lying across the line of the vessel. Fore-and-aft sails are set upon stays or gaffs with their foot in line with the keel. A fore-and-aft sail is triangular, or quadrilateral with the after leech longer than the fore leech. Square sails are quardrilateral, but not necessarily square. See Phrases under Fore, a., and Square, a.; also, Bark, Brig, Schooner, Ship, Stay. Sail burton (Naut.), a purchase for hoisting sails aloft for bending. -- Sail fluke (Zoöl.), the whiff. -- Sail hook, a small hook used in making sails, to hold the seams square. -- Sail loft, a loft or room where sails are cut out and made. -- Sail room (Naut.), a room in a vessel where sails are stowed when not in use. -- Sail yard (Naut.), the yard or spar on which a sail is extended. -- Shoulder-of-mutton sail (Naut.), a triangular sail of peculiar form. It is chiefly used to set on a boat's mast. -- To crowd sail. (Naut.) See under Crowd. -- To loose sails (Naut.), to unfurl or spread sails. -- To make sail (Naut.), to extend an additional quantity of sail. -- To set a sail (Naut.), to extend or spread a sail to the wind. -- To set sail (Naut.), to unfurl or spread the sails; hence, to begin a voyage. -- To shorten sail (Naut.), to reduce the extent of sail, or take in a part. -- To strike sail (Naut.), to lower the sails suddenly, as in saluting, or in sudden gusts of wind; hence, to acknowledge inferiority; to abate pretension. -- Under sail, having the sails spread.\n\n1. To be impelled or driven forward by the action of wind upon sails, as a ship on water; to be impelled on a body of water by the action of steam or other power. 2. To move through or on the water; to swim, as a fish or a water fowl. 3. To be conveyed in a vessel on water; to pass by water; as, they sailed from London to Canton. 4. To set sail; to begin a voyage. 5. To move smoothly through the air; to glide through the air without apparent exertion, as a bird. As is a winged messenger of heaven, . . . When he bestrides the lazy pacing clouds, And sails upon the bosom of the air. Shak.\n\n1. To pass or move upon, as in a ship, by means of sails; hence, to move or journey upon(the water) by means of steam or other force. A thousand ships were manned to sail the sea. Dryden. 2. To fly through; to glide or move smoothly through. Sublime she sails The aërial space, and mounts the winged gales. Pope. 3. To direct or manage the motion of, as a vessel; as, to sail one's own ship. Totten."}