{"word":"saint","definition":"1. A person sanctified; a holy or godly person; one eminent for piety and virtue; any true Christian, as being redeemed and consecrated to God. Them that are sanctified in Christ Jesus, called to be saints. 1 Cor. i. 2. 2. One of the blessed in heaven. Then shall thy saints, unmixed, and from the impure Far separate, circling thy holy mount, Unfeigned hallelujahs to thee sing. Milton. 3. (Eccl.)  One canonized by the church. [Abbrev. St.] Saint Andrew's cross (a) A cross shaped like the letter X. See Illust. 4, under Cross. (b) (Bot.) A low North American shrub (Ascyrum Crux-Andræ, the petals of which have the form of a Saint Andrew's cross. Gray. -- Saint Anthony's cross, a T-shaped cross. See Illust. 6, under Cross. -- Saint Anthony's fire, the erysipelas; -- popularly so called because it was supposed to have been cured by the intercession of Saint Anthony. -- Saint Anthony's nut (Bot.), the groundnut (Bunium flexuosum); -- so called because swine feed on it, and St. Anthony was once a swineherd. Dr. Prior. -- Saint Anthony's turnip (Bot.), the bulbous crowfoot, a favorite food of swine. Dr. Prior. -- Saint Barnaby's thistle (Bot.), a kind of knapeweed (Centaurea solstitialis) flowering on St. Barnabas's Day, June 11th. Dr. Prior. -- Saint Bernard (Zoöl.), a breed of large, handsome dogs celebrated for strength and sagacity, formerly bred chiefly at the Hospice of St. Bernard in Switzerland, but now common in Europe and America. There are two races, the smooth-haired and the rough-haired. See Illust. under Dog. -- Saint Catharine's flower (Bot.), the plant love-a-mist. See under Love. -- Saint Cuthbert's beads (Paleon.), the fossil joints of crinoid stems. -- Saint Dabeoc's heath (Bot.), a heatherlike plant (Dabæcia polifolia), named from an Irish saint. -- Saint Distaff's Day. See under Distaff. -- Saint Elmo's fire, a luminious, flamelike appearance, sometimes seen in dark, tempestuous nights, at some prominent point on a ship, particularly at the masthead and the yardams. It has also been observed on land, and is due to the discharge of electricity from elevated or pointed objects. A single flame is called a Helena, or a Corposant; a double, or twin, flame is called a Castor and Pollux, or a double Corposant. It takes its name from St. Elmo, the patron saint of sailors. -- Saint George's cross (Her.), a Greek cross gules upon a field argent, the field being represented by a narrow fimbriation in the ensign, or union jack, of Great Britain. -- Saint George's ensign, a red cross on a white field with a union jack in the upper corner next the mast. It is the distinguishing badge of ships of the royal navy of England; -- called also the white ensign. Brande & C. -- Saint George's flag, a smaller flag resembling the ensign, but without the union jack; used as the sign of the presence and command of an admiral. [Eng.] Brande & C. -- Saint Gobain glass (Chem.), a fine variety of soda-lime plate glass, so called from St.Gobain in France, where it was manufactured. -- Saint Ignatius's bean (Bot.), the seed of a tree of the Philippines (Strychnos Ignatia), of properties similar to the nux vomica. -- Saint Jame's shell (Zoöl.), a pecten (Vola Jacobæus) worn by piligrims to the Holy Land. See Illust. under Scallop. -- Saint Jame's wort (Bot.), a kind of ragwort (Senecio Jacobæa). -- Saint John's bread. (Bot.) See Carob. -- Saint John's-wort (Bot.), any plant of the genus Hypericum, most species of which have yellow flowers; -- called also John's-wort. -- Saint Leger, the name of a race for three-year-old horses run annually in September at Doncaster, England; -- instituted in 1776 by Col. St. Leger. -- Saint Martin's herb (Bot.), a small tropical American violaceous plant (Sauvagesia erecta). It is very mucilaginous and is used in medicine. -- Saint Martin's summer, a season of mild, damp weather frequently prevailing during late autumn in England and the Mediterranean countries; -- so called from St. Martin's Festival, occuring on November 11. It corresponds to the Indian summer in America. Shak. Whitier. -- Saint Patrick's cross. See Illust 4, under Cross. -- Saint Patrick's Day, the 17th of March, anniversary of the death (about 466) of St. Patrick, the apostle and patron saint of Ireland. -- Saint Peter's fish. (Zoöl.) See John Dory, under John. -- Saint Peter's-wort (Bot.), a name of several plants, as Hypericum Ascyron, H. quadrangulum, Ascyrum stans, etc. -- Saint Peter's wreath (Bot.), a shrubby kind of Spiræa (S. hypericifolia), having long slender branches covered with clusters of small white blossoms in spring. -- Saint's bell. See Sanctus bell, under Sanctus. -- Saint Vitus's dance (Med.), chorea; -- so called from the supposed cures wrought on intercession to this saint.\n\nTo make a saint of; to enroll among the saints by an offical act, as of the pope; to canonize; to give the title or reputation of a saint to (some one). A large hospital, erected by a shoemaker who has been beatified, though never sainted. Addison. To saint it, to act as a saint, or with a show of piety. Whether the charmer sinner it or saint it. Shak.\n\nTo act or live as a saint. [R.] Shak."}