{"word":"salmon","definition":"1. (Zoöl.)  Any one of several species of fishes of the genus Salmo and allied genera. The common salmon (Salmo salar) of Northern Europe and Eastern North America, and the California salmon, or quinnat, are the most important species. They are extensively preserved for food. See Quinnat. Note: The salmons ascend rivers and penetrate to their head streams to spawn. They are remarkably strong fishes, and will even leap over considerable falls which lie in the way of their progress. The common salmon has been known to grow to the weight of seventy-five pounds; more generally it is from fifteen to twenty-five pounds. Young salmon are called parr, peal, smolt, and grilse. Among the true salmons are: Black salmon, or Lake salmon, the namaycush. -- Dog salmon, a salmon of Western North America (Oncorhynchus keta). -- Humpbacked salmon, a Pacific-coast salmon (Oncorhynchus gorbuscha). -- King salmon, the quinnat. -- Landlocked salmon, a variety of the common salmon (var. Sebago), long confined in certain lakes in consequence of obstructions that prevented it from returning to the sea. This last is called also dwarf salmon. Among fishes of other families which are locally and erroneously called salmon are: the pike perch, called jack salmon; the spotted, or southern, squeteague; the cabrilla, called kelp salmon; young pollock, called sea salmon; and the California yellowtail. 2. A reddish yellow or orange color, like the flesh of the salmon. Salmon berry (Bot.), a large red raspberry growing from Alaska to California, the fruit of the Rubus Nutkanus. -- Salmon killer (Zoöl.), a stickleback (Gasterosteus cataphractus) of Western North America and Northern Asia. -- Salmon ladder, salmon stair. See Fish ladder, under Fish. -- Salmon peel, a young salmon. -- Salmon pipe, a certain device for catching salmon. Crabb. -- Salmon trout. (Zoöl.) (a) The European sea trout (Salmo trutta). It resembles the salmon, but is smaller, and has smaller and more numerous scales. (b) The American namaycush. (c) A name that is also applied locally to the adult black spotted trout (Salmo purpuratus), and to the steel head and other large trout of the Pacific coast.\n\nOf a reddish yellow or orange color, like that of the flesh of the salmon."}