{"word":"salt","definition":"1. The chloride of sodium, a substance used for seasoning food, for the preservation of meat, etc. It is found native in the earth, and is also produced, by evaporation and crystallization, from sea water and other water impregnated with saline particles. 2. Hence, flavor; taste; savor; smack; seasoning. Though we are justices and doctors and churchmen . . . we have some salt of our youth in us. Shak. 3. Hence, also, piquancy; wit; sense; as, Attic salt. 4. A dish for salt at table; a saltcellar. I out and bought some things; among others, a dozen of silver salts. Pepys. 5. A sailor; -- usually qualified by old. [Colloq.] Around the door are generally to be seen, laughing and gossiping, clusters of old salts. Hawthorne. 6. (Chem.)  The neutral compound formed by the union of an acid base; thus, sulphuric acid and iron form the salt sulphate of iron or green vitriol. Note: Except in case of ammonium salts, accurately speaking, it is the acid radical which unites with the base or basic radical, with the elimination of hydrogen, of water, or of analogous compounds as side products. In the case of diacid and triacid bases, and of dibasic and tribasic acids, the mutual neutralization may vary in degree, producing respectively basic, neutral, or acid salts See Phrases below. 7. Fig.: That which preserves from corruption or error; that which purifies; a corrective; an antiseptic; also, an allowance or deduction; as, his statements must be taken with a grain of salt. Ye are the salt of the earth. Matt. v. 13. 8. pl.  Any mineral salt used as an aperient or cathartic, especially Epsom salts, Rochelle salt, or Glauber's salt. 9. pl.  Marches flooded by the tide. [Prov. Eng.] Above the salt, Below the salt, phrases which have survived the old custom, in the houses of people of rank, of placing a large saltcellar near the middle of a long table, the places above which were assigned to the guests of distinction, and those below to dependents, inferiors, and poor relations. See Saltfoot. His fashion is not to take knowledge of him that is beneath him in clothes. He never drinks below the salt. B. Jonson. -- Acid salt (Chem.) (a) A salt derived from an acid which has several replaceable hydrogen atoms which are only partially exchanged for metallic atoms or basic radicals; as, acid potassium sulphate is an acid salt. (b) A salt, whatever its constitution, which merely gives an acid reaction; thus, copper sulphate, which is composed of a strong acid united with a weak base, is an acid salt in this sense, though theoretically it is a neutral salt. -- Alkaline salt (Chem.), a salt which gives an alkaline reaction, as sodium carbonate. -- Amphid salt (Old Chem.), a salt of the oxy type, formerly regarded as composed of two oxides, an acid and a basic oxide. [Obsolescent] -- Basic salt (Chem.) (a) A salt which contains more of the basic constituent than is required to neutralize the acid. (b) An alkaline salt. -- Binary salt (Chem.), a salt of the oxy type conveniently regarded as composed of two ingredients (analogously to a haloid salt), viz., a metal and an acid radical. -- Double salt (Chem.), a salt regarded as formed by the union of two distinct salts, as common alum, potassium aluminium sulphate. See under Double. -- Epsom salts. See in the Vocabulary. -- Essential salt (Old Chem.), a salt obtained by crystalizing plant juices. -- Ethereal salt. (Chem.) See under Ethereal. -- Glauber's salt or salts. See in Vocabulary. -- Haloid salt (Chem.), a simple salt of a halogen acid, as sodium chloride. -- Microcosmic salt. (Chem.). See under Microcosmic. -- Neutral salt. (Chem.) (a A salt in which the acid and base (in theory) neutralize each other. (b) A salt which gives a neutral reaction. -- Oxy salt (Chem.), a salt derived from an oxygen acid. -- Per salt (Old Chem.), a salt supposed to be derived from a peroxide base or analogous compound. [Obs.] -- Permanent salt, a salt which undergoes no change on exposure to the air. -- Proto salt (Chem.), a salt derived from a protoxide base or analogous compound. -- Rochelle salt. See under Rochelle. -- Salt of amber (Old Chem.), succinic acid. -- Salt of colcothar (Old Chem.), green vitriol, or sulphate of iron. -- Salt of hartshorn. (Old Chem.) (a) Sal ammoniac, or ammonium chloride. (b) Ammonium carbonate. Cf. Spirit of hartshorn, under Hartshorn. -- Salt of lemons. (Chem.) See Salt of sorrel, below. -- Salt of Saturn (Old Chem.), sugar of lead; lead acetate; -- the alchemical of lead being Saturn. -- Salt of Seignette. Same as Rochelle salt. -- Salt of soda (Old Chem.), sodium carbonate. -- Salt of sorrel (Old Chem.), acid potassium oxalate, or potassium quadroxalate, used as a solvent for ink stains; -- so called because found in the sorrel, or Oxalis. Also sometimes inaccurately called salt of lemon. -- Salt of tartar (Old Chem.), potassium carbonate; -- so called because formerly made by heating cream of tartar, or potassium tartrate. [Obs.] -- Salt of Venus (Old Chem.), blue vitriol; copper sulphate; -- the alchemical name of copper being Venus. -- Salt of wisdom. See Alembroth. -- Sedative salt (Old Med. Chem.), boric acid. -- Sesqui salt (Chem.), a salt derived from a sesquioxide base or analogous compound. -- Spirit of salt. (Chem.) See under Spirit. -- Sulpho salt (Chem.), a salt analogous to an oxy salt, but containing sulphur in place of oxygen.\n\n1. Of or relating to salt; abounding in, or containing, salt; prepared or preserved with, or tasting of, salt; salted; as, salt beef; salt water. \"Salt tears.\" Chaucer. 2. Overflowed with, or growing in, salt water; as, a salt marsh; salt grass. 3. Fig.: Bitter; sharp; pungent. I have a salt and sorry rheum offends me. Shak. 4. Fig.: Salacious; lecherous; lustful. Shak. Salt acid (Chem.), hydrochloric acid. -- Salt block, an apparatus for evaporating brine; a salt factory. Knight. -- Salt bottom, a flat piece of ground covered with saline efforescences. [Western U.S.] bartlett. -- Salt cake (Chem.), the white caked mass, consisting of sodium sulphate, which is obtained as the product of the first stage in the manufacture of soda, according to Leblanc's process. -- Salt fish. (a) Salted fish, especially cod, haddock, and similar fishes that have been salted and dried for food. (b) A marine fish. -- Salt garden, an arrangement for the natural evaporation of sea water for the production of salt, employing large shallow basins excavated near the seashore. -- Salt gauge, an instrument used to test the strength of brine; a salimeter. -- Salt horse, salted beef. [Slang] -- Salt junk, hard salt beef for use at sea. [Slang] -- Salt lick. See Lick, n. -- Salt marsh, grass land subject to the overflow of salt water. -- Salt-marsh caterpillar (Zoöl.), an American bombycid moth (Spilosoma acreæ which is very destructive to the salt-marsh grasses and to other crops. Called also wooly bear. See Illust. under Moth, Pupa, and Woolly bear, under Woolly. -- Salt-marsh fleabane (Bot.), a strong-scented composite herb (Pluchea camphorata) with rayless purplish heads, growing in salt marshes. -- Salt-marsh hen (Zoöl.), the clapper rail. See under Rail. -- Salt-marsh terrapin (Zoöl.), the diamond-back. -- Salt mine, a mine where rock salt is obtained. -- Salt pan. (a) A large pan used for making salt by evaporation; also, a shallow basin in the ground where salt water is evaporated by the heat of the sun. (b) pl. Salt works. -- Salt pit, a pit where salt is obtained or made. -- Salt rising, a kind of yeast in which common salt is a principal ingredient. [U.S.] -- Salt raker, one who collects salt in natural salt ponds, or inclosures from the sea. -- Salt sedative (Chem.), boracic acid. [Obs.] -- Salt spring, a spring of salt water. -- Salt tree (Bot.), a small leguminous tree (Halimodendron argenteum) growing in the salt plains of the Caspian region and in Siberia. -- Salt water, water impregnated with salt, as that of the ocean and of certain seas and lakes; sometimes, also tears. Mine eyes are full of tears, I can not see; And yet salt water blinds them not so much But they can see a sort of traitors here. Shak. -- Salt-water sailor, an ocean mariner. -- Salt-water tailor. (Zoöl.) See Bluefish.\n\n1. To sprinkle, impregnate, or season with salt; to preserve with salt or in brine; to supply with salt; as, to salt fish, beef, or pork; to salt cattle. 2. To fill with salt between the timbers and planks, as a ship, for the preservation of the timber. To salt a mine, to artfully deposit minerals in a mine in order to deceive purchasers regarding its value. [Cant] -- To salt away, To salt down, to prepare with, or pack in, salt for preserving, as meat, eggs, etc.; hence, colloquially, to save, lay up, or invest sagely, as money.\n\nTo deposit salt as a saline solution; as, the brine begins to salt.\n\nThe act of leaping or jumping; a leap. [Obs.] B. Jonson."}