{"word":"say","definition":"Saw. Chaucer.\n\n1. Trial by sample; assay; sample; specimen; smack. [Obs.] if those principal works of God . . . be but certain tastes and saus, as if were, of that final benefit. Hooker. Thy tongue some say of breeding breathes. Shak. 2. Tried quality; temper; proof. [Obs.] he found a sword of better say. Spenser. 3. Essay; trial; attempt. [Obs.] To give a say at, to attempt. B. Jonson.\n\nTo try; to assay. [Obs.] B. Jonson.\n\n1. A kind of silk or satin. [Obs.] Thou say, thou serge, nay, thou buckram lord! Shak. 2. A delicate kind of serge, or woolen cloth. [Obs.] His garment neither was of silk nor say. Spenser.\n\n1. To utter or express in words; to tell; to speak; to declare; as, he said many wise things. Arise, and say how thou camest here. Shak. 2. To repeat; to rehearse; to recite; to pronounce; as, to say a lesson. Of my instruction hast thou nothing bated In what thou hadst to say Shak. After which shall be said or sung the following hymn. Bk. of Com. Prayer. 3. To announce as a decision or opinion; to state positively; to assert; hence, to form an opinion upon; to be sure about; to be determined in mind as to. But what it is, hard is to say. Milton. 4. To mention or suggest as an estimate, hypothesis, or approximation; hence, to suppose; -- in the imperative, followed sometimes by the subjunctive; as, he had, say fifty thousand dollars; the fox had run, say ten miles. Say, for nonpayment that the debt should double, Is twenty hundred kisses such a trouble Shak. It is said, or They say, it is commonly reported; it is rumored; people assert or maintain. -- That is to say, that is; in other words; otherwise.\n\nTo speak; to express an opinion; to make answer; to reply. You have said; but whether wisely or no, let the forest judge. Shak. To this argument we shall soon have said; for what concerns it us to hear a husband divulge his household privacies Milton.\n\nA speech; something said; an expression of opinion; a current story; a maxim or proverb. [Archaic or Colloq.] He no sooner said out his say, but up rises a cunning snap. L'Estrange. That strange palmer's boding say, That fell so ominous and drear Full on the object of his fear. Sir W. Scott."}