{"word":"scale","definition":"1. The dish of a balance; hence, the balance itself; an instrument or machine for weighing; as, to turn the scale; -- chiefly used in the plural when applied to the whole instrument or apparatus for weighing. Also used figuratively. Long time in even scale The battle hung. Milton. The scales are turned; her kindness weighs no more Now than my vows. Waller. 2. (Astron.)  The sign or constellation Libra. Platform scale. See under Platform. tip the scales, influence an action so as to change an outcome from one likely result to another.\n\nTo weigh or measure according to a scale; to measure; also, to grade or vary according to a scale or system. Scaling his present bearing with his past. Shak. To scale, or scale down, a debt, wages, etc., to reduce a debt, etc., according to a fixed ratio or scale. [U.S.]\n\n1. (Anat.)  One of the small, thin, membranous, bony or horny pieces which form the covering of many fishes and reptiles, and some mammals, belonging to the dermal part of the skeleton, or dermoskeleton. See Cycloid, Ctenoid, and Ganoid. Fish that, with their fins and shining scales, Glide under the green wave. Milton. 2. Hence, any layer or leaf of metal or other material, resembling in size and thinness the scale of a fish; as, a scale of iron, of bone, etc. 3. (Zoöl.)  One of the small scalelike structures covering parts of some invertebrates, as those on the wings of Lepidoptera and on the body of Thysanura; the elytra of certain annelids. See Lepidoptera. 4. (Zoöl.)  A scale insect. (See below.) 5. (Bot.)  A small appendage like a rudimentary leaf, resembling the scales of a fish in form, and often in arrangement; as, the scale of a bud, of a pine cone, and the like. The name is also given to the chaff on the stems of ferns. 6. The thin metallic side plate of the handle of a pocketknife. See Illust. of Pocketknife. 7. An incrustation deposit on the inside of a vessel in which water is heated, as a steam boiler. 8. (Metal.)  The thin oxide which forms on the surface of iron forgings. It consists esentially of the magnetic oxide, Fe3O4. Also, a similar coating upon other metals. Covering scale (Zoöl.), a hydrophyllium. -- Ganoid scale (Zoöl.) See under Ganoid. -- Scale armor (Mil.), armor made of small metallic scales overlapping, and fastened upon leather or cloth. -- Scale beetle (Zoöl.), the tiger beetle. -- Scale carp (Zoöl.), a carp having normal scales. -- Scale insect (Zoöl.), any one of numerous species of small hemipterous insects belonging to the family Coccidæ, in which the females, when adult, become more or less scalelike in form. They are found upon the leaves and twigs of various trees and shrubs, and often do great damage to fruit trees. See Orange scale,under Orange. -- Scale moss (Bot.), any leafy-stemmed moss of the order Hepaticæ; -- so called from the small imbricated scalelike leaves of most of the species. See Hepatica, 2, and Jungermannia.\n\n1. To strip or clear of scale or scales; as, to scale a fish; to scale the inside of a boiler. 2. To take off in thin layers or scales, as tartar from the teeth; to pare off, as a surface. \"If all the mountaines were scaled, and the earth made even.\" T. Burnet. 3. To scatter; to spread. [Scot. & Prov. Eng.] 4. (Gun.)  To clean, as the inside of a cannon, by the explosion of a small quantity of powder. Totten.\n\n1. To separate and come off in thin layers or laminæ; as, some sandstone scales by exposure. Those that cast their shell are the lobster and crab; the old skins are found, but the old shells never; so it is likely that they scale off. Bacon. 2. To separate; to scatter. [Scot. & Prov. Eng.]\n\n1. A ladder; a series of steps; a means of ascending. [Obs.] 2. Hence, anything graduated, especially when employed as a measure or rule, or marked by lines at regular intervals. Specifically: (a) A mathematical instrument, consisting of a slip of wood, ivory, or metal, with one or more sets of spaces graduated and numbered on its surface, for measuring or laying off distances, etc., as in drawing, plotting, and the like. See Gunter's scale. (b) A series of spaces marked by lines, and representing proportionately larger distances; as, a scale of miles, yards, feet, etc., for a map or plan. (c) A basis for a numeral system; as, the decimal scale; the binary scale, etc. (d) (Mus.) The graduated series of all the tones, ascending or descending, from the keynote to its octave; -- called also the gamut. It may be repeated through any number of octaves. See Chromatic scale, Diatonic scale, Major scale, and Minor scale, under Chromatic, Diatonic, Major, and Minor. 3. Gradation; succession of ascending and descending steps and degrees; progressive series; scheme of comparative rank or order; as, a scale of being. There is a certain scale of duties . . . which for want of studying in right order, all the world is in confusion. Milton. 4. Relative dimensions, without difference in proportion of parts; size or degree of the parts or components in any complex thing, compared with other like things; especially, the relative proportion of the linear dimensions of the parts of a drawing, map, model, etc., to the dimensions of the corresponding parts of the object that is represented; as, a map on a scale of an inch to a mile. Scale of chords, a graduated scale on which are given the lengths of the chords of arcs from 0º to 90º in a circle of given radius, -- used in measuring given angles and in plotting angles of given numbers of degrees.\n\nTo climb by a ladder, or as if by a ladder; to ascend by steps or by climbing; to clamber up; as, to scale the wall of a fort. Oft have I scaled the craggy oak. Spenser.\n\nTo lead up by steps; to ascend. [Obs.] Satan from hence, now on the lower stair, That scaled by steps of gold to heaven-gate, Looks down with wonder. Milton."}