{"word":"school","definition":"A shoal; a multitude; as, a school of fish.\n\n1. A place for learned intercourse and instruction; an institution for learning; an educational establishment; a place for acquiring knowledge and mental training; as, the school of the prophets. Disputing daily in the school of one Tyrannus. Acts xix. 9. 2. A place of primary instruction; an establishment for the instruction of children; as, a primary school; a common school; a grammar school. As he sat in the school at his primer. Chaucer. 3. A session of an institution of instruction. How now, Sir Hugh! No school to-day Shak. 4. One of the seminaries for teaching logic, metaphysics, and theology, which were formed in the Middle Ages, and which were characterized by academical disputations and subtilties of reasoning. At Cambridge the philosophy of Descartes was still dominant in the schools. Macaulay. 5. The room or hall in English universities where the examinations for degrees and honors are held. 6. An assemblage of scholars; those who attend upon instruction in a school of any kind; a body of pupils. What is the great community of Christians, but one of the innumerable schools in the vast plan which God has instituted for the education of various intelligences Buckminster. 7. The disciples or followers of a teacher; those who hold a common doctrine, or accept the same teachings; a sect or denomination in philosophy, theology, science, medicine, politics, etc. Let no man be less confident in his faith . . . by reason of any difference in the several schools of Christians. Jer. Taylor. 8. The canons, precepts, or body of opinion or practice, sanctioned by the authority of a particular class or age; as, he was a gentleman of the old school. His face pale but striking, though not handsome after the schools. A. S. Hardy. 9. Figuratively, any means of knowledge or discipline; as, the school of experience. Boarding school, Common school, District school, Normal school, etc. See under Boarding, Common, District, etc. -- High school, a free public school nearest the rank of a college. [U.S.] -- School board, a corporation established by law in every borough or parish in England, and elected by the burgesses or ratepayers, with the duty of providing public school accomodation for all children in their dictrict. -- School commitee, School board, an elected commitee of citizens having charge and care of the public schools in any district, town, or city, and responsible control of the money appropriated for school purposes. [U.S.] -- School days, the period in which youth are sent to school. -- School district, a division of a town or city for establishing and conducting schools. [U.S.] -- Sunday school, or Sabbath school, a school held on Sunday for study of the Bible and for religious instruction; the pupils, or the teachers and pupils, of such a school, collectively.\n\n1. To train in an institution of learning; to educate at a school; to teach. He's gentle, never schooled, and yet learned. Shak. 2. To tutor; to chide and admonish; to reprove; to subject to systematic disciplene; to train. It now remains for you to school your child, And ask why God's Anointed be reviled. Dryden. The mother, while loving her child with the intensity of a sole affection, had schooled herself to hope for little other return than the waywardness of an April breeze. Hawthorne."}