{"word":"science","definition":"1. Knowledge; lnowledge of principles and causes; ascertained truth of facts. If we conceive God's or science, before the creation, to be extended to all and every part of the world, seeing everything as it is, . . . his science or sight from all eternity lays no necessity on anything to come to pass. Hammond. Shakespeare's deep and accurate science in mental philosophy. Coleridge. 2. Accumulated and established knowledge, which has been systematized and formulated with reference to the discovery of general truths or the operation of general laws; knowledge classified and made available in work, life, or the search for truth; comprehensive, profound, or philosophical knowledge. All this new science that men lere [teach]. Chaucer. Science is . . . a complement of cognitions, having, in point of form, the character of logical perfection, and in point of matter, the character of real truth. Sir W. Hamilton. 3. Especially, such knowledge when it relates to the physical world and its phenomena, the nature, constitution, and forces of matter, the qualities and function of living tissues, etc.; -- called also natural science, and physical science. Voltaire hardly left a single corner of the field entirely unexplored in science, poetry, history, philosophy. J. Morley. 4. Any branch or departament of systematized knowledge considered as a distinct field of investigation or object of study; as, the science of astronomy, of chemistry, or of mind. Note: The ancients reckoned seven sciences, namely, grammar, rhetoric, logic, arithmetic, music, geometry, and astronomy; -- the first three being included in the Trivium, the remaining four in the Quadrivium. Good sense, which only is the gift of Heaven, And though no science, fairly worth the seven. Pope. 5. Art, skill, or expertness, regarded as the result of knowledge of laws and principles. His science, coolness, and great strength. G. A. Lawrence. Note: Science is applied or pure. Applied science is a knowledge of facts, events, or phenomena, as explained, accounted for, or produced, by means of powers, causes, or laws. Pure science is the knowledge of these powers, causes, or laws, considered apart, or as pure from all applications. Both these terms have a similar and special signification when applied to the science of quantity; as, the applied and pure mathematics. Exact science is knowledge so systematized that prediction and verification, by measurement, experiment, observation, etc., are possible. The mathematical and physical sciences are called the exact sciences. Comparative sciences, Inductive sciences. See under Comparative, and Inductive. Syn. -- Literature; art; knowledge. -- Science, Literature, Art. Science is literally knowledge, but more usually denotes a systematic and orderly arrangement of knowledge. In a more distinctive sense, science embraces those branches of knowledge of which the subject-matter is either ultimate principles, or facts as explained by principles or laws thus arranged in natural order. The term literature sometimes denotes all compositions not embraced under science, but usually confined to the belles-lettres. [See Literature.] Art is that which depends on practice and skill in performance. \"In science, scimus ut sciamus; in art, scimus ut producamus. And, therefore, science and art may be said to be investigations of truth; but one, science, inquires for the sake of knowledge; the other, art, for the sake of production; and hence science is more concerned with the higher truths, art with the lower; and science never is engaged, as art is, in productive application. And the most perfect state of science, therefore, will be the most high and accurate inquiry; the perfection of art will be the most apt and efficient system of rules; art always throwing itself into the form of rules.\" Karslake.\n\nTo cause to become versed in science; to make skilled; to instruct. [R.] Francis."}