{"word":"scrape","definition":"1. To rub over the surface of (something) with a sharp or rough instrument; to rub over with something that roughens by removing portions of the surface; to grate harshly over; to abrade; to make even, or bring to a required condition or form, by moving the sharp edge of an instrument breadthwise over the surface with pressure, cutting away excesses and superfluous parts; to make smooth or clean; as, to scrape a bone with a knife; to scrape a metal plate to an even surface. 2. To remove by rubbing or scraping (in the sense above). I will also scrape her dust from her, and make her like the top of a rock. Ezek. xxvi. 4. 3. To collect by, or as by, a process of scraping; to gather in small portions by laborius effort; hence, to acquire avariciously and save penuriously; -- often followed by together or up; as, to scrape money together. The prelatical party complained that, to swell a number the nonconformists did not choose, but scrape, subscribers. Fuller. 4. To express disapprobation of, as a play, or to silence, as a speaker, by drawing the feet back and forth upon the floor; -- usually with down. Macaulay. To scrape acquaintance, to seek acquaintance otherwise than by an introduction. Farquhar. He tried to scrape acquaintance with her, but failed ignominiously. G. W. Cable.\n\n1. To rub over the surface of anything with something which roughens or removes it, or which smooths or cleans it; to rub harshly and noisily along. 2. To occupy one's self with getting laboriously; as, he scraped and saved until he became rich. \"[Spend] their scraping fathers' gold.\" Shak. 3. To play awkwardly and inharmoniously on a violin or like instrument. 4. To draw back the right foot along the ground or floor when making a bow.\n\n1. The act of scraping; also, the effect of scraping, as a scratch, or a harsh sound; as, a noisy scrape on the floor; a scrape of a pen. 2. A drawing back of the right foot when bowing; also, a bow made with that accompaniment. H. Spencer. 3. A disagreable and embrassing predicament, as it were, a painful rubbing or scraping; a perplexity; a difficulty. The too eager pursuit of this his old enemy through thick and thin has led him into many of these scrapes. Bp. Warburton."}