{"word":"screw","definition":"1. A cylinder, or a cylindrical perforation, having a continuous rib, called the thread, winding round it spirally at a constant inclination, so as to leave a continuous spiral groove, between one turn and the next, -- used chiefly for producing, when revolved, motion or pressure in the direction of its axis, by the sliding of the threads of the cylinder in the grooves between the threads of the perforation adapted to it, the former being distinguished as the external, or male screw, or, more usually the screw; the latter as the internal, or female screw, or, more usually, the nut. Note: The screw, as a mechanical power, is a modification of the inclined plane, and may be regarded as a right-angled triangle wrapped round a cylinder, the hypotenuse of the marking the spiral thread of the screw, its base equaling the circumference of the cylinder, and its height the pitch of the thread. 2. Specifically, a kind of nail with a spiral thread and a head with a nick to receive the end of the screw-driver. Screws are much used to hold together pieces of wood or to fasten something; -- called also wood screws, and screw nails. See also Screw bolt, below. 3. Anything shaped or acting like a screw; esp., a form of wheel for propelling steam vessels. It is placed at the stern, and furnished with blades having helicoidal surfaces to act against the water in the manner of a screw. See Screw propeller, below. 4. A steam vesel propelled by a screw instead of wheels; a screw steamer; a propeller. 5. An extortioner; a sharp bargainer; a skinflint; a niggard. Thackeray. 6. An instructor who examines with great or unnecessary severity; also, a searching or strict examination of a student by an instructor. [Cant, American Colleges] 7. A small packet of tobacco. [Slang] Mayhew. 8. An unsound or worn-out horse, useful as a hack, and commonly of good appearance. Ld. Lytton. 9. (Math.)  A straight line in space with which a definite linear magnitude termed the pitch is associated (cf. 5th Pitch, 10 (b)). It is used to express the displacement of a rigid body, which may always be made to consist of a rotation about an axis combined with a translation parallel to that axis. 10. (Zoöl.)  An amphipod crustacean; as, the skeleton screw (Caprella). See Sand screw, under Sand. Archimedes screw, Compound screw, Foot screw, etc. See under Archimedes, Compound, Foot, etc. -- A screw loose, something out of order, so that work is not done smoothly; as, there is a screw loose somewhere. H. Martineau. -- Endless, or perpetual screw, a screw used to give motion to a toothed wheel by the action of its threads between the teeth of the wheel; -- called also a worm. -- Lag screw. See under Lag. -- Micrometer screw, a screw with fine threads, used for the measurement of very small spaces. -- Right and left screw, a screw having threads upon the opposite ends which wind in opposite directions. -- Screw alley. See Shaft alley, under Shaft. -- Screw bean. (Bot.) (a) The curious spirally coiled pod of a leguminous tree (Prosopis pubescens) growing from Texas to California. It is used for fodder, and ground into meal by the Indians. (b) The tree itself. Its heavy hard wood is used for fuel, for fencing, and for railroad ties. -- Screw bolt, a bolt having a screw thread on its shank, in distinction from a key bolt. See 1st Bolt, 3. -- Screw box, a device, resembling a die, for cutting the thread on a wooden screw. -- Screw dock. See under Dock. -- Screw engine, a marine engine for driving a screw propeller. -- Screw gear. See Spiral gear, under Spiral. -- Screw jack. Same as Jackscrew. -- Screw key, a wrench for turming a screw or nut; a spanner wrench. -- Screw machine. (a) One of a series of machines employed in the manufacture of wood screws. (b) A machine tool resembling a lathe, having a number of cutting tools that can be caused to act on the work successively, for making screws and other turned pieces from metal rods. -- Screw pine (Bot.), any plant of the endogenous genus Pandanus, of which there are about fifty species, natives of tropical lands from Africa to Polynesia; -- named from the spiral arrangement of the pineapple-like leaves. -- Screw plate, a device for cutting threads on small screws, consisting of a thin steel plate having a series of perforations with internal screws forming dies. -- Screw press, a press in which pressure is exerted by means of a screw. -- Screw propeller, a screw or spiral bladed wheel, used in the propulsion of steam vessels; also, a steam vessel propelled by a screw. -- Screw shell (Zoöl.), a long, slender, spiral gastropod shell, especially of the genus Turritella and allied genera. See Turritella. -- Screw steamer, a steamship propelled by a screw. -- Screw thread, the spiral which forms a screw. -- Screw stone (Paleon.), the fossil stem of an encrinite. -- Screw tree (Bot.), any plant of the genus Helicteres, consisting of about thirty species of tropical shrubs, with simple leaves and spirally twisted, five-celled capsules; -- also called twisted-horn, and twisty. -- Screw valve, a stop valve which is opened or closed by a screw. -- Screw worm (Zoöl.), the larva of an American fly (Compsomyia macellaria), allied to the blowflies, which sometimes deposits its eggs in the nostrils, or about wounds, in man and other animals, with fatal results. -- Screw wrench. (a) A wrench for turning a screw. (b) A wrench with an adjustable jaw that is moved by a screw. -- To put the screw, or screws, on, to use pressure upon, as for the purpose of extortion; to coerce. -- To put under the screw or screws, to subject to presure; to force. -- Wood screw, a metal screw with a sharp thread of coarse pitch, adapted to holding fast in wood. See Illust. of Wood screw, under Wood.\n\n1. To turn, as a screw; to apply a screw to; to press, fasten, or make firm, by means of a screw or screws; as, to screw a lock on a door; to screw a press. 2. To force; to squeeze; to press, as by screws. But screw your courage to the sticking place, And we'll not fail. Shak. 3. Hence: To practice extortion upon; to oppress by unreasonable or extortionate exactions. Our country landlords, by unmeasureable screwing and racking their tenants, have already reduced the miserable people to a worse condition than the peasants in France. swift. 4. To twist; to distort; as, to screw his visage. He screwed his face into a hardened smile. Dryden. 5. To examine rigidly, as a student; to subject to a severe examination. [Cant, American Colleges] To screw out, to press out; to extort. -- To screw up, to force; to bring by violent pressure. Howell. -- To screw in, to force in by turning or twisting.\n\n1. To use violent mans in making exactions; to be oppressive or exacting. Howitt. 2. To turn one's self uneasily with a twisting motion; as, he screws about in his chair."}