{"word":"secondary","definition":"1. Suceeding next in order to the first; of second place, origin, rank, rank, etc.; not primary; subordinate; not of the first order or rate. Wheresoever there is normal right on the one hand, no secondary right can discharge it. L'Estrange. Two are the radical differences; the secondary differences are as four. Bacon. 2. Acting by deputation or delegated authority; as, the work of secondary hands. 3. (Chem.)  Possessing some quality, or having been subject to some operation (as substitution), in the second degree; as, a secondary salt, a secondary amine, etc. Cf. primary. 4. (Min.)  Subsequent in origin; -- said of minerals produced by alteertion or deposition subsequent to the formation of the original rocks mass; also of characters of minerals (as secondary cleavage, etc.) developed by pressure or other causes. 5. (Zoöl.)  Pertaining to the second joint of the wing of a bird. 6. (Med.)  Dependent or consequent upon another disease; as, Bright's disease is often secondary to scarlet fever. (b) Occuring in the second stage of a disease; as, the secondary symptoms of syphilis. Secondary accent. See the Note under Accent, n., 1. -- Secondary age. (Geol.) The Mesozoic age, or age before the Tertiary. See Mesozoic, and Note under Age, n., 8. -- Secondary alcohol (Chem.), any one of a series of alcohols which contain the radical CH.OH united with two hydrocarbon radicals. On oxidation the secondary alcohols form ketones. -- Secondary amputation (Surg.), an amputation for injury, performed after the constitutional effects of the injury have subsided. -- Secondary axis (Opt.), any line which passes through the optical center of a lens but not through the centers of curvature, or, in the case of a mirror, which passes through the center of curvature but not through the center of the mirror. -- Secondary battery. (Elec.) See under Battery, n., 4. -- Secondary circle (Geom. & Astron.), a great circle passes through the poles of another great circle and is therefore perpendicular to its plane. -- Secondary circuit, Secondary coil (Elec.), a circuit or coil in which a current is produced by the induction of a current in a neighboring circuit or coil called the primary circuit or coil. -- Secondary color, a color formed by mixing any two primary colors in equal proportions. -- Secondary coverts (Zoöl.), the longer coverts which overlie the basal part of the secondary quills of a bird. See Illust. under Bird. -- Secondary crystal (Min.), a crystal derived from one of the primary forms. -- Secondary current (Elec.), a momentary current induced in a closed circuit by a current of electricity passing through the same or a contiguous circuit at the beginning and also at the end of the passage of the primary current. -- Secondary evidence, that which is admitted upon failure to obtain the primary or best evidence. -- Secondary fever (Med.), a fever coming on in a disease after the subsidence of the fever with which the disease began, as the fever which attends the outbreak of the eruption in smallpox. -- Secondary hemorrhage (Med.), hemorrhage occuring from a wounded blood vessel at some considerable time after the original bleeding has ceased. -- Secondary planet. (Astron.) See the Note under Planet. -- Secondary qualities, those qualities of bodies which are not inseparable from them as such, but are dependent for their development and intensity on the organism of the percipient, such as color, taste, odor, etc. -- Secondary quills or remiges (Zoöl.), the quill feathers arising from the forearm of a bird and forming a row continuous with the primaries; -- called also secondaries. See Illust. of Bird. -- Secondary rocks or strata (Geol.), those lying between the Primary, or Paleozoic, and Tertiary (see Primary rocks, under Primary); -- later restricted to strata of the Mesozoic age, and at but little used. -- Secondary syphilis (Med.), the second stage of syphilis, including the period from the first development of constitutional symptoms to the time when the bones and the internal organs become involved. -- Secondary tint, any subdued tint, as gray. -- Secondary union (Surg.), the union of wounds after suppuration; union by the second intention. Syn. -- Second; second-rate; subordinate; inferior.\n\n1. One who occupies a subordinate, inferior, or auxiliary place; a delegate deputy; one who is second or next to the chief officer; as, the secondary, or undersheriff of the city of London. Old Escalus . . . is thy secondary. Shak. 2. (Astron.) (a) A secondary circle. (b) A satellite. 3. (Zoöl.)  A secondary quill."}