{"word":"see","definition":"1. A seat; a site; a place where sovereign power is exercised. [Obs.] Chaucer. Jove laughed on Venus from his sovereign see. Spenser. 2. Specifically: (a) The seat of episcopal power; a diocese; the jurisdiction of a bishop; as, the see of New York. (b) The seat of an archibishop; a province or jurisdiction of an archibishop; as, an archiepiscopal see. (c) The seat, place, or office of the pope, or Roman pontiff; as, the papal see. (d) The pope or his court at Rome; as, to appeal to the see of Rome. Apostolic see. See under Apostolic.\n\n1. To perceive by the eye; to have knowledge of the existence and apparent qualities of by the organs of sight; to behold; to descry; to view. I will new turn aside, and see this great sight. Ex. iii. 3. 2. To perceive by mental vision; to form an idea or conception of; to note with the mind; to observe; to discern; to distinguish; to understand; to comprehend; to ascertain. Go, I pray thee, see whether it be well with thy brethren. Gen. xxxvii. 14. Jesus saw that he answered discreetly. Mark xii. 34. Who 's so gross That seeth not this palpable device Shak. 3. To follow with the eyes, or as with the eyes; to watch; to regard attentivelly; to look after. Shak. I had a mind to see him out, and therefore did not care for centradicting him. Addison. 4. To have an interview with; especially, to make a call upon; to visit; as, to go to see a friend. And Samuel came no more to see Saul untill the day of his death. 1 Sam. xv. 35. 5. To fall in with; to have intercourse or communication with; hence, to have knowledge or experience of; as, to see military service. Make us glad according to the days wherein thou hast afflicted us, and the years wherein we have seen evil. Ps. xc. 15. Verily, verily, I say unto you, if a man keep my saying, he shall never see death. John viii. 51. Improvement in visdom and prudence by seeing men. Locke. 6. To accompany in person; to escort; to wait upon; as, to see one home; to see one aboard the cars. God you (him, or me, etc.) see, God keep you (him, me, etc.) in his sight; God protect you. [Obs.] Chaucer. -- To see (anything) out, to see (it) to the end; to be present at, or attend, to the end. -- To see stars, to see flashes of light, like stars; -- sometimes the result of concussion of the head. [Colloq.] -- To see (one) through, to help, watch, or guard (one) to the end of a course or an undertaking.\n\n1. To have the power of sight, or of perceiving by the proper organs; to possess or employ the sense of vision; as, he sees distinctly. Whereas I was blind, now I see. John ix. 25. 2. Figuratively: To have intellectual apprehension; to perceive; to know; to understand; to discern; -- often followed by a preposition, as through, or into. For judgment I am come into this world, that they which see not might see; and that they which see might be made blind. John ix. 39. Many sagacious persons will find us out, . . . and see through all our fine pretensions. Tillotson. 3. To be attentive; to take care; to give heed; -- generally with to; as, to see to the house. See that ye fall not out by the way. Gen. xiv. 24. Note: Let me see, Let us see, are used to express consideration, or to introduce the particular consideration of a subject, or some scheme or calculation. Cassio's a proper man, let me see now, -To get his place. Shak. Note: See is sometimes used in the imperative for look, or behold. \"See. see! upon the banks of Boyne he stands.\" Halifax. To see about a thing, to pay attention to it; to consider it. -- To see on, to look at. [Obs.] \"She was full more blissful on to see.\" Chaucer. -- To see to. (a) To look at; to behold; to view. [Obs.] \"An altar by Jordan, a great altar to see to\" Josh. xxii. 10. (b) To take care about; to look after; as, to see to a fire."}