{"word":"seed","definition":"1. (Bot.) (a) A ripened ovule, consisting of an embryo with one or more integuments, or coverings; as, an apple seed; a currant seed. By germination it produces a new plant. (b) Any small seedlike fruit, though it may consist of a pericarp, or even a calyx, as well as the seed proper; as, parsnip seed; thistle seed. And God said, Let the earth bring forth grass, the herb yielding seed, and the fruit tree yielding fruit after his kind, whose seed is in itself. Gen. i. 11. Note: The seed proper has an outer and an inner coat, and within these the kernel or nucleus. The kernel is either the embryo alone, or the embryo inclosed in the albumen, which is the material for the nourishment of the developing embryo. The scar on a seed, left where the stem parted from it, is called the hilum, and the closed orifice of the ovule, the micropyle. 2. (Physiol.)  The generative fluid of the male; semen; sperm; -- not used in the plural. 3. That from which anything springs; first principle; original; source; as, the seeds of virtue or vice. 4. The principle of production. Praise of great acts he scatters as a seed, Which may the like in coming ages breed. Waller. 5. Progeny; offspring; children; descendants; as, the seed of Abraham; the seed of David. Note: In this sense the word is applied to one person, or to any number collectively, and admits of the plural form, though rarely used in the plural. 6. Race; generation; birth. Of mortal seed they were not held. Waller. Seed bag (Artesian well), a packing to prevent percolation of water down the bore hole. It consists of a bag encircling the tubing and filled with flax seed, which swells when wet and fills the space between the tubing and the sides of the hole. -- Seed bud (Bot.), the germ or rudiment of the plant in the embryo state; the ovule. -- Seed coat (Bot.), the covering of a seed. -- Seed corn, or Seed grain (Bot.), corn or grain for seed. -- Seed down (Bot.), the soft hairs on certain seeds, as cotton seed. -- Seed drill. See 6th Drill, 2 (a). -- Seed eater (Zoöl.), any finch of the genera Sporophila, and Crithagra. They feed mainly on seeds. -- Seed gall (Zoöl.), any gall which resembles a seed, formed, on the leaves of various plants, usually by some species of Phylloxera. -- Seed leaf (Bot.), a cotyledon. -- Seed lobe (Bot.), a cotyledon; a seed leaf. -- Seed oil, oil expressed from the seeds of plants. -- Seed oyster, a young oyster, especially when of a size suitable for transplantation to a new locality. -- Seed pearl, a small pearl of little value. -- Seed plat, or Seed plot, the ground on which seeds are sown, to produce plants for transplanting; a nursery. -- Seed stalk (Bot.), the stalk of an ovule or seed; a funicle. -- Seed tick (Zoöl.), one of several species of ticks resembling seeds in form and color. -- Seed vessel (Bot.), that part of a plant which contains the seeds; a pericarp. -- Seed weevil (Zoöl.), any one of numerous small weevels, especially those of the genus Apion, which live in the seeds of various plants. -- Seed wool, cotton wool not yet cleansed of its seeds. [Southern U.S.]\n\n1. To sprinkle with seed; to plant seeds in; to sow; as, to seed a field. 2. To cover thinly with something scattered; to ornament with seedlike decorations. A sable mantle seeded with waking eyes. B. Jonson. To seed down, to sow with grass seed."}