{"word":"sensitive","definition":"1. Having sense of feeling; possessing or exhibiting the capacity of receiving impressions from external objects; as, a sensitive soul. 2. Having quick and acute sensibility, either to the action of external objects, or to impressions upon the mind and feelings; highly susceptible; easily and acutely affected. She was too sensitive to abuse and calumny. Macaulay. 3. (a) (Mech.) Having a capacity of being easily affected or moved; as, a sensitive thermometer; sensitive scales. (b) (Chem. & Photog.) Readily affected or changed by certain appropriate agents; as, silver chloride or bromide, when in contact with certain organic substances, is extremely sensitive to actinic rays. 4. Serving to affect the sense; sensible. [R.] A sensitive love of some sensitive objects. Hammond. 5. Of or pertaining to sensation; depending on sensation; as, sensitive motions; sensitive muscular motions excited by irritation. E. Darwin. Sensitive fern (Bot.), an American fern (Onoclea sensibilis), the leaves of which, when plucked, show a slight tendency to fold together. -- Sensitive flame (Physics), a gas flame so arranged that under a suitable adjustment of pressure it is exceedingly sensitive to sounds, being caused to roar, flare, or become suddenly shortened or extinguished, by slight sounds of the proper pitch. -- Sensitive joint vetch (Bot.), an annual leguminous herb (Æschynomene hispida), with sensitive foliage. -- Sensitive paper, paper prepared for photographic purpose by being rendered sensitive to the effect of light. -- Sensitive plant. (Bot.) (a) A leguminous plant (Mimosa pudica, or M. sensitiva, and other allied species), the leaves of which close at the slightest touch. (b) Any plant showing motions after irritation, as the sensitive brier (Schrankia) of the Southern States, two common American species of Cassia (C. nictitans, and C. Chamæcrista), a kind of sorrel (Oxalis sensitiva), etc. -- Sen\"si*tive*ly, adv. -- Sen\"si*tive*ness, n."}