{"word":"settle","definition":"1. A seat of any kind. [Obs.] \"Upon the settle of his majesty\" Hampole. 2. A bench; especially, a bench with a high back. 3. A place made lower than the rest; a wide step or platform lower than some other part. And from the bottom upon the ground, even to the lower settle, shall be two cubits, and the breadth one cubit. Ezek. xliii. 14. Settle bed, a bed convertible into a seat. [Eng.]\n\n1. To place in a fixed or permanent condition; to make firm, steady, or stable; to establish; to fix; esp., to establish in life; to fix in business, in a home, or the like. And he settled his countenance steadfastly upon him, until he was ashamed. 2 Kings viii. 11. (Rev. Ver.) The father thought the time drew on Of setting in the world his only son. Dryden. 2. To establish in the pastoral office; to ordain or install as pastor or rector of a church, society, or parish; as, to settle a minister. [U. S.] 3. To cause to be no longer in a disturbed condition; to render quiet; to still; to calm; to compose. God settled then the huge whale-bearing lake. Chapman. Hoping that sleep might settle his brains. Bunyan. 4. To clear of dregs and impurities by causing them to sink; to render pure or clear; -- said of a liquid; as, to settle coffee, or the grounds of coffee. 5. To restore or bring to a smooth, dry, or passable condition; -- said of the ground, of roads, and the like; as, clear weather settles the roads. 6. To cause to sink; to lower; to depress; hence, also, to render close or compact; as, to settle the contents of a barrel or bag by shaking it. 7. To determine, as something which is exposed to doubt or question; to free from unscertainty or wavering; to make sure, firm, or constant; to establish; to compose; to quiet; as, to settle the mind when agitated; to settle questions of law; to settle the succession to a throne; to settle an allowance. It will settle the wavering, and confirm the doubtful. Swift. 8. To adjust, as something in discussion; to make up; to compose; to pacify; as, to settle a quarrel. 9. To adjust, as accounts; to liquidate; to balance; as, to settle an account. 10. Hence, to pay; as, to settle a bill. [Colloq.] Abbott. 11. To plant with inhabitants; to colonize; to people; as, the French first settled Canada; the Puritans settled New England; Plymouth was settled in 1620. To settle on or upon, to confer upon by permanent grant; to assure to. \"I . . . have settled upon him a good annuity.\" Addison. -- To settle the land (Naut.), to cause it to sink, or appear lower, by receding from it. Syn. -- To fix; establish; regulate; arrange; compose; adjust; determine; decide.\n\n1. To become fixed or permanent; to become stationary; to establish one's self or itself; to assume a lasting form, condition, direction, or the like, in place of a temporary or changing state. The wind came about and settled in the west. Bacon. Chyle . . . runs through all the intermediate colors until it settles in an intense red. Arbuthnot. 2. To fix one's residence; to establish a dwelling place or home; as, the Saxons who settled in Britain. 3. To enter into the married state, or the state of a householder. As people marry now and settle. Prior. 4. To be established in an employment or profession; as, to settle in the practice of law. 5. To become firm, dry, and hard, as the ground after the effects of rain or frost have disappeared; as, the roads settled late in the spring. 6. To become clear after being turbid or obscure; to clarify by depositing matter held in suspension; as, the weather settled; wine settles by standing. A government, on such occasions, is always thick before it settles. Addison. 7. To sink to the bottom; to fall to the bottom, as dregs of a liquid, or the sediment of a reserveir. 8. To sink gradually to a lower level; to subside, as the foundation of a house, etc. 9. To become calm; to cease from agitation. Till the fury of his highness settle, Come not before him. Shak. 10. To adjust differences or accounts; to come to an agreement; as, he has settled with his creditors. 11. To make a jointure for a wife. He sighs with most success that settles well. Garth."}