{"word":"shaft","definition":"1. The slender, smooth stem of an arrow; hence, an arrow. His sleep, his meat, his drink, is him bereft, That lean he wax, and dry as is a shaft. Chaucer. A shaft hath three principal parts, the stele [stale], the feathers, and the head. Ascham. 2. The long handle of a spear or similar weapon; hence, the weapon itself; (Fig.) anything regarded as a shaft to be thrown or darted; as, shafts of light. And the thunder, Winged with red lightning and impetuous rage, Perhaps hath spent his shafts. Milton. Some kinds of literary pursuits . . . have been attacked with all the shafts of ridicule. V. Knox. 3. That which resembles in some degree the stem or handle of an arrow or a spear; a long, slender part, especially when cylindrical. Specifically: (a) (Bot.) The trunk, stem, or stalk of a plant. (b) (Zoöl.) The stem or midrib of a feather. See Illust. of Feather. (c) The pole, or tongue, of a vehicle; also, a thill. (d) The part of a candlestick which supports its branches. Thou shalt make a candlestick of pure gold . . . his shaft, and his branches, his bowls, his knops, and his flowers, shall be of the same. Ex. xxv. 31. (e) The handle or helve of certain tools, instruments, etc., as a hammer, a whip, etc. (f) A pole, especially a Maypole. [Obs.] Stow. (g) (Arch.) The body of a column; the cylindrical pillar between the capital and base (see Illust. of Column). Also, the part of a chimney above the roof. Also, the spire of a steeple. [Obs. or R.] Gwilt. (h) A column, an obelisk, or other spire-shaped or columnar monument. Bid time and nature gently spare The shaft we raise to thee. Emerson. (i) (Weaving)  A rod at the end of a heddle. (j) (Mach.) A solid or hollow cylinder or bar, having one or more journals on which it rests and revolves, and intended to carry one or more wheels or other revolving parts and to transmit power or motion; as, the shaft of a steam engine. See Illust. of Countershaft. 4. (Zoöl.)  A humming bird (Thaumastura cora) having two of the tail feathers next to the middle ones very long in the male; -- called also cora humming bird. 5. Etym: [Cf. G. schacht.] (Mining)  A well-like excavation in the earth, perpendicular or nearly so, made for reaching and raising ore, for raising water, etc. 6. A long passage for the admission or outlet of air; an air shaft. 7. The chamber of a blast furnace. Line shaft (Mach.), a main shaft of considerable length, in a shop or factory, usually bearing a number of pulleys by which machines are driven, commonly by means of countershafts; -- called also line, or main line. -- Shaft alley (Naut.), a passage extending from the engine room to the stern, and containing the propeller shaft. -- Shaft furnace (Metal.), a furnace, in the form of a chimney, which is charged at the top and tapped at the bottom."}