{"word":"shall","definition":"1. To owe; to be under obligation for. [Obs.] \"By the faith I shall to God\" Court of Love. 2. To be obliged; must. [Obs.] \"Me athinketh [I am sorry] that I shall rehearse it her.\" Chaucer. 3. As an auxiliary, shall indicates a duty or necessity whose obligation is derived from the person speaking; as, you shall go; he shall go; that is, I order or promise your going. It thus ordinarily expresses, in the second and third persons, a command, a threat, or a promise. If the auxillary be emphasized, the command is made more imperative, the promise or that more positive and sure. It is also employed in the language of prophecy; as, \"the day shall come when . . . , \" since a promise or threat and an authoritative prophecy nearly coincide in significance. In shall with the first person, the necessity of the action is sometimes implied as residing elsewhere than in the speaker; as, I shall suffer; we shall see; and there is always a less distinct and positive assertion of his volition than is indicated by will. \"I shall go\" implies nearly a simple futurity; more exactly, a foretelling or an expectation of my going, in which, naturally enough, a certain degree of plan or intention may be included; emphasize the shall, and the event is described as certain to occur, and the expression approximates in meaning to our emphatic \"I will go.\" In a question, the relation of speaker and source of obligation is of course transferred to the person addressed; as, \"Shall you go\" (answer, \"I shall go\"); \"Shall he go\" i. e., \"Do you require or promise his going\" (answer, \"He shall go\".) The same relation is transferred to either second or third person in such phrases as \"You say, or think, you shall go;\" \"He says, or thinks, he shall go.\" After a conditional conjunction (as if, whether) shall is used in all persons to express futurity simply; as, if I, you, or he shall say they are right. Should is everywhere used in the same connection and the same senses as shall, as its imperfect. It also expresses duty or moral obligation; as, he should do it whether he will or not. In the early English, and hence in our English Bible, shall is the auxiliary mainly used, in all the persons, to express simple futurity. (Cf. Will, v. t.) Shall may be used elliptically; thus, with an adverb or other word expressive of motion go may be omitted. \"He to England shall along with you.\" Shak. Note: Shall and will are often confounded by inaccurate speakers and writers. Say: I shall be glad to see you. Shall I do this Shall I help you (not Will I do this) See Will."}