{"word":"shark","definition":"1. (Zoöl.)  Any one of numerous species of elasmobranch fishes of the order Plagiostomi, found in all seas. Note: Some sharks, as the basking shark and the whale shark, grow to an enormous size, the former becoming forty feet or more, and the latter sixty feet or more, in length. Most of them are harmless to man, but some are exceedingly voracious. The man-eating sharks mostly belong to the genera Carcharhinus, Carcharodon, and related genera. They have several rows of large sharp teeth with serrated edges, as the great white shark (Carcharodon carcharias, or Rondeleti) of tropical seas, and the great blue shark (Carcharhinus glaucus) of all tropical and temperate seas. The former sometimes becomes thirty-six feet long, and is the most voracious and dangerous species known. The rare man-eating shark of the United States coast (Charcarodon Atwoodi) is thought by some to be a variety, or the young, of C. carcharias. The dusky shark (Carcharhinus obscurus), and the smaller blue shark (C. caudatus), both common species on the coast of the United States, are of moderate size and not dangerous. They feed on shellfish and bottom fishes. 2. A rapacious, artful person; a sharper. [Colloq.] 3. Trickery; fraud; petty rapine; as, to live upon the shark. [Obs.] South. Baskin shark, Liver shark, Nurse shark, Oil shark, Sand shark, Tiger shark, etc. See under Basking, Liver, etc. See also Dogfish, Houndfish, Notidanian, and Tope. -- Gray shark, the sand shark. -- Hammer-headed shark. See Hammerhead. -- Port Jackson shark. See Cestraciont. -- Shark barrow, the eggcase of a shark; a sea purse. -- Shark ray. Same as Angel fish (a), under Angel. -- Thrasher shark, or Thresher shark, a large, voracious shark. See Thrasher. -- Whale shark, a huge harmless shark (Rhinodon typicus) of the Indian Ocean. It becomes sixty feet or more in length, but has very small teeth.\n\nTo pick or gather indiscriminately or covertly. [Obs.] Shak.\n\n1. To play the petty thief; to practice fraud or trickery; to swindle. Neither sharks for a cup or a reckoning. Bp. Earle. 2. To live by shifts and stratagems. Beau & Fl."}