{"word":"sharp","definition":"1. Having a very thin edge or fine point; of a nature to cut or pierce easily; not blunt or dull; keen. He dies upon my scimeter's sharp point. Shak. 2. Terminating in a point or edge; not obtuse or rounded; somewhat pointed or edged; peaked or ridged; as, a sharp hill; sharp features. 3. Affecting the sense as if pointed or cutting, keen, penetrating, acute: to the taste or smell, pungent, acid, sour, as ammonia has a sharp taste and odor; to the hearing, piercing, shrill, as a sharp sound or voice; to the eye, instantaneously brilliant, dazzling, as a sharp flash. 4. (Mus.) (a) High in pitch; acute; as, a sharp note or tone. (b) Raised a semitone in pitch; as, C sharp (C#), which is a half step, or semitone, higher than C. (c) So high as to be out of tune, or above true pitch; as, the tone is sharp; that instrument is sharp. Opposed in all these senses to Ant: flat. 5. Very trying to the feelings; pierching; keen; severe; painful; distressing; as, sharp pain, weather; a sharp and frosty air. Sharp misery had worn him to the bones. Shak. The morning sharp and clear. Cowper. In sharpest perils faithful proved. Keble. 6. Cutting in language or import; biting; sarcastic; cruel; harsh; rigorous; severe; as, a sharp rebuke. \"That sharp look.\" Tennyson. To that place the sharp Athenian law Can not pursue us. Shak. Be thy words severe, Sharp as merits but the sword forbear. Dryden. 7. Of keen perception; quick to discern or distinguish; having nice discrimination; acute; penetrating; sagacious; clever; as, a sharp eye; sharp sight, hearing, or judgment. Nothing makes men sharper . . . than want. Addison. Many other things belong to the material world, wherein the sharpest philosophers have never yeL. Watts. 8. Eager in pursuit; keen in quest; impatient for gratification; keen; as, a sharp appetite. 9. Fierce; ardent; fiery; violent; impetuous. \"In sharp contest of battle.\" Milton. A sharp assault already is begun. Dryden. 10. Keenly or unduly attentive to one's own interest; close and exact in dealing; shrewd; as, a sharp dealer; a sharp customer. The necessity of being so sharp and exacting. Swift. 11. Composed of hard, angular grains; gritty; as, sharp sand. Moxon. 12. Steep; precipitous; abrupt; as, a sharp ascent or descent; a sharp turn or curve. 13. (Phonetics)  Uttered in a whisper, or with the breath alone, without voice, as certain consonants, such as p, k, t, f; surd; nonvocal; aspirated. Note: Sharp is often used in the formation of self-explaining compounds; as, sharp-cornered, sharp-edged, sharp-pointed, sharp- tasted, sharp-visaged, etc. Sharp practice, the getting of an advantage, or the attempt to do so, by a tricky expedient. -- To brace sharp, or To sharp up (Naut.), to turn the yards to the most oblique position possible, that the ship may lie well up to the wind. Syn. -- Keen; acute; piercing; penetrating; quick; sagacious; discerning; shrewd; witty; ingenious; sour; acid; tart; pungent; acrid; severe; poignant; biting; acrimonious; sarcastic; cutting; bitter; painful; afflictive; violent; harsh; fierce; ardent; fiery.\n\n1. To a point or edge; piercingly; eagerly; sharply. M. Arnold. The head [of a spear] full sharp yground. Chaucer. You bite so sharp at reasons. Shak. 2. Precisely; exactly; as, we shall start at ten o'clock sharp. [Colloq.] Look sharp, attend; be alert. [Colloq.]\n\n1. A sharp tool or weapon. [Obs.] If butchers had but the manners to go to sharps, gentlemen would be contented with a rubber at cuffs. Collier. 2. (Mus.) (a) The character [#] used to indicate that the note before which it is placed is to be raised a half step, or semitone, in pitch. (b) A sharp tone or note. Shak. 3. A portion of a stream where the water runs very rapidly. [Prov. Eng.] C. Kingsley. 4. A sewing needle having a very slender point; a needle of the most pointed of the three grades, blunts, betweens, and sharps. 5. pl.  Same as Middlings, 1. 6. An expert. [Slang]\n\n1. To sharpen. [Obs.] Spenser. 2. (Mus.)  To raise above the proper pitch; to elevate the tone of; especially, to raise a half step, or semitone, above the natural tone.\n\n1. To play tricks in bargaining; to act the sharper. L'Estrange. 2. (Mus.)  To sing above the proper pitch."}