{"word":"sheep","definition":"1. (Zoöl.)  Any one of several species of ruminants of the genus Ovis, native of the higher mountains of both hemispheres, but most numerous in Asia. Note: The domestic sheep (Ovis aries) varies much in size, in the length and texture of its wool, the form and size of its horns, the length of its tail, etc. It was domesticated in prehistoric ages, and many distinct breeds have been produced; as the merinos, celebrated for their fine wool; the Cretan sheep, noted for their long horns; the fat-tailed, or Turkish, sheep, remarkable for the size and fatness of the tail, which often has to be supported on trucks; the Southdowns, in which the horns are lacking; and an Asiatic breed which always has four horns. 2. A weak, bashful, silly fellow. Ainsworth. 3. pl.  Fig.: The people of God, as being under the government and protection of Christ, the great Shepherd. Rocky mountain sheep.(Zoöl.) See Bighorn. -- Maned sheep. (Zoöl.) See Aoudad. -- Sheep bot (Zoöl.), the larva of the sheep botfly. See Estrus. -- Sheep dog (Zoöl.), a shepherd dog, or collie. -- Sheep laurel (Bot.), a small North American shrub (Kalmia angustifolia) with deep rose-colored flowers in corymbs. -- Sheep pest (Bot.), an Australian plant (Acæna ovina) related to the burnet. The fruit is covered with barbed spines, by which it adheres to the wool of sheep. -- Sheep run, an extensive tract of country where sheep range and graze. -- Sheep's beard (Bot.), a cichoraceous herb (Urospermum Dalechampii) of Southern Europe; -- so called from the conspicuous pappus of the achenes. -- Sheep's bit (Bot.), a European herb (Jasione montana) having much the appearance of scabious. -- Sheep pox (Med.), a contagious disease of sheep, characterixed by the development of vesicles or pocks upon the skin. -- Sheep scabious. (Bot.) Same as Sheep's bit. -- Sheep shears, shears in which the blades form the two ends of a steel bow, by the elasticity of which they open as often as pressed together by the hand in cutting; -- so called because used to cut off the wool of sheep. -- Sheep sorrel. (Bot.), a prerennial herb (Rumex Acetosella) growing naturally on poor, dry, gravelly soil. Its leaves have a pleasant acid taste like sorrel. -- Sheep's-wool (Zoöl.), the highest grade of Florida commercial sponges (Spongia equina, variety gossypina). -- Sheep tick (Zoöl.), a wingless parasitic insect (Melophagus ovinus) belonging to the Diptera. It fixes its proboscis in the skin of the sheep and sucks the blood, leaving a swelling. Called also sheep pest, and sheep louse. -- Sheep walk, a pasture for sheep; a sheep run. -- Wild sheep. (Zoöl.) See Argali, Mouflon, and Oörial."}