{"word":"shift","definition":"1. To divide; to distribute; to apportion. [Obs.] To which God of his bounty would shift Crowns two of flowers well smelling. Chaucer. 2. To change the place of; to move or remove from one place to another; as, to shift a burden from one shoulder to another; to shift the blame. Hastily he schifte him[self]. Piers Plowman. Pare saffron between the two St. Mary's days, Or set or go shift it that knowest the ways. Tusser. 3. To change the position of; to alter the bearings of; to turn; as, to shift the helm or sails. Carrying the oar loose, [they] shift it hither and thither at pleasure. Sir W. Raleigh. 4. To exchange for another of the same class; to remove and to put some similar thing in its place; to change; as, to shift the clothes; to shift the scenes. I would advise you to shift a shirt. Shak. 5. To change the clothing of; -- used reflexively. [Obs.] As it were to ride day and night; and . . . not to have patience to shift me. Shak. 6. To put off or out of the way by some expedient. \"I shifted him away.\" Shak. To shift off, to delay; to defer; to put off; to lay aside. -- To shift the scene, to change the locality or the surroundings, as in a play or a story. Shift the scene for half an hour; Time and place are in thy power. Swift.\n\n1. To divide; to distribute. [Obs.] Some this, some that, as that him liketh shift. Chaucer. 2. To make a change or changes; to change position; to move; to veer; to substitute one thing for another; -- used in the various senses of the transitive verb. The sixth age shifts Into the lean and slippered pantaloon. Shak. Here the Baillie shifted and fidgeted about in his seat. Sir W. Scott. 3. To resort to expedients for accomplishing a purpose; to contrive; to manage. Men in distress will look to themselves, and leave their companions to schift as well as they can. L'Estrange. 4. To practice indirect or evasive methods. All those schoolmen, though they were exceeding witty, yet better teach all their followers to shift, than to resolve by their distinctions. Sir W. Raleigh. 5. (Naut.)  To slip to one side of a ship, so as to destroy the equilibrum; -- said of ballast or cargo; as, the cargo shifted.\n\n1. The act of shifting. Specifically: (a) The act of putting one thing in the place of another, or of changing the place of a thing; change; substitution. My going to Oxford was not merely for shift of air. Sir H. Wotton. (b) A turning from one thing to another; hence, an expedient tried in difficalty; often, an evasion; a trick; a fraud. \"Reduced to pitiable shifts.\" Macaulay. I 'll find a thousand shifts to get away. Shak. Little souls on little shifts rely. Dryden. 2. Something frequently shifted; especially, a woman's under-garment; a chemise. 3. The change of one set of workmen for another; hence, a spell, or turn, of work; also, a set of workmen who work in turn with other sets; as, a night shift. 4. In building, the extent, or arrangement, of the overlapping of plank, brick, stones, etc., that are placed in courses so as to break joints. 5. (Mining)  A breaking off and dislocation of a seam; a fault. 6. (Mus.)  A change of the position of the hand on the finger board, in playing the violin. To make shift, to contrive or manage in an exigency. \"I shall make shift to go without him.\" Shak. [They] made a shift to keep their own in Ireland. Milton."}