{"word":"ship","definition":"Pay; reward. [Obs.] In withholding or abridging of the ship or the hire or the wages of servants. Chaucer.\n\n1. Any large seagoing vessel. Like a stately ship . . . With all her bravery on, and tackle trim, Sails filled, and streamers waving. Milton. Thou, too, sail on, O Ship of State! Longfellow. 2. Specifically, a vessel furnished with a bowsprit and three masts (a mainmast, a foremast, and a mizzenmast), each of which is composed of a lower mast, a topmast, and a topgallant mast, and square-rigged on all masts. See Illustation in Appendix. l Port or Larboard Side; s Starboard Side; 1 Roundhouse or Deck House; 2 Tiller; 3 Grating; 4 Wheel; 5 Wheel Chains; 6 Binnacle; 7 Mizzenmast; 8 Skylight; 9 Capstan; 10 Mainmast; 11 Pumps; 12 Galley or Caboose; 13 Main Hatchway; 14 Windlass; 15 Foremast; 16 Fore Hatchway; 17 Bitts; 18 Bowsprit; 19 Head Rail; 20 Boomkins; 21 Catheads on Port Bow and Starboard Bow; 22 Fore Chains; 23 Main Chains; 24 Mizzen Chains; 25 Stern. 1 Fore Royal Stay; 2 Flying Jib Stay; 3 Fore Topgallant Stay;4 Jib Stay; 5 Fore Topmast Stays; 6 Fore Tacks; 8 Flying Martingale; 9 Martingale Stay, shackled to Dolphin Striker; 10 Jib Guys; 11 Jumper Guys; 12 Back Ropes; 13 Robstays; 14 Flying Jib Boom; 15 Flying Jib Footropes; 16 Jib Boom; 17 Jib Foottropes; 18 Bowsprit; 19 Fore Truck; 20 Fore Royal Mast; 21 Fore Royal Lift; 22 Fore Royal Yard; 23 Fore Royal Backstays; 24 Fore Royal Braces; 25 Fore Topgallant Mast and Rigging; 26 Fore Topgallant Lift; 27 Fore Topgallant Yard; 28 Fore Topgallant Backstays; 29 Fore Topgallant Braces; 30 Fore Topmast and Rigging; 31 Fore Topsail Lift; 32 Fore Topsail Yard; 33 Fore Topsail Footropes; 34 Fore Topsail Braces; 35 Fore Yard; 36 Fore Brace; 37 Fore Lift; 38 Fore Gaff; 39 Fore Trysail Vangs; 40 Fore Topmast Studding-sail Boom; 41 Foremast and Rigging; 42 Fore Topmast Backstays; 43 Fore Sheets; 44 Main Truck and Pennant; 45 Main Royal Mast and Backstay; 46 Main Royal Stay; 47 Main Royal Lift; 48 Main Royal Yard; 49 Main Royal Braces; 50 Main Topgallant Mast and Rigging; 51 Main Topgallant Lift; 52 Main Topgallant Backstays; 53 Main Topgallant Yard; 54 Main Topgallant Stay; 55 Main Topgallant Braces; 56 Main Topmast and Rigging; 57 Topsail Lift; 58 Topsail Yard; 59 Topsail Footropes; 60 Topsail Braces; 61 Topmast Stays; 62 Main Topgallant Studding-sail Boom; 63 Main Topmast Backstay; 64 Main Yard; 65 Main Footropes; 66 Mainmast and Rigging; 67 Main Lift; 68 Main Braces; 69 Main Tacks; 70 Main Sheets; 71 Main Trysail Gaff; 72 Main Trysail Vangs; 73 Main Stays; 74 Mizzen Truck; 75 Mizzen Royal Mast and Rigging; 76 Mizzen Royal Stay; 77 Mizzen Royal Lift; 78 Mizzen Royal Yard; 79 Mizzen Royal Braces; 80 Mizzen Topgallant Mast and Rigging; 81 Mizzen Topgallant Lift; 82 Mizzen Topgallant Backstays; 83 Mizzen Topgallant Braces; 84 Mizzen Topgallant Yard; 85 Mizzen Topgallant Stay; 86 Mizzen Topmast and Rigging; 87 Mizzen Topmast Stay; 88 Mizzen Topsail Lift; 89 Mizzen Topmast Backstays; 90 Mizzen Topsail Braces; 91 Mizzen Topsail Yard; 92 Mizzen Topsail Footropes; 93 Crossjack Yard; 94 Crossjack Footropes; 95 Crossjack Lift; 96 Crossjack Braces; 97 Mizzenmast and Rigging; 98 Mizzen Stay; 99 Spanker Gaff; 100 Peak Halyards; 101 Spanker Vangs; 102 Spanker Boom; 103 Spanker Boom Topping Lift; 104 Jacob's Ladder, or Stern Ladder; 105 Spanker Sheet; 106 Cutwater; 107 Starboard Bow; 108 Starboard Beam; 109 Water Line; 110 Starboard Quarter; 111 Rudder. 3. A dish or utensil (originally fashioned like the hull of a ship) used to hold incense. [Obs.] Tyndale. Armed ship, a private ship taken into the service of the government in time of war, and armed and equipped like a ship of war. [Eng.] Brande & C. -- General ship. See under General. -- Ship biscuit, hard biscuit prepared for use on shipboard; -- called also ship bread. See Hardtack. -- Ship boy, a boy who serves in a ship. \"Seal up the ship boy's eyes.\" Shak. -- Ship breaker, one who breaks up vessels when unfit for further use. -- Ship broker, a mercantile agent employed in buying and selling ships, procuring cargoes, etc., and generally in transacting the business of a ship or ships when in port. -- Ship canal, a canal suitable for the passage of seagoing vessels. -- Ship carpenter, a carpenter who works at shipbuilding; a shipwright. -- Ship chandler, one who deals in cordage, canvas, and other, furniture of vessels. -- Ship chandlery, the commodities in which a ship chandler deals; also, the business of a ship chandler. -- Ship fever (Med.), a form of typhus fever; -- called also putrid, jail, or hospital fever. -- Ship joiner, a joiner who works upon ships. -- Ship letter, a letter conveyed by a ship not a mail packet. -- Ship money (Eng. Hist.), an imposition formerly charged on the ports, towns, cities, boroughs, and counties, of England, for providing and furnishing certain ships for the king's service. The attempt made by Charles I. to revive and enforce this tax was resisted by John Hampden, and was one of the causes which led to the death of Charles. It was finally abolished. -- Ship of the line. See under Line. -- Ship pendulum, a pendulum hung amidships to show the extent of the rolling and pitching of a vessel. -- Ship railway. (a) An inclined railway with a cradelike car, by means of which a ship may be drawn out of water, as for repairs. (b) A railway arranged for the transportation of vessels overland between two water courses or harbors. -- Ship's company, the crew of a ship or other vessel. -- Ship's days, the days allowed a vessel for loading or unloading. -- Ship's husband. See under Husband. -- Ship's papers (Mar. Law), papers with which a vessel is required by law to be provided, and the production of which may be required on certain occasions. Among these papers are the register, passport or sea letter, charter party, bills of lading, invoice, log book, muster roll, bill of health, etc. Bouvier. Kent. -- To make ship, to embark in a ship or other vessel.\n\n1. To put on board of a ship, or vessel of any kind, for transportation; to send by water. The timber was . . . shipped in the bay of Attalia, from whence it was by sea transported to Pelusium. Knolles. 2. By extension, in commercial usage, to commit to any conveyance for transportation to a distance; as, to ship freight by railroad. 3. Hence, to send away; to get rid of. [Colloq.] 4. To engage or secure for service on board of a ship; as, to ship seamen. 5. To receive on board ship; as, to ship a sea. 6. To put in its place; as, to ship the tiller or rudder.\n\n1. To engage to serve on board of a vessel; as, to ship on a man-of- war. 2. To embark on a ship. Wyclif (Acts xxviii. 11)"}