{"word":"shoot","definition":"An inclined plane, either artificial or natural, down which timber, coal, etc., are caused to slide; also, a narrow passage, either natural or artificial, in a stream, where the water rushes rapidly; esp., a channel, having a swift current, connecting the ends of a bend in the stream, so as to shorten the course. [Written also chute, and shute.] [U. S.] To take a shoot, to pass through a shoot instead of the main channel; to take the most direct course. [U.S.]\n\n1. To let fly, or cause to be driven, with force, as an arrow or a bullet; -- followed by a word denoting the missile, as an object. If you please To shoot an arrow that self way. Shak. 2. To discharge, causing a missile to be driven forth; -- followed by a word denoting the weapon or instrument, as an object; -- often with off; as, to shoot a gun. The two ends od a bow, shot off, fly from one another. Boyle. 3. To strike with anything shot; to hit with a missile; often, to kill or wound with a firearm; -- followed by a word denoting the person or thing hit, as an object. When Roger shot the hawk hovering over his master's dove house. A. Tucker. 4. To send out or forth, especially with a rapid or sudden motion; to cast with the hand; to hurl; to discharge; to emit. An honest weaver as ever shot shuttle. Beau & Fl. A pit into which the dead carts had nightly shot corpses by scores. Macaulay. 5. To push or thrust forward; to project; to protrude; -- often with out; as, a plant shoots out a bud. They shoot out the lip, they shake the head. Ps. xxii. 7. Beware the secret snake that shoots a sting. Dryden. 6. (Carp.)  To plane straight; to fit by planing. Two pieces of wood that are shot, that is, planed or else pared with a paring chisel. Moxon. 7. To pass rapidly through, over, or under; as, to shoot a rapid or a bridge; to shoot a sand bar. She . . . shoots the Stygian sound. Dryden. 8. To variegate as if by sprinkling or intermingling; to color in spots or patches. The tangled water courses slept, Shot over with purple, and green, and yellow. Tennyson. To be shot of, to be discharged, cleared, or rid of. [Colloq.] \"Are you not glad to be shot of him\" Sir W. Scott.\n\n1. To cause an engine or weapon to discharge a missile; -- said of a person or an agent; as, they shot at a target; he shoots better than he rides. The archers have . . . shot at him. Gen. xlix. 23. 2. To discharge a missile; -- said of an engine or instrument; as, the gun shoots well. 3. To be shot or propelled forcibly; -- said of a missile; to be emitted or driven; to move or extend swiftly, as if propelled; as, a shooting star. There shot a streaming lamp along the sky. Dryden. 4. To penetrate, as a missile; to dart with a piercing sensation; as, shooting pains. Thy words shoot through my heart. Addison. 5. To feel a quick, darting pain; to throb in pain. These preachers make His head to shoot and ache. Herbert. 6. To germinate; to bud; to sprout. Onions, as they hang, will shoot forth. Bacon. But the wild olive shoots, and shades the ungrateful plain. Dryden. 7. To grow; to advance; as, to shoot up rapidly. Well shot in years he seemed. Spenser. Delightful task! to rear the tender thought, To teach the young idea how to shoot. Thomson. 8. To change form suddenly; especially, to solidify. If the menstruum be overcharged, metals will shoot into crystals. Bacon. 9. To protrude; to jut; to project; to extend; as, the land shoots into a promontory. There shot up against the dark sky, tall, gaunt, straggling houses. Dickens. 10. (Naut.)  To move ahead by force of momentum, as a sailing vessel when the helm is put hard alee. To shoot ahead, to pass or move quickly forward; to outstrip others.\n\n1. The act of shooting; the discharge of a missile; a shot; as, the shoot of a shuttle. The Turkish bow giveth a very forcible shoot. Bacon. One underneath his horse to get a shoot doth stalk. Drayton. 2. A young branch or growth. Superfluous branches and shoots of this second spring. Evelyn. 3. A rush of water; a rapid. 4. (Min.)  A vein of ore running in the same general direction as the lode. Knight. 5. (Weaving)  A weft thread shot through the shed by the shuttle; a pick. 6. Etym: [Perh. a different word.]  A shoat; a young hog."}