{"word":"shot","definition":"imp. & p. p. Shoot.\n\nWoven in such a way as to produce an effect of variegation, of changeable tints, or of being figured; as, shot silks. See Shoot, v. t., 8.\n\nA share or proportion; a reckoning; a scot. Here no shots are where all shares be. Chapman. A man is never . . . welcome to a place till some certain shot be paid and the hostess say \"Welcome.\" Shak.\n\n1. The act of shooting; discharge of a firearm or other weapon which throws a missile. He caused twenty shot of his greatest cannon to be made at the king's army. Clarendon. 2. A missile weapon, particularly a ball or bullet; specifically, whatever is discharged as a projectile from firearms or cannon by the force of an explosive. Note: Shot used in war is of various kinds, classified according to the material of which it is composed, into lead, wrought-iron, and cast-iron; according to form, into spherical and oblong; according to structure and modes of operation, into solid, hollow, and case. See Bar shot, Chain shot, etc., under Bar, Chain, etc. 3. Small globular masses of lead, of various sizes, -- used chiefly for killing game; as, bird shot; buckshot. 4. The flight of a missile, or the distance which it is, or can be, thrown; as, the vessel was distant more than a cannon shot. 5. A marksman; one who practices shooting; as, an exellent shot. Shot belt, a belt having a pouch or compartment for carrying shot. -- Shot cartridge, a cartridge containing powder and small shot, forming a charge for a shotgun. -- Shot garland (Naut.), a wooden frame to contain shot, secured to the coamings and ledges round the hatchways of a ship. -- Shot gauge, an instrument for measuring the diameter of round shot. Totten. -- shot hole, a hole made by a shot or bullet discharged. -- Shot locker (Naut.), a strongly framed compartment in the hold of a vessel, for containing shot. -- Shot of a cable (Naut.), the splicing of two or more cables together, or the whole length of the cables thus united. -- Shot prop (Naut.), a wooden prop covered with tarred hemp, to stop a hole made by the shot of an enemy in a ship's side. -- Shot tower, a lofty tower for making shot, by dropping from its summit melted lead in slender streams. The lead forms spherical drops which cool in the descent, and are received in water or other liquid. -- Shot window, a window projecting from the wall. Ritson, quoted by Halliwell, explains it as a window that opens and shuts; and Wodrow describes it as a window of shutters made of timber and a few inches of glass above them.\n\nTo load with shot, as a gun. Totten."}