{"word":"shoulder","definition":"1. (Anat.)  The joint, or the region of the joint, by which the fore limb is connected with the body or with the shoulder girdle; the projection formed by the bones and muscles about that joint. 2. The flesh and muscles connected with the shoulder joint; the upper part of the back; that part of the human frame on which it is most easy to carry a heavy burden; -- often used in the plural. Then by main force pulled up, and on his shoulders bore The gates of Azza. Milton. Adown her shoulders fell her length of hair. Dryden. 3. Fig.: That which supports or sustains; support. In thy shoulder do I build my seat. Shak. 4. That which resembles a human shoulder, as any protuberance or projection from the body of a thing. The north western shoulder of the mountain. Sir W. Scott. 5. The upper joint of the fore leg and adjacent parts of an animal, dressed for market; as, a shoulder of mutton. 6. (Fort.)  The angle of a bastion included between the face and flank. See Illust. of Bastion. 7. An abrupt projection which forms an abutment on an object, or limits motion, etc., as the projection around a tenon at the end of a piece of timber, the part of the top of a type which projects beyond the base of the raised character, etc. Shoulder belt, a belt that passes across the shoulder. -- Shoulder blade (Anat.), the flat bone of the shoulder, to which the humerus is articulated; the scapula. -- Shoulder block (Naut.), a block with a projection, or shoulder, near the upper end, so that it can rest against a spar without jamming the rope. -- Shoulder clapper, one who claps another on the shoulder, or who uses great familiarity. [Obs.] Shak. -- Shoulder girdle. (Anat.) See Pectoral girdle, under Pectoral. -- Shoulder knot, an ornamental knot of ribbon or lace worn on the shoulder; a kind of epaulet or braided ornament worn as part of a military uniform. -- Shoulder-of-mutton sail (Naut.), a triangular sail carried on a boat's mast; -- so called from its shape. -- Shoulder slip, dislocation of the shoulder, or of the humerous. Swift. -- Shoulder strap, a strap worn on or over the shoulder. Specifically (Mil. & Naval), a narrow strap worn on the shoulder of a commissioned officer, indicating, by a suitable device, the rank he holds in the service. See Illust. in App.\n\n1. To push or thrust with the shoulder; to push with violence; to jostle. As they the earth would shoulder from her seat. Spenser. Around her numberless the rabble flowed, Shouldering each other, crowding for a view. Rowe. 2. To take upon the shoulder or shoulders; as, to shoulder a basket; hence, to assume the burden or responsibility of; as, to shoulder blame; to shoulder a debt. As if Hercules Or burly Atlas shouldered up their state. Marston. Right shoulder arms (Mil.), a position in the Manual of Arms which the piece is placed on the right shoulder, with the lock plate up, and the muzzle elevated and inclined to the left, and held as in the illustration."}