{"word":"show","definition":"1. To exhibit or present to view; to place in sight; to display; -- the thing exhibited being the object, and often with an indirect object denoting the person or thing seeing or beholding; as, to show a house; show your colors; shopkeepers show customers goods (show goods to customers). Go thy way, shew thyself to the priest. Matt. viii. 4. Nor want we skill or art from whence to raise Magnificence; and what can heaven show more Milton. 2. To exhibit to the mental view; to tell; to disclose; to reveal; to make known; as, to show one's designs. Shew them the way wherein they must walk. Ex. xviii. 20. If it please my father to do thee evil, then I will shew it thee, and send thee away. 1 Sam. xx. 13. 3. Specifically, to make known the way to (a person); hence, to direct; to guide; to asher; to conduct; as, to show a person into a parlor; to show one to the door. 4. To make apparent or clear, as by evidence, testimony, or reasoning; to prove; to explain; also, to manifest; to evince; as, to show the truth of a statement; to show the causes of an event. I 'll show my duty by my timely care. Dryden. 5. To bestow; to confer; to afford; as, to show favor. Shewing mercy unto thousands of them that love me. Ex. xx. 6. To show forth, to manifest; to publish; to proclaim. -- To show his paces, to exhibit the gait, speed, or the like; -- said especially of a horse. -- To show off, to exhibit ostentatiously. -- To show up, to expose. [Colloq.]\n\n1. To exhibit or manifest one's self or itself; to appear; to look; to be in appearance; to seem. Just such she shows before a rising storm. Dryden. All round a hedge upshoots, and shows At distance like a little wood. Tennyson. 2. To have a certain appearance, as well or ill, fit or unfit; to become or suit; to appear. My lord of York, it better showed with you. Shak. To show off, to make a show; to display one's self.\n\n1. The act of showing, or bringing to view; exposure to sight; exhibition. 2. That which os shown, or brought to view; that which is arranged to be seen; a spectacle; an exhibition; as, a traveling show; a cattle show. As for triumphs, masks, feasts, and such shows. Bacon. 3. Proud or ostentatious display; parade; pomp. I envy none their pageantry and show. Young. 4. Semblance; likeness; appearance. He through the midst unmarked, In show plebeian angel militant Of lowest order, passed. Milton. 5. False semblance; deceitful appearance; pretense. Beware of the scribes, . . . which devour widows' houses, and for a shew make long prayers. Luke xx. 46. 47. 6. (Med.)  A discharge, from the vagina, of mucus streaked with blood, occuring a short time before labor. 7. (Mining)  A pale blue flame, at the top of a candle flame, indicating the presence of fire damp. Raymond. Show bill, a broad sheet containing an advertisement in large letters. -- Show box, a box xontaining some object of curiosity carried round as a show. -- Show card, an advertising placard; also, a card for displaying samples. -- Show case, a gla -- Show glass, a glass which displays objects; a mirror. -- Show of hands, a raising of hands to indicate judgment; as, the vote was taken by a show of hands. -- Show stone, a piece of glass or crystal supposed to have the property of exhibiting images of persons or things not present, indicating in that way future events."}