{"word":"sight","definition":"1. The act of seeing; perception of objects by the eye; view; as, to gain sight of land. A cloud received him out of their sight. Acts. i. 9. 2. The power of seeing; the faculty of vision, or of perceiving objects by the instrumentality of the eyes. Thy sight is young, And thou shalt read when mine begin to dazzle. Shak. O loss of sight, of thee I most complain! Milton. 3. The state of admitting unobstructed vision; visibility; open view; region which the eye at one time surveys; space through which the power of vision extends; as, an object within sight. 4. A spectacle; a view; a show; something worth seeing. Moses said, I will now turn aside and see this great sight, why the bush is not burnt. Ex. iii. 3. They never saw a sight so fair. Spenser. 5. The instrument of seeing; the eye. Why cloud they not their sights Shak. 6. Inspection; examination; as, a letter intended for the sight of only one person. 7. Mental view; opinion; judgment; as, in their sight it was harmless. Wake. That which is highly esteemed among men is abomination in the sight of God. Luke xvi. 15. 8. A small aperture through which objects are to be seen, and by which their direction is settled or ascertained; as, the sight of a quadrant. Thier eyes of fire sparking through sights of steel. Shak. 9. A small piece of metal, fixed or movable, on the breech, muzzle, center, or trunnion of a gun, or on the breech and the muzzle of a rifle, pistol, etc., by means of which the eye is guided in aiming. Farrow. 10. In a drawing, picture, etc., that part of the surface, as of paper or canvas, which is within the frame or the border or margin. In a frame or the like, the open space, the opening. 11. A great number, quantity, or sum; as, a sight of money. [Now colloquial] Note: Sight in this last sense was formerly employed in the best usage. \"A sight of lawyers.\" Latimer. A wonder sight of flowers. Gower. At sight, as soon as seen, or presented to sight; as, a draft payable at sight: to read Greek at sight; to shoot a person at sight. -- Front sight (Firearms), the sight nearest the muzzle. -- Open sight. (Firearms) (a) A front sight through which the objects aimed at may be seen, in distinction from one that hides the object. (b) A rear sight having an open notch instead of an aperture. -- Peep sight, Rear sight. See under Peep, and Rear. -- Sight draft, an order, or bill of exchange, directing the payment of money at sight. -- To take sight, to take aim; to look for the purpose of directing a piece of artillery, or the like. Syn. -- Vision; view; show; spectacle; representation; exhibition.\n\n1. To get sight of; to see; as, to sight land; to sight a wreck. Kane. 2. To look at through a sight; to see accurately; as, to sight an object, as a star. 3. To apply sights to; to adjust the sights of; also, to give the proper elevation and direction to by means of a sight; as, to sight a rifle or a cannon.\n\nTo take aim by a sight."}