{"word":"silk","definition":"1. The fine, soft thread produced by various species of caterpillars in forming the cocoons within which the worm is inclosed during the pupa state, especially that produced by the larvæ of Bombyx mori. 2. Hence, thread spun, or cloth woven, from the above-named material. 3. That which resembles silk, as the filiform styles of the female flower of maize. Raw silk, silk as it is wound off from the cocoons, and before it is manufactured. -- Silk cotton, a cottony substance enveloping the seeds of the silk-cotton tree. -- Silk-cotton tree (Bot.), a name for several tropical trees of the genera Bombax and Eriodendron, and belonging to the order Bombaceæ. The trees grow to an immense size, and have their seeds enveloped in a cottony substance, which is used for stuffing cushions, but can not be spun. -- Silk flower. (Bot.) (a) The silk tree. (b) A similar tree (Calliandra trinervia) of Peru. -- Silk fowl (Zoöl.), a breed of domestic fowls having silky plumage. -- Silk gland (Zoöl.), a gland which secretes the material of silk, as in spider or a silkworm; a sericterium. -- Silk gown, the distinctive robe of a barrister who has been appointed king's or queen's counsel; hence, the counsel himself. Such a one has precedence over mere barristers, who wear stuff gowns. [Eng.] -- Silk grass (Bot.), a kind of grass (Stipa comata) of the Western United States, which has very long silky awns. The name is also sometimes given to various species of the genera Aqave and Yucca. -- Silk moth (Zoöl.), the adult moth of any silkworm. See Silkworm. -- Silk shag, a coarse, rough-woven silk, like plush, but with a stiffer nap. -- Silk spider (Zoöl.), a large spider (Nephila plumipes), native of the Southern United States, remarkable for the large quantity of strong silk it produces and for the great disparity in the sizes of the sexes. -- Silk thrower, Silk throwster, one who twists or spins silk, and prepares it for weaving. Brande & C. -- Silk tree (Bot.), an Asiatic leguminous tree (Albizzia Julibrissin) with finely bipinnate leaves, and large flat pods; -- so called because of the abundant long silky stamens of its blossoms. Also called silk flower. -- Silk vessel. (Zoöl.) Same as Silk gland, above. -- Virginia silk (Bot.), a climbing plant (Periploca Græca) of the Milkweed family, having a silky tuft on the seeds. It is native in Southern Europe."}