{"word":"silver","definition":"1. (Chem.)  A soft white metallic element, sonorous, ductile, very malleable, and capable of a high degree of polish. It is found native, and also combined with sulphur, arsenic, antimony, chlorine, etc., in the minerals argentite, proustite, pyrargyrite, ceragyrite, etc. Silver is one of the \"noble\" metals, so-called, not being easily oxidized, and is used for coin, jewelry, plate, and a great variety of articles. Symbol Ag (Argentum). Atomic weight 107.7. Specific gravity 10.5. Note: Silver was known under the name of luna to the ancients and also to the alchemists. Some of its compounds, as the halogen salts, are remarkable for the effect of light upon them, and are used in photography. 2. Coin made of silver; silver money. 3. Anything having the luster or appearance of silver. 4. The color of silver. Note: Silver is used in the formation of many compounds of obvious meaning; as, silver-armed, silver-bright, silver-buskined, silver- coated, silver-footed, silver-haired, silver-headed, silver-mantled, silver-plated, silver-slippered, silver-sounding, silver-studded, silver-tongued, silver-white. See Silver, a. Black silver (Min.), stephanite; -- called also brittle silver ore, or brittle silver glance. -- Fulminating silver. (Chem.) (a) A black crystalline substance, Ag2O.(NH3)2, obtained by dissolving silver oxide in aqua ammonia. When dry it explodes violently on the slightest percussion. (b) Silver fulminate, a white crystalline substance, Ag2C2N2O2, obtained by adding alcohol to a solution of silver nitrate. When dry it is violently explosive. -- German silver. (Chem.) See under German. -- Gray silver. (Min.) See Freieslebenite. -- Horn silver. (Min.) See Cerargyrite. -- King's silver. (O. Eng. Law) See Postfine. -- Red silver, or Ruby silver. (Min.) See Proustite, and Pyrargyrite. -- Silver beater, one who beats silver into silver leaf or silver foil. -- Silver glance, or Vitreous silver. (Min.) See Argentine.\n\n1. Of or pertaining to silver; made of silver; as, silver leaf; a silver cup. 2. Resembling silver. Specifically: (a) Bright; resplendent; white. \"Silver hair.\" Shak. Others, on silver lakes and rivers, bathed Their downy breast. Milton. (b) Precious; costly. (c) Giving a clear, ringing sound soft and clear. \"Silver voices.\" Spenser. (d) Sweet; gentle; peaceful. \"Silver slumber.\" Spenser. American silver fir (Bot.), the balsam fir. See under Balsam. -- Silver age (Roman Lit.), the latter part (a. d. 14-180) of the classical period of Latinity, -- the time of writers of inferior purity of language, as compared with those of the previous golden age, so-called. -- Silver-bell tree (Bot.), an American shrub or small tree (Halesia tetraptera) with white bell-shaped flowers in clusters or racemes; the snowdrop tree. -- Silver bush (Bot.), a shrubby leguminous plant (Anthyllis Barba- Jovis) of Southern Europe, having silvery foliage. -- Silver chub (Zoöl.), the fallfish. -- Silver eel. (Zoöl.) (a) The cutlass fish. (b) A pale variety of the common eel. -- Silver fir (Bot.), a coniferous tree (Abies pectinata) found in mountainous districts in the middle and south of Europe, where it often grows to the height of 100 or 150 feet. It yields Burgundy pitch and Strasburg turpentine. -- Silver foil, foil made of silver. -- Silver fox (Zoöl.), a variety of the common fox (Vulpes vulpes, variety argenteus) found in the northern parts of Asia, Europe, and America. Its fur is nearly black, with silvery tips, and is highly valued. Called also black fox, and silver-gray fox. -- Silver gar. (Zoöl.) See Billfish (a) -- Silver grain (Bot.), the lines or narrow plates of cellular tissue which pass from the pith to the bark of an exogenous stem; the medullary rays. In the wood of the oak they are much larger than in that of the beech, maple, pine, cherry, etc. -- Silver grebe (Zoöl.), the red-throated diver. See Illust. under Diver. -- Silver hake (Zoöl.), the American whiting. -- Silver leaf, leaves or sheets made of silver beaten very thin. -- Silver lunge (Zoöl.), the namaycush. -- Silver moonfish.(Zoöl.) See Moonfish (b). -- Silver moth (Zoöl.), a lepisma. -- Silver owl (Zoöl.), the barn owl. -- Silver perch (Zoöl.), the mademoiselle, 2. -- Silver pheasant (Zoöl.), any one of several species of beautiful crested and long-tailed Asiatic pheasants, of the genus Euplocamus. They have the tail and more or less of the upper parts silvery white. The most common species (E. nychtemerus) is native of China. -- Silver plate, domestic utensils made of silver. -- Silver plover (Zoöl.), the knot. -- Silver salmon (Zoöl.), a salmon (Oncorhynchus kisutch) native of both coasts of the North Pacific. It ascends all the American rivers as far south as the Sacramento. Called also kisutch, whitefish, and white salmon. -- Silver shell (Zoöl.), a marine bivalve of the genus Anomia. See Anomia. -- Silver steel, an alloy of steel with a very small proportion of silver. -- Silver stick, a title given to the title field officer of the Life Guards when on duty at the palace. [Eng.] Thackeray. -- Silver tree (Bot.), a South African tree (Leucadendron argenteum) with long, silvery, silky leaves. -- Silver trout, (Zoöl.) See Trout. -- Silver wedding. See under Wedding. -- Silver whiting (Zoöl.), a marine sciænoid food fish (Menticirrus littoralis) native of the Southern United States; -- called also surf whiting. -- Silver witch (Zoöl.), A lepisma.\n\n1. To cover with silver; to give a silvery appearance to by applying a metal of a silvery color; as, to silver a pin; to silver a glass mirror plate with an amalgam of tin and mercury. 2. To polish like silver; to impart a brightness to, like that of silver. And smiling calmness silvered o'er the deep. Pope. 3. To make hoary, or white, like silver. His head was silvered o'er with age. Gay.\n\nTo acquire a silvery color. [R.] The eastern sky began to silver and shine. L. Wallace."}