{"word":"simple","definition":"1. Single; not complex; not infolded or entangled; uncombined; not compounded; not blended with something else; not complicated; as, a simple substance; a simple idea; a simple sound; a simple machine; a simple problem; simple tasks. 2. Plain; unadorned; as, simple dress. \"Simple truth.\" Spenser. \"His simple story.\" Burns. 3. Mere; not other than; being only. A medicine . . . whose simple touch Is powerful to araise King Pepin. Shak. 4. Not given to artifice, stratagem, or duplicity; undesigning; sincere; true. Full many fine men go upon my score, as simple as I stand here, and I trust them. Marston. Must thou trust Tradition's simple tongue Byron. To be simple is to be great. Emerson. 5. Artless in manner; unaffected; unconstrained; natural; inartificial;; straightforward. In simple manners all the secret lies. Young. 6. Direct; clear; intelligible; not abstruse or enigmatical; as, a simple statement; simple language. 7. Weak in intellect; not wise or sagacious; of but moderate understanding or attainments; hence, foolish; silly. \"You have simple wits.\" Shak. The simple believeth every word; but the prudent man looketh well to his going. Prov. xiv. 15. 8. Not luxurious; without much variety; plain; as, a simple diet; a simple way of living. Thy simple fare and all thy plain delights. Cowper. 9. Humble; lowly; undistinguished. A simple husbandman in garments gray. Spenser. Clergy and laity, male and female, gentle and simple made the fuel of the same fire. Fuller. 10. (BOt.)  Without subdivisions; entire; as, a simple stem; a simple leaf. 11. (Chem.)  Not capable of being decomposed into anything more simple or ultimate by any means at present known; elementary; thus, atoms are regarded as simple bodies. Cf. Ultimate, a. Note: A simple body is one that has not as yet been decomposed. There are indications that many of our simple elements are still compound bodies, though their actual decomposition into anything simpler may never be accomplished.fundamental particle 12. (Min.)  Homogenous. 13. (Zoöl.)  Consisting of a single individual or zooid; as, a simple ascidian; -- opposed to compound. Simple contract (Law), any contract, whether verbal or written, which is not of record or under seal. J. W. Smith. Chitty. -- Simple equation (Alg.), an eqyation containing but one unknown quantity, and that quantity only in the first degree. -- Simple eye (Zoöl.), an eye having a single lens; -- opposed to Ant: compound eye. -- Simple interest. See under Interest. -- Simple larceny. (Law) See under Larceny. -- Simple obligation (Rom. Law), an obligation which does not depend for its execution upon any event provided for by the parties, or is not to become void on the happening of any such event. Burrill. Syn. -- Single; uncompounded; unmingled; unmixed; mere; uncombined; elementary; plain; artless; sincere; harmless; undesigning; frank; open; unaffected; inartificial; unadorned; credulous; silly; foolish; shallow; unwise. -- Simple, Silly. One who is simple is sincere, unaffected, and inexperienced in duplicity, -- hence liable to be duped. A silly person is one who is ignorant or weak and also self-confident; hence, one who shows in speech and act a lack of good sense. Simplicity is incompatible with duplicity, artfulness, or vanity, while silliness is consistent with all three. Simplicity denotes lack of knowledge or of guile; silliness denotes want of judgment or right purpose, a defect of character as well as of education. I am a simple woman, much too weak To oppose your cunning. Shak. He is the companion of the silliest people in their most silly pleasure; he is ready for every impertinent entertainment and diversion. Law.\n\n1. Something not mixed or compounded. \"Compounded of many simples.\" Shak. 2. (Med.)  A medicinal plant; -- so called because each vegetable was supposed to possess its particular virtue, and therefore to constitute a simple remedy. What virtue is in this remedy lies in the naked simple itself as it comes over from the Indies. Sir W. Temple. 3. (Weaving) (a) A drawloom. (b) A part of the apparatus for raising the heddles of a drawloom. 4. (R. C. Ch.)  A feast which is not a double or a semidouble.\n\nTo gather simples, or medicinal plants. As simpling on the flowery hills she [Circe] strayed. Garth."}