{"word":"sink","definition":"1. To fall by, or as by, the force of gravity; to descend lower and lower; to decline gradually; to subside; as, a stone sinks in water; waves rise and sink; the sun sinks in the west. I sink in deep mire. Ps. lxix. 2. 2. To enter deeply; to fall or retire beneath or below the surface; to penetrate. The stone sunk into his forehead. 1 San. xvii. 49. 3. Hence, to enter so as to make an abiding impression; to enter completely. Let these sayings sink down into your ears. Luke ix. 44. 4. To be overwhelmed or depressed; to fall slowly, as so the ground, from weakness or from an overburden; to fail in strength; to decline; to decay; to decrease. I think our country sinks beneath the yoke. Shak. He sunk down in his chariot. 2 Kings ix. 24. Let not the fire sink or slacken. Mortimer. 5. To decrease in volume, as a river; to subside; to become diminished in volume or in apparent height. The Alps and Pyreneans sink before him. Addison. Syn. -- To fall; subside; drop; droop; lower; decline; decay; decrease; lessen.\n\n1. To cause to sink; to put under water; to immerse or submerge in a fluid; as, to sink a ship. [The Athenians] fell upon the wings and sank a single ship. Jowett (Thucyd.). 2. Figuratively: To cause to decline; to depress; to degrade; hence, to ruin irretrievably; to destroy, as by drowping; as, to sink one's reputation. I raise of sink, imprison or set free. Prior. If I have a conscience, let it sink me. Shak. Thy cruel and unnatural lust of power Has sunk thy father more than all his years. Rowe. 3. To make (a depression) by digging, delving, or cutting, etc.; as, to sink a pit or a well; to sink a die. 4. To bring low; to reduce in quantity; to waste. You sunk the river repeated draughts. Addison. 5. To conseal and appropriate. [Slang] If sent with ready money to buy anything, and you happen to be out of pocket, sink the money, and take up the goods on account. Swift. 6. To keep out of sight; to suppress; to ignore. A courtly willingness to sink obnoxious truths. Robertson. 7. To reduce or extinguish by payment; as, to sink the national debt.\n\n1. A drain to carry off filthy water; a jakes. 2. A shallow box or vessel of wood, stone, iron, or other material, connected with a drain, and used for receiving filthy water, etc., as in a kitchen. 3. A hole or low place in land or rock, where waters sink and are lost; -- called also sink hole. [U. S.] Sink hole. (a) The opening to a sink drain. (b) A cesspool. (c) Same as Sink, n., 3."}