{"word":"skill","definition":"1. Discrimination; judgment; propriety; reason; cause. [Obs.] Shak. \"As it was skill and right.\" Chaucer. For great skill is, he prove that he wrought. Chaucer. [For with good reason he should test what he created.] 2. Knowledge; understanding. [Obsoles.] That by his fellowship he color mightskill of any wight. Spenser. Nor want we skill or art. Milton. 3. The familiar knowledge of any art or science, united with readiness and dexterity in execution or performance, or in the application of the art or science to practical purposes; power to discern and execute; ability to perceive and perform; expertness; aptitude; as, the skill of a mathematician, physician, surgeon, mechanic, etc. Phocion, . . . by his great wisdom and skill at negotiations, diverted Alexander from the conquest of Athens. Swift. Where patience her sweet skill imparts. Keble. 4. Display of art; exercise of ability; contrivance; address. [Obs.] Richard . . . by a thousand princely skills, gathering so much corn as if he meant not to return. Fuller. 5. Any particular art. [Obs.] Learned in one skill, and in another kind of learning unskillful. Hooker. Syn. -- Dexterity; adroitness; expertness; art; aptitude; ability. -- Skill, Dexterity, Adroitness. Skill is more intelligent, denoting familiar knowledge united to readiness of performance. Dexterity, when applied to the body, is more mechanical, and refers to habitual ease of execution. Adroitness involves the same image with dexterity, and differs from it as implaying a general facility of movement (especially in avoidance of danger or in escaping from a difficalty). The same distinctions apply to the figurative sense of the words. A man is skillful in any employment when he understands both its theory and its practice. He is dexterous when he maneuvers with great lightness. He is adroit in the use od quick, sudden, and well- directed movements of the body or the mind, so as to effect the object he has in view.\n\nTo know; to understand. [Obs.] To skill the arts of expressing our mind. Barrow.\n\n1. To be knowing; to have understanding; to be dexterous in performance. [Obs.] I can not skill of these thy ways. Herbert. 2. To make a difference; to signify; to matter; -- used impersonally. Spenser. What skills it, if a bag of stones or gold About thy neck do drown thee Herbert. It skills not talking of it. Sir W. Scott."}