{"word":"skin","definition":"1. (Anat.)  The external membranous integument of an animal. Note: In man, and the vertebrates generally, the skin consist of two layers, an outer nonsensitive and nonvascular epidermis, cuticle, or skarfskin, composed of cells which are constantly growing and multiplying in the deeper, and being thrown off in the superficial, layers; and an inner sensitive, and vascular dermis, cutis, corium, or true skin, composed mostly of connective tissue. 2. The hide of an animal, separated from the body, whether green, dry, or tanned; especially, that of a small animal, as a calf, sheep, or goat. 3. A vessel made of skin, used for holding liquids. See Bottle, 1. \"Skins of wine.\" Tennyson. 4. The bark or husk of a plant or fruit; the exterior coat of fruits and plants. 5. (Naut.) (a) That part of a sail, when furled, which remains on the outside and covers the whole. Totten. (b) The covering, as of planking or iron plates, outside the framing, forming the sides and bottom of a vessel; the shell; also, a lining inside the framing. Skin friction, Skin resistance (Naut.), the friction, or resistance, caused by the tendency of water to adhere to the immersed surface (skin) of a vessel. -- Skin graft (Surg.), a small portion of skin used in the process of grafting. See Graft, v. t., 2. -- Skin moth (Zoöl.), any insect which destroys the prepared skins of animals, especially the larva of Dermestes and Anthrenus. -- Skin of the teeth, nothing, or next to nothing; the least possible hold or advantage. Job xix. 20. -- Skin wool, wool taken from dead sheep.\n\n1. To strip off the skin or hide of; to flay; to peel; as, to skin an animal. 2. To cover with skin, or as with skin; hence, to cover superficially. It will but skin and film the ulcerous place. Shak. 3. To strip of money or property; to cheat. [Slang]\n\n1. To become covered with skin; as, a wound skins over. 2. To produce, in recitation, examination, etc., the work of another for one's own, or to use in such exercise cribs, memeoranda, etc., which are prohibited. [College Cant, U.S.]"}