{"word":"slate","definition":"1. (Min.)  An argillaceous rock which readily splits into thin plates; argillite; argillaceous schist. 2. Any rock or stone having a slaty structure. 3. A prepared piece of such stone. Especially: (a) A thin, flat piece, for roofing or covering houses, etc. (b) A tablet for writing upon. 4. An artificial material, resembling slate, and used for the above purposes. 5. A thin plate of any material; a flake. [Obs.] 6. (Politics)  A list of candidates, prepared for nomination or for election; a list of candidates, or a programme of action, devised beforehand. [Cant, U.S.] Bartlett. Adhesive slate (Min.), a kind of slate of a greenish gray color, which absorbs water rapidly, and adheres to the tongue; whence the name. -- Aluminous slate, or Alum slate (Min.), a kind of slate containing sulphate of alumina, -- used in the manufacture of alum. -- Bituminous slate (Min.), a soft species of sectile clay slate, impregnated with bitumen. -- Hornblende slate (Min.), a slaty rock, consisting essentially of hornblende and feldspar, useful for flagging on account of its toughness. -- Slate ax or axe, a mattock with an ax end, used in shaping slates for roofs, and making holes in them for the nails. -- Slate clay (Geol.), an indurated clay, forming one of the alternating beds of the coal measures, consisting of an infusible compound of alumina and silica, and often used for making fire bricks. Tomlinson. -- Slate globe, a globe the surface of which is made of an artificial slatelike material. -- Slate pencil, a pencil of slate, or of soapstone, used for writing on a slate. -- Slate rocks (Min.), rocks which split into thin laminæ, not necessarily parallel to the stratification; foliated rocks. -- Slate spar (Min.), a variety of calcite of silvery white luster and of a slaty structure. -- Transparent slate, a plate of translucent material, as ground glass, upon which a copy of a picture, placed beneath it, can be made by tracing.\n\n1. To cover with slate, or with a substance resembling slate; as, to slate a roof; to slate a globe. 2. To register (as on a slate and subject to revision), for an appointment. [Polit. Cant]\n\nTo set a dog upon; to bait; to slat. See 2d Slat, 3. [Prov. Eng. & Scot.] [Written also slete.] Ray."}