{"word":"small","definition":"1. Having little size, compared with other things of the same kind; little in quantity or degree; diminutive; not large or extended in dimension; not great; not much; inconsiderable; as, a small man; a small river. To compare Great things with small. Milton. 2. Being of slight consequence; feeble in influence or importance; unimportant; trivial; insignificant; as, a small fault; a small business. 3. Envincing little worth or ability; not large-minded; -- sometimes, in reproach, paltry; mean. A true delineation of the smallest man is capable of interesting the reatest man. Carlyle. 4. Not prolonged in duration; not extended in time; short; as, after a small space. Shak. 5. Weak; slender; fine; gentle; soft; not loud. \"A still, small voice.\" 1 Kings xix. 12. Great and small,of all ranks or degrees; -- used especially of persons. \"His quests, great and small.\" Chaucer. -- Small arms, muskets, rifles, pistols, etc., in distinction from cannon. -- Small beer. See under Beer. -- Small coal. (a) Little coals of wood formerly used to light fires. Gay. (b) Coal about the size of a hazelnut, separated from the coarser parts by screening. -- Small craft (Naut.), a vessel, or vessels in general, of a small size. -- Small fruits. See under Fruit. -- Small hand, a certain size of paper. See under Paper. -- Small hours. See under Hour. -- Small letter. (Print.), a lower-case letter. See Lower-case, and Capital letter, under Capital, a. -- Small piece, a Scotch coin worth about 2 -- Small register. See the Note under 1st Register, 7. -- Small stuff (Naut.), spun yarn, marline, and the smallest kinds of rope. R. H. Dana, Jr. -- Small talk, light or trifling conversation; chitchat. -- Small wares (Com.), various small textile articles, as tapes, braid, tringe, and the like. M`Culloch.\n\n1. In or to small extent, quantity, or degree; little; slightly. [Obs.] \"I wept but small.\" Chaucer. \"It small avails my mood.\" Shak. 2. Not loudly; faintly; timidly. [Obs. or Humorous] You may speak as small as you will. Shak.\n\n1. The small or slender part of a thing; as, the small of the leg or of the back. 2. pl.  Smallclothes. [Colloq.] Hood. Dickens. 3. pl.  Same as Little go. See under Little, a.\n\nTo make little or less. [Obs.]"}