{"word":"smart","definition":"1. To feel a lively, pungent local pain; -- said of some part of the body as the seat of irritation; as, my finger smarts; these wounds smart. Chaucer. Shak. 2. To feel a pungent pain of mind; to feel sharp pain or grief; to suffer; to feel the sting of evil. No creature smarts so little as a fool. Pope. He that is surety for a stranger shall smart for it. Prov. xi. 15.\n\nTo cause a smart in. \"A goad that . . . smarts the flesh.\" T. Adams.\n\n1. Quick, pungent, lively pain; a pricking local pain, as the pain from puncture by nettles. \"In pain's smart.\" Chaucer. 2. Severe, pungent pain of mind; pungent grief; as, the smart of affliction. To stand 'twixt us and our deserved smart. Milton. Counsel mitigates the greatest smart. Spenser. 3. A fellow who affects smartness, briskness, and vivacity; a dandy. [Slang] Fielding. 4. Smart money (see below). [Canf]\n\n1. Causing a smart; pungent; pricking; as, a smart stroke or taste. How smart lash that speech doth give my conscience. Shak. 2. Keen; severe; poignant; as, smart pain. 3. Vigorous; sharp; severe. \"Smart skirmishes, in which many fell.\" Clarendon. 4. Accomplishing, or able to accomplish, results quickly; active; sharp; clever. [Colloq.] 5. Efficient; vigorous; brilliant. \"The stars shine smarter.\" Dryden. 6. Marked by acuteness or shrewdness; quick in suggestion or reply; vivacious; witty; as, a smart reply; a smart saying. Who, for the poor renown of being smart Would leave a sting within a brother's heart Young. A sentence or two, . . . which I thought very smart. Addison. 7. Pretentious; showy; spruce; as, a smart gown. 8. Brisk; fresh; as, a smart breeze. Smart money. (a) Money paid by a person to buy himself off from some unpleasant engagement or some painful situation. (b) (Mil.) Money allowed to soldiers or sailors, in the English service, for wounds and injures received; also, a sum paid by a recruit, previous to being sworn in, to procure his release from service. (c) (Law) Vindictive or exemplary damages; damages beyond a full compensation for the actual injury done. Burrill. Greenleaf. -- Smart ticket, a certificate given to wounded seamen, entitling them to smart money. [Eng.] Brande & C. Syn. -- Pungent; poignant; sharp; tart; acute; quick; lively; brisk; witty; clever; keen; dashy; showy. -- Smart, Clever. Smart has been much used in New England to describe a person who is intelligent, vigorous, and active; as, a smart young fellow; a smart workman, etc., conciding very nearly with the English sense of clever. The nearest approach to this in England is in such expressions as, he was smart (pungent or witty) in his reply, etc.; but smart and smartness, when applied to persons, more commonly refer to dress; as, a smart appearance; a smart gown, etc."}