{"word":"soldier","definition":"1. One who is engaged in military service as an officer or a private; one who serves in an army; one of an organized body of combatants. I am a soldier and unapt to weep. Shak. 2. Especially, a private in military service, as distinguished from an officer. It were meet that any one, before he came to be a captain, should have been a soldier. Spenser. 3. A brave warrior; a man of military experience and skill, or a man of distinguished valor; -- used by way of emphasis or distinction. Shak. 4. (Zoöl.)  The red or cuckoo gurnard (Trigla pini.) [Prov. Eng.] 5. (Zoöl.)  One of the asexual polymorphic forms of white ants, or termites, in which the head and jaws are very large and strong. The soldiers serve to defend the nest. See Termite. Soldier beetle (Zoöl.), an American carabid beetle (Chauliognathus Americanus) whose larva feeds upon other insects, such as the plum curculio. -- Soldier bug (Zoöl.), any hemipterous insect of the genus Podisus and allied genera, as the spined soldier bug (Podius spinosus). These bugs suck the blood of other insects. -- Soldier crab (Zoöl.) (a) The hermit crab. (b) The fiddler crab. -- Soldier fish (Zoöl.), a bright-colored etheostomoid fish (Etheostoma coeruleum) found in the Mississippi River; -- called also blue darter, and rainbow darter. -- Soldier fly (Zoöl.), any one of numerous species of small dipterous flies of the genus Stratyomys and allied genera. They are often bright green, with a metallic luster, and are ornamented on the sides of the back with markings of yellow, like epaulets or shoulder straps. -- Soldier moth (Zoöl.), a large geometrid moth (Euschema militaris), having the wings bright yellow with bluish black lines and spots. -- Soldier orchis (Bot.), a kind of orchis (Orchis militaris).\n\n1. To serve as a soldier. 2. To make a pretense of doing something, or of performing any task. [Colloq.U.S.] Note: In this sense the vulgar pronounciation (so\"jer) is jocosely preserved. It needs an opera glass to discover whether the leaders are pulling, or only soldiering. C. D. Warner."}