{"word":"solution","definition":"1. The act of separating the parts of any body, or the condition of undergoing a separation of parts; disruption; breach. In all bodies there is an appetite of union and evitation of solution of continuity. Bacon. 2. The act of solving, or the state of being solved; the disentanglement of any intricate problem or difficult question; explanation; clearing up; -- used especially in mathematics, either of the process of solving an equation or problem, or the result of the process. 3. The state of being dissolved or disintegrated; resolution; disintegration. It is unquestionably an enterprise of more promise to assail the nations in their hour of faintness and solution, than at a time when magnificent and seductive systems of worship were at their height of energy and splendor. I. Taylor. 4. (Chem.Phys.)  The act or process by which a body (whether solid, liquid, or gaseous) is absorbed into a liquid, and, remaining or becoming fluid, is diffused throughout the solvent; also, the product reulting from such absorption. Note: When a solvent will not take in any more of a substance the solution is said to be saturated. Solution is two kinds; viz.: (a) Mechanical solution, in which no marked chemical change takes place, and in which, in the case of solids, teh dissolved body can be regained by evaporation, as in the solution of salt or sugar in water. (b) Chemical solution, in which there is involved a decided chemical change, as when limestone or zinc undergoes solution in hydrochloric acid. Mechanical solution is regarded as a form of molecular or atomic attraction, and is probably occasioned by the formation of certain very weak and unstable compounds which are easily dissociated and pass into new and similar compounds. Note: This word is not used in chemistry or mineralogy for fusion, or the melting of bodies by the heat of fire. 5. release; deliverance; disharge. [Obs.] Barrow. 6. (Med.) (a) The termination of a disease; resolution. (b) A crisis. (c) A liquid medicine or preparation (usually aqueous) in which the solid ingredients are wholly soluble. U. S. Disp. Fehling's solution (Chem.), a standardized solution of cupric hydrate in sodium potassium tartrate, used as a means of determining the reducing power of certain sugars and sirups by the amount of red cuprous oxide thrown down. -- Heavy solution (Min.), a liquid of high density, as a solution of mercuric iodide in potassium iodide (called the Sonstadt or Thoulet solution) having a maximum specific gravity of 3.2, or of borotungstate of cadium (Klein solution, specific gravity 3.6), and the like. Such solutions are much used in determining the specific gravities of minerals, and in separating them when mechanically mixed as in a pulverized rock. -- Nessler's solution. See Nesslerize. -- Solution of continuity, the separation of connection, or of connected substances or parts; -- applied, in surgery, to a facture, laceration, or the like. \"As in the natural body a wound, or solution of continuity, is worse than a corrupt humor, so in the spiritual.\" Bacon. -- Standardized solution (Chem.), a solution which is used as a reagent, and is of a known and standard strength; specifically, a normal solution, containing in each cubic centimeter as many milligrams of the element in question as the number representing its atomic weight; thus, a normal solution of silver nitrate would contain 107.7 mgr. of silver nitrate in each cubic centimeter."}