{"word":"some","definition":"1. Consisting of a greater or less portion or sum; composed of a quantity or number which is not stated; -- used to express an indefinite quantity or number; as, some wine; some water; some persons. Used also pronominally; as, I have some. Some theoretical writers allege that there was a time when there was no such thing as society. Blackstone. 2. A certain; one; -- indicating a person, thing, event, etc., as not known individually, or designated more specifically; as, some man, that is, some one man. \"Some brighter clime.\" Mrs. Barbauld. Some man praiseth his neighbor by a wicked intent. Chaucer. Most gentlemen of property, at some period or other of their lives, are ambitious of representing their county in Parliament. Blackstone. 3. Not much; a little; moderate; as, the censure was to some extent just. 4. About; near; more or less; -- used commonly with numerals, but formerly also with a singular substantive of time or distance; as, a village of some eighty houses; some two or three persons; some hour hence. Shak. The number slain on the rebel's part were some two thousand. Bacon. 5. Considerable in number or quality. \"Bore us some leagues to sea.\" Shak. On its outer point, some miles away. The lighthouse lifts its massive masonry. Longfellow. 6. Certain; those of one part or portion; -- in distinct from other or others; as, some men believe one thing, and others another. Some [seeds] fell among thorns; . . . but other fell into good ground. Matt. xiii. 7, 8. 7. A part; a portion; -- used pronominally, and followed sometimes by of; as, some of our provisions. Your edicts some reclaim from sins, But most your life and blest example wins. Dryden. All and some, one and all. See under All, adv. [Obs.] Note: The illiterate in the United States and Scotland often use some as an adverb, instead of somewhat, or an equivalent expression; as, I am some tired; he is some better; it rains some, etc. Some . . . some, one part . . . another part; these . . . those; -- used distributively. Some to the shores do fly, Some to the woods, or whither fear advised. Daniel. Note: Formerly used also of single persons or things: this one . . . that one; one . . . another. Some in his bed, some in the deep sea. Chaucer."}