{"word":"sort","definition":"Chance; lot; destiny. [Obs.] By aventure, or sort, or cas [chance]. Chaucer. Let blockish Ajax draw The sort to fight with Hector. Shak.\n\n1. A kind or species; any number or collection of individual persons or things characterized by the same or like qualities; a class or order; as, a sort of men; a sort of horses; a sort of trees; a sort of poems. 2. Manner; form of being or acting. Which for my part I covet to perform, In sort as through the world I did proclaim. Spenser. Flowers, in such sort worn, can neither be smelt nor seen well by those that wear them. Hooker. I'll deceive you in another sort. Shak. To Adam in what sort Shall I appear Milton. I shall not be wholly without praise, if in some sort I have copied his style. Dryden. 3. Condition above the vulgar; rank. [Obs.] Shak. 4. A chance group; a company of persons who happen to be together; a troop; also, an assemblage of animals. [Obs.] \"A sort of shepherds.\" Spenser. \"A sort of steers.\" Spenser. \"A sort of doves.\" Dryden. \"A sort of rogues.\" Massinger. A boy, a child, and we a sort of us, Vowed against his voyage. Chapman. 5. A pair; a set; a suit. Johnson. 6. pl. (Print.)  Letters, figures, points, marks, spaces, or quadrats, belonging to a case, separately considered. Out of sorts (Print.), with some letters or sorts of type deficient or exhausted in the case or font; hence, colloquially, out of order; ill; vexed; disturbed. -- To run upon sorts (Print.), to use or require a greater number of some particular letters, figures, or marks than the regular proportion, as, for example, in making an index. Syn. -- Kind; species; rank; condition. -- Sort, Kind. Kind originally denoted things of the same family, or bound together by some natural affinity; and hence, a class. Sort signifies that which constitutes a particular lot of parcel, not implying necessarily the idea of affinity, but of mere assemblage. the two words are now used to a great extent interchangeably, though sort (perhaps from its original meaning of lot) sometimes carries with it a slight tone of disparagement or contempt, as when we say, that sort of people, that sort of language. As when the total kind Of birds, in orderly array on wing, Came summoned over Eden to receive Their names of there. Milton. None of noble sort Would so offend a virgin. Shak.\n\n1. To separate, and place in distinct classes or divisions, as things having different qualities; as, to sort cloths according to their colors; to sort wool or thread according to its fineness. Rays which differ in refrangibility may be parted and sorted from one another. Sir I. Newton. 2. To reduce to order from a confused state. Hooker. 3. To conjoin; to put together in distribution; to class. Shellfish have been, by some of the ancients, compared and sorted with insects. Bacon. She sorts things present with things past. Sir J. Davies. 4. To choose from a number; to select; to cull. That he may sort out a worthy spouse. Chapman. I'll sort some other time to visit you. Shak. 5. To conform; to adapt; to accommodate. [R.] I pray thee, sort thy heart to patience. Shak.\n\n1. To join or associate with others, esp. with others of the same kind or species; to agree. Nor do metals only sort and herd with metals in the earth, and minerals with minerals. Woodward. The illiberality of parents towards children makes them base, and sort with any company. Bacon. 2. To suit; to fit; to be in accord; to harmonize. They are happy whose natures sort with their vocations. Bacon. Things sort not to my will. herbert. I can not tell you precisely how they sorted. Sir W. Scott."}