{"word":"sound","definition":"The air bladder of a fish; as, cod sounds are an esteemed article of food.\n\nA cuttlefish. [Obs.] Ainsworth.\n\n1. Whole; unbroken; unharmed; free from flaw, defect, or decay; perfect of the kind; as, sound timber; sound fruit; a sound tooth; a sound ship. 2. Healthy; not diseased; not being in a morbid state; -- said of body or mind; as, a sound body; a sound constitution; a sound understanding. 3. Firm; strong; safe. The brasswork here, how rich it is in beams, And how, besides, it makes the whole house sound. Chapman. 4. Free from error; correct; right; honest; true; faithful; orthodox; -- said of persons; as, a sound lawyer; a sound thinker. Do not I know you a favorer Of this new seat Ye are nor sound. Shak. 5. Founded in truth or right; supported by justice; not to be overthrown on refuted; not fallacious; as, sound argument or reasoning; a sound objection; sound doctrine; sound principles. Hold fast the form of sound words, which thou hast heard of me. 2 Tim. i. 13. 6. heavy; laid on with force; as, a sound beating. 7. Undisturbed; deep; profound; as, sound sleep. 8. Founded in law; legal; valid; not defective; as, a sound title to land. Note: Sound is sometimes used in the formation of self-explaining compounds; as, sound-headed, sound-hearted, sound-timbered, etc. Sound currency (Com.), a currency whose actual value is the same as its nominal value; a currency which does not deteriorate or depreciate or fluctuate in comparision with the standard of values.\n\nSoundly. So sound he slept that naught might him awake. Spenser.\n\nA narrow passage of water, or a strait between the mainland and an island; also, a strait connecting two seas, or connecting a sea or lake with the ocean; as, the Sound between the Baltic and the german Ocean; Long Island Sound. The Sound of Denmark, where ships pay toll. Camden. Sound dues, tolls formerly imposed by Denmark on vessels passing through the Baltic Sound.\n\n1. To measure the depth of; to fathom; especially, to ascertain the depth of by means of a line and plummet. 2. Fig.: To ascertain, or try to ascertain, the thoughts, motives, and purposes of (a person); to examine; to try; to test; to probe. I was in jest, And by that offer meant to sound your breast. Dryden. I've sounded my Numidians man by man. Addison. 3. (Med.)  To explore, as the bladder or urethra, with a sound; to examine with a sound; also, to examine by auscultation or percussion; as, to sound a patient.\n\nTo ascertain the depth of water with a sounding line or other device. I sound as a shipman soundeth in the sea with his plummet to know the depth of sea. Palsgrave.\n\nAny elongated instrument or probe, usually metallic, by which cavities of the body are sounded or explored, especially the bladder for stone, or the urethra for a stricture.\n\n1. The peceived object occasioned by the impulse or vibration of a material substance affecting the ear; a sensation or perception of the mind received through the ear, and produced by the impulse or vibration of the air or other medium with which the ear is in contact; the effect of an impression made on the organs of hearing by an impulse or vibration of the air caused by a collision of bodies, or by other means; noise; report; as, the sound of a drum; the sound of the human voice; a horrid sound; a charming sound; a sharp, high, or shrill sound. The warlike sound Of trumpets loud and clarions. Milton. 2. The occasion of sound; the impulse or vibration which would occasion sound to a percipient if present with unimpaired; hence, the theory of vibrations in elastic media such cause sound; as, a treatise on sound. Note: In this sense, sounds are spoken of as audible and inaudible. 3. Noise without signification; empty noise; noise and nothing else. Sense and not sound . . . must be the principle. Locke. Sound boarding, boards for holding pugging, placed in partitions of under floors in order to deaden sounds. -- Sound bow, in a series of transverse sections of a bell, that segment against which the clapper strikes, being the part which is most efficacious in producing the sound. See Illust. of Bell. -- Sound post. (Mus.) See Sounding post, under Sounding.\n\n1. To make a noise; to utter a voice; to make an impulse of the air that shall strike the organs of hearing with a perceptible effect. \"And first taught speaking trumpets how to sound.\" Dryden. How silver-sweet sound lovers' tongues! Shak. 2. To be conveyed in sound; to be spread or published; to convey intelligence by sound. From you sounded out the word of the Lord. 1 Thess. i. 8. 3. To make or convey a certain impression, or to have a certain import, when heard; hence, to seem; to appear; as, this reproof sounds harsh; the story sounds like an invention. Good sir, why do you start, and seem to fear Things that do sound so fair Shak. To sound in or into, to tend to; to partake of the nature of; to be consonant with. [Obs., except in the phrase To sound in damages, below.] Soun[d]ing in moral virtue was his speech. Chaucer. -- To sound in damages (Law), to have the essential quality of damages. This is said of an action brought, not for the recovery of a specific thing, as replevin, etc., but for damages only, as trespass, and the like.\n\n1. To causse to make a noise; to play on; as, to sound a trumpet or a horn. A bagpipe well could he play and soun[d]. Chaucer. 2. To cause to exit as a sound; as, to sound a note with the voice, or on an instrument. 3. To order, direct, indicate, or proclain by a sound, or sounds; to give a signal for by a certain sound; as, to sound a retreat; to sound a parley. The clock sounded the hour of noon. G. H. Lewes. 4. To celebrate or honor by sounds; to cause to be reported; to publish or proclaim; as, to sound the praises of fame of a great man or a great exploit. 5. To examine the condition of (anything) by causing the same to emit sounds and noting their character; as, to sound a piece of timber; to sound a vase; to sound the lungs of a patient. 6. To signify; to import; to denote. [Obs.] Milton. Soun[d]ing alway the increase of his winning. Chaucer."}