{"word":"spanish","definition":"Of or pertaining to Spain or the Spaniards. Spanish bayonet (Bot.), a liliaceous plant (Yucca alorifolia) with rigid spine-tipped leaves. The name is also applied to other similar plants of the Southwestern United States and mexico. Called also Spanish daggers. -- Spanish bean (Bot.) See the Note under Bean. -- Spanish black, a black pigment obtained by charring cork. Ure. -- Spanish broom (Bot.), a leguminous shrub (Spartium junceum) having many green flexible rushlike twigs. -- Spanish brown, a species of earth used in painting, having a dark reddish brown color, due to the presence of sesquioxide of iron. -- Spanish buckeye (Bot.), a small tree (Ungnadia speciosa) of Texas, New Mexico, etc., related to the buckeye, but having pinnate leaves and a three-seeded fruit. -- Spanish burton (Naut.), a purchase composed of two single blocks. A double Spanish burton has one double and two single blocks. Luce (Textbook of Seamanship). -- Spanish chalk (Min.), a kind of steatite; -- so called because obtained from Aragon in Spain. -- Spanish cress (Bot.), a cruciferous plant (lepidium Cadamines), a species of peppergrass. -- Spanish curiew (Zoöl.), the long-billed curlew. [U.S.] -- Spanish daggers (Bot.) See Spanish bayonet. -- Spanish elm (Bot.), a large West Indian tree (Cordia Gerascanthus) furnishing hard and useful timber. -- Spanish feretto, a rich reddish brown pigment obtained by calcining copper and sulphur together in closed crucibles. -- Spanish flag (Zoöl.), the California rockfish (Sebastichthys rubrivinctus). It is conspicuously colored with bands of red and white. -- Spanish fly (Zoöl.), a brilliant green beetle, common in the south of Europe, used for raising blisters. See Blister beetle under Blister, and Cantharis. -- Spanish fox (Naut.), a yarn twisted against its lay. -- Spanish grass. (Bot.) See Esparto. -- Spanish juice (Bot.), licorice. -- Spanish leather. See Cordwain. -- Spanish mackerel. (Zoöl.) (a) A species of mackerel (Scomber colias) found both in Europe and America. In America called chub mackerel, big-eyed mackerel, and bull mackerel. (b) In the United States, a handsome mackerel having bright yellow round spots (Scomberomorus maculatus), highly esteemed as a food fish. The name is sometimes erroneously applied to other species. See Illust. under Mackerel. -- Spanish main, the name formerly given to the southern portion of the Caribbean Sea, together with the contiguous coast, embracing the route traversed by Spanish treasure ships from the New to the Old World. -- Spanish moss. (Bot.) See Tillandsia. -- Spanish needles (Bot.), a composite weed (Bidens bipinnata) having achenia armed with needlelike awns. -- Spanish nut (Bot.), a bulbous plant (Iris Sisyrinchium) of the south of Europe. -- Spanish potato (Bot.), the sweet potato. See under Potato. -- Spanish red, an ocherous red pigment resembling Venetian red, but slightly yellower and warmer. Fairholt. -- Spanish reef (Naut.), a knot tied in the head of a jib-headed sail. -- Spanish sheep (Zoöl.), a merino. -- Spanish white, an impalpable powder prepared from chalk by pulverizing and repeated washings, -- used as a white pigment. -- Spanish windlass (Naut.), a wooden roller, with a rope wound about it, into which a marline spike is thrust to serve as a lever.\n\nThe language of Spain."}