{"word":"spare","definition":"1. To use frugally or stintingly, as that which is scarce or valuable; to retain or keep unused; to save. \"No cost would he spare.\" Chaucer. [Thou] thy Father's dreadful thunder didst not spare. Milton. He that hath knowledge, spareth his words. Prov. xvii. 27. 2. To keep to one's self; to forbear to impart or give. Be pleased your plitics to spare. Dryden. Spare my sight the pain Of seeing what a world of tears it costs you. Dryden. 3. To preserve from danger or punishment; to forbear to punish, injure, or harm; to show mercy to. Spare us, good Lord. Book of Common Prayer. Dim sadness did not spare That time celestial visages. Milton. Man alone can whom he conquers spare. Waller. 4. To save or gain, as by frugality; to reserve, as from some occupation, use, or duty. All the time he could spare from the necessary cares of his weighty charge, he Knolles. 5. To deprive one's self of, as by being frugal; to do without; to dispense with; to give up; to part with. Where angry Jove did never spare One breath of kind and temperate air. Roscommon. I could have better spared a better man. Shak. To spare one's self. (a) To act with reserve. [Obs.] Her thought that a lady should her spare. Chaucer. (b) To save one's self labor, punishment, or blame.\n\n1. To be frugal; not to be profuse; to live frugally; to be parsimonious. I, who at some times spend, at others spare, Divided between carelessness and care. Pope. 2. To refrain from inflicting harm; to use mercy or forbearance. He will not spare in the day of vengeance. Prov. vi. 34. 3. To desist; to stop; to refrain. [Obs.] Chaucer.\n\n1. Scanty; not abundant or plentiful; as, a spare diet. 2. Sparing; frugal; parsimonious; chary. He was spare, but discreet of speech. Carew. 3. Being over and above what is necessary, or what must be used or reserved; not wanted, or not used; superfluous; as, I have no spare time. If that no spare clothes he had to give. Spenser. 4. Held in reserve, to be used in an emergency; as, a spare anchor; a spare bed or room. 5. Lean; wanting flesh; meager; thin; gaunt. O, give me the spare men, and spare me the great ones. Shak. 6. Slow. [Obs. or prov. Eng.] Grose.\n\n1. The act of sparing; moderation; restraint. [Obs.] Killing for sacrifice, without any spare. Holland. 2. Parsimony; frugal use. [Obs.] Bacon. Poured out their plenty without spite or spare. Spenser. 3. An opening in a petticoat or gown; a placket. [Obs.] 4. That which has not been used or expended. 5. (Tenpins)  The right of bowling again at a full set of pins, after having knocked all the pins down in less than three bowls. If all the pins are knocked down in one bowl it is a double spare; in two bowls, a single spare."}