{"word":"specific","definition":"1. Of or pertaining to a species; characterizing or constituting a species; possessing the peculiar property or properties of a thing which constitute its species, and distinguish it from other things; as, the specific form of an animal or a plant; the specific qualities of a drug; the specific distinction between virtue and vice. Specific difference is that primary attribute which distinguishes each species from one another. I. Watts. 2. Specifying; definite, or making definite; limited; precise; discriminating; as, a specific statement. 3. (Med.)  Exerting a peculiar influence over any part of the body; preventing or curing disease by a peculiar adaption, and not on general principles; as, quinine is a specific medicine in cases of malaria. In fact, all medicines will be found specific in the perfection of the science. Coleridge. Specific character (Nat. Hist.), a characteristic or characteristics distinguishing one species from every other species of the same genus. -- Specific disease (Med.) (a) A disease which produces a determinate definite effect upon the blood and tissues or upon some special tissue. (b) A disease which is itself uniformly produced by a definite and peculiar poison or organism. -- Specific duty. (Com.) See under Duty. -- Specific gravity. (Physics) See under Gravity. -- Specific heat (Physics), the quantity of heat required to raise temperature of a body one degree, taking as the unit of measure the quantity required to raise the same weight of water from zero to one degree; thus, the specific heat of mercury is 0.033, that of water being 1.000. -- Specific inductive capacity (Physics), the effect of a dielectric body in producing static electric induction as compared with that of some other body or bodies referred to as a standard. -- Specific legacy (Law), a bequest of a particular thing, as of a particular animal or piece of furniture, specified and distinguished from all others. Wharton. Burrill. -- Specific name (Nat., Hist.), the name which, appended to the name of the genus, constitutes the distinctive name of the species; -- originally applied by Linnæus to the essential character of the species, or the essential difference. The present specific name he at first called the trivial name. -- Specific performance (Law), the peformance of a contract or agreement as decreed by a court of equity.\n\n1. (Med.)  A specific remedy. See Specific, a., 3. His parents were weak enough to believe that the royal touch was a specific for this malady. Macaulay. 2. Anything having peculiar adaption to the purpose to which it is applied. Dr. H. More."}