{"word":"spell","definition":"A spelk, or splinter. [Obs.] Holland.\n\nTo supply the place of for a time; to take the turn of, at work; to relieve; as, to spell the helmsman.\n\n1. The relief of one person by another in any piece of work or wathing; also, a turn at work which is carried on by one person or gang relieving another; as, a spellat the pumps; a spell at the masthead. A spell at the wheel isc called a trick. Ham. Nav. Encyc. 2. The time during which one person or gang works until relieved; hence, any relatively short period of time, whether a few hours, days, or weeks. Nothing new hass happened in this quarter, except the setting in of a severe spell of cold weather. Washington. 3. One of two or more persons or gangs who work by spells. [R.] Their toil is so extreme that they can not endure it above four hours in a day, but are succeeded by spells. Garew. 4. A gratuitous helping forward of another's work; as, a logging spell. [Local, U.S.]\n\n1. A story; a tale. [Obs.] \"Hearken to my spell.\" Chaucer. 2. A stanza, verse, or phrase supposed to be endowed with magical power; an incantation; hence, any charm. Start not; her actions shall be holy as You hear my spell is lawful. Shak.\n\n1. To tell; to relate; to teach. [Obs.] Might I that legend find, By fairies spelt in mystic rhymes. T. Warton. 2. To put under the influence of a spell; to affect by a spell; to bewitch; to fascinate; to charm. \"Spelled with words of power.\" Dryden. He was much spelled with Eleanor Talbot. Sir G. Buck. 3. To constitute; to measure. [Obs.] The Saxon heptarchy, when seven kings put together did spell but one in effect. Fuller. 4. To tell or name in their proper order letters of, as a word; to write or print in order the letters of, esp. the proper letters; to form, as words, by correct orthography. The word \"satire\" ought to be spelled with i, and not with y. Dryden. 5. To discover by characters or marks; to read with difficulty; -- usually with out; as, to spell out the sense of an author; to spell out a verse in the Bible. To spell out a God in the works of creation. South. To sit spelling and observing divine justice upon every accident. Milton.\n\n1. To form words with letters, esp. with the proper letters, either orally or in writing. When what small knowledge was, in them did dwell, And he a god, who could but read or spell. Dryden. 2. To study by noting characters; to gain knowledge or learn the meaning of anything, by study. [Obs.] Where I may sit and rightly spell Of every star that heaven doth shew, And every herb that sips the dew. Milton."}