{"word":"spider","definition":"1. (Zoöl.)  Any one of numerous species of arachnids comprising the order Araneina. Spiders have the mandibles converted into poison fangs, or falcers. The abdomen is large and not segmented, with two or three pairs of spinnerets near the end, by means of which they spin threads of silk to form cocoons, or nests, to protect their eggs and young. Many species spin also complex webs to entrap the insects upon which they prey. The eyes are usually eight in number (rarely six), and are situated on the back of the cephalothorax. See Illust. under Araneina. Note: Spiders are divided into two principal groups: the Dipneumona, having two lungs: and the Tetrapneumona, having four lungs. See Mygale. The former group includes several tribes; as, the jumping spiders (see Saltigradæ), the wolf spiders, or Citigradæ (see under Wolf), the crab spiders, or Laterigradæ (see under Crab), the garden, or geometric, spiders, or Orbitellæ (see under Geometrical, and Garden), and others. See Bird spider, under Bird, Grass spider, under Grass, House spider, under House, Silk spider, under Silk. 2. (Zoöl.)  Any one of various other arachnids resembling the true spiders, especially certain mites, as the red spider (see under Red). 3. An iron pan with a long handle, used as a kitchen utensil in frying food. Originally, it had long legs, and was used over coals on the hearth. 4. A trevet to support pans or pots over a fire. 5. (Mach.)  A skeleton, or frame, having radiating arms or members, often connected by crosspieces; as, a casting forming the hub and spokes to which the rim of a fly wheel or large gear is bolted; the body of a piston head; a frame for strengthening a core or mold for a casting, etc. Spider ant. (Zoöl.) Same as Solitary ant, under Solitary. -- Spider crab (Zoöl.), any one of numerous species of maioid crabs having a more or less triangular body and ten long legs. Some of the species grow to great size, as the great Japanese spider crab (Macrocheira Kempferi), measuring sometimes more than fifteen feet across the legs when they are extended. -- Spider fly (Zoöl.), any one of numerous species of parasitic dipterous insects of the family Hippoboscidæ. They are mostly destitute of wings, and live among the feathers of birds and the hair of bats. Called also bird tick, and bat tick. -- Spider hunter (Zoöl.), any one of several species of East Indian sunbirds of the genus Arachnothera. -- Spider lines, filaments of a spider's web crossing the field of vision in optical instruments; -- used for determining the exact position of objects and making delicate measurements. Fine wires, silk fibers, or lines on glass similarly placed, are called spider lines. -- Spider mite. (Zoöl.) (a) Any one of several species of parasitic mites of the genus Argas and allied genera. See Argas. (b) Any one of numerous small mites injurious to plants. -- Spider monkey (Zoöl.), any one of numerous species of South American monkeys of the genus Ateles, having very long legs and a long prehensile tail. -- Spider orchis (Bot.), a European orchidaceous plant (Ophrys aranifera), having flowers which resemble spiders. -- Spider shell (Zoöl.), any shell of the genus Pteroceras. See Pteroceras."}