{"word":"spin","definition":"1. To draw out, and twist into threads, either by the hand or machinery; as, to spin wool, cotton, or flax; to spin goat's hair; to produce by drawing out and twisting a fibrous material. All the yarn she [Penelope] spun in Ulysses' absence did but fill Ithaca full of moths. Shak. 2. To draw out tediously; to form by a slow process, or by degrees; to extend to a great length; -- with out; as, to spin out large volumes on a subject. Do you mean that story is tediously spun out Sheridan. 3. To protract; to spend by delays; as, to spin out the day in idleness. By one delay after another they spin out their whole lives. L'Estrange. 4. To cause to turn round rapidly; to whirl; to twirl; as, to spin a top. 5. To form (a web, a cocoon, silk, or the like) from threads produced by the extrusion of a viscid, transparent liquid, which hardens on coming into contact with the air; -- said of the spider, the silkworm, etc. 6. (Mech.)  To shape, as malleable sheet metal, into a hollow form, by bending or buckling it by pressing against it with a smooth hand tool or roller while the metal revolves, as in a lathe. To spin a yarn (Naut.), to tell a story, esp. a long or fabulous tale. -- To spin hay (Mil.), to twist it into ropes for convenient carriage on an expedition. -- To spin street yarn, to gad about gossiping. [Collog.]\n\n1. To practice spinning; to work at drawing and twisting threads; to make yarn or thread from fiber; as, the woman knows how to spin; a machine or jenny spins with great exactness. They neither know to spin, nor care to toll. Prior. 2. To move round rapidly; to whirl; to revolve, as a top or a spindle, about its axis. Round about him spun the landscape, Sky and forest reeled together. Longfellow. With a whirligig of jubilant mosquitoes spinning about each head. G. W. Cable. 3. To stream or issue in a thread or a small current or jet; as, blood spinsfrom a vein. Shak. 4. To move swifty; as, to spin along the road in a carriage, on a bicycle, etc. [Colloq.]\n\n1. The act of spinning; as, the spin of a top; a spin a bicycle. [Colloq.] 2. (Kinematics)  Velocity of rotation about some specified axis. go for a spin take a spin, take a trip in a wheeled vehicle, usu. an automobile."}