{"word":"spirit","definition":"1. Air set in motion by breathing; breath; hence, sometimes, life itself. [Obs.] \"All of spirit would deprive.\" Spenser. The mild air, with season moderate, Gently attempered, and disposed eo well, That still it breathed foorth sweet spirit. Spenser. 2. A rough breathing; an aspirate, as the letter h; also, a mark to denote aspiration; a breathing. [Obs.] Be it a letter or spirit, we have great use for it. B. Jonson. 3. Life, or living substance, considered independently of corporeal existence; an intelligence conceived of apart from any physical organization or embodiment; vital essence, force, or energy, as distinct from matter. 4. The intelligent, immaterial and immortal part of man; the soul, in distinction from the body in which it resides; the agent or subject of vital and spiritual functions, whether spiritual or material. There is a spirit in man; and the inspiration of the Almighty giveth them understanding. Job xxxii. 8. As the body without the spirit is dead, so faith without works is dead also. James ii. 26. Spirit is a substance wherein thinking, knowing, doubting, and a power of moving, do subsist. Locke. 5. Specifically, a disembodied soul; the human soul after it has left the body. Then shall the dust return to the earth as it was, and the spirit shall return unto God who gave it. Eccl. xii. 7. Ye gentle spirits far away, With whom we shared the cup of grace. Keble. 6. Any supernatural being, good or bad; an apparition; a specter; a ghost; also, sometimes, a sprite,; a fairy; an elf. Whilst young, preserve his tender mind from all impressions of spirits and goblins in the dark. Locke. 7. Energy, vivacity, ardor, enthusiasm, courage, etc. \"Write it then, quickly,\" replied Bede; and summoning all his spirits together, like the last blaze of a candle going out, he indited it, and expired. Fuller. 8. One who is vivacious or lively; one who evinces great activity or peculiar characteristics of mind or temper; as, a ruling spirit; a schismatic spirit. Such spirits as he desired to please, such would I choose for my judges. Dryden. 9. Temper or disposition of mind; mental condition or disposition; intellectual or moral state; -- often in the plural; as, to be cheerful, or in good spirits; to be downhearted, or in bad spirits. God has . . . made a spirit of building succeed a spirit of pulling down. South. A perfect judge will read each work of wit With the same spirit that its author writ. Pope. 10. Intent; real meaning; -- opposed to the letter, or to formal statement; also, characteristic quality, especially such as is derived from the individual genius or the personal character; as, the spirit of an enterprise, of a document, or the like. 11. Tenuous, volatile, airy, or vapory substance, possessed of active qualities. All bodies have spirits . . . within them. Bacon. 12. Any liquid produced by distillation; especially, alcohol, the spirits, or spirit, of wine (it having been first distilled from wine): -- often in the plural. 13. pl.  Rum, whisky, brandy, gin, and other distilled liquors having much alcohol, in distinction from wine and malt liquors. 14. (Med.)  A solution in alcohol of a volatile principle. Cf. Tincture. U. S. Disp. 15. (Alchemy)  Any one of the four substances, sulphur, sal ammoniac, quicksilver, or arsenic (or, according to some, orpiment). The four spirits and the bodies seven. Chaucer. 16. (Dyeing)  Stannic chloride. See under Stannic. Note: Spirit is sometimes joined with other words, forming compounds, generally of obvious signification; as, spirit-moving, spirit- searching, spirit-stirring, etc. Astral spirits, Familiar spirits, etc. See under Astral, Familiar, etc. -- Animal spirits. (a) (Physiol.) The fluid which at one time was supposed to circulate through the nerves and was regarded as the agent of sensation and motion; -- called also the nervous fluid, or nervous principle. (b) Physical health and energy; frolicsomeness; sportiveness. -- Ardent spirits, strong alcoholic liquors, as brandy, rum, whisky, etc., obtained by distillation. -- Holy Spirit, or The Spirit (Theol.), the Spirit of God, or the third person of the Trinity; the Holy Ghost. The spirit also signifies the human spirit as influenced or animated by the Divine Spirit. -- Proof spirit. (Chem.) See under Proof. -- Rectified spirit (Chem.), spirit rendered purer or more concentrated by redistillation, so as to increase the percentage of absolute alcohol. -- Spirit butterfly (Zoöl.), any one of numerous species of delicate butterflies of tropical America belonging to the genus Ithomia. The wings are gauzy and nearly destitute of scales. -- Spirit duck. (Zoöl.) (a) The buffle-headed duck. (b) The golden- eye. -- Spirit lamp (Art), a lamp in which alcohol or methylated spirit is burned. -- Spirit level. See under Level. -- Spirit of hartshorn. (Old Chem.) See under Hartshorn. -- Spirit of Mindererus (Med.), an aqueous solution of acetate of ammonium; -- named after R. Minderer, physician of Augsburg. -- Spirit of nitrous ether (Med. Chem.), a pale yellow liquid, of a sweetish taste and a pleasant ethereal odor. It is obtained by the distillatin of alcohol with nitric and sulphuric acids, and consists essentially of ethyl nitrite with a little acetic aldehyde. It is used a diaphoretic, diuretic, antispasmodic, etc. Called also sweet spirit of niter. -- Spirit of salt (Chem.), hydrochloric acid; -- so called because obtained from salt and sulphuric acid. [Obs.] -- Spirit of sense, the utmost refinement of sensation. [Obs.] Shak. -- Spirits, or Spirit, of turpentine (Chem.), rectified oil of turpentine, a transparent, colorless, volatile, and very inflammable liquid, distilled from the turpentine of the various species of pine; camphine. See Camphine. -- Spirit of vitriol (Chem.), sulphuric acid; -- so called because formerly obtained by the distillation of green vitriol. [Obs.] -- Spirit of vitriolic ether (Chem.) ether; -- often but incorrectly called sulphuric ether. See Ether. [Obs.] -- Spirits, or Spirit, of wine (Chem.), alcohol; -- so called because formerly obtained by the distillation of wine. -- Spirit rapper, one who practices spirit rapping; a \"medium\" so called. -- Spirit rapping, an alleged form of communication with the spirits of the dead by raps. See Spiritualism, 3. -- Sweet spirit of niter. See Spirit of nitrous ether, above. Syn. -- Life; ardor; energy; fire; courage; animatioon; cheerfulness; vivacity; enterprise.\n\n1. To animate with vigor; to excite; to encourage; to inspirit; as, civil dissensions often spirit the ambition of private men; -- sometimes followed by up. Many officers and private men spirit up and assist those obstinate people to continue in their rebellion. Swift . 2. To convey rapidly and secretly, or mysteriously, as if by the agency of a spirit; to kidnap; -- often with away, or off. The ministry had him spirited away, and carried abroad as a dangerous person. Arbuthnot & Pope. I felt as if I had been spirited into some castle of antiquity. Willis. Spiriting away (Law), causing to leave; the offense of inducing a witness to leave a jurisdiction so as to evade process requiring attendance at trial."}