{"word":"spoil","definition":"1. To plunder; to strip by violence; to pillage; to rob; -- with of before the name of the thing taken; as, to spoil one of his goods or possession. \"Ye shall spoil the Egyptians.\" Ex. iii. 22. My sons their old, unhappy sire despise, Spoiled of his kingdom, and deprived of eues. Pope. 2. To seize by violence;; to take by force; to plunder. No man can enter into a strong man's house, and spoil his goods, except he will first bind the strong man. Mark iii. 27. 3. To cause to decay and perish; to corrput; to vitiate; to mar. Spiritual pride spils many graces. Jer. Taylor. 4. To render useless by injury; to injure fatally; to ruin; to destroy; as, to spoil paper; to have the crops spoiled by insects; to spoil the eyes by reading.\n\n1. To practice plunder or robbery. Outlaws, which, lurking in woods, used to break forth to rob and spoil. Spenser. 2. To lose the valuable qualities; to be corrupted; to decay; as, fruit will soon spoil in warm weather.\n\n1. That which is taken from another by violence; especially, the plunder taken from an enemy; pillage; booty. Gentle gales, Fanning their odoriferous wings, dispense Native perfumes, and whisper whence they stole Those balmy spoils. Milton. 2. Public offices and their emoluments regarded as the peculiar property of a successful party or faction, to be bestowed for its own advantage; -- commonly in the plural; as to the victor belong the spoils. From a principle of gratitude I adhered to the coalition; my vote was counted in the day of battle, but I was overlooked in the division of the spoil. Gibbon. 3. That which is gained by strength or effort. each science and each art his spoil. Bentley. 4. The act or practice of plundering; robbery; aste. The man that hath no music in himself, Nor is not moved with concord of sweet sounds, Is fit for treason, stratagems, and spoil. Shak. 5. Corruption; cause of corruption. [Archaic] Villainous company hath been the spoil of me. Shak. 6. The slough, or cast skin, of a serpent or other animal. [Obs.] Bacon. Spoil bank, a bank formed by the earth taken from an excavation, as of a canal. -- The spoils system, the theory or practice of regarding public and their emoluments as so much plunder to be distributed among their active partisans by those who are chosen to responsible offices of administration."}