{"word":"squirrel","definition":"1. (Zoöl.)  Any one of numerous species of small rodents belonging to the genus Sciurus and several allied genera of the famly Sciuridæ. Squirrels generally have a bushy tail, large erect ears, and strong hind legs. They are commonly arboreal in their habits, but many species live in burrows. Note: Among the common North American squirrels are the gray squirrel (Scirius Carolinensis) and its black variety; the fox, or cat, sqirrel (S. cinereus, or S. niger) which is a large species, and variable in color, the southern variety being frequently black, while the northern and western varieties are usually gray or rusty brown; the red squirrel (see Chickaree); the striped, or chipping, squirrel (see Chipmunk); and the California gray squirrel (S. fossor). Several other species inhabit Mexico and Central America. The common European species (Sciurus vulgaris) has a long tuft of hair on each ear. the so-called Australian squirrels are marsupials. See Petaurist, and Phalanger. 2. One of the small rollers of a carding machine which work with the large cylinder. Barking squirrel (Zoöl.), the prairie dog. -- Federation squirrel (Zoöl.), the striped gopher. See Gopher, 2. -- Flying squirrel (Zoöl.). See Flying squirrel, in the Vocabulary. -- Java squirrel (Zoöl.). See Jelerang. -- Squirrel corn (Bot.), a North American herb (Dicantra Canadensis) bearing little yellow tubers. -- Squirrel cup (Bot.), the blossom of the Hepatica triloba, a low perennial herb with cup-shaped flowers varying from purplish blue to pink or even white. It is one of the earliest flowers of spring. -- Squirrel fish (Zoöl.) (a) A sea bass (Serranus fascicularis) of the Southern United States. (b) The sailor's choice (Diplodus rhomboides). (c) The redmouth, or grunt. (d) A market fish of Bermuda (Holocentrum Ascensione). -- Squirrel grass (Bot.), a pestiferous grass (Hordeum murinum) related to barley. In California the stiffly awned spiklets work into the wool of sheep, and into the throat, flesh, and eyes of animals, sometimes even producing death. -- Squirrel hake (Zoöl.), a common American hake (Phycis tenuis); -- called also white hake. -- Squirrel hawk (Zoöl.), any rough-legged hawk; especially, the California species Archibuteo ferrugineus. -- Squirrel monkey. (Zoöl.) (a) Any one of several species of small, soft-haired South American monkeys of the genus Calithrix. They are noted for their graceful form and agility. See Teetee. (b) A marmoset. -- Squirrel petaurus (Zoöl.), a flying phalanger of Australia. See Phalanger, Petaurist, and Flying phalanger under Flying. -- Squirrel shrew (Zoöl.), any one of several species of East Indian and Asiatic insectivores of the genus Tupaia. They are allied to the shrews, but have a bushy tail, like that of a squirrel. -- Squirrel-tail grass (Bot.), a grass (Hordeum jubatum) found in salt marshes and along the Great Lakes, having a dense spike beset with long awns."}