{"word":"stage","definition":"1. A floor or story of a house. [Obs.] Wyclif. 2. An elevated platform on which an orator may speak, a play be performed, an exhibition be presented, or the like. 3. A floor elevated for the convenience of mechanical work, or the like; a scaffold; a staging. 4. A platform, often floating, serving as a kind of wharf. 5. The floor for scenic performances; hence, the theater; the playhouse; hence, also, the profession of representing dramatic compositions; the drama, as acted or exhibited. Knights, squires, and steeds, must enter on the stage. Pope. Lo! Where the stage, the poor, degraded stage, Holds its warped mirror to a gaping age. C. Sprague. 6. A place where anything is publicly exhibited; the scene of any noted action or carrer; the spot where any remarkable affair occurs. When we are born, we cry that we are come To this stage of fools. Shak. Music and ethereal mirth Wherewith the stage of air and earth did ring. Miton. 7. The platform of a microscope, upon which an object is placed to be viewed. See Illust. of Microscope. 8. A place of rest on a regularly traveled road; a stage house; a station; a place appointed for a relay of horses. 9. A degree of advancement in a journey; one of several portions into which a road or course is marked off; the distance between two places of rest on a road; as, a stage of ten miles. A stage . . . signifies a certain distance on a road. Jeffrey. He traveled by gig, with his wife, his favorite horse performing the journey by easy stages. Smiles. 10. A degree of advancement in any pursuit, or of progress toward an end or result. Such a polity is suited only to a particular stage in the progress of society. Macaulay. 11. A large vehicle running from station to station for the accomodation of the public; a stagecoach; an omnibus. \"A parcel sent you by the stage.\" Cowper. I went in the sixpenny stage. Swift. 12. (Biol.)  One of several marked phases or periods in the development and growth of many animals and plants; as, the larval stage; pupa stage; zoea stage. Stage box, a box close to the stage in a theater. -- Stage carriage, a stagecoach. -- Stage door, the actor's and workmen's entrance to a theater. -- Stage lights, the lights by which the stage in a theater is illuminated. -- Stage micrometer, a graduated device applied to the stage of a microscope for measuring the size of an object. -- Stage wagon, a wagon which runs between two places for conveying passengers or goods. -- Stage whisper, a loud whisper, as by an actor in a theater, supposed, for dramatic effect, to be unheard by one or more of his fellow actors, yet audible to the audience; an aside. stage of the game, [Colloq.] stage n. 10.\n\nTo exhibit upon a stage, or as upon a stage; to display publicly. Shak."}