{"word":"stalk","definition":"1. (Bot.) (a) The stem or main axis of a plant; as, a stalk of wheat, rye, or oats; the stalks of maize or hemp. (b) The petiole, pedicel, or peduncle, of a plant. 2. That which resembes the stalk of a plant, as the stem of a quill. Grew. 3. (Arch.)  An ornament in the Corinthian capital resembling the stalk of a plant, from which the volutes and helices spring. 4. One of the two upright pieces of a ladder. [Obs.] To climd by the rungs and the stalks. Chaucer. 5. (Zoöl.) (a) A stem or peduncle, as of certain barnacles and crinoids. (b) The narrow basal portion of the abdomen of a hymenopterous insect. (c) The peduncle of the eyes of decapod crustaceans. 6. (Founding)  An iron bar with projections inserted in a core to strengthen it; a core arbor. Stalk borer (Zoöl.), the larva of a noctuid moth (Gortyna nitela), which bores in the stalks of the raspberry, strawberry, tomato, asters, and many other garden plants, often doing much injury.\n\n1. To walk slowly and cautiously; to walk in a stealthy, noiseless manner; -- sometimes used with a reflexive pronoun. Shak. Into the chamber he stalked him full still. Chaucer. [Bertran] stalks close behind her, like a witch's fiend, Pressing to be employed. Dryden. 2. To walk behind something as a screen, for the purpose of approaching game; to proceed under clover. The king . . . crept under the shoulder of his led horse; . . . \"I must stalk,\" said he. Bacon. One underneath his horse, to get a shoot doth stalk. Drayton. 3. To walk with high and proud steps; usually implying the affectation of dignity, and indicating dislike. The word is used, however, especially by the poets, to express dignity of step. With manly mien he stalked along the ground. Dryden. Then stalking through the deep, He fords the ocean. Addison. I forbear myself from entering the lists in which he has long stalked alone and unchallenged. Mericale.\n\nTo approach under cover of a screen, or by stealth, for the purpose of killing, as game. As for shooting a man from behind a wall, it is cruelly like to stalking a deer. Sir W. Scott.\n\nA high, proud, stately step or walk. Thus twice before, . . . With martial stalk hath he gone by our watch. Shak. The which with monstrous stalk behind him stepped. Spenser."}