{"word":"stall","definition":"1. A stand; a station; a fixed spot; hence, the stand or place where a horse or an ox kept and fed; the division of a stable, or the compartment, for one horse, ox, or other animal. \"In an oxes stall.\" Chaucer. 2. A stable; a place for cattle. At last he found a stall where oxen stood. Dryden. 3. A small apartment or shed in which merchandise is exposed for sale; as, a butcher's stall; a bookstall. 4. A bench or table on which small articles of merchandise are exposed for sale. How peddlers' stalls with glittering toys are laid. Gay. 5. A seat in the choir of a church, for one of the officiating clergy. It is inclosed, either wholly or partially, at the back and sides. The stalls are frequently very rich, with canopies and elaborate carving. The dignifird clergy, out of humanility, have called their thrones by the names of stalls. Bp. Warburton. Loud the monks in their stalls. Longfellow. 6. In the theater, a seat with arms or otherwise partly inclosed, as distinguished from the benches, sofas, etc. 7. (Mining)  The space left by excavation between pillars. See Post and stall, under Post. Stall reader, one who reads books at a stall where they are exposed for sale. Cries the stall reader, \"Bless us! what a word on A titlepage is this!\" Milton.\n\n1. To put into a stall or stable; to keep in a stall or stalls; as, to stall an ox. Where King Latinus then his oxen stalled. Dryden. 2. To fatten; as, to stall cattle. [Prov. Eng.] 3. To place in an office with the customary formalities; to install. Shak. 4. To plunge into mire or snow so as not to be able to get on; to set; to fix; as, to stall a cart. Burton. His horses had been stalled in the snow. E. E. Hale. 5. To forestall; to anticipitate. Having This not to be stall'd by my report. Massinger. 6. To keep close; to keep secret. [Obs.] Stall this in your bosom. Shak.\n\n1. To live in, or as in, a stall; to dwell. [Obs.] We could not stall together In the whole world. Shak. 2. To kennel, as dogs. Johnson. 3. To be set, as in mire or snow; to stick fast. 4. To be tired of eating, as cattle. [Prov. Eng.]"}