{"word":"stamp","definition":"1. To strike beat, or press forcibly with the bottom of the foot, or by thrusting the foot downward. Shak. He frets, he fumes, he stares, he stamps the ground. Dryden. 2. To bring down (the foot) forcibly on the ground or floor; as, he stamped his foot with rage. 3. To crush; to pulverize; specifically (Metal.), to crush by the blow of a heavy stamp, as ore in a mill. I took your sin, the calf which ye had made, and burnt it with fire, and stamped it, and ground it very small. Deut. ix. 21. 4. To impress with some mark or figure; as, to stamp a plate with arms or initials. 5. Fig.: To impress; to imprint; to fix deeply; as, to stamp virtuous principles on the heart. God . . . has stamped no original characters on our minds wherein we may read his being. Locke. 6. To cut out, bend, or indent, as paper, sheet metal, etc., into various forms, by a blow or suddenly applied pressure with a stamp or die, etc.; to mint; to coin. 7. To put a stamp on, as for postage; as, to stamp a letter; to stamp a legal document. To stamp out, to put an end to by sudden and energetic action; to extinguish; as, to stamp out a rebellion.\n\n1. To strike; to beat; to crush. These cooks how they stamp and strain and grind. Chaucer. 2. To strike the foot forcibly downward. But starts, exclaims, and stamps, and raves, and dies. dennis.\n\n1. The act of stamping, as with the foot. 2. The which stamps; any instrument for making impressions on other bodies, as a die. 'T is gold so pure It can not bear the stamp without alloy. Dryden. 3. The mark made by stamping; a mark imprinted; an impression. That sacred name gives ornament and grace, And, like his stamp, makes basest metals pass. Dryden. 4. that which is marked; a thing stamped. hanging a golden stamp about their necks. Shak. 5. Etym: [F. estampe, of german origin. See Stamp, v. t.]  A picture cut in wood or metal, or made by impression; a cut; a plate. [Obs.] At Venice they put out very curious stamps of the several edifices which are most famous for their beauty and magnificence. Addison. 6. An offical mark set upon things chargeable with a duty or tax to government, as evidence that the duty or tax is paid; as, the stamp on a bill of exchange. 7. Hence, a stamped or printed device, issued by the government at a fixed price, and required by law to be affixed to, or stamped on, certain papers, as evidence that the government dues are paid; as, a postage stamp; a receipt stamp, etc. 8. An instrument for cutting out, or shaping, materials, as paper, leather, etc., by a downward pressure. 9. A character or reputation, good or bad, fixed on anything as if by an imprinted mark; current value; authority; as, these persons have the stamp of dishonesty; the Scriptures bear the stamp of a divine origin. Of the same stamp is that which is obtruded on us, that an adamant suspends the attraction of the loadstone. Sir T. Browne. 10. Make; cast; form; character; as, a man of the same stamp, or of a different stamp. A soldier of this season's stamp. Shak. 11. A kind of heavy hammer, or pestle, raised by water or steam power, for beating ores to powder; anything like a pestle, used for pounding or bathing. 12. A half-penny. [Obs.] au. & Fl. 13. pl.  Money, esp. paper money. [Slang, U.S.] Stamp act, an act of the British Parliament [1765] imposing a duty on all paper, vellum, and parchment used in the American colonies, and declaring all writings on unstamped materials to be null an void. -- Stamp collector, an officer who receives or collects stamp duties; one who collects postage or other stamps. -- Stamp duty, a duty, or tax, imposed on paper and parchment used for certain writings, as deeds, conveyances, etc., the evidence of the payment of the duty or tax being a stamp. [Eng.] -- Stamp hammer, a hammer, worked by power, which rises and falls vertically, like a stamp in a stamp mill. -- Stamp head, a heavy mass of metal, forming the head or lower end of a bar, which is lifted and let fall, in a stamp mill. -- Stamp mill (Mining), a mill in which ore is crushed with stamps; also, a machine for stamping ore. -- Stamp note, a stamped certificate from a customhouse officer, which allows goods to be received by the captain of a ship as freight. [Eng.] -- Stamp office, an office for the issue of stamps and the reception of stamp duties."}