{"word":"stand","definition":"1. To be at rest in an erect position; to be fixed in an upright or firm position; as: (a) To be supported on the feet, in an erect or nearly erect position; -- opposed to lie, sit, kneel, etc. \"I pray you all, stand up!\" Shak. (b) To continue upright in a certain locality, as a tree fixed by the roots, or a building resting on its foundation. It stands as it were to the ground yglued. Chaucer. The ruined wall Stands when its wind worn battlements are gone. Byron. 2. To occupy or hold a place; to have a situation; to be situated or located; as, Paris stands on the Seine. Wite ye not where there stands a little town Chaucer. 3. To cease from progress; not to proceed; to stop; to pause; to halt; to remain stationary. I charge thee, stand, And tell thy name. Dryden. The star, which they saw in the east, went before them, till it came and stood over where the young child was. Matt. ii. 9. 4. To remain without ruin or injury; to hold good against tendencies to impair or injure; to be permanent; to endure; to last; hence, to find endurance, strength, or resources. My mind on its own center stands unmoved. Dryden. 5. To maintain one's ground; to be acquitted; not to fail or yield; to be safe. Readers by whose judgment I would stand or fall. Spectator. 6. To maintain an invincible or permanent attitude; to be fixed, steady, or firm; to take a position in resistance or opposition. \"The standing pattern of their imitation.\" South. The king granted the Jews . . . to gather themselves together, and to stand for their life. Esther viii. 11. 7. To adhere to fixed principles; to maintain moral rectitude; to keep from falling into error or vice. We must labor so as to stand with godliness, according to his appointment. Latimer. 8. To have or maintain a position, order, or rank; to be in a particular relation; as, Christian charity, or love, stands first in the rank of gifts. 9. To be in some particular state; to have essence or being; to be; to consist. \"Sacrifices . . . which stood only in meats and drinks.\" Heb. ix. 10. Accomplish what your signs foreshow; I stand resigned, and am prepared to go. Dryden. Thou seest how it stands with me, and that I may not tarry. Sir W. Scott. 10. To be consistent; to agree; to accord. Doubt me not; by heaven, I will do nothing But what may stand with honor. Massinger. 11. (Naut.)  To hold a course at sea; as, to stand from the shore; to stand for the harbor. From the same parts of heaven his navy stands. Dryden. 12. To offer one's self, or to be offered, as a candidate. He stood to be elected one of the proctors of the university. Walton. 13. To stagnate; not to flow; to be motionless. Or the black water of Pomptina stands. Dryden. 14. To measure when erect on the feet. Six feet two, as I think, he stands. Tennyson. 15. (Law) (a) To be or remain as it is; to continue in force; to have efficacy or validity; to abide. Bouvier. (b) To appear in court. Burrill. Stand by (Naut.), a preparatory order, equivalent to Be ready. -- To stand against, to opposite; to resist. -- To stand by. (a) To be near; to be a spectator; to be present. (b) To be aside; to be aside with disregard. \"In the interim [we] let the commands stand by neglected.\" Dr. H. More. (c) To maintain; to defend; to support; not to desert; as, to stand by one's principles or party. (d) To rest on for support; to be supported by. Whitgift. -- To stand corrected, to be set right, as after an error in a statement of fact. Wycherley. -- To stand fast, to be fixed; to be unshaken or immovable. -- To stand firmly on, to be satisfied or convinced of. \"Though Page be a secure fool, and stands so firmly on his wife's frailty.\" Shak. -- To stand for. (a) To side with; to espouse the cause of; to support; to maintain, or to profess or attempt to maintain; to defend. \"I stand wholly for you.\" Shak. (b) To be in the place of; to be the substitute or to represent; as, a cipher at the left hand of a figure stands for nothing. \"I will not trouble myself, whether these names stand for the same thing, or really include one another.\" Locke. -- To stand in, to cost. \"The same standeth them in much less cost.\" Robynson (More's Utopia). The Punic wars could not have stood the human race in less than three millions of the species. Burke. -- To stand in hand, to conduce to one's interest; to be serviceable or advantageous. -- To stand off. (a) To keep at a distance. (b) Not to comply. (c) To keep at a distance in friendship, social intercourse, or acquaintance. (d) To appear prominent; to have relief. \"Picture is best when it standeth off, as if it were carved.\" Sir H. Wotton. -- To stand off and on (Naut.), to remain near a coast by sailing toward land and then from it. -- To stand on (Naut.), to continue on the same tack or course. -- To stand out. (a) To project; to be prominent. \"Their eyes stand out with fatness.\" Psalm lxxiii. 7. (b) To persist in opposition or resistance; not to yield or comply; not to give way or recede. His spirit is come in, That so stood out against the holy church. Shak. -- To stand to. (a) To ply; to urge; to persevere in using. \"Stand to your tackles, mates, and stretch your oars.\" Dryden. (b) To remain fixed in a purpose or opinion. \"I will stand to it, that this is his sense.\" Bp. Stillingfleet. (c) To abide by; to adhere to; as to a contrast, assertion, promise, etc.; as, to stand to an award; to stand to one's word. (d) Not to yield; not to fly; to maintain, as one's ground. \"Their lives and fortunes were put in safety, whether they stood to it or ran away.\" Bacon. (e) To be consistent with; to agree with; as, it stands to reason that he could not have done so. (f) To support; to uphold. \"Stand to me in this cause.\" Shak. -- To stand together, to be consistent; to agree. -- To stand to sea (Naut.), to direct the course from land. -- To stand under, to undergo; to withstand. Shak. -- To stand up. (a) To rise from sitting; to be on the feet. (b) To arise in order to speak or act. \"Against whom, when the accusers stood up, they brought none accusation of such things as I supposed.\" Acts xxv. 18. (c) To rise and stand on end, as the hair. (d) To put one's self in opposition; to contend. \"Once we stood up about the corn.\" Shak. -- To stand up for, to defend; to justify; to support, or attempt to support; as, to stand up for the administration. -- To stand upon. (a) To concern; to interest. (b) To value; to esteem. \"We highly esteem and stand much upon our birth.\" Ray. (c) To insist on; to attach much importance to; as, to stand upon security; to stand upon ceremony. (d) To attack; to assault. [A Hebraism] \"So I stood upon him, and slew him.\" 2 Sam. i. 10. -- To stand with, to be consistent with. \"It stands with reason that they should be rewarded liberally.\" Sir J. Davies.\n\n1. To endure; to sustain; to bear; as, I can not stand the cold or the heat. 2. To resist, without yielding or receding; to withstand. \"Love stood the siege.\" Dryden. He stood the furious foe. Pope. 3. To abide by; to submit to; to suffer. Bid him disband his legions, . . . And stand the judgment of a Roman senate. Addison. 4. To set upright; to cause to stand; as, to stand a book on the shelf; to stand a man on his feet. 5. To be at the expense of; to pay for; as, to stand a treat. [Colloq.] Tackeray. To stand fire, to receive the fire of arms from an enemy without giving way. -- To stand one's ground, to keep the ground or station one has taken; to maintain one's position. \"Pleasants and burghers, however brave, are unable to stand their ground against veteran soldiers.\" Macaulay. -- To stand trial, to sustain the trial or examination of a cause; not to give up without trial.\n\n1. The act of standing. I took my stand upon an eminence . . . to look into thier several ladings. Spectator. 2. A halt or stop for the purpose of defense, resistance, or opposition; as, to come to, or to make, a stand. Vice is at stand, and at the highest flow. Dryden. 3. A place or post where one stands; a place where one may stand while observing or waiting for something. I have found you out a stand most fit, Where you may have such vantage on the duke, He shall not pass you. Shak. 4. A station in a city or town where carriages or wagons stand for hire; as, a cab stand. Dickens. 5. A raised platform or station where a race or other outdoor spectacle may be viewed; as, the judge's or the grand stand at a race course. 6. A small table; also, something on or in which anything may be laid, hung, or placed upright; as, a hat stand; an umbrella stand; a music stand. 7. A place where a witness stands to testify in court. 8. The situation of a shop, store, hotel, etc.; as, a good, bad, or convenient stand for business. [U. S.] 9. Rank; post; station; standing. Father, since your fortune did attain So high a stand, I mean not to descend. Daniel. 10. A state of perplexity or embarrassment; as, to be at a stand what to do. L'Estrange. 11. A young tree, usually reserved when other trees are cut; also, a tree growing or standing upon its own root, in distinction from one produced from a scion set in a stock, either of the same or another kind of tree. 12. (Com.)  A weight of from two hundred and fifty to three hundred pounds, -- used in weighing pitch. Microscope stand, the instrument, excepting the eyepiece, objective, and other removable optical parts. -- Stand of ammunition, the projectile, cartridge, and sabot connected together. -- Stand of arms. (Mil.) See under Arms. -- Stand of colors (Mil.), a single color, or flag. Wilhelm (Mil. Dict.) -- To be at a stand, to be stationary or motionless; to be at a standstill; hence, to be perplexed; to be embarrassed. -- To make a stand, to halt for the purpose of offering resistance to a pursuing enemy. Syn. -- Stop; halt; rest; interruption; obstruction; perplexity; difficulty; embarrassment; hesitation."}