{"word":"standing","definition":"1. Remaining erect; not cut down; as, standing corn. 2. Not flowing; stagnant; as, standing water. 3. Not transitory; not liable to fade or vanish; lasting; as, a standing color. 4. Established by law, custom, or the like; settled; continually existing; permanent; not temporary; as, a standing army; legislative bodies have standing rules of proceeding and standing committees. 5. Not movable; fixed; as, a standing bed (distinguished from a trundle-bed). Standing army. See Standing army, under Army. -- Standing bolt. See Stud bolt, under Stud, a stem. -- Standing committee, in legislative bodies, etc., a committee appointed for the consideration of all subjects of a particular class which shall arise during the session or a stated period. -- Standing cup, a tall goblet, with a foot and a cover. -- Standing finish (Arch.), that part of the interior fittings, esp. of a dwelling house, which is permanent and fixed in its place, as distinguished from doors, sashes, etc. -- Standing order (Eccl.), the denomination (Congregiational) established by law; -- a term formerly used in Connecticut. See also under Order. -- Standing part. (Naut.) (a) That part of a tackle which is made fast to a block, point, or other object. (b) That part of a rope around which turns are taken with the running part in making a knot of the like. -- Standing rigging (Naut.), the cordage or rope which sustain the masts and remain fixed in their position, as the shrouds and stays, - - distinguished from running rigging.\n\n1. The act of stopping, or coming to a stand; the state of being erect upon the feet; stand. 2. Maintenance of position; duration; duration or existence in the same place or condition; continuance; as, a custom of long standing; an officer of long standing. An ancient thing of long standing. Bunyan. 3. Place to stand in; station; stand. I will provide you a good standing to see his entry. Bacon. I think in deep mire, where there is no standing. Ps. lxix. 2. 4. Condition in society; relative position; reputation; rank; as, a man of good standing, or of high standing. Standing off (Naut.), sailing from the land. -- Standing on (Naut.), sailing toward land."}