{"word":"staple","definition":"1. A settled mart; an emporium; a city or town to which merchants brought commodities for sale or exportation in bulk; a place for wholesale traffic. The customs of Alexandria were very great, it having been the staple of the Indian trade. Arbuthnot. For the increase of trade and the encouragement of the worthy burgesses of Woodstock, her majesty was minded to erect the town into a staple for wool. Sir W. Scott. Note: In England, formerly, the king's staple was established in certain ports or towns, and certain goods could not be exported without being first brought to these places to be rated and charged with the duty payable of the king or the public. The principal commodities on which customs were lived were wool, skins, and leather; and these were originally the staple commodities. 2. Hence: Place of supply; source; fountain head. Whitehall naturally became the chief staple of news. Whenever there was a rumor that any thing important had happened or was about to happen, people hastened thither to obtain intelligence from the fountain head. Macaulay. 3. The principal commodity of traffic in a market; a principal commodity or production of a country or district; as, wheat, maize, and cotton are great staples of the United States. We should now say, Cotton is the great staple, that is, the established merchandize, of Manchester. Trench. 4. The principal constituent in anything; chief item. 5. Unmanufactured material; raw material. 6. The fiber of wool, cotton, flax, or the like; as, a coarse staple; a fine staple; a long or short staple. 7. A loop of iron, or a bar or wire, bent and formed with two points to be driven into wood, to hold a hook, pin, or the like. 8. (Mining) (a) A shaft, smaller and shorter than the principal one, joining different levels. (b) A small pit. 9. A district granted to an abbey. [Obs.] Camden.\n\n1. Pertaining to, or being market of staple for, commodities; as, a staple town. [R.] 2. Established in commerce; occupying the markets; settled; as, a staple trade. Dryden. 3. Fit to be sold; marketable. [R.] Swift. 4. Regularly produced or manufactured in large quantities; belonging to wholesale traffic; principal; chief. Wool, the great staple commodity of England. H\n\nTo sort according to its staple; as, to staple cotton."}