{"word":"start","definition":"1. To leap; to jump. [Obs.] 2. To move suddenly, as with a spring or leap, from surprise, pain, or other sudden feeling or emotion, or by a voluntary act. And maketh him out of his sleep to start. Chaucer. I start as from some dreadful dream. Dryden. Keep your soul to the work when ready to start aside. I. Watts. But if he start, It is the flesh of a corrupted heart. Shak. 3. To set out; to commence a course, as a race or journey; to begin; as, to start business. At once they start, advancing in a line. Dryden. At intervals some bird from out the brakes Starts into voice a moment, then is still. Byron. 4. To become somewhat displaced or loosened; as, a rivet or a seam may start under strain or pressure. To start after, to set out after; to follow; to pursue. -- To start against, to act as a rival candidate against. -- To start for, to be a candidate for, as an office. -- To start up, to rise suddenly, as from a seat or couch; to come suddenly into notice or importance.\n\n1. To cause to move suddenly; to disturb suddenly; to startle; to alarm; to rouse; to cause to flee or fly; as, the hounds started a fox. Upon malicious bravery dost thou come To start my quiet Shak. Brutus will start a spirit as soon as Cæsar. Shak. 2. To bring onto being or into view; to originate; to invent. Sensual men agree in the pursuit of every pleasure they can start. Sir W. Temple. 3. To cause to move or act; to set going, running, or flowing; as, to start a railway train; to start a mill; to start a stream of water; to start a rumor; to start a business. I was engaged in conversation upon a subject which the people love to start in discourse. Addison. 4. To move suddenly from its place or position; to displace or loosen; to dislocate; as, to start a bone; the storm started the bolts in the vessel. One, by a fall in wrestling, started the end of the clavicle from the sternum. Wiseman. 5. Etym: [Perh. from D. storten, which has this meaning also.] (Naut.)  To pour out; to empty; to tap and begin drawing from; as, to start a water cask.\n\n1. The act of starting; a sudden spring, leap, or motion, caused by surprise, fear, pain, or the like; any sudden motion, or beginning of motion. The fright awakened Arcite with a start. Dryden. 2. A convulsive motion, twitch, or spasm; a spasmodic effort. For she did speak in starts distractedly. Shak. Nature does nothing by starts and leaps, or in a hurry. L'Estrange. 3. A sudden, unexpected movement; a sudden and capricious impulse; a sally; as, starts of fancy. To check the starts and sallies of the soul. Addison. 4. The beginning, as of a journey or a course of action; first motion from a place; act of setting out; the outset; -- opposed to finish. The start of first performance is all. Bacon. I see you stand like greyhounds in the slips, Straining upon the start. Shak. At a start, at once; in an instant. [Obs.] At a start he was betwixt them two. Chaucer. To get, or have, the start, to before another; to gain or have the advantage in a similar undertaking; -- usually with of. \"Get the start of the majestic world.\" Shak. \"She might have forsaken him if he had not got the start of her.\" Dryden.\n\n1. A tail, or anything projecting like a tail. 2. The handle, or tail, of a plow; also, any long handle. [Prov. Eng.] 3. The curved or inclined front and bottom of a water-wheel bucket. 4. (Mining)  The arm, or level, of a gin, drawn around by a horse."}