{"word":"statute","definition":"1. An act of the legislature of a state or country, declaring, commanding, or prohibiting something; a positive law; the written will of the legislature expressed with all the requisite forms of legislation; -- used in distinction fraom common law. See Common law, under Common, a. Bouvier. Note: Statute is commonly applied to the acts of a legislative body consisting of representatives. In monarchies, legislature laws of the sovereign are called edicts, decrees, ordinances, rescripts, etc. In works on international law and in the Roman law, the term is used as embracing all laws imposed by competent authority. Statutes in this sense are divided into statutes real, statutes personal, and statutes mixed; statutes real applying to immovables; statutes personal to movables; and statutes mixed to both classes of property. 2. An act of a corporation or of its founder, intended as a permanent rule or law; as, the statutes of a university. 3. An assemblage of farming servants (held possibly by statute) for the purpose of being hired; -- called also statute fair. [Eng.] Cf. 3d Mop, 2. Halliwell. Statute book, a record of laws or legislative acts. Blackstone. -- Statute cap, a kind of woolen cap; -- so called because enjoined to be worn by a statute, dated in 1571, in behalf of the trade of cappers. [Obs.] Halliwell. -- Statute fair. See Statute, n., 3, above. -- Statute labor, a definite amount of labor required for the public service in making roads, bridges, etc., as in certain English colonies. -- Statute merchant (Eng. Law), a bond of record pursuant to the stat. 13 Edw. I., acknowledged in form prescribed, on which, if not paid at the day, an execution might be awarded against the body, lands, and goods of the debtor, and the obligee might hold the lands until out of the rents and profits of them the debt was satisfied; -- called also a pocket judgment. It is now fallen into disuse. Tomlins. Bouvier. -- Statute mile. See under Mile. -- Statute of limitations (Law), a statute assigned a certain time, after which rights can not be enforced by action. -- Statute staple, a bond of record acknowledged before the mayor of the staple, by virtue of which the creditor may, on nonpayment, forthwith have execution against the body, lands, and goods of the debtor, as in the statute merchant. It is now disused. Blackstone. Syn. -- Act; regulation; edict; decree. See Law."}