{"word":"step","definition":"1. To move the foot in walking; to advance or recede by raising and moving one of the feet to another resting place, or by moving both feet in succession. 2. To walk; to go on foot; esp., to walk a little distance; as, to step to one of the neighbors. 3. To walk slowly, gravely, or resolutely. Home the swain retreats, His flock before him stepping to the fold. Thomson. 4. Fig.: To move mentally; to go in imagination. They are stepping almost three thousand years back into the remotest antiquity. Pope. To step aside, to walk a little distance from the rest; to retire from company. -- To step forth, to move or come forth. -- To step in or into. (a) To walk or advance into a place or state, or to advance suddenly in. Whosoever then first, after the troubling of the water, stepped in, was made whole of whatsoever disease he had. John v. 4. (b) To enter for a short time; as, I just stepped into the house. (c) To obtain possession without trouble; to enter upon easily or suddenly; as, to step into an estate. -- To step out. (a) (Mil.) To increase the length, but not the rapidity, of the step, extending it to thirty-tree inches. (b) To go out for a short distance or a short time. -- To step short (Mil.), to diminish the length or rapidity of the step according to the established rules.\n\n1. To set, as the foot. 2. (Naut.)  To fix the foot of (a mast) in its step; to erect. To step off, to measure by steps, or paces; hence, to divide, as a space, or to form a series of marks, by successive measurements, as with dividers.\n\n1. An advance or movement made by one removal of the foot; a pace. 2. A rest, or one of a set of rests, for the foot in ascending or descending, as a stair, or a round of a ladder. The breadth of every single step or stair should be never less than one foot. Sir H. Wotton. 3. The space passed over by one movement of the foot in walking or running; as, one step is generally about three feet, but may be more or less. Used also figuratively of any kind of progress; as, he improved step by step, or by steps. To derive two or three general principles of motion from phenomena, and afterwards to tell us how the properties and actions of all corporeal things follow from those manifest principles, would be a very great step in philosophy. Sir I. Newton. 4. A small space or distance; as, it is but a step. 5. A print of the foot; a footstep; a footprint; track. 6. Gait; manner of walking; as, the approach of a man is often known by his step. 7. Proceeding; measure; action; an act. The reputation of a man depends on the first steps he makes in the world. Pope. Beware of desperate steps. The darkest day, Live till to-morrow, will have passed away. Cowper. I have lately taken steps . . . to relieve the old gentleman's distresses. G. W. Cable. 8. pl.  Walk; passage. Conduct my steps to find the fatal tree. Dryden. 9. pl.  A portable framework of stairs, much used indoors in reaching to a high position. 10. (Naut.)  In general, a framing in wood or iron which is intended to receive an upright shaft; specif., a block of wood, or a solid platform upon the keelson, supporting the heel of the mast. 11. (Mach.) (a) One of a series of offsets, or parts, resembling the steps of stairs, as one of the series of parts of a cone pulley on which the belt runs. (b) A bearing in which the lower extremity of a spindle or a vertical shaft revolves. 12. (Mus.)  The intervak between two contiguous degrees of the csale. Note: The word tone is often used as the name of this interval; but there is evident incongruity in using tone for indicating the interval between tones. As the word scale is derived from the Italian scala, a ladder, the intervals may well be called steps. 13. (Kinematics)  A change of position effected by a motion of translation. W. K. Clifford. Back step, Half step, etc. See under Back, Half, etc. -- Step grate, a form of grate for holding fuel, in which the bars rise above one another in the manner of steps. -- To take steps, to take action; to move in a matter."}