{"word":"stone","definition":"1. Concreted earthy or mineral matter; also, any particular mass of such matter; as, a house built of stone; the boy threw a stone; pebbles are rounded stones. \"Dumb as a stone.\" Chaucer. They had brick for stone, and slime . . . for mortar. Gen. xi. 3. Note: In popular language, very large masses of stone are called rocks; small masses are called stones; and the finer kinds, gravel, or sand, or grains of sand. Stone is much and widely used in the construction of buildings of all kinds, for walls, fences, piers, abutments, arches, monuments, sculpture, and the like. 2. A precious stone; a gem. \"Many a rich stone.\" Chaucer. \"Inestimable stones, unvalued jewels.\" Shak. 3. Something made of stone. Specifically: - (a) The glass of a mirror; a mirror. [Obs.] Lend me a looking-glass; If that her breath will mist or stain the stone, Why, then she lives. Shak. (b) A monument to the dead; a gravestone. Gray. Should some relenting eye Glance on the where our cold relics lie. Pope. 4. (Med.)  A calculous concretion, especially one in the kidneys or bladder; the disease arising from a calculus. 5. One of the testes; a testicle. Shak. 6. (Bot.)  The hard endocarp of drupes; as, the stone of a cherry or peach. See Illust. of Endocarp. 7. A weight which legally is fourteen pounds, but in practice varies with the article weighed. [Eng.] Note: The stone of butchers' meat or fish is reckoned at 8 lbs.; of cheese, 16 lbs.; of hemp, 32 lbs.; of glass, 5 lbs. 8. Fig.: Symbol of hardness and insensibility; torpidness; insensibility; as, a heart of stone. I have not yet forgot myself to stone. Pope. 9. (Print.)  A stand or table with a smooth, flat top of stone, commonly marble, on which to arrange the pages of a book, newspaper, etc., before printing; -- called also imposing stone. Note: Stone is used adjectively or in composition with other words to denote made of stone, containing a stone or stones, employed on stone, or, more generally, of or pertaining to stone or stones; as, stone fruit, or stone-fruit; stone-hammer, or stone hammer; stone falcon, or stone-falcon. Compounded with some adjectives it denotes a degree of the quality expressed by the adjective equal to that possessed by a stone; as, stone-dead, stone-blind, stone-cold, stone- still, etc. Atlantic stone, ivory. [Obs.] \"Citron tables, or Atlantic stone.\" Milton. -- Bowing stone. Same as Cromlech. Encyc. Brit. -- Meteoric stones, stones which fall from the atmosphere, as after the explosion of a meteor. -- Philosopher's stone. See under Philosopher. -- Rocking stone. See Rocking-stone. -- Stone age, a supposed prehistoric age of the world when stone and bone were habitually used as the materials for weapons and tools; -- called also flint age. The bronze age succeeded to this. -- Stone bass (Zoöl.), any one of several species of marine food fishes of the genus Serranus and allied genera, as Serranus Couchii, and Polyprion cernium of Europe; -- called also sea perch. -- Stone biter (Zoöl.), the wolf fish. -- Stone boiling, a method of boiling water or milk by dropping hot stones into it, -- in use among savages. Tylor. -- Stone borer (Zoöl.), any animal that bores stones; especially, one of certain bivalve mollusks which burrow in limestone. See Lithodomus, and Saxicava. -- Stone bramble (Bot.), a European trailing species of bramble (Rubus saxatilis). -- Stone-break. Etym: [Cf. G. steinbrech.] (Bot.) Any plant of the genus Saxifraga; saxifrage. -- Stone bruise, a sore spot on the bottom of the foot, from a bruise by a stone. -- Stone canal. (Zoöl.) Same as Sand canal, under Sand. -- Stone cat (Zoöl.), any one of several species of small fresh- water North American catfishes of the genus Noturus. They have sharp pectoral spines with which they inflict painful wounds. -- Stone coal, hard coal; mineral coal; anthracite coal. -- Stone coral (Zoöl.), any hard calcareous coral. -- Stone crab. (Zoöl.) (a) A large crab (Menippe mercenaria) found on the southern coast of the United States and much used as food. (b) A European spider crab (Lithodes maia). Stone crawfish (Zoöl.), a European crawfish (Astacus torrentium), by many writers considered only a variety of the common species (A. fluviatilis). -- Stone curlew. (Zoöl.) (a) A large plover found in Europe (Edicnemus crepitans). It frequents stony places. Called also thick- kneed plover or bustard, and thick-knee. (b) The whimbrel. [Prov. Eng.] (c) The willet. [Local, U.S.] -- Stone crush. Same as Stone bruise, above. -- Stone eater. (Zoöl.) Same as Stone borer, above. -- Stone falcon (Zoöl.), the merlin. -- Stone fern (Bot.), a European fern (Asplenium Ceterach) which grows on rocks and walls. -- Stone fly (Zoöl.), any one of many species of pseudoneuropterous insects of the genus Perla and allied genera; a perlid. They are often used by anglers for bait. The larvæ are aquatic. -- Stone fruit (Bot.), any fruit with a stony endocarp; a drupe, as a peach, plum, or cherry. -- Stone grig (Zoöl.), the mud lamprey, or pride. -- Stone hammer, a hammer formed with a face at one end, and a thick, blunt edge, parallel with the handle, at the other, -- used for breaking stone. -- Stone hawk (Zoöl.), the merlin; -- so called from its habit of sitting on bare stones. -- Stone jar, a jar made of stoneware. -- Stone lily (Paleon.), a fossil crinoid. -- Stone lugger. (Zoöl.) See Stone roller, below. -- Stone marten (Zoöl.), a European marten (Mustela foina) allied to the pine marten, but having a white throat; -- called also beech marten. -- Stone mason, a mason who works or builds in stone. -- Stone-mortar (Mil.), a kind of large mortar formerly used in sieges for throwing a mass of small stones short distances. -- Stone oil, rock oil, petroleum. -- Stone parsley (Bot.), an umbelliferous plant (Seseli Labanotis). See under Parsley. -- Stone pine. (Bot.) A nut pine. See the Note under Pine, and Piñon. -- Stone pit, a quarry where stones are dug. -- Stone pitch, hard, inspissated pitch. -- Stone plover. (Zoöl.) (a) The European stone curlew. (b) Any one of several species of Asiatic plovers of the genus Esacus; as, the large stone plover (E. recurvirostris). (c) The gray or black-bellied plover. [Prov. Eng.] (d) The ringed plover. (e) The bar-tailed godwit. [Prov. Eng.] Also applied to other species of limicoline birds. -- Stone roller. (Zoöl.) (a) An American fresh-water fish (Catostomus nigricans) of the Sucker family. Its color is yellowish olive, often with dark blotches. Called also stone lugger, stone toter, hog sucker, hog mullet. (b) A common American cyprinoid fish (Campostoma anomalum); -- called also stone lugger. -- Stone's cast, or Stone's throw, the distance to which a stone may be thrown by the hand. -- Stone snipe (Zoöl.), the greater yellowlegs, or tattler. [Local, U.S.] -- Stone toter. (Zoöl.) (a) See Stone roller (a), above. (b) A cyprinoid fish (Exoglossum maxillingua) found in the rivers from Virginia to New York. It has a three-lobed lower lip; -- called also cutlips. -- To leave no stone unturned, to do everything that can be done; to use all practicable means to effect an object.\n\n1. To pelt, beat, or kill with stones. And they stoned Stephen, calling upon God, and saying, Lord Jesus, receive my spirit. Acts vii. 59. 2. To make like stone; to harden. O perjured woman! thou dost stone my heart. Shak. 3. To free from stones; also, to remove the seeds of; as, to stone a field; to stone cherries; to stone raisins. 4. To wall or face with stones; to line or fortify with stones; as, to stone a well; to stone a cellar. 5. To rub, scour, or sharpen with a stone."}