{"word":"stoop","definition":"Originally, a covered porch with seats, at a house door; the Dutch stoep as introduced by the Dutch into New York. Afterward, an out-of-door flight of stairs of from seven to fourteen steps, with platform and parapets, leading to an entrance door some distance above the street; the French perron. Hence, any porch, platform, entrance stairway, or small veranda, at a house door. [U. S.]\n\nA vessel of liquor; a flagon. [Written also stoup.] Fetch me a stoop of liquor. Shak.\n\nA post fixed in the earth. [Prov. Eng.]\n\n1. To bend the upper part of the body downward and forward; to bend or lean forward; to incline forward in standing or walking; to assume habitually a bent position. 2. To yield; to submit; to bend, as by compulsion; to assume a position of humility or subjection. Mighty in her ships stood Carthage long, . . . Yet stooped to Rome, less wealthy, but more strong. Dryden. These are arts, my prince, In which your Zama does not stoop to Rome. Addison. 3. To descend from rank or dignity; to condescend. \"She stoops to conquer.\" Goldsmith. Where men of great wealth stoop to husbandry, it multiplieth riches exceedingly. Bacon. 4. To come down as a hawk does on its prey; to pounce; to souse; to swoop. The bird of Jove, stooped from his aëry tour, Two birds of gayest plume before him drove. Milton. 5. To sink when on the wing; to alight. And stoop with closing pinions from above. Dryden. Cowering low With blandishment, each bird stooped on his wing. Milton. Syn. -- To lean; yield; submit; condescend; descend; cower; shrink.\n\n1. To bend forward and downward; to bow down; as, to stoop the body. \"Have stooped my neck.\" Shak. 2. To cause to incline downward; to slant; as, to stoop a cask of liquor. 3. To cause to submit; to prostrate. [Obs.] Many of those whose states so tempt thine ears Are stooped by death; and many left alive. Chapman. 4. To degrade. [Obs.] Shak.\n\n1. The act of stooping, or bending the body forward; inclination forward; also, an habitual bend of the back and shoulders. 2. Descent, as from dignity or superiority; condescension; an act or position of humiliation. Can any loyal subject see With patience such a stoop from sovereignty Dryden. 3. The fall of a bird on its prey; a swoop. L'Estrange."}