{"word":"stop","definition":"1. To close, as an aperture, by filling or by obstructing; as, to stop the ears; hence, to stanch, as a wound. Shak. 2. To obstruct; to render impassable; as, to stop a way, road, or passage. 3. To arrest the progress of; to hinder; to impede; to shut in; as, to stop a traveler; to stop the course of a stream, or a flow of blood. 4. To hinder from acting or moving; to prevent the effect or efficiency of; to cause to cease; to repress; to restrain; to suppress; to interrupt; to suspend; as, to stop the execution of a decree, the progress of vice, the approaches of old age or infirmity. Whose disposition all the world well knows Will not be rubbed nor stopped. Shak. 5. (Mus.)  To regulate the sounds of, as musical strings, by pressing them against the finger board with the finger, or by shortening in any way the vibrating part. 6. To point, as a composition; to punctuate. [R.] If his sentences were properly stopped. Landor. 7. (Naut.)  To make fast; to stopper. Syn. -- To obstruct; hinder; impede; repress; suppress; restrain; discontinue; delay; interrupt. To stop off (Founding), to fill (a part of a mold) with sand, where a part of the cavity left by the pattern is not wanted for the casting. -- To stop the mouth. See under Mouth.\n\n1. To cease to go on; to halt, or stand still; to come to a stop. He bites his lip, and starts; Stops on a sudden, looks upon the ground; Then lays his finger on his temple: strait Springs out into fast gait; then stops again. Shak. 2. To cease from any motion, or course of action. Stop, while ye may, suspend your mad career! Cowper. 3. To spend a short time; to reside temporarily; to stay; to tarry; as, to stop with a friend. [Colloq.] By stopping at home till the money was gone. R. D. Blackmore. To stop over, to stop at a station beyond the time of the departure of the train on which one came, with the purpose of continuing one's journey on a subsequent train; to break one's journey. [Railroad Cant, U.S.] stopover\n\n1. The act of stopping, or the state of being stopped; hindrance of progress or of action; cessation; repression; interruption; check; obstruction. It is doubtful . . . whether it contributed anything to the stop of the infection. De Foe. Occult qualities put a stop to the improvement of natural philosophy. Sir I. Newton. It is a great step toward the mastery of our desires to give this stop to them. Locke. 2. That which stops, impedes, or obstructs; as obstacle; an impediment; an obstruction. A fatal stop traversed their headlong course. Daniel. So melancholy a prospect should inspire us with zeal to oppose some stop to the rising torrent. Rogers. 3. (Mach.)  A device, or piece, as a pin, block, pawl, etc., for arresting or limiting motion, or for determining the position to which another part shall be brought. 4. (Mus.) (a) The closing of an aperture in the air passage, or pressure of the finger upon the string, of an instrument of music, so as to modify the tone; hence, any contrivance by which the sounds of a musical instrument are regulated. The organ sound a time survives the stop. Daniel. (b) In the organ, one of the knobs or handles at each side of the organist, by which he can draw on or shut off any register or row of pipes; the register itself; as, the vox humana stop. 5. (Arch.)  A member, plain or molded, formed of a separate piece and fixed to a jamb, against which a door or window shuts. This takes the place, or answers the purpose, of a rebate. Also, a pin or block to prevent a drawer from sliding too far. 6. A point or mark in writing or printing intended to distinguish the sentences, parts of a sentence, or clauses; a mark of punctuation. See Punctuation. 7. (Opt.)  The diaphragm used in optical instruments to cut off the marginal portions of a beam of light passing through lenses. 8. (Zoöl.)  The depression in the face of a dog between the skull and the nasal bones. It is conspicuous in the bulldog, pug, and some other breeds. 9. (Phonetics)  Some part of the articulating organs, as the lips, or the tongue and palate, closed (a) so as to cut off the passage of breath or voice through the mouth and the nose (distinguished as a lip-stop, or a front-stop, etc., as in p, t, d, etc.), or (b) so as to obstruct, but not entirely cut off, the passage, as in l, n, etc.; also, any of the consonants so formed. H. Sweet. Stop bead (Arch.), the molding screwed to the inner side of a window frame, on the face of the pulley stile, completing the groove in which the inner sash is to slide. -- Stop motion (Mach.), an automatic device for arresting the motion of a machine, as when a certain operation is completed, or when an imperfection occurs in its performance or product, or in the material which is supplied to it, etc. -- Stop plank, one of a set of planks employed to form a sort of dam in some hydraulic works. -- Stop valve, a valve that can be closed or opened at will, as by hand, for preventing or regulating flow, as of a liquid in a pipe; -- in distinction from a valve which is operated by the action of the fluid it restrains. -- Stop watch, a watch the hands of which can be stopped in order to tell exactly the time that has passed, as in timing a race. See Independent seconds watch, under Independent, a. Syn. -- Cessation; check; obstruction; obstacle; hindrance; impediment; interruption."}