{"word":"store","definition":"1. That which is accumulated, or massed together; a source from which supplies may be drawn; hence, an abundance; a great quantity, or a great number. The ships are fraught with store of victuals. Bacon. With store of ladies, whose bright eyes Rain influence, and give the prize. Milton. 2. A place of deposit for goods, esp. for large quantities; a storehouse; a warehouse; a magazine. 3. Any place where goods are sold, whether by wholesale or retail; a shop. [U.S. & British Colonies] 4. pl.  Articles, especially of food, accumulated for some specific object; supplies, as of provisions, arms, ammunition, and the like; as, the stores of an army, of a ship, of a family. His swine, his horse, his stoor, and his poultry. Chaucer. In store, in a state of accumulation; in keeping; hence, in a state of readiness. \"I have better news in store for thee.\" Shak. -- Store clothes, clothing purchased at a shop or store; -- in distinction from that which is home-made. [Colloq. U.S.] -- Store pay, payment for goods or work in articles from a shop or store, instead of money. [U.S.] -- To set store by, to value greatly; to have a high appreciation of. -- To tell no store of, to make no account of; to consider of no importance. Syn. -- Fund; supply; abundance; plenty; accumulation; provision. -- Store, Shop. The English call the place where goods are sold (however large or splendid it may be) a shop, and confine the word store to its original meaning; viz., a warehouse, or place where goods are stored. In America the word store is applied to all places, except the smallest, where goods are sold. In some British colonies the word store is used as in the United States. In his needy shop a tortoise hung, An alligator stuffed, and other skins Of ill-shaped fishes; and about his shelves A beggarly account of empty boxes. Shak. Sulphurous and nitrous foam, . . . Concocted and adjusted, they reduced To blackest grain, and into store conveyed. Milton.\n\nAccumulated; hoarded. Bacon.\n\n1. To collect as a reserved supply; to accumulate; to lay away. Dora stored what little she could save. Tennyson. 2. To furnish; to supply; to replenish; esp., to stock or furnish against a future time. Her mind with thousand virtues stored. Prior. Wise Plato said the world with men was stored. Denham. Having stored a pond of four acres with carps, tench, and other fish. Sir M. Hale. 3. To deposit in a store, warehouse, or other building, for preservation; to warehouse; as, to store goods."}