{"word":"straight","definition":"A variant of Strait, a. [Obs. or R.] Egypt is a long country, but it is straight, that is to say, narrow. Sir J. Mandeville.\n\n1. Right, in a mathematical sense; passing from one point to another by the nearest course; direct; not deviating or crooked; as, a straight line or course; a straight piece of timber. And the crooked shall be made straight. Isa. xl. 4. There are many several sorts of crooked lines, but there is only one which is straight. Dryden. 2. (Bot.)  Approximately straight; not much curved; as, straight ribs are such as pass from the base of a leaf to the apex, with a small curve. 3. (Card Playing)  Composed of cards which constitute a regular sequence, as the ace, king, queen, jack, and ten-spot; as, a straight hand; a straight flush. 4. Conforming to justice and rectitude; not deviating from truth or fairness; upright; as, straight dealing. 5. Unmixed; undiluted; as, to take liquor straight. [Slang] 6. Making no exceptions or deviations in one's support of the organization and candidates of a political party; as, a straight Republican; a straight Democrat; also, containing the names of all the regularly nominated candidates of a party and no others; as, a straight ballot. [Political Cant, U.S.] Straight arch (Arch.), a form of arch in which the intrados is straight, but with its joints drawn radially, as in a common arch. -- A straight face, one giving no evidence of merriment or other emotion. -- A straight line. \"That which lies evenly between its extreme points.\" Euclid. \"The shortest line between two points.\" Chauvenet. \"A line which has the same direction through its whole length.\" Newcomb. -- Straight-way valve, a valve which, when opened widely, affords a straight passageway, as for water. walk the straight and narrow.\n\nIn a straight manner; directly; rightly; forthwith; immediately; as, the arrow went straight to the mark. \"Floating straight.\" Shak. I know thy generous temper well; Fling but the appearance of dishonor on it, It straight takes fire, and mounts into a blaze. Addison. Everything was going on straight. W. Black.\n\nA hand of five cards in consecutive order as to value; a sequence. When they are of one suit, it is calles straight flush.\n\nTo straighten. [R.] A Smith."}