{"word":"stream","definition":"1. A current water or other fluid; a liquid flowing continuously in a line or course, either on the earth, as a river, brook, etc., or from a vessel, reservoir, or fountain; specifically, any course of running water; as, many streams are blended in the Mississippi; gas and steam came from the earth in streams; a stream of molten lead from a furnace; a stream of lava from a volcano. 2. A beam or ray of light. \"Sun streams.\" Chaucer. 3. Anything issuing or moving with continued succession of parts; as, a stream of words; a stream of sand. \"The stream of beneficence.\" Atterbury. \"The stream of emigration.\" Macaulay. 4. A continued current or course; as, a stream of weather. \"The very stream of his life.\" Shak. 5. Current; drift; tendency; series of tending or moving causes; as, the stream of opinions or manners. Gulf stream. See under Gulf. -- Stream anchor, Stream cable. (Naut.) See under Anchor, and Cable. -- Stream ice, blocks of ice floating in a mass together in some definite direction. -- Stream tin, particles or masses of tin ore found in alluvial ground; -- so called because a stream of water is the principal agent used in separating the ore from the sand and gravel. -- Stream works (Cornish Mining), a place where an alluvial deposit of tin ore is worked. Ure. -- To float with the stream, figuratively, to drift with the current of opinion, custom, etc., so as not to oppose or check it. Syn. -- Current; flow; rush; tide; course. -- Stream, Current. These words are often properly interchangeable; but stream is the broader word, denoting a prevailing onward course. The stream of the Mississippi rolls steadily on to the Gulf of Mexico, but there are reflex currents in it which run for a while in a contrary direction.\n\n1. To issue or flow in a stream; to flow freely or in a current, as a fluid or whatever is likened to fluids; as, tears streamed from her eyes. Beneath those banks where rivers stream. Milton. 2. To pour out, or emit, a stream or streams. A thousand suns will stream on thee. Tennyson. 3. To issue in a stream of light; to radiate. 4. To extend; to stretch out with a wavy motion; to float in the wind; as, a flag streams in the wind.\n\nTo send forth in a current or stream; to cause to flow; to pour; as, his eyes streamed tears. It may so please that she at length will stream Some dew of grace into my withered heart. Spenser. 2. To mark with colors or embroidery in long tracts. The herald's mantle is streamed with gold. Bacon. 3. To unfurl. Shak. To stream the buoy. (Naut.) See under Buoy."}