{"word":"stretch","definition":"1. To reach out; to extend; to put forth. And stretch forth his neck long and small. Chaucer. I in conquest stretched mine arm. Shak. 2. To draw out to the full length; to cause to extend in a straight line; as, to stretch a cord or rope. 3. To cause to extend in breadth; to spread; to expand; as, to stretch cloth; to stretch the wings. 4. To make tense; to tighten; to distend forcibly. The ox hath therefore stretched his yoke in vain. Shak. 5. To draw or pull out to greater length; to strain; as, to stretch a tendon or muscle. Awake, my soul, stretch every nerve. Doddridge. 6. To exaggerate; to extend too far; as, to stretch the truth; to stretch one's credit. They take up, one day, the most violent and stretched prerogative. Burke.\n\n1. To be extended; to be drawn out in length or in breadth, or both; to spread; to reach; as, the iron road stretches across the continent; the lake stretches over fifty square miles. As far as stretcheth any ground. Gower. 2. To extend or spread one's self, or one's limbs; as, the lazy man yawns and stretches. 3. To be extended, or to bear extension, without breaking, as elastic or ductile substances. The inner membrane . . . because it would stretch and yield, remained umbroken. Boyle. 4. To strain the truth; to exaggerate; as, a man apt to stretch in his report of facts. [Obs. or Colloq.] 5. (Naut.)  To sail by the wind under press of canvas; as, the ship stretched to the eastward. Ham. Nav. Encyc. Stretch out, an order to rowers to extend themselves forward in dipping the oar.\n\n1. Act of stretching, or state of being stretched; reach; effort; struggle; strain; as, a stretch of the limbs; a stretch of the imagination. By stretch of arms the distant shore to gain. Dryden. Those put a lawful authority upon the stretch, to the abuse of yower, under the color of prerogative. L'Estrange. 2. A continuous line or surface; a continuous space of time; as, grassy stretches of land. A great stretch of cultivated country. W. Black. But all of them left me a week at a stretch. E. Eggleston. 3. The extent to which anything may be stretched. Quotations, in their utmost stretch, can signify no more than that Luther lay under severe agonies of mind. Atterbury. This is the utmost stretch that nature can. Granville. 4. (Naut.)  The reach or extent of a vessel's progress on one tack; a tack or board. 5. Course; direction; as, the stretch of seams of coal. To be on the stretch, to be obliged to use one's utmost powers. -- Home stretch. See under Home, a."}