{"word":"strip","definition":"1. To deprive; to bereave; to make destitute; to plunder; especially, to deprive of a covering; to skin; to peel; as, to strip a man of his possession, his rights, his privileges, his reputation; to strip one of his clothes; to strip a beast of his skin; to strip a tree of its bark. And strippen her out of her rude array. Chaucer. They stripped Joseph out of his coat. Gen. xxxvii. 23. Opinions which . . . no clergyman could have avowed without imminent risk of being stripped of his gown. Macaulay. 2. To divest of clothing; to uncover. Before the folk herself strippeth she. Chaucer. Strip your sword stark naked. Shak. 3. (Naut.)  To dismantle; as, to strip a ship of rigging, spars, etc. 4. (Agric.)  To pare off the surface of, as land, in strips. 5. To deprive of all milk; to milk dry; to draw the last milk from; hence, to milk with a peculiar movement of the hand on the teats at the last of a milking; as, to strip a cow. 6. To pass; to get clear of; to outstrip. [Obs.] When first they stripped the Malean promontory. Chapman. Before he reached it he was out of breath, And then the other stripped him. Beau. & Fl. 7. To pull or tear off, as a covering; to remove; to wrest away; as, to strip the skin from a beast; to strip the bark from a tree; to strip the clothes from a man's back; to strip away all disguisses. To strip bad habits from a corrupted heart, is stripping off the skin. Gilpin. 8. (Mach.) (a) To tear off (the thread) from a bolt or nut; as, the thread is stripped. (b) To tear off the thread from (a bolt or nut); as, the bolt is stripped. 9. To remove the metal coating from (a plated article), as by acids or electrolytic action. 10. (Carding)  To remove fiber, flock, or lint from; -- said of the teeth of a card when it becomes partly clogged. 11. To pick the cured leaves from the stalks of (tobacco) and tie them into \"hands\"; to remove the midrib from (tobacco leaves).\n\n1. To take off, or become divested of, clothes or covering; to undress. 2. (Mach.)  To fail in the thread; to lose the thread, as a bolt, screw, or nut. See Strip, v. t., 8.\n\n1. A narrow piece, or one comparatively long; as, a strip of cloth; a strip of land. 2. (Mining)  A trough for washing ore. 3. (Gunnery)  The issuing of a projectile from a rifled gun without acquiring the spiral motion. Farrow."}