{"word":"strike","definition":"1. To touch or hit with some force, either with the hand or with an instrument; to smite; to give a blow to, either with the hand or with any instrument or missile. He at Philippi kept His sword e'en like a dancer; while I struck The lean and wrinkled Cassius. Shak. 2. To come in collision with; to strike against; as, a bullet struck him; the wave struck the boat amidships; the ship struck a reef. 3. To give, as a blow; to impel, as with a blow; to give a force to; to dash; to cast. They shall take of the blood, and strike it on the two sideposts. Ex. xii. 7. Who would be free, themselves must strike the blow. Byron. 4. To stamp or impress with a stroke; to coin; as, to strike coin from metal: to strike dollars at the mint. 5. To thrust in; to cause to enter or penetrate; to set in the earth; as, a tree strikes its roots deep. 6. To punish; to afflict; to smite. To punish the just is not good, nor strike princes for equity. Prov. xvii. 26. 7. To cause to sound by one or more beats; to indicate or notify by audible strokes; as, the clock strikes twelve; the drums strike up a march. 8. To lower; to let or take down; to remove; as, to strike sail; to strike a flag or an ensign, as in token of surrender; to strike a yard or a topmast in a gale; to strike a tent; to strike the centering of an arch. 9. To make a sudden impression upon, as by a blow; to affect sensibly with some strong emotion; as, to strike the mind, with surprise; to strike one with wonder, alarm, dread, or horror. Nice works of art strike and surprise us most on the first view. Atterbury. They please as beauties, here as wonders strike. Pope. 10. To affect in some particular manner by a sudden impression or impulse; as, the plan proposed strikes me favorably; to strike one dead or blind. How often has stricken you dumb with his irony! Landor. 11. To cause or produce by a stroke, or suddenly, as by a stroke; as, to strike a light. Waving wide her myrtle wand, She strikes a universal peace through sea and land. Milton. 12. To cause to ignite; as, to strike a match. 13. To make and ratify; as, to strike a bargain. Note: Probably borrowed from the L. foedus ferrire, to strike a compact, so called because an animal was struck and killed as a sacrifice on such occasions. 14. To take forcibly or fraudulently; as, to strike money. [Old Slang] 15. To level, as a measure of grain, salt, or the like, by scraping off with a straight instrument what is above the level of the top. 16. (Masonry)  To cut off, as a mortar joint, even with the face of the wall, or inward at a slight angle. 17. To hit upon, or light upon, suddenly; as, my eye struck a strange word; they soon struck the trail. 18. To borrow money of; to make a demand upon; as, he struck a friend for five dollars. [Slang] 19. To lade into a cooler, as a liquor. B. Edwards. 20. To stroke or pass lightly; to wave. Behold, I thought, He will . . . strike his hand over the place, and recover the leper. 2 Kings v. 11. 21. To advance; to cause to go forward; -- used only in past participle. \"Well struck in years.\" Shak. To strike an attitude, To strike a balance. See under Attitude, and Balance. -- To strike a jury (Law), to constitute a special jury ordered by a court, by each party striking out a certain number of names from a prepared list of jurors, so as to reduce it to the number of persons required by law. Burrill. -- To strike a lead. (a) (Mining) To find a vein of ore. (b) Fig.: To find a way to fortune. [Colloq.] -- To strike a ledger, or an account, to balance it. -- To strike hands with. (a) To shake hands with. Halliwell. (b) To make a compact or agreement with; to agree with. -- To strike off. (a) To erase from an account; to deduct; as, to strike off the interest of a debt. (b) (Print.) To impress; to print; as, to strike off a thousand copies of a book. (c) To separate by a blow or any sudden action; as, to strike off what is superfluous or corrupt. -- To strike oil, to find petroleum when boring for it; figuratively, to make a lucky hit financially. [Slang, U.S.] -- To strike one luck, to shake hands with one and wish good luck. [Obs.] Beau. & Fl. -- To strike out. (a) To produce by collision; to force out, as, to strike out sparks with steel. (b) To blot out; to efface; to erase. \"To methodize is as necessary as to strike out.\" Pope. (c) To form by a quick effort; to devise; to invent; to contrive, as, to strike out a new plan of finance. (d) (Baseball) To cause a player to strike out; -- said of the pitcher. See To strike out, under Strike, v. i. -- To strike sail. See under Sail. -- To strike up. (a) To cause to sound; to begin to beat. \"Strike up the drums.\" Shak. (b) To begin to sing or play; as, to strike up a tune. (c) To raise (as sheet metal), in making diahes, pans, etc., by blows or pressure in a die. -- To strike work, to quit work; to go on a strike.\n\nTo move; to advance; to proceed; to take a course; as, to strike into the fields. A mouse . . . struck forth sternly [bodily]. Piers Plowman. 2. To deliver a quick blow or thrust; to give blows. And fiercely took his trenchant blade in hand, With which he stroke so furious and so fell. Spenser. Strike now, or else the iron cools. Shak. 3. To hit; to collide; to dush; to clash; as, a hammer strikes against the bell of a clock. 4. To sound by percussion, with blows, or as with blows; to be struck; as, the clock strikes. A deep sound strikes like a rising knell. Byron. 5. To make an attack; to aim a blow. A puny subject strikes At thy great glory. Shak. Struck for throne, and striking found his doom. Tennyson. 6. To touch; to act by appulse. Hinder light but from striking on it [porphyry], and its colors vanish. Locke. 7. To run upon a rock or bank; to be stranded; as, the ship struck in the night. 8. To pass with a quick or strong effect; to dart; to penetrate. Till a dart strike through his liver. Prov. vii. 23. Now and then a glittering beam of wit or passion strikes through the obscurity of the poem. Dryden. 9. To break forth; to commence suddenly; -- with into; as, to strike into reputation; to strike into a run. 10. To lower a flag, or colors, in token of respect, or to signify a surrender of a ship to an enemy. That the English ships of war should not strike in the Danish seas. Bp. Burnet. 11. To quit work in order to compel an increase, or prevent a reduction, of wages. 12. To become attached to something; -- said of the spat of oysters. 13. To steal money. [Old Slang, Eng.] Nares. To strike at, to aim a blow at. -- To strike for, to start suddenly on a course for. -- To strike home, to give a blow which reaches its object, to strike with effect. -- To strike in. (a) To enter suddenly. (b) To disappear from the surface, with internal effects, as an eruptive disease. (c) To come in suddenly; to interpose; to interrupt. \"I proposed the embassy of Constantinople for Mr. Henshaw, but my Lord Winchelsea struck in.\" Evelyn. (d) To join in after another has begun,as in singing. -- To strike in with, to conform to; to suit itself to; to side with, to join with at once. \"To assert this is to strike in with the known enemies of God's grace.\" South. To strike out. (a) To start; to wander; to make a sudden excursion; as, to strike out into an irregular course of life. (b) To strike with full force. (c) (Baseball) To be put out for not hitting the ball during one's turn at the bat. -- To strike up, to commence to play as a musician; to begin to sound, as an instrument. \"Whilst any trump did sound, or drum struck up.\" Shak.\n\n1. The act of striking. 2. An instrument with a straight edge for leveling a measure of grain, salt, and the like, scraping off what is above the level of the top; a strickle. 3. A bushel; four pecks. [Prov. Eng.] Tusser. 4. An old measure of four bushels. [Prov. Eng.] 5. Fullness of measure; hence, excellence of quality. Three hogsheads of ale of the first strike. Sir W. Scott. 6. An iron pale or standard in a gate or fence. [Obs.] 7. The act of quitting work; specifically, such an act by a body of workmen, done as a means of enforcing compliance with demands made on their employer. Strikes are the insurrections of labor. F. A. Walker. 8. (Iron Working)  A puddler's stirrer. 9. (Geol.)  The horizontal direction of the outcropping edges of tilted rocks; or, the direction of a horizontal line supposed to be drawn on the surface of a tilted stratum. It is at right angles to the dip. 10. The extortion of money, or the attempt to extort money, by threat of injury; blackmailing. Strike block (Carp.), a plane shorter than a jointer, used for fitting a short joint. Moxon. -- Strike of flax, a handful that may be hackled at once. [Obs. or Prov. Eng.] Chaucer. -- Strike of sugar. (Sugar Making) (a) The act of emptying the teache, or last boiler, in which the cane juice is exposed to heat, into the coolers. (b) The quantity of the sirup thus emptied at once."}