{"word":"stroke","definition":"Struck.\n\n1. The act of striking; a blow; a hit; a knock; esp., a violent or hostile attack made with the arm or hand, or with an instrument or weapon. His hand fetcheth a stroke with the ax to cut down the tree. Deut. xix. 5. A fool's lips enter into contention and his mouth calleth for strokes. Prov. xviii. 6. He entered and won the whole kingdom of Naples without striking a stroke. Bacon. 2. The result of effect of a striking; injury or affliction; soreness. In the day that Lord bindeth up the breach of his people, and healeth the stroke of their wound. Isa. xxx. 26. 3. The striking of the clock to tell the hour. Well, but what's o'clock - Upon the stroke of ten. -- Well, let is strike. Shak. 4. A gentle, caressing touch or movement upon something; a stroking. Dryden. 5. A mark or dash in writing or printing; a line; the touch of a pen or pencil; as, an up stroke; a firm stroke. O, lasting as those colors may they shine, Free as thy stroke, yet faultless as thy line. Pope. 6. Hence, by extension, an addition or amandment to a written composition; a touch; as, to give some finishing strokes to an essay. Addison. 7. A sudden attack of disease; especially, a fatal attack; a severe disaster; any affliction or calamity, especially a sudden one; as, a stroke of apoplexy; the stroke of death. At this one stroke the man looked dead in law. Harte. 8. A throb or beat, as of the heart. Tennyson. 9. One of a series of beats or movements against a resisting medium, by means of which movement through or upon it is accomplished; as, the stroke of a bird's wing in flying, or an oar in rowing, of a skater, swimmer, etc.; also: (Rowing) (a) The rate of succession of stroke; as, a quick stroke. (b) The oar nearest the stern of a boat, by which the other oars are guided; -- called also stroke oar. (c) The rower who pulls the stroke oar; the strokesman. 10. A powerful or sudden effort by which something is done, produced, or accomplished; also, something done or accomplished by such an effort; as, a stroke of genius; a stroke of business; a master stroke of policy. 11. (Mach.)  The movement, in either direction, of the piston plunger, piston rod, crosshead, etc., as of a steam engine or a pump, in which these parts have a reciprocating motion; as, the forward stroke of a piston; also, the entire distance passed through, as by a piston, in such a movement; as, the piston is at half stroke. Note: The respective strokes are distinguished as up and down strokes, outward and inward strokes, forward and back strokes, the forward stroke in stationary steam engines being toward the crosshead, but in locomotives toward the front of the vehicle. 12. Power; influence. [Obs.] \"Where money beareth [hath] all the stroke.\" Robynson (More's Utopia). He has a great stroke with the reader. Dryden. 13. Appetite. [Obs.] Swift. To keep stroke, to make strokes in unison. The oars where silver, Which to the tune of flutes kept stroke. Shak.\n\n1. To strike. [Obs.] Ye mote with the plat sword again Stroken him in the wound, and it will close. Chaucer. 2. To rib gently in one direction; especially, to pass the hand gently over by way of expressing kindness or tenderness; to caress; to soothe. He dried the falling drops, and, yet more kind, He stroked her cheeks. Dryden. 3. To make smooth by rubbing. Longfellow. 4. (Masonry)  To give a finely fluted surface to. 5. To row the stroke oar of; as, to stroke a boat."}