{"word":"strong","definition":"1. Having active physical power, or great physical power to act; having a power of exerting great bodily force; vigorous. That our oxen may be strong to labor. Ps. cxliv. 14. Orses the strong to greater strength must yield. Dryden. 2. Having passive physical power; having ability to bear or endure; firm; hale; sound; robust; as, a strong constitution; strong health. 3. Solid; tough; not easily broken or injured; able to withstand violence; able to sustain attacks; not easily subdued or taken; as, a strong beam; a strong rock; a strong fortress or town. 4. Having great military or naval force; powerful; as, a strong army or fleet; a nation strong at sea. 5. Having great wealth, means, or resources; as, a strong house, or company of merchants. 6. Reaching a certain degree or limit in respect to strength or numbers; as, an army ten thousand strong. 7. Moving with rapidity or force; violent; forcible; impetuous; as, a strong current of water or wind; the wind was strong from the northeast; a strong tide. 8. Adapted to make a deep or effectual impression on the mind or imagination; striking or superior of the kind; powerful; forcible; cogent; as, a strong argument; strong reasons; strong evidence; a strong example; strong language. 9. Ardent; eager; zealous; earnestly engaged; as, a strong partisan; a strong Whig or Tory. Her mother, ever strong against that match. Shak. 10. Having virtues of great efficacy; or, having a particular quality in a great degree; as, a strong powder or tincture; a strong decoction; strong tea or coffee. 11. Full of spirit; containing a large proportion of alcohol; intoxicating; as, strong liquors. 12. Affecting any sense powerfully; as, strong light, colors, etc.; a strong flavor of onions; a strong scent. 13. Solid; nourishing; as, strong meat. Heb. v. 12. 14. Well established; firm; not easily overthrown or altered; as, a strong custom; a strong belief. 15. Violent; vehement; earnest; ardent. He had offered up prayers and supplications with strong crying and tears. Heb. v. 7. 16. Having great force, vigor, power, or the like, as the mind, intellect, or any faculty; as, a man of a strong mind, memory, judgment, or imagination. I was stronger in prophecy than in criticism. Dryden. 17. Vigorous; effective; forcible; powerful. Like her sweet voice is thy harmonious song, As high, as sweet, as easy, and as strong. E. Smith. 18. (Stock Exchange)  Tending to higher prices; rising; as, a strong market. 19. (Gram.) (a) Pertaining to, or designating, a verb which forms its preterit (imperfect) by a variation in the root vowel, and the past participle (usually) by the addition of -en (with or without a change of the root vowel); as in the verbs strive, strove, striven; break, broke, broken; drink, drank, drunk. Opposed to weak, or regular. See Weak. (b) Applied to forms in Anglo-Saxon, etc., which retain the old declensional endings. In the Teutonic languages the vowel stems have held the original endings most firmly, and are called strong; the stems in -n are called weak other constant stems conform, or are irregular. F. A. March. Strong conjugation (Gram.), the conjugation of a strong verb; -- called also old, or irregular, conjugation, and distinguished from the weak, or regular, conjugation. Note: Strong is often used in the formation of self-explaining compounds; as, strong-backed, strong-based, strong-bodied, strong- colored, strong-fisted, strong-handed, strong-ribbed, strong- smelling, strong-voiced, etc. Syn. -- Vigorous; powerful; stout; solid; firm; hardy; muscular; forcible; cogent; valid. See Robust."}