{"word":"stuff","definition":"1. Material which is to be worked up in any process of manufacture. For the stuff they had was sufficient for all the work to make it, and too much. Ex. xxxvi. 7. Ambitions should be made of sterner stuff. Shak. The workman on his stuff his skill doth show, And yet the stuff gives not the man his skill. Sir J. Davies. 2. The fundamental material of which anything is made up; elemental part; essence. Yet do I hold it very stuff o' the conscience To do no contrived murder. Shak. 3. Woven material not made into garments; fabric of any kind; specifically, any one of various fabrics of wool or worsted; sometimes, worsted fiber. What stuff wilt have a kirtle of Shak. It [the arras] was of stuff and silk mixed, though, superior kinds were of silk exclusively. F. G. Lee. 4. Furniture; goods; domestic vessels or utensils. He took away locks, and gave away the king's stuff. Hayward. 5. A medicine or mixture; a potion. Shak. 6. Refuse or worthless matter; hence, also, foolish or irrational language; nonsense; trash. Anger would indite Such woeful stuff as I or Shadwell write. Dryden. 7. (Naut.)  A melted mass of turpentine, tallow, etc., with which the masts, sides, and bottom of a ship are smeared for lubrication. Ham. Nav. Encyc. 8. Paper stock ground ready for use. Note: When partly ground, called half stuff. Knight. Clear stuff. See under Clear. -- Small stuff (Naut.), all kinds of small cordage. Ham. Nav. Encyc. -- Stuff gown, the distinctive garb of a junior barrister; hence, a junior barrister himself. See Silk gown, under Silk.stuff and nonsense. (See def. 6 for stuff) balderdash, twaddle, nonsense, foolishness.\n\n1. To fill by crowding something into; to cram with something; to load to excess; as, to stuff a bedtick. Sometimes this crook drew hazel bought adown, And stuffed her apron wide with nuts so brown. Gay. Lest the gods, for sin, Should with a swelling dropsy stuff thy skin. Dryden. 2. To thrust or crowd; to press; to pack. Put roses into a glass with a narrow mouth, stuffing them close together . . . and they retain smell and color. Bacon. 3. To fill by being pressed or packed into. With inward arms the dire machine they load, And iron bowels stuff the dark abode. Dryden. 4. (Cookery)  To fill with a seasoning composition of bread, meat, condiments, etc.; as, to stuff a turkey. 5. To obstruct, as any of the organs; to affect with some obstruction in the organs of sense or respiration. I'm stuffed, cousin; I can not smell. Shak. 6. To fill the skin of, for the purpose of preserving as a specimen; -- said of birds or other animals. 7. To form or fashion by packing with the necessary material. An Eastern king put a judge to death for an iniquitous sentence, and ordered his hide to be stuffed into a cushion, and placed upon the tribunal. Swift. 8. To crowd with facts; to cram the mind of; sometimes, to crowd or fill with false or idle tales or fancies. 9. To put fraudulent votes into (a ballot box). [U. S.]\n\nTo feed gluttonously; to cram. Taught harmless man to cram and stuff. Swift."}