{"word":"stump","definition":"1. The part of a tree or plant remaining in the earth after the stem or trunk is cut off; the stub. 2. The part of a limb or other body remaining after a part is amputated or destroyed; a fixed or rooted remnant; a stub; as, the stump of a leg, a finger, a tooth, or a broom. 3. pl.  The legs; as, to stir one's stumps. [Slang] 4. (Cricket)  One of the three pointed rods stuck in the ground to form a wicket and support the bails. 5. A short, thick roll of leather or paper, cut to a point, or any similar implement, used to rub down the lines of a crayon or pencil drawing, in shading it, or for shading drawings by producing tints and gradations from crayon, etc., in powder. 6. A pin in a tumbler lock which forms an obstruction to throwing the bolt, except when the gates of the tumblers are properly arranged, as by the key; a fence; also, a pin or projection in a lock to form a guide for a movable piece. Leg stump (Cricket), the stump nearest to the batsman. -- Off stump (Cricket), the stump farthest from the batsman. -- Stump tracery (Arch.), a term used to describe late German Gothic tracery, in which the molded bar seems to pass through itself in its convolutions, and is then cut off short, so that a section of the molding is seen at the end of each similar stump. -- To go on the stump, or To take the stump, to engage in making public addresses for electioneering purposes; -- a phrase derived from the practice of using a stump for a speaker's platform in newly- settled districts. Hence also the phrases stump orator, stump speaker, stump speech, stump oratory, etc. [Colloq. U.S.]\n\n1. To cut off a part of; to reduce to a stump; to lop. Around the stumped top soft moss did grow. Dr. H. More. 2. To strike, as the toes, against a stone or something fixed; to stub. [Colloq.] 3. To challenge; also, to nonplus. [Colloq.] 4. To travel over, delivering speeches for electioneering purposes; as, to stump a State, or a district. See To go on the stump, under Stump, n. [Colloq. U.S.] 5. (Cricket) (a) To put (a batsman) out of play by knocking off the bail, or knocking down the stumps of the wicket he is defending while he is off his allotted ground; -- sometimes with out. T. Hughes. (b) To bowl down the stumps of, as, of a wicket. A herd of boys with clamor bowled, And stumped the wicket. Tennyson. To stump it. (a) To go afoot; hence, to run away; to escape. [Slang] Ld. Lytton. (b) To make electioneering speeches. [Colloq. U.S.]\n\nTo walk clumsily, as if on stumps. To stump up, to pay cash. [Prov. Eng.] Halliwell."}