{"word":"such","definition":"1. Of that kind; of the like kind; like; resembling; similar; as, we never saw such a day; -- followed by that or as introducing the word or proposition which defines the similarity, or the standard of comparison; as, the books are not such that I can recommend them, or, not such as I can recommend; these apples are not such as those we saw yesterday; give your children such precepts as tend to make them better. And in his time such a conqueror That greater was there none under the sun. Chaucer. His misery was such that none of the bystanders could refrain from weeping. Macaulay. Note: The indefinite article a or an never precedes such, but is placed between it and the noun to which it refers; as, such a man; such an honor. The indefinite adjective some, several, one, few, many, all, etc., precede such; as, one such book is enough; all such people ought to be avoided; few such ideas were then held. 2. Having the particular quality or character specified. That thou art happy, owe to God; That thou continuest such, owe to thyself. Milton. 3. The same that; -- with as; as, this was the state of the kingdom at such time as the enemy landed. \"[It] hath such senses as we have.\" Shak. 4. Certain; -- representing the object as already particularized in terms which are not mentioned. In rushed one and tells him such a knight Is new arrived. Daniel. To-day or to-morrow we will go into such a city, and continue there a year. James iv. 13. Note: Such is used pronominally. \"He was the father of such as dwell in tents.\" Gen. iv. 20. \"Such as I are free in spirit when our limbs are chained.\" Sir W. Scott. Such is also used before adjectives joined to substantives; as, the fleet encountered such a terrible storm that it put back. \"Everything was managed with so much care, and such excellent order was observed.\" De Foe. Temple sprung from a family which . . . long after his death produced so many eminent men, and formed such distinguished alliances, that, etc. Macaulay. Such is used emphatically, without the correlative. Now will he be mocking: I shall have such a life. Shak. Such was formerly used with numerals in the sense of times as much or as many; as, such ten, or ten times as many. Such and such, or Such or such, certain; some; -- used to represent the object indefinitely, as already particularized in one way or another, or as being of one kind or another. \"In such and such a place shall be my camp.\" 2 Kings vi. 8. \"Sovereign authority may enact a law commanding such and such an action.\" South. -- Such like or character, of the like kind. And many other such like things ye do. Mark vii. 8."}