{"word":"sulphur","definition":"1. (Chem.)  A nonmetallic element occurring naturally in large quantities, either combined as in the sulphides (as pyrites) and sulphates (as gypsum), or native in volcanic regions, in vast beds mixed with gypsum and various earthy materials, from which it is melted out. Symbol S. Atomic weight 32. The specific gravity of ordinary octohedral sulphur is 2.05; of prismatic sulphur, 1.96. Note: It is purified by distillation, and is obtained as a lemon- yellow powder (by sublimation), called flour, or flowers, of sulphur, or in cast sticks called roll sulphur, or brimstone. It burns with a blue flame and a peculiar suffocating odor. It is an ingredient of gunpowder, is used on friction matches, and in medicine (as a laxative and insecticide), but its chief use is in the manufacture of sulphuric acid. Sulphur can be obtained in two crystalline modifications, in orthorhombic octahedra, or in monoclinic prisms, the former of which is the more stable at ordinary temperatures. Sulphur is the type, in its chemical relations, of a group of elements, including selenium and tellurium, called collectively the sulphur group, or family. In many respects sulphur resembles oxygen. 2. (Zoöl.)  Any one of numerous species of yellow or orange butterflies of the subfamily Pierinæ; as, the clouded sulphur (Eurymus, or Colias, philodice), which is the common yellow butterfly of the Eastern United States. Amorphous sulphur (Chem.), an elastic variety of sulphur of a resinous appearance, obtained by pouring melted sulphur into water. On standing, it passes back into a brittle crystalline modification. -- Liver of sulphur. (Old Chem.) See Hepar. -- Sulphur acid. (Chem.) See Sulphacid. -- Sulphur alcohol. (Chem.) See Mercaptan. -- Sulphur auratum Etym: [L.] (Old Chem.), a golden yellow powder, consisting of antimonic sulphide, Sb2S5, -- formerly a famous nostrum. -- Sulphur base (Chem.), an alkaline sulphide capable of acting as a base in the formation of sulphur salts according to the old dual theory of salts. [Archaic] -- Sulphur dioxide (Chem.), a colorless gas, SO2, of a pungent, suffocating odor, produced by the burning of sulphur. It is employed chiefly in the production of sulphuric acid, and as a reagent in bleaching; -- called also sulphurous anhydride, and formerly sulphurous acid. -- Sulphur ether (Chem.), a sulphide of hydrocarbon radicals, formed like the ordinary ethers, which are oxides, but with sulphur in the place of oxygen. -- Sulphur salt (Chem.), a salt of a sulphacid; a sulphosalt. -- Sulphur showers, showers of yellow pollen, resembling sulphur in appearance, often carried from pine forests by the wind to a great distance. -- Sulphur trioxide (Chem.), a white crystalline solid, SO3, obtained by oxidation of sulphur dioxide. It dissolves in water with a hissing noise and the production of heat, forming sulphuric acid, and is employed as a dehydrating agent. Called also sulphuric anhydride, and formerly sulphuric acid. -- Sulphur whale. (Zoöl.) See Sulphur-bottom. -- Vegetable sulphur (Bot.), lycopodium powder. See under Lycopodium."}