{"word":"sum","definition":"1. The aggregate of two or more numbers, magnitudes, quantities, or particulars; the amount or whole of any number of individuals or particulars added together; as, the sum of 5 and 7 is 12. Take ye the sum of all the congregation. Num. i. 2. Note: Sum is now commonly applied to an aggregate of numbers, and number to an aggregate of persons or things. 2. A quantity of money or currency; any amount, indefinitely; as, a sum of money; a small sum, or a large sum. \"The sum of forty pound.\" Chaucer. With a great sum obtained I this freedom. Acts xxii. 28. 3. The principal points or thoughts when viewed together; the amount; the substance; compendium; as, this is the sum of all the evidence in the case; this is the sum and substance of his objections. 4. Height; completion; utmost degree. Thus have I told thee all my state, and brought My story to the sum of earthly bliss. Milton. 5. (Arith.)  A problem to be solved, or an example to be wrought out. Macaulay. A sum in arithmetic wherein a flaw discovered at a particular point is ipso facto fatal to the whole. Gladstone. A large sheet of paper . . . covered with long sums. Dickens. Algebraic sum, as distinguished from arithmetical sum, the aggregate of two or more numbers or quantities taken with regard to their signs, as + or -, according to the rules of addition in algebra; thus, the algebraic sum of -2, 8, and -1 is 5. -- In sum, in short; in brief. [Obs.] \"In sum, the gospel . . . prescribes every virtue to our conduct, and forbids every sin.\" Rogers.\n\n1. To bring together into one whole; to collect into one amount; to cast up, as a column of figures; to ascertain the totality of; -- usually with up. The mind doth value every moment, and then the hour doth rather sum up the moments, than divide the day. Bacon. 2. To bring or collect into a small compass; to comprise in a few words; to condense; -- usually with up. \"Go to the ant, thou sluggard,\" in few words sums up the moral of this fable. L'Estrange. He sums their virtues in himself alone. Dryden. 3. (Falconry)  To have (the feathers) full grown; to furnish with complete, or full-grown, plumage. But feathered soon and fledge They summed their pens [wings]. Milton. Summing up, a compendium or abridgment; a recapitulation; a résumé; a summary. Syn. -- To cast up; collect; comprise; condense; comprehend; compute."}