{"word":"support","definition":"1. To bear by being under; to keep from falling; to uphold; to sustain, in a literal or physical sense; to prop up; to bear the weight of; as, a pillar supports a structure; an abutment supports an arch; the trunk of a tree supports the branches. 2. To endure without being overcome, exhausted, or changed in character; to sustain; as, to support pain, distress, or misfortunes. This fierce demeanor and his insolence The patience of a god could not support. Dryden. 3. To keep from failing or sinking; to solace under affictive circumstances; to assist; to encourage; to defend; as, to support the courage or spirits. 4. To assume and carry successfully, as the part of an actor; to represent or act; to sustain; as, to support the character of King Lear. 5. To furnish with the means of sustenance or livelihood; to maintain; to provide for; as, to support a family; to support the ministers of the gospel. 6. To carry on; to enable to continue; to maintain; as, to support a war or a contest; to support an argument or a debate. 7. To verify; to make good; to substantiate; to establish; to sustain; as, the testimony is not sufficient to support the charges; the evidence will not support the statements or allegations. To urge such arguments, as though they were sufficient to support and demonstrate a whole scheme of moral philosophy. J. Edwards. 8. To vindicate; to maintain; to defend successfully; as, to be able to support one's own cause. 9. To uphold by aid or countenance; to aid; to help; to back up; as, to support a friend or a party; to support the present administration. Wherefore, bold pleasant, Darest thou support a published traitor Shak. 10. A attend as an honorary assistant; as, a chairman supported by a vice chairman; O'Connell left the prison, supported by his two sons. Support arms (Mil.), a command in the manual of arms in responce to which the piece is held vertically at the shoulder, with the hammer resting on the left forearm, which is passed horizontally across the body in front; also, the position assumed in response to this command. Syn. -- To maintain; endure; verify; substantiate; countenance; patronize; help; back; second; succor; relieve; uphold; encourage; favor; nurture; nourish; cherish; shield; defend; protect; stay; assist; forward.\n\n1. The act, state, or operation of supporting, upholding, or sustaining. 2. That which upholds, sustains, or keeps from falling, as a prop, a pillar, or a foundation of any kind. 3. That which maintains or preserves from being overcome, falling, yielding, sinking, giving way, or the like; subsistence; maintenance; assistance; reënforcement; as, he gave his family a good support, the support of national credit; the assaulting column had the support of a battery. Points of support (Arch.), the horizontal area of the solids of a building, walls, piers, and the like, as compared with the open or vacant spaces. -- Right of support (Law), an easement or servitude by which the owner of a house has a right to rest his timber on the walls of his neighbor's house. Kent. Syn. -- Stay; prop; maintenance; subsistence; assistance; favor; countenance; encouragement; patronage; aid; help; succor; nutriment; sustenance; food."}