{"word":"sweet","definition":"1. Having an agreeable taste or flavor such as that of sugar; saccharine; -- opposed to sour and bitter; as, a sweet beverage; sweet fruits; sweet oranges. 2. Pleasing to the smell; fragrant; redolent; balmy; as, a sweet rose; sweet odor; sweet incense. The breath of these flowers is sweet to me. Longfellow. 3. Pleasing to the ear; soft; melodious; harmonious; as, the sweet notes of a flute or an organ; sweet music; a sweet voice; a sweet singer. To make his English sweet upon his tongue. Chaucer. A voice sweet, tremulous, but powerful. Hawthorne. 4. Pleasing to the eye; beautiful; mild and attractive; fair; as, a sweet face; a sweet color or complexion. Sweet interchange Of hill and valley, rivers, woods, and plains. Milton. 5. Fresh; not salt or brackish; as, sweet water. Bacon. 6. Not changed from a sound or wholesome state. Specifically: (a) Not sour; as, sweet milk or bread. (b) Not state; not putrescent or putrid; not rancid; as, sweet butter; sweet meat or fish. 7. Plaesing to the mind; mild; gentle; calm; amiable; winning; presuasive; as, sweet manners. Canst thou bind the sweet influence of Pleiades Job xxxviii. 31. Mildness and sweet reasonableness is the one established rule of Christian working. M. Arnold. Note: Sweet is often used in the formation of self-explaining compounds; as, sweet-blossomed, sweet-featured, sweet-smelling, sweet-tempered, sweet-toned, etc. Sweet alyssum. (Bot.) See Alyssum. -- Sweet apple. (Bot.) (a) Any apple of sweet flavor. (b) See Sweet- top. -- Sweet bay. (Bot.) (a) The laurel (laurus nobilis). (b) Swamp sassafras. -- Sweet calabash (Bot.), a plant of the genus Passiflora (P. maliformis) growing in the West Indies, and producing a roundish, edible fruit, the size of an apple. -- Sweet cicely. (Bot.) (a) Either of the North American plants of the umbelliferous genus Osmorrhiza having aromatic roots and seeds, and white flowers. Gray. (b) A plant of the genus Myrrhis (M. odorata) growing in England. -- Sweet calamus, or Sweet cane. (Bot.) Same as Sweet flag, below. -- Sweet Cistus (Bot.), an evergreen shrub (Cistus Ladanum) from which the gum ladanum is obtained. -- Sweet clover. (Bot.) See Melilot. -- Sweet coltsfoot (Bot.), a kind of butterbur (Petasites sagittata) found in Western North America. -- Sweet corn (Bot.), a variety of the maize of a sweet taste. See the Note under Corn. -- Sweet fern (Bot.), a small North American shrub (Comptonia, or Myrica, asplenifolia) having sweet-scented or aromatic leaves resembling fern leaves. -- Sweet flag (Bot.), an endogenous plant (Acorus Calamus) having long flaglike leaves and a rootstock of a pungent aromatic taste. It is found in wet places in Europe and America. See Calamus, 2. -- Sweet gale (Bot.), a shrub (Myrica Gale) having bitter fragrant leaves; -- also called sweet willow, and Dutch myrtle. See 5th Gale. Sweet grass (Bot.), holy, or Seneca, grass. -- Sweet gum (Bot.), an American tree (Liquidambar styraciflua). See Liquidambar. -- Sweet herbs, fragrant herbs cultivated for culinary purposes. -- Sweet John (Bot.), a variety of the sweet William. -- Sweet leaf (Bot.), horse sugar. See under Horse. -- Sweet marjoram. (Bot.) See Marjoram. -- Sweet marten (Zoöl.), the pine marten. -- Sweet maudlin (Bot.), a composite plant (Achillea Ageratum) allied to milfoil. -- Sweet oil, olive oil. -- Sweet pea. (Bot.) See under Pea. -- Sweet potato. (Bot.) See under Potato. -- Sweet rush (Bot.), sweet flag. -- Sweet spirits of niter (Med. Chem.) See Spirit of nitrous ether, under Spirit. -- Sweet sultan (Bot.), an annual composite plant (Centaurea moschata), also, the yellow-flowered (C. odorata); -- called also sultan flower. -- Sweet tooth, an especial fondness for sweet things or for sweetmeats. [Colloq.] -- Sweet William. (a) (Bot.) A species of pink (Dianthus barbatus) of many varieties. (b) (Zoöl.) The willow warbler. (c) (Zoöl.) The European goldfinch; -- called also sweet Billy. [Prov. Eng.] -- Sweet willow (Bot.), sweet gale. -- Sweet wine. See Dry wine, under Dry. -- To be sweet on, to have a particular fondness for, or special interest in, as a young man for a young woman. [Colloq.] Thackeray. Syn. -- Sugary; saccharine; dulcet; luscious.\n\n1. That which is sweet to the taste; -- used chiefly in the plural. Specifically: (a) Confectionery, sweetmeats, preserves, etc. (b) Home-made wines, cordials, metheglin, etc. 2. That which is sweet or pleasant in odor; a perfume. \"A wilderness of sweets.\" Milton. 3. That which is pleasing or grateful to the mind; as, the sweets of domestic life. A little bitter mingled in our cup leaves no relish of the sweet. Locke. 4. One who is dear to another; a darling; -- a term of endearment. \"Wherefore frowns my sweet\" B. Jonson.\n\nSweetly. Shak.\n\nTo sweeten. [Obs.] Udall."}