{"word":"sweep","definition":"1. To pass a broom across (a surface) so as to remove loose dirt, dust, etc.; to brush, or rub over, with a broom for the purpose of cleaning; as, to sweep a floor, the street, or a chimney. Used also figuratively. I will sweep it with the besom of destruction. Isa. xiv. 23. 2. To drive or carry along or off with a broom or a brush, or as if with a broom; to remove by, or as if by, brushing; as, to sweep dirt from a floor; the wind sweeps the snow from the hills; a freshet sweeps away a dam, timber, or rubbish; a pestilence sweeps off multitudes. The hail shall sweep away the refuge of lies. Isa. xxviii. 17. I have already swept the stakes. Dryden. 3. To brush against or over; to rub lightly along. Their long descending train, With rubies edged and sapphires, swept the plain. Dryden. 4. To carry with a long, swinging, or dragging motion; hence, to carry in a stately or proud fashion. And like a peacock sweep along his tail. Shak. 5. To strike with a long stroke. Wake into voice each silent string, And sweep the sounding lyre. Pope. 6. (Naut.)  To draw or drag something over; as, to sweep the bottom of a river with a net. 7. To pass over, or traverse, with the eye or with an instrument of observation; as, to sweep the heavens with a telescope. To sweep, or sweep up, a mold (Founding), to form the sand into a mold by a templet, instead of compressing it around the pattern.\n\n1. To clean rooms, yards, etc., or to clear away dust, dirt, litter, etc., with a broom, brush, or the like. 2. To brush swiftly over the surface of anything; to pass with switness and force, as if brushing the surface of anything; to move in a stately manner; as, the wind sweeps across the plain; a woman sweeps through a drawing-room. 3. To pass over anything comprehensively; to range through with rapidity; as, his eye sweeps through space.\n\n1. The act of sweeping. 2. The compass or range of a stroke; as, a long sweep. 3. The compass of any turning body or of any motion; as, the sweep of a door; the sweep of the eye. 4. The compass of anything flowing or brushing; as, the flood carried away everything within its sweep. 5. Violent and general destruction; as, the sweep of an epidemic disease. 6. Direction and extent of any motion not rectlinear; as, the sweep of a compass. 7. Direction or departure of a curve, a road, an arch, or the like, away from a rectlinear line. The road which makes a small sweep. Sir W. Scott. 8. One who sweeps; a sweeper; specifically, a chimney sweeper. 9. (Founding)  A movable templet for making molds, in loam molding. 10. (Naut.) (a) The mold of a ship when she begins to curve in at the rungheads; any part of a ship shaped in a segment of a circle. (b) A large oar used in small vessels, partly to propel them and partly to steer them. 11. (Refining)  The almond furnace. [Obs.] 12. A long pole, or piece of timber, moved on a horizontal fulcrum fixed to a tall post and used to raise and lower a bucket in a well for drawing water. [Variously written swape, sweep, swepe, and swipe.] 13. (Card Playing)  In the game of casino, a pairing or combining of all the cards on the board, and so removing them all; in whist, the winning of all the tricks (thirteen) in a hand; a slam. 14. pl.  The sweeping of workshops where precious metals are worked, containing filings, etc. Sweep net, a net for drawing over a large compass. -- Sweep of the tiller (Naut.), a circular frame on which the tiller traverses."}