{"word":"swell","definition":"1. To grow larger; to dilate or extend the exterior surface or dimensions, by matter added within, or by expansion of the inclosed substance; as, the legs swell in dropsy; a bruised part swells; a bladder swells by inflation. 2. To increase in size or extent by any addition; to increase in volume or force; as, a river swells, and overflows its banks; sounds swell or diminish. 3. To rise or be driven into waves or billows; to heave; as, in tempest, the ocean swells into waves. 4. To be puffed up or bloated; as, to swell with pride. You swell at the tartan, as the bull is said to do at scarlet. Sir W. Scott. 5. To be inflated; to belly; as, the sails swell. 6. To be turgid, bombastic, or extravagant; as, swelling words; a swelling style. 7. To protuberate; to bulge out; as, a cask swells in the middle. 8. To be elated; to rise arrogantly. Your equal mind yet swells not into state. Dryden. 9. To grow upon the view; to become larger; to expand. \"Monarchs to behold the swelling scene!\" Shak. 10. To become larger in amount; as, many little debts added, swell to a great amount. 11. To act in a pompous, ostentatious, or arrogant manner; to strut; to look big. Here he comes, swelling like a turkey cock. Shak.\n\n1. To increase the size, bulk, or dimensions of; to cause to rise, dilate, or increase; as, rains and dissolving snow swell the rivers in spring; immigration swells the population. [The Church] swells her high, heart-cheering tone. Keble. 2. To aggravate; to heighten. It is low ebb with his accuser when such peccadilloes are put to swell the charge. Atterbury. 3. To raise to arrogance; to puff up; to inflate; as, to be swelled with pride or haughtiness. 4. (Mus.)  To augment gradually in force or loudness, as the sound of a note.\n\n1. The act of swelling. 2. Gradual increase. Specifically: (a) Increase or augmentation in bulk; protuberance. (b) Increase in height; elevation; rise. Little River affords navigation during a swell to within three miles of the Miami. Jefferson. (c) Increase of force, intensity, or volume of sound. Music arose with its voluptuous swell. Byron. (d) Increase of power in style, or of rhetorical force. The swell and subsidence of his periods. Landor. 3. A gradual ascent, or rounded elevation, of land; as, an extensive plain abounding with little swells. 4. A wave, or billow; especially, a succession of large waves; the roll of the sea after a storm; as, a heavy swell sets into the harbor. The swell Of the long waves that roll in yonder bay. Tennyson. The gigantic swells and billows of the snow. Hawthorne. 5. (Mus.)  A gradual increase and decrease of the volume of sound; the crescendo and diminuendo combined; -- generally indicated by the sign. 6. A showy, dashing person; a dandy. [Slang] Ground swell. See under Ground. -- Organ swell (Mus.), a certain number of pipes inclosed in a box, the uncovering of which by means of a pedal produces increased sound. -- Swell shark (Zoöl.), a small shark (Scyllium ventricosum) of the west coast of North America, which takes in air when caught, and swells up like a swellfish.\n\nHaving the characteristics of a person of rank and importance; showy; dandified; distinguished; as, a swell person; a swell neighborhood. [Slang] Swell mob. See under Mob. [Slang]"}