{"word":"tack","definition":"1. A stain; a tache. [Obs.] 2. Etym: [Cf. L. tactus.]  A peculiar flavor or taint; as, a musty tack. [Obs. or Colloq.] Drayton.\n\n1. A small, short, sharp-pointed nail, usually having a broad, flat head. 2. That which is attached; a supplement; an appendix. See Tack, v. t., 3. Macaulay. Some tacks had been made to money bills in King Charles's time. Bp. Burnet. 3. (Naut.) (a) A rope used to hold in place the foremost lower corners of the courses when the vessel is closehauled (see Illust. of Ship); also, a rope employed to pull the lower corner of a studding sail to the boom. (b) The part of a sail to which the tack is usually fastened; the foremost lower corner of fore-and-aft sails, as of schooners (see Illust. of Sail). (c) The direction of a vessel in regard to the trim of her sails; as, the starboard tack, or port tack; -- the former when she is closehauled with the wind on her starboard side; hence, the run of a vessel on one tack; also, a change of direction. 4. (Scots Law)  A contract by which the use of a thing is set, or let, for hire; a lease. Burrill. 5. Confidence; reliance. [Prov. Eng.] Halliwell. Tack of a flag (Naut.), a line spliced into the eye at the foot of the hoist for securing the flag to the halyards. -- Tack pins (Naut.), belaying pins; -- also called jack pins. -- To haul the tacks aboard (Naut.), to set the courses. -- To hold tack, to last or hold out. Milton.\n\n1. To fasten or attach. \"In hopes of getting some commendam tacked to their sees.\" Swift. And tacks the center to the sphere. Herbert. 2. Especially, to attach or secure in a slight or hasty manner, as by stitching or nailing; as, to tack together the sheets of a book; to tack one piece of cloth to another; to tack on a board or shingle; to tack one piece of metal to another by drops of solder. 3. In parliamentary usage, to add (a supplement) to a bill; to append; -- often with on or to. Macaulay. 4. (Naut.)  To change the direction of (a vessel) when sailing closehauled, by putting the helm alee and shifting the tacks and sails so that she will proceed to windward nearly at right angles to her former course. Note: In tacking, a vessel is brought to point at first directly to windward, and then so that the wind will blow against the other side.\n\nTo change the direction of a vessel by shifting the position of the helm and sails; also (as said of a vessel), to have her direction changed through the shifting of the helm and sails. See Tack, v. t., 4. Monk, . . . when he wanted his ship to tack to larboard, moved the mirth of his crew by calling out, \"Wheel to the left.\" Macaulay."}