{"word":"tally","definition":"1. Originally, a piece of wood on which notches or scores were cut, as the marks of number; later, one of two books, sheets of paper, etc., on which corresponding accounts were kept. Note: In purshasing and selling, it was once customary for traders to have two sticks, or one stick cleft into two parts, and to mark with a score or notch, on each, the number or quantity of goods delivered, -- the seller keeping one stick, and the purchaser the other. Before the use of writing, this, or something like it, was the only method of keeping accounts; and tallies were received as evidence in courts of justice. In the English exchequer were tallies of loans, one part being kept in the exchequer, the other being given to the creditor in lieu of an obligation for money lent to government. 2. Hence, any account or score kept by notches or marks, whether on wood or paper, or in a book; especially, one kept in duplicate. 3. One thing made to suit another; a match; a mate. They were framed the tallies for each other. Dryden. 4. A notch, mark, or score made on or in a tally; as, to make or earn a tally in a game. 5. A tally shop. See Tally shop, below. Tally shop, a shop at which goods or articles are sold to customers on account, the account being kept in corresponding books, one called the tally, kept by the buyer, the other the counter tally, kept by the seller, and the payments being made weekly or otherwise by agreement. The trade thus regulated is called tally trade. Eng. Encyc. -- To strike tallies, to act in correspondence, or alike. [Obs.] Fuller.\n\n1. To score with correspondent notches; hence, to make to correspond; to cause to fit or suit. They are not so well tallied to the present juncture. Pope. 2. (Naut.)  To check off, as parcels of freight going inboard or outboard. W. C. Russell. Tally on (Naut.), to dovetail together.\n\n1. To be fitted; to suit; to correspond; to match. I found pieces of tiles that exactly tallied with the channel. Addison. Your idea . . . tallies exactly with mine. Walpole. 2. To make a tally; to score; as, to tally in a game. Tally on (Naut.), to man a rope for hauling, the men standing in a line or tail.\n\nStoutly; with spirit. [Obs.] Beau. & Fl."}