{"word":"taste","definition":"1. To try by the touch; to handle; as, to taste a bow. [Obs.] Chapman. Taste it well and stone thou shalt it find. Chaucer. 2. To try by the touch of the tongue; to perceive the relish or flavor of (anything) by taking a small quantity into a mouth. Also used figuratively. When the ruler of the feast had tasted the water that was made wine. John ii. 9. When Commodus had once tasted human blood, he became incapable of pity or remorse. Gibbon. 3. To try by eating a little; to eat a small quantity of. I tasted a little of this honey. 1 Sam. xiv. 29. 4. To become acquainted with by actual trial; to essay; to experience; to undergo. He . . . should taste death for every man. Heb. ii. 9. 5. To partake of; to participate in; -- usually with an implied sense of relish or pleasure. Thou . . . wilt taste No pleasure, though in pleasure, solitary. Milton.\n\n1. To try food with the mouth; to eat or drink a little only; to try the flavor of anything; as, to taste of each kind of wine. 2. To have a smack; to excite a particular sensation, by which the specific quality or flavor is distinguished; to have a particular quality or character; as, this water tastes brackish; the milk tastes of garlic. Yea, every idle, nice, and wanton reason Shall to the king taste of this action. Shak. 3. To take sparingly. For age but tastes of pleasures, youth devours. Dryden. 4. To have perception, experience, or enjoyment; to partake; as, to taste of nature's bounty. Waller. The valiant never taste of death but once. Shak.\n\n1. The act of tasting; gustation. 2. A particular sensation excited by the application of a substance to the tongue; the quality or savor of any substance as perceived by means of the tongue; flavor; as, the taste of an orange or an apple; a bitter taste; an acid taste; a sweet taste. 3. (Physiol.)  The one of the five senses by which certain properties of bodies (called their taste, savor, flavor) are ascertained by contact with the organs of taste. Note: Taste depends mainly on the contact of soluble matter with the terminal organs (connected with branches of the glossopharyngeal and other nerves) in the papillæ on the surface of the tongue. The base of the tongue is considered most sensitive to bitter substances, the point to sweet and acid substances. 4. Intellectual relish; liking; fondness; -- formerly with of, now with for; as, he had no taste for study. I have no taste Of popular applause. Dryden. 5. The power of perceiving and relishing excellence in human performances; the faculty of discerning beauty, order, congruity, proportion, symmetry, or whatever constitutes excellence, particularly in the fine arts and belles-letters; critical judgment; discernment. 6. Manner, with respect to what is pleasing, refined, or in accordance with good usage; style; as, music composed in good taste; an epitaph in bad taste. 7. Essay; trial; experience; experiment. Shak. 8. A small portion given as a specimen; a little piece tastted of eaten; a bit. Bacon. 9. A kind of narrow and thin silk ribbon. Syn. -- Savor; relish; flavor; sensibility; gout. -- Taste, Sensibility, Judgment. Some consider taste as a mere sensibility, and others as a simple exercise of judgment; but a union of both is requisite to the existence of anything which deserves the name. An original sense of the beautiful is just as necessary to æsthetic judgments, as a sense of right and wrong to the formation of any just conclusions or moral subjects. But this \"sense of the beautiful\" is not an arbitrary principle. It is under the guidance of reason; it grows in delicacy and correctness with the progress of the individual and of society at large; it has its laws, which are seated in the nature of man; and it is in the development of these laws that we find the true \"standard of taste.\" What, then, is taste, but those internal powers, Active and strong, and feelingly alive To each fine impulse a discerning sense Of decent and sublime, with quick disgust From things deformed, or disarranged, or gross In species This, nor gems, nor stores of gold, Nor purple state, nor culture, can bestow, But God alone, when first his active hand Imprints the secret bias of the soul. Akenside. Taste of buds, or Taste of goblets (Anat.), the flask-shaped end organs of taste in the epithelium of the tongue. They are made up of modified epithelial cells arranged somewhat like leaves in a bud."}