{"word":"tea","definition":"1. The prepared leaves of a shrub, or small tree (Thea, or Camellia, Chinensis). The shrub is a native of China, but has been introduced to some extent into some other countries. Note: Teas are classed as green or black, according to their color or appearance, the kinds being distinguished also by various other characteristic differences, as of taste, odor, and the like. The color, flavor, and quality are dependent upon the treatment which the leaves receive after being gathered. The leaves for green tea are heated, or roasted slightly, in shallow pans over a wood fire, almost immediately after being gathered, after which they are rolled with the hands upon a table, to free them from a portion of their moisture, and to twist them, and are then quickly dried. Those intended for black tea are spread out in the air for some time after being gathered, and then tossed about with the hands until they become soft and flaccid, when they are roasted for a few minutes, and rolled, and having then been exposed to the air for a few hours in a soft and moist state, are finally dried slowly over a charcoal fire. The operation of roasting and rolling is sometimes repeated several times, until the leaves have become of the proper color. The principal sorts of green tea are Twankay, the poorest kind; Hyson skin, the refuse of Hyson; Hyson, Imperial, and Gunpowder, fine varieties; and Young Hyson, a choice kind made from young leaves gathered early in the spring. Those of black tea are Bohea, the poorest kind; Congou; Oolong; Souchong, one of the finest varieties; and Pekoe, a fine-flavored kind, made chiefly from young spring buds. See Bohea, Congou, Gunpowder tea, under Gunpowder, Hyson, Oolong, and Souchong. K. Johnson. Tomlinson. Note: \"No knowledge of . . . [tea] appears to have reached Europe till after the establishment of intercourse between Portugal and China in 1517. The Portuguese, however, did little towards the introduction of the herb into Europe, and it was not till the Dutch established themselves at Bantam early in 17th century, that these adventurers learned from the Chinese the habit of tea drinking, and brought it to Europe.\" Encyc. Brit. 2. A decoction or infusion of tea leaves in boiling water; as, tea is a common beverage. 3. Any infusion or decoction, especially when made of the dried leaves of plants; as, sage tea; chamomile tea; catnip tea. 4. The evening meal, at which tea is usually served; supper. Arabian tea, the leaves of Catha edulis; also (Bot.), the plant itself. See Kat. -- Assam tea, tea grown in Assam, in India, originally brought there from China about the year 1850. -- Australian, or Botany Bay, tea (Bot.), a woody clambing plant (Smilax glycyphylla). -- Brazilian tea. (a) The dried leaves of Lantana pseodothea, used in Brazil as a substitute for tea. (b) The dried leaves of Stachytarpheta mutabilis, used for adulterating tea, and also, in Austria, for preparing a beverage. -- Labrador tea. (Bot.) See under Labrador. -- New Jersey tea (Bot.), an American shrub, the leaves of which were formerly used as a substitute for tea; redroot. See Redroot. -- New Zealand tea. (Bot.) See under New Zealand. -- Oswego tea. (Bot.) See Oswego tea. -- Paraguay tea, mate. See 1st Mate. -- Tea board, a board or tray for holding a tea set. -- Tea bug (Zoöl.), an hemipterous insect which injures the tea plant by sucking the juice of the tender leaves. -- Tea caddy, a small box for holding tea. -- Tea chest, a small, square wooden case, usually lined with sheet lead or tin, in which tea is imported from China. -- Tea clam (Zoöl.), a small quahaug. [Local, U.S.] -- Tea garden, a public garden where tea and other refreshments are served. -- Tea plant (Bot.), any plant, the leaves of which are used in making a beverage by infusion; specifically, Thea Chinensis, from which the tea of commerce is obtained. -- Tea rose (Bot.), a delicate and graceful variety of the rose (Rosa Indica, var. odorata), introduced from China, and so named from its scent. Many varieties are now cultivated. -- Tea service, the appurtenances or utensils required for a tea table, -- when of silver, usually comprising only the teapot, milk pitcher, and sugar dish. -- Tea set, a tea service. -- Tea table, a table on which tea furniture is set, or at which tea is drunk. -- Tea taster, one who tests or ascertains the quality of tea by tasting. -- Tea tree (Bot.), the tea plant of China. See Tea plant, above. -- Tea urn, a vessel generally in the form of an urn or vase, for supplying hot water for steeping, or infusing, tea.\n\nTo take or drink tea. [Colloq.]"}