{"word":"tear","definition":"1. (Physiol.)  A drop of the limpid, saline fluid secreted, normally in small amount, by the lachrymal gland, and diffused between the eye and the eyelids to moisten the parts and facilitate their motion. Ordinarily the secretion passes through the lachrymal duct into the nose, but when it is increased by emotion or other causes, it overflows the lids. And yet for thee ne wept she never a tear. Chaucer. 2. Something in the form of a transparent drop of fluid matter; also, a solid, transparent, tear-shaped drop, as of some balsams or resins. Let Araby extol her happy coast, Her fragrant flowers, her trees with precious tears. Dryden. 3. That which causes or accompanies tears; a lament; a dirge. [R.] \"Some melodous tear.\" Milton. Note: Tear is sometimes used in the formation of self-explaining compounds; as, tear-distilling, tear-drop, tear-filled, tear-stained, and the like.\n\n1. To separate by violence; to pull apart by force; to rend; to lacerate; as, to tear cloth; to tear a garment; to tear the skin or flesh. Tear him to pieces; he's a conspirator. Shak. 2. Hence, to divide by violent measures; to disrupt; to rend; as, a party or government torn by factions. 3. To rend away; to force away; to remove by force; to sunder; as, a child torn from its home. The hand of fate Hath torn thee from me. Addison. 4. To pull with violence; as, to tear the hair. 5. To move violently; to agitate. \"Once I loved torn ocean's roar.\" Byron. To tear a cat, to rant violently; to rave; -- especially applied to theatrical ranting. [Obs.] Shak. -- To tear down, to demolish violently; to pull or pluck down. -- To tear off, to pull off by violence; to strip. -- To tear out, to pull or draw out by violence; as, to tear out the eyes. -- To tear up, to rip up; to remove from a fixed state by violence; as, to tear up a floor; to tear up the foundation of government or order.\n\n1. To divide or separate on being pulled; to be rent; as, this cloth tears easily. 2. To move and act with turbulent violence; to rush with violence; hence, to rage; to rave.\n\nThe act of tearing, or the state of being torn; a rent; a fissure. Macaulay. Wear and tear. See under Wear, n."}