{"word":"telegraph","definition":"An apparatus, or a process, for communicating intelligence rapidly between distant points, especially by means of preconcerted visible or audible signals representing words or ideas, or by means of words and signs, transmitted by electrical action. Note: The instruments used are classed as indicator, type-printing, symbol-printing, or chemical-printing telegraphs, according as the intelligence is given by the movements of a pointer or indicator, as in Cooke & Wheatstone's (the form commonly used in England), or by impressing, on a fillet of paper, letters from types, as in House's and Hughe's, or dots and marks from a sharp point moved by a magnet, as in Morse's, or symbols produced by electro-chemical action, as in Bain's. In the offices in the United States the recording instrument is now little used, the receiving operator reading by ear the combinations of long and short intervals of sound produced by the armature of an electro-magnet as it is put in motion by the opening and breaking of the circuit, which motion, in registering instruments, traces upon a ribbon of paper the lines and dots used to represent the letters of the alphabet. See Illustration in Appendix. Acoustic telegraph. See under Acoustic. -- Dial telegraph, a telegraph in which letters of the alphabet and numbers or other symbols are placed upon the border of a circular dial plate at each station, the apparatus being so arranged that the needle or index of the dial at the receiving station accurately copies the movements of that at the sending station. -- Electric telegraph, or Electro-magnetic telegraph, a telegraph in which an operator at one station causes words or signs to be made at another by means of a current of electricity, generated by a battery and transmitted over an intervening wire. -- Facsimile telegraph. See under Facsimile. -- Indicator telegraph. See under Indicator. -- Pan-telegraph, an electric telegraph by means of which a drawing or writing, as an autographic message, may be exactly reproduced at a distant station. -- Printing telegraph, an electric telegraph which automatically prints the message as it is received at a distant station, in letters, not signs. -- Signal telegraph, a telegraph in which preconcerted signals, made by a machine, or otherwise, at one station, are seen or heard and interpreted at another; a semaphore. -- Submarine telegraph cable, a telegraph cable laid under water to connect stations separated by a body of water. -- Telegraph cable, a telegraphic cable consisting of several conducting wires, inclosed by an insulating and protecting material, so as to bring the wires into compact compass for use on poles, or to form a strong cable impervious to water, to be laid under ground, as in a town or city, or under water, as in the ocean. -- Telegraph plant (Bot.), a leguminous plant (Desmodium gyrans) native of the East Indies. The leaflets move up and down like the signals of a semaphore.\n\nTo convey or announce by telegraph."}