{"word":"tell","definition":"1. To mention one by one, or piece by piece; to recount; to enumerate; to reckon; to number; to count; as, to tell money. \"An heap of coin he told.\" Spenser. He telleth the number of the stars. Ps. cxlvii. 4. Tell the joints of the body. Jer. Taylor. 2. To utter or recite in detail; to give an account of; to narrate. Of which I shall tell all the array. Chaucer. And not a man appears to tell their fate. Pope. 3. To make known; to publish; to disclose; to divulge. Why didst thou not tell me that she was thy wife Gen. xii. 18. 4. To give instruction to; to make report to; to acquaint; to teach; to inform. A secret pilgrimage, That you to-day promised to tell me of Shak. 5. To order; to request; to command. He told her not to be frightened. Dickens. 6. To discern so as to report; to ascertain by observing; to find out; to discover; as, I can not tell where one color ends and the other begins. 7. To make account of; to regard; to reckon; to value; to estimate. [Obs.] I ne told no dainity of her love. Chaucer. Note: Tell, though equivalent in some respect to speak and say, has not always the same application. We say, to tell truth or falsehood, to tell a number, to tell the reasons, to tell something or nothing; but we never say, to tell a speech, discourse, or oration, or to tell an argument or a lesson. It is much used in commands; as, tell me the whole story; tell me all you know. To tell off, to count; to divide. Sir W. Scott. Syn. -- To communicate; impart; reveal; disclose; inform; acquaint; report; repeat; rehearse; recite.\n\n1. To give an account; to make report. That I may publish with the voice of thankgiving, and tell of all thy wondrous works. Ps. xxvi. 7. 2. To take effect; to produce a marked effect; as, every shot tells; every expression tells. To tell of. (a) To speak of; to mention; to narrate or describe. (b) To inform against; to disclose some fault of. -- To tell on, to inform against. [Archaic & Colloq.] Lest they should tell on us, saying, So did David. 1 Sam. xxvii. 11.\n\nThat which is told; tale; account. [R.] I am at the end of my tell. Walpole.\n\nA hill or mound. W. M. Thomson."}