{"word":"term","definition":"1. That which limits the extent of anything; limit; extremity; bound; boundary. Corruption is a reciprocal to generation, and they two are as nature's two terms, or boundaries. Bacon. 2. The time for which anything lasts; any limited time; as, a term of five years; the term of life. 3. In universities, schools, etc., a definite continuous period during which instruction is regularly given to students; as, the school year is divided into three terms. 4. (Geom.)  A point, line, or superficies, that limits; as, a line is the term of a superficies, and a superficies is the term of a solid. 5. (Law)  A fixed period of time; a prescribed duration; as: (a) The limitation of an estate; or rather, the whole time for which an estate is granted, as for the term of a life or lives, or for a term of years. (b) A space of time granted to a debtor for discharging his obligation. (c) The time in which a court is held or is open for the trial of causes. Bouvier. Note: In England, there were formerly four terms in the year, during which the superior courts were open: Hilary term, beginning on the 11th and ending on the 31st of January; Easter term, beginning on the 15th of April, and ending on the 8th of May; Trinity term, beginning on the 22d day of May, and ending on the 12th of June; Michaelmas term, beginning on the 2d and ending on the 25th day of November. The rest of the year was called vacation. But this division has been practically abolished by the Judicature Acts of 1873, 1875, which provide for the more convenient arrangement of the terms and vacations. In the United States, the terms to be observed by the tribunals of justice are prescribed by the statutes of Congress and of the several States. 6. (Logic)  The subject or the predicate of a proposition; one of the three component parts of a syllogism, each one of which is used twice. The subject and predicate of a proposition are, after Aristotle, together called its terms or extremes. Sir W. Hamilton. Note: The predicate of the conclusion is called the major term, because it is the most general, and the subject of the conclusion is called the minor term, because it is less general. These are called the extermes; and the third term, introduced as a common measure between them, is called the mean or middle term. Thus in the following syllogism, --Every vegetable is combustible; Every tree is a vegetable; Therefore every tree is combustible, -combustible, the predicate of the conclusion, is the major term; tree is the minor term; vegetable is the middle term. 7. A word or expression; specifically, one that has a precisely limited meaning in certain relations and uses, or is peculiar to a science, art, profession, or the like; as, a technical term. \"Terms quaint of law.\" Chaucer. In painting, the greatest beauties can not always be expressed for want of terms. Dryden. 8. (Arch.)  A quadrangular pillar, adorned on the top with the figure of a head, as of a man, woman, or satyr; -- called also terminal figure. See Terminus, n., 2 and 3. Note: The pillar part frequently tapers downward, or is narrowest at the base. Terms rudely carved were formerly used for landmarks or boundaries. Gwilt. 9. (Alg.)  A member of a compound quantity; as, a or b in a + b; ab or cd in ab - cd. 10. pl. (Med.)  The menses. 11. pl. (Law)  Propositions or promises, as in contracts, which, when assented to or accepted by another, settle the contract and bind the parties; conditions. 12. (Law)  In Scotland, the time fixed for the payment of rents. Note: Terms legal and conventional in Scotland correspond to quarter days in England and Ireland. There are two legal terms -- Whitsunday, May 15, and Martinmas, Nov. 11; and two conventional terms -- Candlemas, Feb. 2, and Lammas day, Aug. 1. Mozley & W. 13. (Naut.)  A piece of carved work placed under each end of the taffrail. J. Knowels. In term, in set terms; in formal phrase. [Obs.] I can not speak in term. Chaucer. -- Term fee (Law) (a), a fee by the term, chargeable to a suitor, or by law fixed and taxable in the costs of a cause for each or any term it is in court. -- Terms of a proportion (Math.), the four members of which it is composed. -- To bring to terms, to compel (one) to agree, assent, or submit; to force (one) to come to terms. -- To make terms, to come to terms; to make an agreement: to agree. Syn. -- Limit; bound; boundary; condition; stipulation; word; expression. -- Term, Word. These are more frequently interchanged than almost any other vocables that occur of the language. There is, however, a difference between them which is worthy of being kept in mind. Word is generic; it denotes an utterance which represents or expresses our thoughts and feelings. Term originally denoted one of the two essential members of a proposition in logic, and hence signifies a word of specific meaning, and applicable to a definite class of objects. Thus, we may speak of a scientific or a technical term, and of stating things in distinct terms. Thus we say, \"the term minister literally denotes servant;\" \"an exact definition of terms is essential to clearness of thought;\" \"no term of reproach can sufficiently express my indignation;\" \"every art has its peculiar and distinctive terms,\" etc. So also we say, \"purity of style depends on the choice of words, and precision of style on a clear understanding of the terms used.\" Term is chiefly applied to verbs, nouns, and adjectives, these being capable of standing as terms in a logical proposition; while prepositions and conjunctions, which can never be so employed, are rarely spoken of as terms, but simply as words.\n\nTo apply a term to; to name; to call; to denominate. Men term what is beyond the limits of the universe \"imaginary space.\" Locke."}