{"word":"that","definition":"1. As a demonstrative pronoun (pl. Those), that usually points out, or refers to, a person or thing previously mentioned, or supposed to be understood. That, as a demonstrative, may precede the noun to which it refers; as, that which he has said is true; those in the basket are good apples. The early fame of Gratian was equal to that of the most celebrated princes. Gibbon. Note: That may refer to an entire sentence or paragraph, and not merely to a word. It usually follows, but sometimes precedes, the sentence referred to. That be far from thee, to do after this manner, to slay the righteous with the wicked. Gen. xviii. 25. And when Moses heard that, he was content. Lev. x. 20. I will know your business, Harry, that I will. Shak. Note: That is often used in opposition to this, or by way of distinction, and in such cases this, like the Latin hic and French ceci, generally refers to that which is nearer, and that, like Latin ille and French cela, to that which is more remote. When they refer to foreign words or phrases, this generally refers to the latter, and that to the former. Two principles in human nature reign; Self-love, to urge, and Reason, to restrain; Nor this a good, nor that a bad we call. Pope. If the Lord will, we shall live, and do this or that. James iv. 16. 2. As an adjective, that has the same demonstrative force as the pronoun, but is followed by a noun. It shall be more tolerable for Sodom and Gomorrah in the day of judgment, than for that city. Matt. x. 15. The woman was made whole from that hour. Matt. ix. 22. Note: That was formerly sometimes used with the force of the article the, especially in the phrases that one, that other, which were subsequently corrupted into th'tone, th'tother (now written t'other). Upon a day out riden knightes two . . . That one of them came home, that other not. Chaucer. 3. As a relative pronoun, that is equivalent to who or which, serving to point out, and make definite, a person or thing spoken of, or alluded to, before, and may be either singular or plural. He that reproveth a scorner getteth to himself shame. Prov. ix. 7. A judgment that is equal and impartial must incline to the greater probabilities. Bp. Wilkins. Note: If the relative clause simply conveys an additional idea, and is not properly explanatory or restrictive, who or which (rarely that) is employed; as, the king that (or who) rules well is generally popular; Victoria, who (not that) rules well, enjoys the confidence of her subjects. Ambiguity may in some cases be avoided in the use of that (which is restrictive) instead of who or which, likely to be understood in a coördinating sense. Bain. That was formerly used for that which, as what is now; but such use is now archaic. We speak that we do know, and testify that we have seen. John iii. 11. That I have done it is thyself to wite [blame]. Chaucer. That, as a relative pronoun, cannot be governed by a preposition preceding it, but may be governed by one at the end of the sentence which it commences. The ship that somebody was sailing in. Sir W. Scott. In Old English, that was often used with the demonstratives he, his, him, etc., and the two together had the force of a relative pronoun; thus, that he = who; that his = whose; that him = whom. I saw to-day a corpse yborn to church That now on Monday last I saw him wirche [work]. Chaucer. Formerly, that was used, where we now commonly use which, as a relative pronoun with the demonstrative pronoun that as its antecedent. That that dieth, let it die; and that that is to cut off, let it be cut off. Zech. xi. 9. 4. As a conjunction, that retains much of its force as a demonstrative pronoun. It is used, specifically: -- (a) To introduce a clause employed as the object of the preceding verb, or as the subject or predicate nominative of a verb. She tells them 't is a causeless fantasy, And childish error, that they are afraid. Shak. I have shewed before, that a mere possibility to the contrary, can by no means hinder a thing from being highly credible. Bp. Wilkins. (b) To introduce, a reason or cause; -- equivalent to for that, in that, for the reason that, because. He does hear me; And that he does, I weep. Shak. (c) To introduce a purpose; -- usually followed by may, or might, and frequently preceded by so, in order, to the end, etc. These things I say, that ye might be saved. John v. 34. To the end that he may prolong his days. Deut. xvii. 20. (d) To introduce a consequence, result, or effect; -- usually preceded by so or such, sometimes by that. The birds their notes renew, and bleating herds Attest their joy, that hill and valley rings. Milton. He gazed so long That both his eyes were dazzled. Tennyson. (e) To introduce a clause denoting time; -- equivalent to in which time, at which time, when. So wept Duessa until eventide, That shining lamps in Jove's high course were lit. Spenser. Is not this the day That Hermia should give answer of her choice Shak. (f) In an elliptical sentence to introduce a dependent sentence expressing a wish, or a cause of surprise, indignation, or the like. Ha, cousin Silence, that thou hadst seen that that this knight and I have seen! Shak. O God, that right should thus overcome might! Shak. Note: That was formerly added to other conjunctions or to adverbs to make them emphatic. To try if that our own be ours or no. Shak. That is sometimes used to connect a clause with a preceding conjunction on which it depends. When he had carried Rome and that we looked For no less spoil than glory. Shak. 5. As adverb: To such a degree; so; as, he was that frightened he could say nothing. [Archaic or in illiteral use.] All that, everything of that kind; all that sort. With singing, laughing, ogling, and all that. Pope. The rank is but the guinea's stamp, The man's the gowd [gold] for a'that. Burns. -- For that. See under For, prep. -- In that. See under In, prep."}