{"word":"think","definition":"1. To seem or appear; -- used chiefly in the expressions methinketh or methinks, and methought. Note: These are genuine Anglo-Saxon expressions, equivalent to it seems to me, it seemed to me. In these expressions me is in the dative case. 2. To employ any of the intellectual powers except that of simple perception through the senses; to exercise the higher intellectual faculties. For that I am I know, because I think. Dryden. 3. Specifically: -- (a) To call anything to mind; to remember; as, I would have sent the books, but I did not think of it. Well thought upon; I have it here. Shak. (b) To reflect upon any subject; to muse; to meditate; to ponder; to consider; to deliberate. And when he thought thereon, he wept. Mark xiv. 72. He thought within himself, saying, What shall I do, because I have no room where to bestow my fruits Luke xii. 17. (c) To form an opinion by reasoning; to judge; to conclude; to believe; as, I think it will rain to-morrow. Let them marry to whom they think best. Num. xxxvi. 6. (d) To purpose; to intend; to design; to mean. I thought to promote thee unto great honor. Num. xxiv. 11. Thou thought'st to help me. Shak. (e) To presume; to venture. Think not to say within yourselves, We have Abraham to our father. Matt. iii. 9. Note: To think, in a philosophical use as yet somewhat limited, designates the higher intellectual acts, the acts preëminently rational; to judge; to compare; to reason. Thinking is employed by Hamilton as \"comprehending all our collective energies.\" It is defined by Mansel as \"the act of knowing or judging by means of concepts,\"by Lotze as \"the reaction of the mind on the material supplied by external influences.\" See Thought. To think better of. See under Better. -- To think much of, or To think well of, to hold in esteem; to esteem highly. Syn. -- To expect; guess; cogitate; reflect; ponder; contemplate; meditate; muse; imagine; suppose; believe. See Expect, Guess.\n\n1. To conceive; to imagine. Charity . . . thinketh no evil. 1 Cor. xiii. 4,5. 2. To plan or design; to plot; to compass. [Obs.] So little womanhood And natural goodness, as to think the death Of her own son. Beau. & Fl. 3. To believe; to consider; to esteem. Nor think superfluous other's aid. Milton. To think much, to esteem a great matter; to grudge. [Obs.] \"[He] thought not much to clothe his enemies.\" Milton. -- To think scorn. (a) To disdain. [Obs.] \"He thought scorn to lay hands on Mordecai alone.\" Esther iii. 6. (b) To feel indignation. [Obs.]"}