{"word":"ticket","definition":"A small piece of paper, cardboard, or the like, serving as a notice, certificate, or distinguishing token of something. Specifically: -- (a) A little note or notice. [Obs. or Local] He constantly read his lectures twice a week for above forty years, giving notice of the time to his auditors in a ticket on the school doors. Fuller. (b) A tradesman's bill or account. [Obs.] Note: Hence the phrase on ticket, on account; whence, by abbreviation, came the phrase on tick. See 1st Tick. Your courtier is mad to take up silks and velvets On ticket for his mistress. J. Cotgrave. (c) A certificate or token of right of admission to a place of assembly, or of passage in a public conveyance; as, a theater ticket; a railroad or steamboat ticket. (d) A label to show the character or price of goods. (e) A certificate or token of a share in a lottery or other scheme for distributing money, goods, or the like. (f) (Politics) A printed list of candidates to be voted for at an election; a set of nominations by one party for election; a ballot. [U.S.] The old ticket forever! We have it by thirty-four votes. Sarah Franklin (1766). Scratched ticket, a ticket from which the names of one or more of the candidates are scratched out. -- Split ticket, a ticket representing different divisions of a party, or containing candidates selected from two or more parties. -- Straight ticket, a ticket containing the regular nominations of a party, without change. -- Ticket day (Com.), the day before the settling or pay day on the stock exchange, when the names of the actual purchasers are rendered in by one stockbroker to another. [Eng.] Simmonds. -- Ticket of leave, a license or permit given to a convict, or prisoner of the crown, to go at large, and to labor for himself before the expiration of his sentence, subject to certain specific conditions. [Eng.] Simmonds. -- Ticket porter, a licensed porter wearing a badge by which he may be identified. [Eng.]\n\n1. To distinguish by a ticket; to put a ticket on; as, to ticket goods. 2. To furnish with a tickets; to book; as, to ticket passengers to California. [U.S.]"}