{"word":"tide","definition":"1. Time; period; season. [Obsoles.] \"This lusty summer's tide.\" Chaucer. And rest their weary limbs a tide. Spenser. Which, at the appointed tide, Each one did make his bride. Spenser. At the tide of Christ his birth. Fuller. 2. The alternate rising and falling of the waters of the ocean, and of bays, rivers, etc., connected therewith. The tide ebbs and flows twice in each lunar day, or the space of a little more than twenty- four hours. It is occasioned by the attraction of the sun and moon (the influence of the latter being three times that of the former), acting unequally on the waters in different parts of the earth, thus disturbing their equilibrium. A high tide upon one side of the earth is accompanied by a high tide upon the opposite side. Hence, when the sun and moon are in conjunction or opposition, as at new moon and full moon, their action is such as to produce a greater than the usual tide, called the spring tide, as represented in the cut. When the moon is in the first or third quarter, the sun's attraction in part counteracts the effect of the moon's attraction, thus producing under the moon a smaller tide than usual, called the neap tide. Note: The flow or rising of the water is called flood tide, and the reflux, ebb tide. 3. A stream; current; flood; as, a tide of blood. \"Let in the tide of knaves once more; my cook and I'll provide.\" Shak. 4. Tendency or direction of causes, influences, or events; course; current. There is a tide in the affairs of men, Which, taken at the flood, leads on to fortune. Shak. 5. Violent confluence. [Obs.] Bacon. 6. (Mining)  The period of twelve hours. Atmospheric tides, tidal movements of the atmosphere similar to those of the ocean, and produced in the same manner by the attractive forces of the sun and moon. -- Inferior tide. See under Inferior, a. -- To work double tides. See under Work, v. t. -- Tide day, the interval between the occurrences of two consecutive maxima of the resultant wave at the same place. Its length varies as the components of sun and moon waves approach to, or recede from, one another. A retardation from this cause is called the lagging of the tide, while the acceleration of the recurrence of high water is termed the priming of the tide. See Lag of the tide, under 2d Lag. -- Tide dial, a dial to exhibit the state of the tides at any time. -- Tide gate. (a) An opening through which water may flow freely when the tide sets in one direction, but which closes automatically and prevents the water from flowing in the other direction. (b) (Naut.) A place where the tide runs with great velocity, as through a gate. -- Tide gauge, a gauge for showing the height of the tide; especially, a contrivance for registering the state of the tide continuously at every instant of time. Brande & C. -- Tide lock, a lock situated between an inclosed basin, or a canal, and the tide water of a harbor or river, when they are on different levels, so that craft can pass either way at all times of the tide; - - called also guard lock. -- Tide mill. (a) A mill operated by the tidal currents. (b) A mill for clearing lands from tide water. -- Tide rip, a body of water made rough by the conflict of opposing tides or currents. -- Tide table, a table giving the time of the rise and fall of the tide at any place. -- Tide water, water affected by the flow of the tide; hence, broadly, the seaboard. -- Tide wave, or Tidal wave, the swell of water as the tide moves. That of the ocean is called primitive; that of bays or channels derivative. Whewell. -- Tide wheel, a water wheel so constructed as to be moved by the ebb or flow of the tide.\n\nTo cause to float with the tide; to drive or carry with the tide or stream. They are tided down the stream. Feltham.\n\n1. To betide; to happen. [Obs.] What should us tide of this new law Chaucer. 2. To pour a tide or flood. 3. (Naut.)  To work into or out of a river or harbor by drifting with the tide and anchoring when it becomes adverse."}