{"word":"tie","definition":"1. A knot; a fastening. 2. A bond; an obligation, moral or legal; as, the sacred ties of friendship or of duty; the ties of allegiance. No distance breaks the tie of blood. Young. 3. A knot of hair, as at the back of a wig. Young. 4. An equality in numbers, as of votes, scores, etc., which prevents either party from being victorious; equality in any contest, as a race. 5. (Arch. & Engin.)  A beam or rod for holding two parts together; in railways, one of the transverse timbers which support the track and keep it in place. 6. (Mus.)  A line, usually straight, drawn across the stems of notes, or a curved line written over or under the notes, signifying that they are to be slurred, or closely united in the performance, or that two notes of the same pitch are to be sounded as one; a bind; a ligature. 7. pl.  Low shoes fastened with lacings. Bale tie, a fastening for the ends of a hoop for a bale.\n\n1. To fasten with a band or cord and knot; to bind. \"Tie the kine to the cart.\" 1 Sam. vi. 7. My son, keep thy father's commandment, and forsake not the law of thy mother: bind them continually upon thine heart, and tie them about thy neck. Prov. vi. 20,21. 2. To form, as a knot, by interlacing or complicating a cord; also, to interlace, or form a knot in; as, to tie a cord to a tree; to knit; to knot. \"We do not tie this knot with an intention to puzzle the argument.\" Bp. Burnet. 3. To unite firmly; to fasten; to hold. In bond of virtuous love together tied. Fairfax. 4. To hold or constrain by authority or moral influence, as by knotted cords; to oblige; to constrain; to restrain; to confine. Not tied to rules of policy, you find Revenge less sweet than a forgiving mind. Dryden. 5. (Mus.)  To unite, as notes, by a cross line, or by a curved line, or slur, drawn over or under them. 6. To make an equal score with, in a contest; to be even with. To ride and tie. See under Ride. -- To tie down. (a) To fasten so as to prevent from rising. (b) To restrain; to confine; to hinder from action. -- To tie up, to confine; to restrain; to hinder from motion or action.\n\nTo make a tie; to make an equal score."}