{"word":"timber","definition":"A certain quantity of fur skins, as of martens, ermines, sables, etc., packed between boards; being in some cases forty skins, in others one hundred and twenty; -- called also timmer. [Written also timbre.]\n\nThe crest on a coat of arms. [Written also timbre.]\n\nTo surmount as a timber does. [Obs.]\n\n1. That sort of wood which is proper for buildings or for tools, utensils, furniture, carriages, fences, ships, and the like; -- usually said of felled trees, but sometimes of those standing. Cf. Lumber, 3. And ta'en my fiddle to the gate, . . . And fiddled in the timber! Tennyson. 2. The body, stem, or trunk of a tree. 3. Fig.: Material for any structure. Such dispositions are the very errors of human nature; and yet they are the fittest timber to make politics of. Bacon. 4. A single piece or squared stick of wood intended for building, or already framed; collectively, the larger pieces or sticks of wood, forming the framework of a house, ship, or other structure, in distinction from the covering or boarding. So they prepared timber . . . to build the house. 1 Kings v. 18. Many of the timbers were decayed. W. Coxe. 5. Woods or forest; wooden land. [Western U.S.] 6. (Shipbuilding)  A rib, or a curving piece of wood, branching outward from the keel and bending upward in a vertical direction. One timber is composed of several pieces united. Timber and room. (Shipbuilding) Same as Room and space. See under Room. -- Timber beetle (Zoöl.), any one of numerous species of beetles the larvæ of which bore in timber; as, the silky timber beetle (Lymexylon sericeum). -- Timber doodle (Zoöl.), the American woodcock. [Local, U.S.] -- Timber grouse (Zoöl.), any species of grouse that inhabits woods, as the ruffed grouse and spruce partridge; -- distinguished from prairie grouse. -- Timber hitch (Naut.), a kind of hitch used for temporarily marking fast a rope to a spar. See Illust. under Hitch. -- Timber mare, a kind of instrument upon which soldiers were formerly compelled to ride for punishment. Johnson. -- Timber scribe, a metal tool or pointed instrument for marking timber. Simmonds. -- Timber sow. (Zoöl.) Same as Timber worm, below. Bacon. -- Timber tree, a tree suitable for timber. -- Timber worm (Zoöl.), any larval insect which burrows in timber. -- Timber yard, a yard or place where timber is deposited.\n\nTo furnish with timber; -- chiefly used in the past participle. His bark is stoutly timbered. Shak.\n\n1. To light on a tree. [Obs.] 2. (Falconry)  To make a nest."}