{"word":"tincture","definition":"1. A tinge or shade of color; a tint; as, a tincture of red. 2. (Her.)  One of the metals, colors, or furs used in armory. Note: There are two metals: gold, called or, and represented in engraving by a white surface covered with small dots; and silver, called argent, and represented by a plain white surface. The colors and their representations are as follows: red, called gules, or a shading of vertical lines; blue, called azure, or horizontal lines; black, called sable, or horizontal and vertical lines crossing; green, called vert, or diagonal lines from dexter chief corner; purple, called purpure, or diagonal lines from sinister chief corner. The furs are ermine, ermines, erminois, pean, vair, counter vair, potent, and counter potent. See Illustration in Appendix. 3. The finer and more volatile parts of a substance, separated by a solvent; an extract of a part of the substance of a body communicated to the solvent. 4. (Med.)  A solution (commonly colored) of medicinal substance in alcohol, usually more or less diluted; spirit containing medicinal substances in solution. Note: According to the United States Pharmacopoeia, the term tincture (also called alcoholic tincture, and spirituous tincture) is reserved for the alcoholic solutions of nonvolatile substances, alcoholic solutions of volatile substances being called spirits. Ethereal tincture, a solution of medicinal substance in ether. 5. A slight taste superadded to any substance; as, a tincture of orange peel. 6. A slight quality added to anything; a tinge; as, a tincture of French manners. All manners take a tincture from our own. Pope. Every man had a slight tincture of soldiership, and scarcely any man more than a slight tincture. Macaulay.\n\n1. To communicate a slight foreign color to; to tinge; to impregnate with some extraneous matter. A little black paint will tincture and spoil twenty gay colors. I. Watts. 2. To imbue the mind of; to communicate a portion of anything foreign to; to tinge. The stain of habitual sin may thoroughly tincture all our soul. Barrow."}