{"word":"tongue","definition":"1. (Anat.)  an organ situated in the floor of the mouth of most vertebrates and connected with the hyoid arch. Note: The tongue is usually muscular, mobile, and free at one extremity, and in man other mammals is the principal organ of taste, aids in the prehension of food, in swallowing, and in modifying the voice as in speech. To make his English sweet upon his tongue. Chaucer. 2. The power of articulate utterance; speech. Parrots imitating human tongue. Dryden. 3. Discourse; fluency of speech or expression. Much tongue and much judgment seldom go together. L. Estrange. 4. Honorable discourse; eulogy. [Obs.] She was born noble; let that title find her a private grave, but neither tongue nor honor. Beau. & Fl. 5. A language; the whole sum of words used by a particular nation; as, the English tongue. Chaucer. Whose tongue thou shalt not understand. Deut. xxviii. 49. To speak all tongues. Milton. 6. Speech; words or declarations only; -- opposed to thoughts or actions. My little children, let us love in word, neither in tongue, but in deed and in truth. 1 John iii. 18. 7. A people having a distinct language. A will gather all nations and tongues. Isa. lxvi. 18. 8. (Zoöl.) (a) The lingual ribbon, or odontophore, of a mollusk. (b) The proboscis of a moth or a butterfly. (c) The lingua of an insect. 9. (Zoöl.)  Any small sole. 10. That which is considered as resembing an animal's tongue, in position or form. Specifically: -- (a) A projection, or slender appendage or fixture; as, the tongue of a buckle, or of a balance. (b) A projection on the side, as of a board, which fits into a groove. (c) A point, or long, narrow strip of land, projecting from the mainland into a sea or a lake. (d) The pole of a vehicle; especially, the pole of an ox cart, to the end of which the oxen are yoked. (e) The clapper of a bell. (f) (Naut.) A sort piece of rope spliced into the upper part of standing backstays, etc.; also. the upper main piece of a mast composed of several pieces. (g) (Mus.) Same as Reed, n., 5. To hold the tongue, to be silent. -- Tongue bone (Anat.), the hyoid bone. -- Tongue grafting. See under Grafting. Syn. -- Language; speech; expression. See Language.\n\n1. To speak; to utter. \"Such stuff as madmen tongue.\" Shak. 2. To chide; to scold. How might she tongue me. Shak . 3. (Mus.)  To modulate or modify with the tongue, as notes, in playing the flute and some other wind instruments. 4. To join means of a tongue and grove; as, to tongue boards together.\n\n1. To talk; to prate. Dryden. 2. (Mus.)  To use the tongue in forming the notes, as in playing the flute and some other wind instruments."}