{"word":"touch","definition":"1. To come in contact with; to hit or strike lightly against; to extend the hand, foot, or the like, so as to reach or rest on. Him thus intent Ithuriel with his spear Touched lightly. Milton. 2. To perceive by the sense of feeling. Nothing but body can be touched or touch. Greech. 3. To come to; to reach; to attain to. The god, vindictive, doomed them never more-Ah, men unblessed! -- to touch their natal shore. Pope. 4. To try; to prove, as with a touchstone. [Obs.] Wherein I mean to touch your love indeed. Shak. 5. To relate to; to concern; to affect. The quarrel toucheth none but us alone. Shak. 6. To handle, speak of, or deal with; to treat of. Storial thing that toucheth gentilesse. Chaucer. 7. To meddle or interfere with; as, I have not touched the books. Pope. 8. To affect the senses or the sensibility of; to move; to melt; to soften. What of sweet before Hath touched my sense, flat seems to this and harsh. Milton. The tender sire was touched with what he said. Addison. 9. To mark or delineate with touches; to add a slight stroke to with the pencil or brush. The lines, though touched but faintly, are drawn right. Pope. 10. To infect; to affect slightly. Bacon. 11. To make an impression on; to have effect upon. Its face . . . so hard that a file will not touch it. Moxon. 12. To strike; to manipulate; to play on; as, to touch an instrument of music. [They] touched their golden harps. Milton. 13. To perform, as a tune; to play. A person is the royal retinue touched a light and lively air on the flageolet. Sir W. Scott. 14. To influence by impulse; to impel forcibly. \" No decree of mine, . . . [to] touch with lightest moment of impulse his free will,\" Milton. 15. To harm, afflict, or distress. Let us make a covenant with thee, that thou wilt do us no hurt, as we have not touched thee. Gen. xxvi. 28, 29. 16. To affect with insanity, especially in a slight degree; to make partially insane; -- rarely used except in the past participle. She feared his head was a little touched. Ld. Lytton. 17. (Geom.)  To be tangent to. See Tangent, a. 18. To lay a hand upon for curing disease. To touch a sail (Naut.), to bring it so close to the wind that its weather leech shakes. -- To touch the wind (Naut.), to keep the ship as near the wind as possible. -- To touch up, to repair; to improve by touches or emendation.\n\n1. To be in contact; to be in a state of junction, so that no space is between; as, two spheres touch only at points. Johnson. 2. To fasten; to take effect; to make impression. [R.] Strong waters pierce metals, and will touch upon gold, that will not touch upon silver. Bacon. 3. To treat anything in discourse, especially in a slight or casual manner; -- often with on or upon. If the antiquaries have touched upon it, they immediately quitted it. Addison. 4. (Naut)  To be brought, as a sail, so close to the wind that its weather leech shakes. To touch and go (Naut.), to touch bottom lightly and without damage, as a vessel in motion. -- To touch at, to come or go to, without tarrying; as, the ship touched at Lisbon. -- To touch on or upon, to come or go to for a short time. [R.] I made a little voyage round the lake, and touched on the several towns that lie on its coasts. Addison.\n\n1. The act of touching, or the state of being touched; contact. Their touch affrights me as a serpent's sting. Shak. 2. (Physiol.)  The sense by which pressure or traction exerted on the skin is recognized; the sense by which the properties of bodies are determined by contact; the tactile sense. See Tactile sense, under Tactile. The spider's touch, how exquisitely fine. Pope. Note: Pure tactile feelings are necessarily rare, since temperature sensations and muscular sensations are more or less combined with them. The organs of touch are found chiefly in the epidermis of the skin and certain underlying nervous structures. 3. Act or power of exciting emotion. Not alone The death of Fulvia, with more urgent touches, Do strongly speak to us. Shak. 4. An emotion or affection. A true, natural, and a sensible touch of mercy. Hooker. 5. Personal reference or application. [Obs.] Speech of touch toward others should be sparingly used. Bacon. 6. A stroke; as, a touch of raillery; a satiric touch; hence, animadversion; censure; reproof. I never bare any touch of conscience with greater regret. Eikon Basilike. 7. A single stroke on a drawing or a picture. Never give the least touch with your pencil till you have well examined your design. Dryden. 8. Feature; lineament; trait. Of many faces, eyes, and hearts, To have the touches dearest prized. Shak. 9. The act of the hand on a musical instrument; bence, in the plural, musical notes. Soft stillness and the night Become the touches of sweet harmony. Shak. 10. A small quantity intermixed; a little; a dash. Eyes La touch of Sir Peter Lely in them. Hazlitt. Madam, I have a touch of your condition. Shak. 11. A hint; a suggestion; slight notice. A small touch will put him in mind of them. Bacon. 12. A slight and brief essay. [Colloq.] Print my preface in such form as, in the booksellers' phrase, will make a sixpenny touch. Swift. 13. A touchstone; hence, stone of the sort used for touchstone. [Obs.] \" Now do I play the touch.\" Shak. A neat new monument of touch and alabaster. Fuller. 14. Hence, examination or trial by some decisive standard; test; proof; tried quality. Equity, the true touch of all laws. Carew. Friends of noble touch . Shak. 15. (Mus.)  The particular or characteristic mode of action, or the resistance of the keys of an instrument to the fingers; as, a heavy touch, or a light touch, also, the manner of touching, striking, or pressing the keys of a piano; as, a legato touch; a staccato touch. 16. (Shipbilding)  The broadest part of a plank worked top and but (see Top and but, under Top, n.), or of one worked anchor-stock fashion (that is, tapered from the middle to both ends); also, the angles of the stern timbers at the counters. J. Knowles. 17. (Football)  That part of the field which is beyond the line of flags on either side. Encyc. of Rural Sports. 18. A boys' game; tag. In touch (Football), outside of bounds. T. Hughes. -- To be in touch, to be in contact, or in sympathy. -- To keep touch. (a) To be true or punctual to a promise or engagement [Obs.]; hence, to fulfill duly a function. My mind and senses keep touch and time. Sir W. Scott. (b) To keep in contact; to maintain connection or sympathy;-with with or of. -- Touch and go, a phrase descriptive of a narrow escape. -- True as touch (i.e., touchstone), quite true. [Obs.]"}