{"word":"trade","definition":"1. A track; a trail; a way; a path; also, passage; travel; resort. [Obs.] A postern with a blind wicket there was, A common trade to pass through Priam's house. Surrey. Hath tracted forth some salvage beastes trade. Spenser. Or, I'll be buried in the king's highway, Some way of common trade, where subjects' feet May hourly trample on their sovereign's head. Shak. 2. Course; custom; practice; occupation; employment. [Obs.] \"The right trade of religion.\" Udall. There those five sisters had continual trade. Spenser. Long did I love this lady, Long was my travel, long my trade to win her. Massinger. Thy sin's not accidental but a trade. Shak. 3. Business of any kind; matter of mutual consideration; affair; dealing. [Obs.] Have you any further trade with us Shak. 4. Specifically: The act or business of exchanging commodities by barter, or by buying and selling for money; commerce; traffic; barter. Note: Trade comprehends every species of exchange or dealing, either in the produce of land, in manufactures, in bills, or in money; but it is chiefly used to denote the barter or purchase and sale of goods, wares, and merchandise, either by wholesale or retail. Trade is either foreign or domestic. Foreign trade consists in the exportation and importation of goods, or the exchange of the commodities of different countries. Domestic, or home, trade is the exchange, or buying and selling, of goods within a country. Trade is also by the wholesale, that is, by the package or in large quantities, generally to be sold again, or it is by retail, or in small parcels. The carrying trade is the business of transporting commodities from one country to another, or between places in the same country, by land or water. 5. The business which a person has learned, and which he engages in, for procuring subsistence, or for profit; occupation; especially, mechanical employment as distinguished from the liberal arts, the learned professions, and agriculture; as, we speak of the trade of a smith, of a carpenter, or mason, but not now of the trade of a farmer, or a lawyer, or a physician. Accursed usury was all his trade. Spenser. The homely, slighted, shepherd's trade. Milton. I will instruct thee in my trade. Shak. 6. Instruments of any occupation. [Obs.] The house and household goods, his trade of war. Dryden. 7. A company of men engaged in the same occupation; thus, booksellers and publishers speak of the customs of the trade, and are collectively designated as the trade. 8. pl.  The trade winds. 9. Refuse or rubbish from a mine. [Prov. Eng.] Syn. -- Profession; occupation; office; calling; avocation; employment; commerce; dealing; traffic. Board of trade. See under Board. -- Trade dollar. See under Dollar. -- Trade price, the price at which goods are sold to members of the same trade, or by wholesale dealers to retailers. Trade sale, an auction by and for the trade, especially that of the booksellers. -- Trade wind, a wind in the torrid zone, and often a little beyond at, which blows from the same quarter throughout the year, except when affected by local causes; -- so called because of its usefulness to navigators, and hence to trade. Note: The general direction of the trade winds is from N. E. to S. W. on the north side of the equator, and from S. E. to N. W. on the south side of the equator. They are produced by the joint effect of the rotation of the earth and the movement of the air from the polar toward the equatorial regions, to supply the vacancy caused by heating, rarefaction, and consequent ascent of the air in the latter regions. The trade winds are principally limited to two belts in the tropical regions, one on each side of the equator, and separated by a belt which is characterized by calms or variable weather.\n\n1. To barter, or to buy and sell; to be engaged in the exchange, purchase, or sale of goods, wares, merchandise, or anything else; to traffic; to bargain; to carry on commerce as a business. A free port, where nations . . . resorted with their goods and traded. Arbuthnot. 2. To buy and sell or exchange property in a single instance. 3. To have dealings; to be concerned or associated; -- usually followed by with. How did you dare to trade and traffic with Macbeth Shak.\n\nTo sell or exchange in commerce; to barter. They traded the persons of men. Ezek. xxvii. 13. To dicker and to swop, to trade rifles and watches. Cooper.\n\nimp. of Tread."}