{"word":"transcendental","definition":"1. Supereminent; surpassing others; as, transcendental being or qualities. 2. (Philos.)  In the Kantian system, of or pertaining to that which can be determined a priori in regard to the fundamental principles of all human knowledge. What is transcendental, therefore, transcends empiricism; but is does not transcend all human knowledge, or become transcendent. It simply signifies the a priori or necessary conditions of experience which, though affording the conditions of experience, transcend the sphere of that contingent knowledge which is acquired by experience. 3. Vaguely and ambitiously extravagant in speculation, imagery, or diction. Note: In mathematics, a quantity is said to be transcendental relative to another quantity when it is expressed as a transcendental function of the latter; thus, ax, 102x, log x, sin x, tan x, etc., are transcendental relative to x. Transcendental curve (Math.), a curve in which one ordinate is a transcendental function of the other. -- Transcendental equation (Math.), an equation into which a transcendental function of one of the unknown or variable quantities enters. -- Transcendental function. (Math.) See under Function. Syn. -- Transcendental, Empirical. These terms, with the corresponding nouns, transcendentalism and empiricism, are of comparatively recent origin. Empirical refers to knowledge which is gained by the experience of actual phenomena, without reference to the principles or laws to which they are to be referred, or by which they are to be explained. Transcendental has reference to those beliefs or principles which are not derived from experience, and yet are absolutely necessary to make experience possible or useful. Such, in the better sense of the term, is the transcendental philosophy, or transcendentalism. Each of these words is also used in a bad sense, empiricism applying to that one-sided view of knowledge which neglects or loses sight of the truths or principles referred to above, and trusts to experience alone; transcendentalism, to the opposite extreme, which, in its deprecation of experience, loses sight of the relations which facts and phenomena sustain to principles, and hence to a kind of philosophy, or a use of language, which is vague, obscure, fantastic, or extravagant.\n\nA transcendentalist. [Obs.]"}