{"word":"tread","definition":"1. To set the foot; to step. Where'er you tread, the blushing flowers shall rise. Pope. Fools rush in where angels fear to tread. Pope. The hard stone Under our feet, on which we tread and go. Chaucer. 2. To walk or go; especially, to walk with a stately or a cautious step. Ye that . . . stately tread, or lowly creep. Milton. 3. To copulate; said of birds, esp. the males. Shak. To tread on or upon. (a) To trample; to set the foot on in contempt. \"Thou shalt tread upon their high places.\" Deut. xxxiii. 29. (b) to follow closely. \"Year treads on year.\" Wordsworth. -- To tread upon the heels of, to follow close upon. \"Dreadful consequences that tread upon the heels of those allowances to sin.\" Milton. One woe doth tread upon another's heel. Shak.\n\n1. To step or walk on. Forbid to tread the promised land he saw. Prior. Methought she trod the ground with greater grace. Dryden. 2. To beat or press with the feet; as, to tread a path; to tread land when too light; a well-trodden path. 3. To go through or accomplish by walking, dancing, or the like. \" I am resolved to forsake Malta, tread a pilgrimage to fair Jerusalem.\" Beau. & Fl. They have measured many a mile, To tread a measure with you on this grass. Shak. 4. To crush under the foot; to trample in contempt or hatred; to subdue. Through thy name will we tread them under that rise up against us. Ps. xliv. 5. 5. To copulate with; to feather; to cover; -- said of the male bird. Chaucer. To tread out, to press out with the feet; to press out, as wine or wheat; as, to tread out grain with cattle or horses. -- To tread the stage, to act as a stageplayer; to perform a part in a drama.\n\n1. A step or stepping; pressure with the foot; a footstep; as, a nimble tread; a cautious tread. She is coming, my own, my sweet; Were it ever so airy a tread, My heart would hear her and beat. Tennyson. 2. Manner or style of stepping; action; gait; as, the horse has a good tread. 3. Way; track; path. [R.] Shak. 4. The act of copulation in birds. 5. (Arch.)  The upper horizontal part of a step, on which the foot is placed. 6. (Fort.)  The top of the banquette, on which soldiers stand to fire over the parapet. 7. (Mach.) (a) The part of a wheel that bears upon the road or rail. (b) The part of a rail upon which car wheels bear. 8. (Biol.)  The chalaza of a bird's egg; the treadle. 9. (Far.)  A bruise or abrasion produced on the foot or ankle of a horse that interferes. See Interfere, 3."}