{"word":"trunk","definition":"1. The stem, or body, of a tree, apart from its limbs and roots; the main stem, without the branches; stock; stalk. About the mossy trunk I wound me soon, For, high from ground, the branches would require Thy utmost reach. Milton. 2. The body of an animal, apart from the head and limbs. 3. The main body of anything; as, the trunk of a vein or of an artery, as distinct from the branches. 4. (Arch)  That part of a pilaster which is between the base and the capital, corresponding to the shaft of a column. 5. (Zoöl.)  That segment of the body of an insect which is between the head and abdomen, and bears the wings and legs; the thorax; the truncus. 6. (Zoöl.) (a) The proboscis of an elephant. (b) The proboscis of an insect. 7. A long tube through which pellets of clay, p He shot sugarplums them out of a trunk. Howell. 8. A box or chest usually covered with leather, metal, or cloth, or sometimes made of leather, hide, or metal, for containing clothes or other goods; especially, one used to convey the effects of a traveler. Locked up in chests and trunks. Shak. 9. (Mining)  A flume or sluice in which ores are separated from the slimes in which they are contained. 10. (Steam Engine)  A large pipe forming the piston rod of a steam engine, of sufficient diameter to allow one end of the connecting rod to be attached to the crank, and the other end to pass within the pipe directly to the piston, thus making the engine more compact. 11. A long, large box, pipe, or conductor, made of plank or metal plates, for various uses, as for conveying air to a mine or to a furnace, water to a mill, grain to an elevator, etc. Trunk engine, a marine engine, the piston rod of which is a trunk. See Trunk, 10. -- Trunk hose, large breeches formerly worn, reaching to the knees. -- Trunk line, the main line of a railway, canal, or route of conveyance. -- Trunk turtle (Zoöl.), the leatherback.\n\n1. To lop off; to curtail; to truncate; to maim. [Obs.] \"Out of the trunked stock.\" Spenser. 2. (Mining)  To extract (ores) from the slimes in which they are contained, by means of a trunk. See Trunk, n., 9. Weale."}