{"word":"trust","definition":"1. Assured resting of the mind on the integrity, veracity, justice, friendship, or other sound principle, of another person; confidence; reliance; reliance. \"O ever-failing trust in mortal strength!\" Milton. Most take things upon trust. Locke. 2. Credit given; especially, delivery of property or merchandise in reliance upon future payment; exchange without immediate receipt of an equivalent; as, to sell or buy goods on trust. 3. Assured anticipation; dependence upon something future or contingent, as if present or actual; hope; belief. \"Such trust have we through Christ.\" 2 Cor. iii. 4. His trust was with the Eternal to be deemed Equal in strength. Milton. 4. That which is committed or intrusted to one; something received in confidence; charge; deposit. 5. The condition or obligation of one to whom anything is confided; responsible charge or office. [I] serve him truly that will put me in trust. Shak. Reward them well, if they observe their trust. Denham. 6. That upon which confidence is reposed; ground of reliance; hope. O Lord God, thou art my trust from my youth. Ps. lxxi. 5. 7. (Law)  An estate devised or granted in confidence that the devisee or grantee shall convey it, or dispose of the profits, at the will, or for the benefit, of another; an estate held for the use of another; a confidence respecting property reposed in one person, who is termed the trustee, for the benefit of another, who is called the cestui que trust. 8. An organization formed mainly for the purpose of regulating the supply and price of commodities, etc.; as, a sugar trust. [Cant] Syn. -- Confidence; belief; faith; hope; expectation. Trust deed (Law), a deed conveying property to a trustee, for some specific use.\n\nHeld in trust; as, trust property; trustmoney.\n\n1. To place confidence in; to rely on, to confide, or repose faith, in; as, we can not trust those who have deceived us. I will never trust his word after. Shak. He that trusts every one without reserve will at last be deceived. Johnson. 2. To give credence to; to believe; to credit. Trust me, you look well. Shak. 3. To hope confidently; to believe; -- usually with a phrase or infinitive clause as the object. I trust to come unto you, and speak face to face. 2 John 12. We trustwe have a good conscience. Heb. xiii. 18. 4. to show confidence in a person by intrusting (him) with something. Whom, with your power and fortune, sir, you trust, Now to suspect is vain. Dryden. 5. To commit, as to one's care; to intrust. Merchants were not willing to trust precious cargoes to any custody but that of a man-of-war. Macaulay. 6. To give credit to; to sell to upon credit, or in confidence of future payment; as, merchants and manufacturers trust their customers annually with goods. 7. To risk; to venture confidently. [Beguiled] by thee to trust thee from my side. Milton.\n\n1. To have trust; to be credulous; to be won to confidence; to confide. More to know could not be more to trust. Shak. 2. To be confident, as of something future; to hope. I will trust and not be afraid. Isa. xii. 2. 3. To sell or deliver anything in reliance upon a promise of payment; to give credit. It is happier sometimes to be cheated than not to trust. Johnson. To trust in, To trust on, to place confidence in,; to rely on; to depend. \"Trust in the Lord, and do good.\" Ps. xxxvii. 3. \"A priest . . . on whom we trust.\" Chaucer. Her widening streets on new foundations trust. Dryden. To trust to or unto, to depend on; to have confidence in; to rely on. They trusted unto the liers in wait. Judges xx. 36."}