{"word":"truss","definition":"1. A bundle; a package; as, a truss of grass. Fabyan. Bearing a truss of trifles at his back. Spenser. Note: A truss of hay in England is 56 lbs. of old and 60 lbs. of new hay; a truss of straw is 36 lbs. 2. A padded jacket or dress worn under armor, to protect the body from the effects of friction; also, a part of a woman's dress; a stomacher. [Obs.] Nares. Puts off his palmer's weed unto his truss, which bore The stains of ancient arms. Drayton. 3. (Surg.)  A bandage or apparatus used in cases of hernia, to keep up the reduced parts and hinder further protrusion, and for other purposes. 4. (Bot.)  A tuft of flowers formed at the top of the main stalk, or stem, of certain plants. 5. (Naut.)  The rope or iron used to keep the center of a yard to the mast. 6. (Arch. & Engin.)  An assemblage of members of wood or metal, supported at two points, and arranged to transmit pressure vertically to those points, with the least possible strain across the length of any member. Architectural trusses when left visible, as in open timber roofs, often contain members not needed for construction, or are built with greater massiveness than is requisite, or are composed in unscientific ways in accordance with the exigencies of style. Truss rod, a rod which forms the tension member of a trussed beam, or a tie rod in a truss.\n\n1. To bind or pack close; to make into a truss. Shak. It [his hood] was trussed up in his wallet. Chaucer. 2. To take fast hold of; to seize and hold firmly; to pounce upon. [Obs.] Who trussing me as eagle doth his prey. Spenser. 3. To strengthen or stiffen, as a beam or girder, by means of a brace or braces. 4. To skewer; to make fast, as the wings of a fowl to the body in cooking it. 5. To execute by hanging; to hang; -- usually with up. [Slang.] Sir W. Scott. To truss a person or one's self, to adjust and fasten the clothing of; especially, to draw tight and tie the laces of garments. [Obs.] \"Enter Honeysuckle, in his nightcap, trussing himself.\" J. Webster (1607). -- To truss up, to strain; to make close or tight. -- Trussed beam, a beam which is stiffened by a system of braces constituting a truss of which the beam is a chord."}