{"word":"try","definition":"1. To divide or separate, as one sort from another; to winnow; to sift; to pick out; -- frequently followed by out; as, to try out the wild corn from the good. [Obs.] Sir T. Elyot. 2. To purify or refine, as metals; to melt out, and procure in a pure state, as oil, tallow, lard, etc. Shak. The words of the Lord are pure words: as silver tried in a furnace of earth, purified seven times. Ps. xii. 6. For thou, O God, hast proved us: thou hast tried us, as silver is tried. Ps. lxvi. 10. 3. To prove by experiment; to apply a test to, for the purpose of determining the quality; to examine; to prove; to test; as, to try weights or measures by a standard; to try a man's opinions. Let the end try the man. Shak. 4. To subject to severe trial; to put to the test; to cause suffering or trouble to. Thus far to try thee, Adam, I was pleased. Milton. Thomas Paine (1776) 5. To experiment with; to test by use; as, to try a remedy for disease; to try a horse. Come, try upon yourselves what you have seen me. Shak. To ease her cares the force of sleep she tries. Swift. 6. To strain; to subject to excessive tests; as, the light tries his eyes; repeated disappointments try one's patience. 7. (Law)  To examine or investigate judicially; to examine by witnesses or other judicial evidence and the principles of law; as, to try a cause, or a criminal. 8. To settle; to decide; to determine; specifically, to decide by an appeal to arms; as, to try rival claims by a duel; to try conclusions. Left I the court, to see this quarrel tried. Shak. 9. To experience; to have or gain knowledge of by experience. Milton. Or try the Libyan heat or Scythian cold. Dryden. 10. To essay; to attempt; to endeavor. Let us try . . . to found a path. Milton. To try on. (a) To put on, as a garment, to ascertain whether it fits the person. (b) To attempt; to undertake. [Slang] Dickens. Syn. -- To attempt; endeavor; strive; aim; examine. -- Try, Attempt. To try is the generic, to attempt is the specific, term. When we try, we are usually uncertain as to success; when we attempt, we have always some definite object in view which we seek to accomplish. We may be indifferent as to the result of a trial, but we rarely attempt anything without a desire to succeed. He first deceased: she for a little tried To live without him; liked it not, and died. Sir H. Wotton. Alack, I am afraid they have a waked, And 't is not done. The attempt, and not the deed, Confounds us. Shak.\n\n1. To exert strength; to endeavor; to make an effort or an attempt; as, you must try hard if you wish to learn. 2. To do; to fare; as, how do you try! [Prov. Eng.]\n\n1. A screen, or sieve, for grain. [Obs. or Prov. Eng.] Holland. 2. Act of trying; attempt; experiment; trial. This breaking of his has been but a try for his friends. Shak. Try cock, a gauge cock. See under Gauge.\n\nRefined; select; excellent; choice. [Obs.] \"Sugar that is try.\" Chaucer."}