{"word":"turkey","definition":"An empire in the southeast of Europe and southwest of Asia. Turkey carpet, a superior kind of carpet made in Asia Minor and adjoining countries, having a deep pile and composed of pure wool with a weft of different material. It is distinguishable by its coloring and patterns from similar carpets made in India and elsewhere. -- Turkey oak. (Bot.) See Cerris. -- Turkey red. (a) A brilliant red imparted by madder to cottons, calicoes, etc., the fiber of which has been prepared previously with oil or other fatty matter. (b) Cloth dyed with this red. -- Turkey sponge. (Zoöl.) See Toilet sponge, under Sponge. -- Turkey stone, a kind of oilstone from Turkey; novaculite; -- called also Turkey oilstone.\n\nAny large American gallinaceous bird belonging to the genus Meleagris, especially the North American wild turkey (Meleagris gallopavo), and the domestic turkey, which was probably derived from the Mexican wild turkey, but had been domesticated by the Indians long before the discovery of America. Note: The Mexican wild turkey is now considered a variety of the northern species (var. Mexicana). Its tall feathers and coverts are tipped with white instead of brownish chestnut, and its flesh is white. The Central American, or ocellated, turkey (M. ocellata) is more elegantly colored than the common species. See under Ocellated. The Australian, or native, turkey is a bustard (Choriotis australis). See under Native. Turkey beard (Bot.), a name of certain American perennial liliaceous herbs of the genus Xerophyllum. They have a dense tuft of hard, narrowly linear radical leaves, and a long raceme of small whitish flowers. Also called turkey's beard. -- Turkey berry (Bot.), a West Indian name for the fruit of certain kinds of nightshade (Solanum mammosum, and S. torvum). -- Turkey bird (Zoöl.), the wryneck. So called because it erects and ruffles the feathers of its neck when disturbed. [Prov. Eng.] -- Turkey buzzard (Zoöl.), a black or nearly black buzzard (Cathartes aura), abundant in the Southern United States. It is so called because its naked and warty head and neck resemble those of a turkey. Its is noted for its high and graceful flight. Called also turkey vulture. -- Turkey cock (Zoöl.), a male turkey. -- Turkey hen (Zoöl.), a female turkey. -- Turkey pout (Zoöl.), a young turkey. [R.] -- Turkey vulture (Zoöl.), the turkey buzzard."}