{"word":"twist","definition":"1. To contort; to writhe; to complicate; to crook spirally; to convolve. Twist it into a serpentine form. Pope. 2. Hence, to turn from the true form or meaning; to pervert; as, to twist a passage cited from an author. 3. To distort, as a solid body, by turning one part relatively to another about an axis passing through both; to subject to torsion; as, to twist a shaft. 4. To wreathe; to wind; to encircle; to unite by intertexture of parts. \"Longing to twist bays with that ivy.\" Waller. There are pillars of smoke twisted about wreaths of flame. T. Burnet. 5. To wind into; to insinuate; -- used reflexively; as, avarice twists itself into all human concerns. 6. To unite by winding one thread, strand, or other flexible substance, round another; to form by convolution, or winding separate things round each other; as, to twist yarn or thread. Shak. 7. Hence, to form as if by winding one part around another; to wreathe; to make up. Was it not to this end That thou began'st to twist so fine a story Shak. 8. To form into a thread from many fine filaments; as, to twist wool or cotton.\n\n1. To be contorted; to writhe; to be distorted by torsion; to be united by winding round each other; to be or become twisted; as, some strands will twist more easily than others. 2. To follow a helical or spiral course; to be in the form of a helix.\n\n1. The act of twisting; a contortion; a flexure; a convolution; a bending. Not the least turn or twist in the fibers of any one animal which does not render them more proper for that particular animal's way of life than any other cast or texture. Addison. 2. The form given in twisting. [He] shrunk at first sight of it; he found fault with the length, the thickness, and the twist. Arbuthnot. 3. That which is formed by twisting, convoluting, or uniting parts. Specifically: -- (a) A cord, thread, or anything flexible, formed by winding strands or separate things round each other. (b) A kind of closely twisted, strong sewing silk, used by tailors, saddlers, and the like. (c) A kind of cotton yarn, of several varieties. (d) A roll of twisted dough, baked. (e) A little twisted roll of tobacco. (f) (Weaving) One of the threads of a warp, -- usually more tightly twisted than the filling. (g) (Firearms)  A material for gun barrels, consisting of iron and steel twisted and welded together; as, Damascus twist. (h) (Firearms & Ord.) The spiral course of the rifling of a gun barrel or a cannon. (i) A beverage made of brandy and gin. [Slang] 4. Etym: [OE.; -- so called as being a two-forked branch. See Twist, v. t.]  A twig. [Obs.] Chaucer. Fairfax. Gain twist, or Gaining twist (Firearms), twist of which the pitch is less, and the inclination greater, at the muzzle than at the breech. -- Twist drill, a drill the body of which is twisted like that of an auger. See Illust. of Drill. -- Uniform twist (Firearms), a twist of which the spiral course has an equal pitch throughout."}