{"word":"unity","definition":"1. The state of being one; oneness. Whatever we can consider as one thing suggests to the understanding the idea of unity. Locks. Note: Unity is affirmed of a simple substance or indivisible monad, or of several particles or parts so intimately and closely united as to constitute a separate body or thing. See the Synonyms under Union. 2. Concord; harmony; conjunction; agreement; uniformity; as, a unity of proofs; unity of doctrine. Behold, how good and how pleasant it is for brethren to dwell together in unity! Ps. cxxxiii. 1. 3. (Math.)  Any definite quantity, or aggregate of quantities or magnitudes taken as one, or for which 1 is made to stand in calculation; thus, in a table of natural sines, the radius of the circle is regarded as unity. Note: The number 1, when it is not applied to any particular thing, is generally called unity. 4. (Poetry & Rhet.)  In dramatic composition, one of the principles by which a uniform tenor of story and propriety of representation are preserved; conformity in a composition to these; in oratory, discourse, etc., the due subordination and reference of every part to the development of the leading idea or the eastablishment of the main proposition. Note: In the Greek drama, the three unities required were those of action, of time, and of place; that is, that there should be but one main plot; that the time supposed should not exceed twenty-four hours; and that the place of the action before the spectators should be one and the same throughout the piece. 5. (Fine Arts & Mus.)  Such a combination of parts as to constitute a whole, or a kind of symmetry of style and character. 6. (Law)  The peculiar characteristics of an estate held by several in joint tenancy. Note: The properties of it are derived from its unity, which is fourfold; unity of interest, unity of title, unity of time, and unity of possession; in other words, joint tenants have one and the same interest, accruing by one and the same conveyance, commencing at the same time, and held by one and the same undivided possession. Unity of possession is also a joint possession of two rights in the same thing by several titles, as when a man, having a lease of land, afterward buys the fee simple, or, having an easement in the land of another, buys the servient estate. At unity, at one. -- Unity of type. (Biol.) See under Type. Syn. -- Union; oneness; junction; concord; harmony. See Union."}