{"word":"utter","definition":"1. Outer. \"Thine utter eyen.\" Chaucer. [Obs.] \"By him a shirt and utter mantle laid.\" Chapman. As doth an hidden moth The inner garment fret, not th' utter touch. Spenser. 2. Situated on the outside, or extreme limit; remote from the center; outer. [Obs.] Through utter and through middle darkness borne. Milton. The very utter part pf Saint Adelmes point is five miles from Sandwich. Holinshed. 3. Complete; perfect; total; entire; absolute; as, utter ruin; utter darkness. They . . . are utter strangers to all those anxious thoughts which disquiet mankind. Atterbury. 4. Peremptory; unconditional; unqualified; final; as, an utter refusal or denial. Clarendon. Utter bar (Law), the whole body of junior barristers. See Outer bar, under 1st Outer. [Eng.] -- Utter barrister (Law), one recently admitted as barrister, who is accustomed to plead without, or outside, the bar, as distinguished from the benchers, who are sometimes permitted to plead within the bar. [Eng.] Cowell.\n\n1. To put forth or out; to reach out. [Obs.] How bragly [proudly] it begins to bud, And utter his tender head. Spenser. 2. To dispose of in trade; to sell or vend. [Obs.] Such mortal drugs I have, but Mantua's law Is death to any he that utters them. Shak. They bring it home, and utter it commonly by the name of Newfoundland fish. Abp. Abbot. 3. hence, to put in circulation, as money; to put off, as currency; to cause to pass in trade; -- often used, specifically, of the issue of counterfeit notes or coins, forged or fraudulent documents, and the like; as, to utter coin or bank notes. The whole kingdom should continue in a firm resolution never to receive or utter this fatal coin. Swift. 4. To give public expression to; to disclose; to publish; to speak; to pronounce. \"Sweet as from blest, uttering joy.\" Milton. The words I utter Let none think flattery, for they 'll find 'em truth. Shak. And the last words he uttered called me cruel. Addison. Syn. -- To deliver; give forth; issue; liberate; discharge; pronounce. See Deliver."}