{"word":"variety","definition":"1. The quality or state of being various; intermixture or succession of different things; diversity; multifariousness. Variety is nothing else but a continued novelty. South. The variety of colors depends upon the composition of light. Sir I. Newton. For earth this variety from heaven. Milton. There is a variety in the tempers of good men. Atterbury. 2. That which is various. Specifically: -- (a) A number or collection of different things; a varied assortment; as, a variety of cottons and silks. He . . . wants more time to do that variety of good which his soul thirsts after. Law. (b) Something varying or differing from others of the same general kind; one of a number of things that are akin; a sort; as, varieties of wood, land, rocks, etc. (c) (Biol.) An individual, or group of individuals, of a species differing from the rest in some one or more of the characteristics typical of the species, and capable either of perpetuating itself for a period, or of being perpetuated by artificial means; hence, a subdivision, or peculiar form, of a species. Note: Varieties usually differ from species in that any two, however unlike, will generally propagate indefinitely (unless they are in their nature unfertile, as some varieties of rose and other cultivated plants); in being a result of climate, food, or other extrinsic conditions or influences, but generally by a sudden, rather than a gradual, development; and in tending in many cases to lose their distinctive peculiarities when the individuals are left to a state of nature, and especially if restored to the conditions that are natural to typical individuals of the species. Many varieties of domesticated animals and of cultivated plants have been directly produced by man. (d) In inorganic nature, one of those forms in which a species may occur, which differ in minor characteristics of structure, color, purity of composition, etc. Note: These may be viewed as variations from the typical species in its most perfect and purest form, or, as is more commonly the case, all the forms, including the latter, may rank as Varieties. Thus, the sapphire is a blue variety, and the ruby a red variety, of corundum; again, calcite has many Varieties differing in form and structure, as Iceland spar, dogtooth spar, satin spar, and also others characterized by the presence of small quantities of magnesia, iron, manganese, etc. Still again, there are Varieties of granite differing in structure, as graphic granite, porphyritic granite, and other Varieties differing in composition, as albitic granite, hornblendic, or syenitic, granite, etc. Geographical variety (Biol.), a variety of any species which is coincident with a geographical region, and is usually dependent upon, or caused by, peculiarities of climate. -- Variety hybrid (Biol.), a cross between two individuals of different varieties of the same species; a mongrel. Syn. -- Diversity; difference; kind. -- Variety, Diversity. A man has a variety of employments when he does many things which are not a mere repetition of the same act; he has a diversity of employments when the several acts performed are unlike each other, that is, diverse. In most cases, where there is variety there will be more or less of diversity, but not always. One who sells railroad tickets performs a great variety of acts in a day, while there is but little diversity in his employment. All sorts are here that all the earth yields! Variety without end. Milton. But see in all corporeal nature's scene, What changes, what diversities, have been! Blackmore."}