{"word":"vault","definition":"1. (Arch.)  An arched structure of masonry, forming a ceiling or canopy. The long-drawn aisle and fretted vault. Gray. 2. An arched apartment; especially, a subterranean room, use for storing articles, for a prison, for interment, or the like; a cell; a cellar. \"Charnel vaults.\" Milton. The silent vaults of death. Sandys. To banish rats that haunt our vault. Swift. 3. The canopy of heaven; the sky. That heaven's vault should crack. Shak. 4. Etym: [F. volte, It. volta, originally, a turn, and the same word as volta an arch. See the Etymology above.]  A leap or bound. Specifically: -- (a) (Man.) The bound or leap of a horse; a curvet. (b) A leap by aid of the hands, or of a pole, springboard, or the like. Note: The l in this word was formerly often suppressed in pronunciation. Barrel, Cradle, Cylindrical, or Wagon, vault (Arch.), a kind of vault having two parallel abutments, and the same section or profile at all points. It may be rampant, as over a staircase (see Rampant vault, under Rampant), or curved in plan, as around the apse of a church. -- Coved vault. (Arch.) See under 1st Cove, v. t. -- Groined vault (Arch.), a vault having groins, that is, one in which different cylindrical surfaces intersect one another, as distinguished from a barrel, or wagon, vault. -- Rampant vault. (Arch.) See under Rampant. -- Ribbed vault (Arch.), a vault differing from others in having solid ribs which bear the weight of the vaulted surface. True Gothic vaults are of this character. -- Vault light, a partly glazed plate inserted in a pavement or ceiling to admit light to a vault below.\n\n1. To form with a vault, or to cover with a vault; to give the shape of an arch to; to arch; as, vault a roof; to vault a passage to a court. The shady arch that vaulted the broad green alley. Sir W. Scott. 2. Etym: [See Vault, v. i.]  To leap over; esp., to leap over by aid of the hands or a pole; as, to vault a fence. I will vault credit, and affect high pleasures. Webster (1623).\n\n1. To leap; to bound; to jump; to spring. Vaulting ambition, which o'erleaps itself. Shak. Leaning on his lance, he vaulted on a tree. Dryden. Lucan vaulted upon Pegasus with all the heat and intrepidity of youth. Addison. 2. To exhibit feats of tumbling or leaping; to tumble."}