{"word":"vent","definition":"Sale; opportunity to sell; market. [Obs.] Shelton. There is no vent for any commodity but of wool. Sir W. Temple.\n\nTo sell; to vend. [Obs.] Therefore did those nations vent such spice. Sir W. Raleigh.\n\nA baiting place; an inn. [Obs.]\n\nTo snuff; to breathe or puff out; to snort. [Obs.] Spenser.\n\n1. A small aperture; a hole or passage for air or any fluid to escape; as, the vent of a cask; the vent of a mold; a volcanic vent. Look, how thy wounds do bleed at many vents. Shak. Long't was doubtful, both so closely pent, Which first should issue from the narrow vent. Pope. 2. Specifically: --(a) (Zoöl.)  The anal opening of certain invertebrates and fishes; also, the external cloacal opening of reptiles, birds, amphibians, and many fishes. (b) (Gun.) The opening at the breech of a firearm, through which fire is communicated to the powder of the charge; touchhole. (c) (Steam Boilers) Sectional area of the passage for gases divided by the length of the same passage in feet. 3. Fig.: Opportunity of escape or passage from confinement or privacy; outlet. 4. Emission; escape; passage to notice or expression; publication; utterance. Without the vent of words. Milton. Thou didst make tolerable vent of thy travel. Shak. To give vent to, to suffer to escape; to let out; to pour forth; as, to give vent to anger. -- To take vent, to escape; to be made public. [R.] -- Vent feather (Zoöl.), one of the anal, or crissal, feathers of a bird. -- Vent field (Gun.), a flat raised surface around a vent. -- Vent piece. (Gun.) (a) A bush. See 4th Bush, n, 2. (b) A breech block.\n\n1. To let out at a vent, or small aperture; to give passage or outlet to. 2. To suffer to escape from confinement; to let out; to utter; to pour forth; as, to vent passion or complaint. The queen of heaven did thus her fury vent. Dryden. 3. To utter; to report; to publish. [Obs.] By mixing somewhat true to vent more lies. Milton. Thou hast framed and vented very curious orations. Barrow. 4. To scent, as a hound. [Obs.] Turbervile. 5. To furnish with a vent; to make a vent in; as, to vent. a mold."}