{"word":"venus","definition":"1. (Class. Myth.)  The goddess of beauty and love, that is, beauty or love deified. 2. (Anat.)  One of the planets, the second in order from the sun, its orbit lying between that of Mercury and that of the Earth, at a mean distance from the sun of about 67,000,000 miles. Its diameter is 7,700 miles, and its sidereal period 224.7 days. As the morning star, it was called by the ancients Lucifer; as the evening star, Hesperus. 3. (Alchem.)  The metal copper; -- probably so designated from the ancient use of the metal in making mirrors, a mirror being still the astronomical symbol of the planet Venus. [Archaic] 4. (Zoöl.)  Any one of numerous species of marine bivalve shells of the genus Venus or family Veneridæ. Many of these shells are large, and ornamented with beautiful frills; others are smooth, glossy, and handsomely colored. Some of the larger species, as the round clam, or quahog, are valued for food. Venus's basin (Bot.), the wild teasel; - - so called because the connate leaf bases form a kind of receptacle for water, which was formerly gathered for use in the toilet. Also called Venus's bath. -- Venus's basket (Zoöl.), an elegant, cornucopia-shaped, hexactinellid sponge (Euplectella speciosa) native of the East Indies. It consists of glassy, transparent, siliceous fibers interwoven and soldered together so as to form a firm network, and has long, slender, divergent anchoring fibers at the base by means of which it stands erect in the soft mud at the bottom of the sea. Called also Venus's flower basket, and Venus's purse. -- Venus's comb. (a) (Bot.) Same as Lady's comb. (b) (Zoöl.) A species of Murex (M. tenuispinus). It has a long, tubular canal, with a row of long, slender spines along both of its borders, and rows of similar spines covering the body of the shell. Called also Venus's shell. -- Venus's fan (Zoöl.), a common reticulated, fanshaped gorgonia (Gorgonia flabellum) native of Florida and the West Indies. When fresh the color is purple or yellow, or a mixture of the two. -- Venus's flytrap. (Bot.) See Flytrap, 2. -- Venus's girdle (Zoöl.), a long, flat, ribbonlike, very delicate, transparent and iridescent ctenophore (Cestum Veneris) which swims in the open sea. Its form is due to the enormous development of two spheromeres. See Illust. in Appendix. -- Venus's hair (Bot.), a delicate and graceful fern (Adiantum Capillus-Veneris) having a slender, black and shining stem and branches. -- Venus's hair stone (Min.), quartz penetrated by acicular crystals of rutile. -- Venus's looking-glass (Bot.), an annual plant of the genus Specularia allied to the bellflower; -- also called lady's looking- glass. -- Venus's navelwort (Bot.), any one of several species of Omphalodes, low boraginaceous herbs with small blue or white flowers. -- Venus's pride (Bot.), an old name for Quaker ladies. See under Quaker. -- Venus's purse. (Zoöl.) Same as Venus's basket, above. -- Venus's shell. (Zoöl.) (a) Any species of Cypræa; a cowrie. (b) Same as Venus's comb, above. (c) Same as Venus, 4. -- Venus's slipper. (a) (Bot.) Any plant of the genus Cypripedium. See Lady's slipper. (b) (Zoöl.) Any heteropod shell of the genus Carinaria. See Carinaria."}