{"word":"vertical","definition":"1. Of or pertaining to the vertex; situated at the vertex, or highest point; directly overhead, or in the zenith; perpendicularly above one. Charity . . . is the vertical top of all religion. Jer. Taylor. 2. Perpendicular to the plane of the horizon; upright; plumb; as, a vertical line. Vertical angle (Astron. & Geod.), an angle measured on a vertical circle, called an angle of elevation, or altitude, when reckoned from the horizon upward, and of depression when downward below the horizon. -- Vertical anthers (Bot.), such anthers as stand erect at the top of the filaments. -- Vertical circle (Astron.), an azimuth circle. See under Azimuth. -- Vertical drill, an drill. See under Upright. -- Vertical fire (Mil.), the fire, as of mortars, at high angles of elevation. -- Vertical leaves (Bot.), leaves which present their edges to the earth and the sky, and their faces to the horizon, as in the Australian species of Eucalyptus. -- Vertical limb, a graduated arc attached to an instrument, as a theodolite, for measuring vertical angles. -- Vertical line. (a) (Dialing) A line perpendicular to the horizon. (b) (Conic Sections) A right line drawn on the vertical plane, and passing through the vertex of the cone. (c) (Surv.) The direction of a plumb line; a line normal to the surface of still water. (d) (Geom., Drawing, etc.) A line parallel to the sides of a page or sheet, in distinction from a horizontal line parallel to the top or bottom. -- Vertical plane. (a) (Conic Sections) A plane passing through the vertex of a cone, and through its axis. (b) (Projections) Any plane which passes through a vertical line. (c) (Persp.) The plane passing through the point of sight, and perpendicular to the ground plane, and also to the picture. -- Vertical sash, a sash sliding up and down. Cf. French sash, under 3d Sash. -- Vertical steam engine, a steam engine having the crank shaft vertically above or below a vertical cylinder.\n\n1. Vertical position; zenith. [R.] 2. (Math.)  A vertical line, plane, or circle. Prime vertical, Prime vertical dial. See under Prime, a."}