{"word":"view","definition":"1. The act of seeing or beholding; sight; look; survey; examination by the eye; inspection. Thenceforth I thought thee worth my nearer view. Milton. Objects near our view are thought greater than those of a larger size are more remote. Locke. Surveying nature with too nice a view. Dryden. 2. Mental survey; intellectual perception or examination; as, a just view of the arguments or facts in a case. I have with exact view perused thee, Hector. Shak. 3. Power of seeing, either physically or mentally; reach or range of sight; extent of prospect. The walls of Pluto's palace are in view. Dryden. 4. That which is seen or beheld; sight presented to the natural or intellectual eye; scene; prospect; as, the view from a window. 'T is distance lends enchantment to the view. Campbell. 5. The pictorial representation of a scene; a sketch, as, a fine view of Lake George. 6. Mode of looking at anything; manner of apprehension; conception; opinion; judgment; as, to state one's views of the policy which ought to be pursued. To give a right view of this mistaken part of liberty. Locke. 7. That which is looked towards, or kept in sight, as object, aim, intention, purpose, design; as, he did it with a view of escaping. No man sets himself about anything but upon some view or other which serves him for a reason. Locke. 8. Appearance; show; aspect. [Obs.] [Graces] which, by the splendor of her view Dazzled, before we never knew. Waller. Field of view. See under Field. -- Point of view. See under Point. -- To have in view, to have in mind as an incident, object, or aim; as, to have one's resignation in view. -- View halloo, the shout uttered by a hunter upon seeing the fox break cover. -- View of frankpledge (Law), a court of record, held in a hundred, lordship, or manor, before the steward of the leet. Blackstone. -- View of premises (Law), the inspection by the jury of the place where a litigated transaction is said to have occurred.\n\n1. To see; to behold; especially, to look at with attention, or for the purpose of examining; to examine with the eye; to inspect; to explore. O, let me view his visage, being dead. Shak. Nearer to view his prey, and, unespied, To mark what of their state he more might learn. Milton. 2. To survey or examine mentally; to consider; as, to view the subject in all its aspects. The happiest youth, viewing his progress through. Shak."}