{"word":"vital","definition":"1. Belonging or relating to life, either animal or vegetable; as, vital energies; vital functions; vital actions. 2. Contributing to life; necessary to, or supporting, life; as, vital blood. Do the heavens afford him vital food Spenser. And vital virtue infused, and vital warmth. Milton. 3. Containing life; living. \"Spirits that live throughout, vital in every part.\" Milton. 4. Being the seat of life; being that on which life depends; mortal. The dart flew on, and pierced a vital part. Pope. 5. Very necessary; highly important; essential. A competence is vital to content. Young. 6. Capable of living; in a state to live; viable. [R.] Pythagoras and Hippocrates . . . affirm the birth of the seventh month to be vital. Sir T. Browne. Vital air, oxygen gas; -- so called because essential to animal life. [Obs.] -- Vital capacity (Physiol.), the breathing capacity of the lungs; -- expressed by the number of cubic inches of air which can be forcibly exhaled after a full inspiration. -- Vital force. (Biol.) See under Force. The vital forces, according to Cope, are nerve force (neurism), growth force (bathmism), and thought force (phrenism), all under the direction and control of the vital principle. Apart from the phenomena of consciousness, vital actions no longer need to be considered as of a mysterious and unfathomable character, nor vital force as anything other than a form of physical energy derived from, and convertible into, other well- known forces of nature. -- Vital functions (Physiol.), those functions or actions of the body on which life is directly dependent, as the circulation of the blood, digestion, etc. -- Vital principle, an immaterial force, to which the functions peculiar to living beings are ascribed. -- Vital statistics, statistics respecting the duration of life, and the circumstances affecting its duration. -- Vital tripod. (Physiol.) See under Tripod. -- Vital vessels (Bot.), a name for latex tubes, now disused. See Latex.\n\nA vital part; one of the vitals. [R.]"}