{"word":"voluntary","definition":"1. Proceeding from the will; produced in or by an act of choice. That sin or guilt pertains exclusively to voluntary action is the true principle of orthodoxy. N. W. Taylor. 2. Unconstrained by the interference of another; unimpelled by the influence of another; not prompted or persuaded by another; done of his or its own accord; spontaneous; acting of one's self, or of itself; free. Our voluntary service he requires. Milton. She fell to lust a voluntary prey. Pope. 3. Done by design or intention; intentional; purposed; intended; not accidental; as, if a man kills another by lopping a tree, it is not voluntary manslaughter. 4. (Physiol.)  Of or pertaining to the will; subject to, or regulated by, the will; as, the voluntary motions of an animal, such as the movements of the leg or arm (in distinction from involuntary motions, such as the movements of the heart); the voluntary muscle fibers, which are the agents in voluntary motion. 5. Endowed with the power of willing; as, man is a voluntary agent. God did not work as a necessary, but a voluntary, agent, intending beforehand, and decreeing with himself, that which did outwardly proceed from him. Hooker. 6. (Law)  Free; without compulsion; according to the will, consent, or agreement, of a party; without consideration; gratuitous; without valuable consideration. 7. (Eccl.)  Of or pertaining to voluntaryism; as, a voluntary church, in distinction from an established or state church. Voluntary affidavit or oath (Law), an affidavit or oath made in extrajudicial matter. -- Voluntary conveyance (Law), a conveyance without valuable consideration. -- Voluntary escape (Law), the escape of a prisoner by the express consent of the sheriff. -- Voluntary jurisdiction. (Eng. Eccl. Law) See Contentious jurisdiction, under Contentious. -- Voluntary waste. (Law) See Waste, n., 4. Syn. -- See Spontaneous.\n\n1. One who engages in any affair of his own free will; a volunteer. [R.] Shak. 2. (Mus.)  A piece played by a musician, often extemporarily, according to his fancy; specifically, an organ solo played before, during, or after divine service. 3. (Eccl.)  One who advocates voluntaryism."}