{"word":"wager","definition":"1. Something deposited, laid, or hazarded on the event of a contest or an unsettled question; a bet; a stake; a pledge. Besides these plates for horse races, the wagers may be as the persons please. Sir W. Temple. If any atheist can stake his soul for a wager against such an inexhaustible disproportion, let him never hereafter accuse others of credulity. Bentley. 2. (Law)  A contract by which two parties or more agree that a certain sum of money, or other thing, shall be paid or delivered to one of them, on the happening or not happening of an uncertain event. Bouvier. Note: At common law a wager is considered as a legal contract which the courts must enforce unless it be on a subject contrary to public policy, or immoral, or tending to the detriment of the public, or affecting the interest, feelings, or character of a third person. In many of the United States an action can not be sustained upon any wager or bet. Chitty. Bouvier. 3. That on which bets are laid; the subject of a bet. Wager of battel, or Wager of battle (O. Eng. Law), the giving of gage, or pledge, for trying a cause by single combat, formerly allowed in military, criminal, and civil causes. In writs of right, where the trial was by champions, the tenant produced his champion, who, by throwing down his glove as a gage, thus waged, or stipulated, battle with the champion of the demandant, who, by taking up the glove, accepted the challenge. The wager of battel, which has been long in disuse, was abolished in England in 1819, by a statute passed in consequence of a defendant's having waged his battle in a case which arose about that period. See Battel. -- Wager of law (Law), the giving of gage, or sureties, by a defendant in an action of debt, that at a certain day assigned he would take a law, or oath, in open court, that he did not owe the debt, and at the same time bring with him eleven neighbors (called compurgators), who should avow upon their oaths that they believed in their consciences that he spoke the truth. -- Wager policy. (Insurance Law) See under Policy.\n\nTo hazard on the issue of a contest, or on some question that is to be decided, or on some casualty; to lay; to stake; to bet. And wagered with him Pieces of gold 'gainst this which he wore. Shak.\n\nTo make a bet; to lay a wager. 'T was merry when You wagered on your angling. Shak."}