{"word":"wake","definition":"The track left by a vessel in the water; by extension, any track; as, the wake of an army. This effect followed immediately in the wake of his earliest exertions. De Quincey. Several humbler persons . . . formed quite a procession in the dusty wake of his chariot wheels. Thackeray.\n\n1. To be or to continue awake; to watch; not to sleep. The father waketh for the daughter. Ecclus. xlii. 9. Though wisdom wake, suspicion sleeps. Milton. I can not think any time, waking or sleeping, without being sensible of it. Locke. 2. To sit up late festive purposes; to hold a night revel. The king doth wake to-night, and takes his rouse, Keeps wassail, and the swaggering upspring reels. Shak. 3. To be excited or roused from sleep; to awake; to be awakened; to cease to sleep; -- often with up. He infallibly woke up at the sound of the concluding doxology. G. Eliot. 4. To be exited or roused up; to be stirred up from a dormant, torpid, or inactive state; to be active. Gentle airs due at their hour To fan the earth now waked. Milton. Then wake, my soul, to high desires. Keble.\n\n1. To rouse from sleep; to awake. The angel . . . came again and waked me. Zech. iv. 1. 2. To put in motion or action; to arouse; to excite. \"I shall waken all this company.\" Chaucer. Lest fierce remembrance wake my sudden rage. Milton. Even Richard's crusade woke little interest in his island realm. J. R. Green. 3. To bring to life again, as if from the sleep of death; to reanimate; to revive. To second life Waked in the renovation of the just. Milton. 4. To watch, or sit up with, at night, as a dead body.\n\n1. The act of waking, or being awaked; also, the state of being awake. [Obs. or Poetic] Making such difference 'twixt wake and sleep. Shak. Singing her flatteries to my morning wake. Dryden. 2. The state of forbearing sleep, especially for solemn or festive purposes; a vigil. The warlike wakes continued all the night, And funeral games played at new returning light. Dryden. The wood nymphs, decked with daises trim, Their merry wakes and pastimes keep. Milton. 3. Specifically: (a) (Ch. of Eng.) An annual parish festival formerly held in commemoration of the dedication of a church. Originally, prayers were said on the evening preceding, and hymns were sung during the night, in the church; subsequently, these vigils were discontinued, and the day itself, often with succeeding days, was occupied in rural pastimes and exercises, attended by eating and drinking, often to excess. Great solemnities were made in all churches, and great fairs and wakes throughout all England. Ld. Berners. And every village smokes at wakes with lusty cheer. Drayton. (b) The sitting up of persons with a dead body, often attended with a degree of festivity, chiefly among the Irish. \"Blithe as shepherd at a wake.\" Cowper. Wake play, the ceremonies and pastimes connected with a wake. See Wake, n., 3 (b), above. [Obs.] Chaucer."}