{"word":"walk","definition":"1. To move along on foot; to advance by steps; to go on at a moderate pace; specifically, of two-legged creatures, to proceed at a slower or faster rate, but without running, or lifting one foot entirely before the other touches the ground. At the end of twelve months, he walked in the palace of the kingdom of Babylon. Dan. iv. 29. When Peter was come down out of the ship, he walked on the water, to go to Jesus. Matt. xiv. 29. Note: In the walk of quadrupeds, there are always two, and for a brief space there are three, feet on the ground at once, but never four. 2. To move or go on the feet for exercise or amusement; to take one's exercise; to ramble. 3. To be stirring; to be abroad; to go restlessly about; -- said of things or persons expected to remain quiet, as a sleeping person, or the spirit of a dead person; to go about as a somnambulist or a specter. I have heard, but not believed, the spirits of the dead May walk again. Shak. When was it she last walked Shak. 4. To be in motion; to act; to move; to wag. [Obs.] \"Her tongue did walk in foul reproach.\" Spenser. Do you think I'd walk in any plot B. Jonson. I heard a pen walking in the chimney behind the cloth. Latimer. 5. To behave; to pursue a course of life; to conduct one's self. We walk perversely with God, and he will walk crookedly toward us. Jer. Taylor. 6. To move off; to depart. [Obs. or Colloq.] He will make their cows and garrans to walk. Spenser. To walk in, to go in; to enter, as into a house. -- To walk after the flesh (Script.), to indulge sensual appetites, and to live in sin. Rom. viii. 1. -- To walk after the Spirit (Script.), to be guided by the counsels and influences of the Spirit, and by the word of God. Rom. viii. 1. -- To walk by faith (Script.), to live in the firm belief of the gospel and its promises, and to rely on Christ for salvation. 2 Cor. v. 7. -- To walk in darkness (Script.), to live in ignorance, error, and sin. 1 John i. 6. -- To walk in the flesh (Script.), to live this natural life, which is subject to infirmities and calamities. 2 Cor. x. 3. -- To walk in the light (Script.), to live in the practice of religion, and to enjoy its consolations. 1 John i. 7. -- To walk over, in racing, to go over a course at a walk; -- said of a horse when there is no other entry; hence, colloquially, to gain an easy victory in any contest. -- To walk through the fire (Script.), to be exercised with severe afflictions. Isa. xliii. 2. -- To walk with God (Script.), to live in obedience to his commands, and have communion with him.\n\n1. To pass through, over, or upon; to traverse; to perambulate; as, to walk the streets. As we walk our earthly round. Keble. 2. To cause to walk; to lead, drive, or ride with a slow pace; as to walk one's horses. \" I will rather trust . . . a thief to walk my ambling gelding.\" Shak. 3. Etym: [AS. wealcan to roll. See Walk to move on foot.]  To subject, as cloth or yarn, to the fulling process; to full. [Obs. or Scot.] To walk the plank, to walk off the plank into the water and be drowned; -- an expression derived from the practice of pirates who extended a plank from the side of a ship, and compelled those whom they would drown to walk off into the water; figuratively, to vacate an office by compulsion. Bartlett.\n\n1. The act of walking, or moving on the feet with a slow pace; advance without running or leaping. 2. The act of walking for recreation or exercise; as, a morning walk; an evening walk. 3. Manner of walking; gait; step; as, we often know a person at a distance by his walk. 4. That in or through which one walks; place or distance walked over; a place for walking; a path or avenue prepared for foot passengers, or for taking air and exercise; way; road; hence, a place or region in which animals may graze; place of wandering; range; as, a sheep walk. A woody mountain . . . with goodliest trees Planted, with walks and bowers. Milton. He had walk for a hundred sheep. Latimer. Amid the sound of steps that beat The murmuring walks like rain. Bryant. 5. A frequented track; habitual place of action; sphere; as, the walk of the historian. The mountains are his walks. Sandys. He opened a boundless walk for his imagination. Pope. 6. Conduct; course of action; behavior. 7. The route or district regularly served by a vender; as, a milkman's walk. [Eng.]"}