{"word":"wall","definition":"A kind of knot often used at the end of a rope; a wall knot; a wale. Wall knot, a knot made by unlaying the strands of a rope, and making a bight with the first strand, then passing the second over the end of the first, and the third over the end of the second and through the bight of the first; a wale knot. Wall knots may be single or double, crowned or double-crowned.\n\n1. A work or structure of stone, brick, or other materials, raised to some height, and intended for defense or security, solid and permanent inclosing fence, as around a field, a park, a town, etc., also, one of the upright inclosing parts of a building or a room. The plaster of the wall of the King's palace. Dan. v. 5. 2. A defense; a rampart; a means of protection; in the plural, fortifications, in general; works for defense. The waters were a wall unto them on their right hand, and on their left. Ex. xiv. 22. In such a night, Troilus, methinks, mounted the Troyan walls. Shak. To rush undaunted to defend the walls. Dryden. 3. An inclosing part of a receptacle or vessel; as, the walls of a steam-engine cylinder. 4. (Mining) (a) The side of a level or drift. (b) The country rock bounding a vein laterally. Raymond. Note: Wall is often used adjectively, and also in the formation of compounds, usually of obvious signification; as in wall paper, or wall-paper; wall fruit, or wall-fruit; wallflower, etc. Blank wall, Blind wall, etc. See under Blank, Blind, etc. -- To drive to the wall, to bring to extremities; to push to extremes; to get the advantage of, or mastery over. -- To go to the wall, to be hard pressed or driven; to be the weaker party; to be pushed to extremes. -- To take the wall. to take the inner side of a walk, that is, the side next the wall; hence, to take the precedence. \"I will take the wall of any man or maid of Montague's.\" Shak. -- Wall barley (Bot.), a kind of grass (Hordeum murinum) much resembling barley; squirrel grass. See under Squirrel. -- Wall box. (Mach.) See Wall frame, below. -- Wall creeper (Zoöl.), a small bright-colored bird (Tichodroma muraria) native of Asia and Southern Europe. It climbs about over old walls and cliffs in search of insects and spiders. Its body is ash- gray above, the wing coverts are carmine-red, the primary quills are mostly red at the base and black distally, some of them with white spots, and the tail is blackish. Called also spider catcher. -- Wall cress (Bot.), a name given to several low cruciferous herbs, especially to the mouse-ear cress. See under Mouse-ear. -- Wall frame (Mach.), a frame set in a wall to receive a pillow block or bearing for a shaft passing through the wall; -- called also wall box. -- Wall fruit, fruit borne by trees trained against a wall. -- Wall gecko (Zoöl.), any one of several species of Old World geckos which live in or about buildings and run over the vertical surfaces of walls, to which they cling by means of suckers on the feet. -- Wall lizard (Zoöl.), a common European lizard (Lacerta muralis) which frequents houses, and lives in the chinks and crevices of walls; -- called also wall newt. -- Wall louse, a wood louse. -- Wall moss (Bot.), any species of moss growing on walls. -- Wall newt (Zoöl.), the wall lizard. Shak. -- Wall paper, paper for covering the walls of rooms; paper hangings. -- Wall pellitory (Bot.), a European plant (Parictaria officinalis) growing on old walls, and formerly esteemed medicinal. -- Wall pennywort (Bot.), a plant (Cotyledon Umbilicus) having rounded fleshy leaves. It is found on walls in Western Europe. -- Wall pepper (Bot.), a low mosslike plant (Sedum acre) with small fleshy leaves having a pungent taste and bearing yellow flowers. It is common on walls and rocks in Europe, and is sometimes seen in America. -- Wall pie (Bot.), a kind of fern; wall rue. -- Wall piece, a gun planted on a wall. H. L. Scott. -- Wall plate (Arch.), a piece of timber placed horizontally upon a wall, and supporting posts, joists, and the like. See Illust. of Roof. -- Wall rock, granular limestone used in building walls. [U. S.] Bartlett. -- Wall rue (Bot.), a species of small fern (Asplenium Ruta-muraria) growing on walls, rocks, and the like. -- Wall spring, a spring of water issuing from stratified rocks. -- Wall tent, a tent with upright cloth sides corresponding to the walls of a house. -- Wall wasp (Zoöl.), a common European solitary wasp (Odynerus parietus) which makes its nest in the crevices of walls.\n\n1. To inclose with a wall, or as with a wall. \"Seven walled towns of strength.\" Shak. The king of Thebes, Amphion, That with his singing walled that city. Chaucer. 2. To defend by walls, or as if by walls; to fortify. The terror of his name that walls us in. Denham. 3. To close or fill with a wall, as a doorway."}