{"word":"warm","definition":"1. Having heat in a moderate degree; not cold as, warm milk. \"Whose blood is warm within.\" Shak. Warm and still is the summer night. Longfellow. 2. Having a sensation of heat, esp. of gentle heat; glowing. 3. Subject to heat; having prevalence of heat, or little or no cold weather; as, the warm climate of Egypt. 4. Fig.: Not cool, indifferent, lukewarm, or the like, in spirit or temper; zealous; ardent; fervent; excited; sprightly; irritable; excitable. Mirth, and youth, and warm desire! Milton. Each warm wish springs mutual from the heart. Pope. They say he's warm man and does not care to be madAddison. I had been none of the warmest of partisans. Hawthor 5. Violent; vehement; furious; excited; passionate; as, a warm contest; a warm debate. Welcome, daylight; we shall have warm work on't. Dryden. 6. Being well off as to property, or in good circumstances; forehanded; rich. [Colloq.] Warm householders, every one of them. W. Irving. You shall have a draft upon him, payable at sight: and let me tell you he as warm a man as any within five miles round him. Goldsmith. 7. In children's games, being near the object sought for; hence, being close to the discovery of some person, thing, or fact concealed. [Colloq.] Here, indeed, young Mr. Dowse was getting \"warm,\" Black. 8. (Paint.)  Having yellow or red for a basis, or in their composition; -- said of colors, and opposed to cold which is of blue and its compounds. Syn. -- Ardent; zealous; fervent; glowing; enthusiastic; cordial; keen; violent; furious; hot.\n\n1. To communicate a moderate degree of heat to; to render warm; to supply or furnish heat to; as, a stove warms an apartment. Then shall it [an ash tree] be for a man to burn; for he will take thereof and warm himself. Isa. xliv 15 Enough to warm, but not enough to burn. Longfellow. 2. To make engaged or earnest; to interest; to engage; to excite ardor or zeal; to enliven. I formerly warmed my head with reading controversial writings. Pope. Bright hopes, that erst bosom warmed. Keble.\n\n1. To become warm, or moderately heated; as, the earth soon warms in a clear day summer. There shall not be a coal to warm at. Isa. xlvii. 14. 2. To become ardent or animated; as, the speakewarms as he proceeds.\n\nThe act of warming, or the state of being warmed; a warming; a heating. [Colloq.] Dickens."}