{"word":"warp","definition":"1. To throw; hence, to send forth, or throw out, as words; to utter. [Obs.] Piers Plowman. 2. To turn or twist out of shape; esp., to twist or bend out of a flat plane by contraction or otherwise. The planks looked warped. Coleridge. Walter warped his mouth at this To something so mock solemn, that I laughed. Tennyson. 3. To turn aside from the true direction; to cause to bend or incline; to pervert. This first avowed, nor folly warped my mind. Dryden. I have no private considerations to warp me in this controversy. Addison. We are divested of all those passions which cloud the intellects, and warp the understandings, of men. Southey. 4. To weave; to fabricate. [R. & Poetic.] Nares. While doth he mischief warp. Sternhold. 5. (Naut.)  To tow or move, as a vessel, with a line, or warp, attached to a buoy, anchor, or other fixed object. 6. To cast prematurely, as young; -- said of cattle, sheep, etc. [Prov. Eng.] 7. (Agric.)  To let the tide or other water in upon (lowlying land), for the purpose of fertilization, by a deposit of warp, or slimy substance. [Prov. Eng.] 8. (Rope Making)  To run off the reel into hauls to be tarred, as yarns. 9. (Weaving)  To arrange (yarns) on a warp beam. Warped surface (Geom.), a surface generated by a straight line moving so that no two of its consecutive positions shall be in the same plane. Davies & Peck.\n\n1. To turn, twist, or be twisted out of shape; esp., to be twisted or bent out of a flat plane; as, a board warps in seasoning or shrinking. One of you will prove a shrunk panel, and, like green timber, warp, warp. Shak. They clamp one piece of wood to the end of another, to keep it from casting, or warping. Moxon. 2. to turn or incline from a straight, true, or proper course; to deviate; to swerve. There is our commission, From which we would not have you warp. Shak. 3. To fly with a bending or waving motion; to turn and wave, like a flock of birds or insects. A pitchy cloud Of locusts, warping on the eastern wind. Milton. 4. To cast the young prematurely; to slink; -- said of cattle, sheep, etc. [Prov. Eng.] 5. (Weaving)  To wind yarn off bobbins for forming the warp of a web; to wind a warp on a warp beam.\n\n1. (Weaving)  The threads which are extended lengthwise in the loom, and crossed by the woof. 2. (Naut.)  A rope used in hauling or moving a vessel, usually with one end attached to an anchor, a post, or other fixed object; a towing line; a warping hawser. 3. (Agric.)  A slimy substance deposited on land by tides, etc., by which a rich alluvial soil is formed. Lyell. 4. A premature casting of young; -- said of cattle, sheep, etc. [Prov. Eng.] 5. Four; esp., four herrings; a cast. See Cast, n., 17. [Prov. Eng.] Wright. 6. Etym: [From Warp, v.]  The state of being warped or twisted; as, the warp of a board. Warp beam, the roller on which the warp is wound in a loom. -- Warp fabric, fabric produced by warp knitting. -- Warp frame, or Warp-net frame, a machine for making warp lace having a number of needles and employing a thread for each needle. -- Warp knitting, a kind of knitting in which a number of threads are interchained each with one or more contiguous threads on either side; -- also called warp weaving. -- Warp lace, or Warp net, lace having a warp crossed by weft threads."}