{"word":"wash","definition":"1. To cleanse by ablution, or dipping or rubbing in water; to apply water or other liquid to for the purpose of cleansing; to scrub with water, etc., or as with water; as, to wash the hands or body; to wash garments; to wash sheep or wool; to wash the pavement or floor; to wash the bark of trees. When Pilate saw that he could prevail nothing, . . . he took water and washed his hands before the multitude, saying, I am innocent of the blood of this just person. Matt. xxvii. 24. 2. To cover with water or any liquid; to wet; to fall on and moisten; hence, to overflow or dash against; as, waves wash the shore. Fresh-blown roses washed with dew. Milton. [The landscape] washed with a cold, gray mist. Longfellow. 3. To waste or abrade by the force of water in motion; as, heavy rains wash a road or an embankment. 4. To remove by washing to take away by, or as by, the action of water; to drag or draw off as by the tide; -- often with away, off, out, etc.; as, to wash dirt from the hands. Arise, and be baptized, and wash away thy sins. Acts xxii. 16. The tide will wash you off. Shak. 5. To cover with a thin or watery coat of color; to tint lightly and thinly. 6. To overlay with a thin coat of metal; as, steel washed with silver. To wash gold, etc., to treat earth or gravel, or crushed ore, with water, in order to separate the gold or other metal, or metallic ore, through their superior gravity. -- To wash the hands of. See under Hand.\n\n1. To perform the act of ablution. Wash in Jordan seven times. 2 Kings v. 10. 2. To clean anything by rubbing or dipping it in water; to perform the business of cleansing clothes, ore, etc., in water. \"She can wash and scour.\" Shak. 3. To bear without injury the operation of being washed; as, some calicoes do not wash. [Colloq.] 4. To be wasted or worn away by the action of water, as by a running or overflowing stream, or by the dashing of the sea; -- said of road, a beach, etc.\n\n1. The act of washing; an ablution; a cleansing, wetting, or dashing with water; hence, a quantity, as of clothes, washed at once. 2. A piece of ground washed by the action of a sea or river, or sometimes covered and sometimes left dry; the shallowest part of a river, or arm of the sea; also, a bog; a marsh; a fen; as, the washes in Lincolnshire. \"The Wash of Edmonton so gay.\" Cowper. These Lincoln washes have devoured them. Shak. 3. Substances collected and deposited by the action of water; as, the wash of a sewer, of a river, etc. The wash of pastures, fields, commons, and roads, where rain water hath a long time settled. Mortimer. 4. Waste liquid, the refuse of food, the collection from washed dishes, etc., from a kitchen, often used as food for pigs. Shak. 5. (Distilling) (a) The fermented wort before the spirit is extracted. (b) A mixture of dunder, molasses, water, and scummings, used in the West Indies for distillation. B. Edwards. 6. That with which anything is washed, or wetted, smeared, tinted, etc., upon the surface. Specifically: -- (a) A liquid cosmetic for the complexion. (b) A liquid dentifrice. (c) A liquid preparation for the hair; as, a hair wash. (d) A medical preparation in a liquid form for external application; a lotion. (e) (Painting) A thin coat of color, esp. water color. (j) A thin coat of metal laid on anything for beauty or preservation. 7. (Naut.) (a) The blade of an oar, or the thin part which enters the water. (b) The backward current or disturbed water caused by the action of oars, or of a steamer's screw or paddles, etc. 8. The flow, swash, or breaking of a body of water, as a wave; also, the sound of it. 9. Ten strikes, or bushels, of oysters. [Prov. Eng.] Wash ball, a ball of soap to be used in washing the hands or face. Swift. -- Wash barrel (Fisheries), a barrel nearly full of split mackerel, loosely put in, and afterward filled with salt water in order to soak the blood from the fish before salting. -- Wash bottle. (Chem.) (a) A bottle partially filled with some liquid through which gases are passed for the purpose of purifying them, especially by removing soluble constituents. (b) A washing bottle. See under Washing. -- Wash gilding. See Water gilding. -- Wash leather, split sheepskin dressed with oil, in imitation of chamois, or shammy, and used for dusting, cleaning glass or plate, etc.; also, alumed, or buff, leather for soldiers' belts.\n\nWashy; weak. [Obs.] Their bodies of so weak and wash a temper. Beau. & Fl. 2. Capable of being washed without injury; washable; as, wash goods. [Colloq.]"}