{"word":"water","definition":"1. The fluid which descends from the clouds in rain, and which forms rivers, lakes, seas, etc. \"We will drink water.\" Shak.\"Powers of fire, air, water, and earth.\" Milton. Note: Pure water consists of hydrogen and oxygen, H2O, and is a colorless, odorless, tasteless, transparent liquid, which is very slightly compressible. At its maximum density, 39º Fahr. or 4º C., it is the standard for specific gravities, one cubic centimeter weighing one gram. It freezes at 32º Fahr. or 0º C. and boils at 212º Fahr. or 100º C. (see Ice, Steam). It is the most important natural solvent, and is frequently impregnated with foreign matter which is mostly removed by distillation; hence, rain water is nearly pure. It is an important ingredient in the tissue of animals and plants, the human body containing about two thirds its weight of water. 2. A body of water, standing or flowing; a lake, river, or other collection of water. Remembering he had passed over a small water a poor scholar when first coming to the university, he kneeled. Fuller. 3. Any liquid secretion, humor, or the like, resembling water; esp., the urine. 4. (Pharm.)  A solution in water of a gaseous or readily volatile substance; as, ammonia water. U. S. Pharm. 5. The limpidity and luster of a precious stone, especially a diamond; as, a diamond of the first water, that is, perfectly pure and transparent. Hence, of the first water, that is, of the first excellence. 6. A wavy, lustrous pattern or decoration such as is imparted to linen, silk, metals, etc. See Water, v. t., 3, Damask, v. t., and Damaskeen. 7. An addition to the shares representing the capital of a stock company so that the aggregate par value of the shares is increased while their value for investment is diminished, or \"diluted.\" [Brokers' Cant] Note: Water is often used adjectively and in the formation of many self-explaining compounds; as, water drainage; water gauge, or water- gauge; waterfowl, water-fowl, or water fowl; water-beaten; water- borne, water-circled, water-girdled, water-rocked, etc. Hard water. See under Hard. -- Inch of water, a unit of measure of quantity of water, being the quantity which will flow through an orifice one inch square, or a circular orifice one inch in diameter, in a vertical surface, under a stated constant head; also called miner's inch, and water inch. The shape of the orifice and the head vary in different localities. In the Western United States, for hydraulic mining, the standard aperture is square and the head from 4 to 9 inches above its center. In Europe, for experimental hydraulics, the orifice is usually round and the head from -- Mineral water, waters which are so impregnated with foreign ingredients, such as gaseous, sulphureous, and saline substances, as to give them medicinal properties, or a particular flavor or temperature. -- Soft water, water not impregnated with lime or mineral salts. -- To hold water. See under Hold, v. t. -- To keep one's head above water, to keep afloat; fig., to avoid failure or sinking in the struggles of life. [Colloq.] -- To make water. (a) To pass urine. Swift. (b) (Naut.) To admit water; to leak. -- Water of crystallization (Chem.), the water combined with many salts in their crystalline form. This water is loosely, but, nevertheless, chemically, combined, for it is held in fixed and definite amount for each substance containing it. Thus, while pure copper sulphate, CuSO4, is a white amorphous substance, blue vitriol, the crystallized form, CuSO4.5H2O, contains five molecules of water of crystallization. -- Water on the brain (Med.), hydrocephalus. -- Water on the chest (Med.), hydrothorax. Note: Other phrases, in which water occurs as the first element, will be found in alphabetical order in the Vocabulary.\n\n1. To wet or supply with water; to moisten; to overflow with water; to irrigate; as, to water land; to water flowers. With tears watering the ground. Milton. Men whose lives gilded on like rivers that water the woodlands. Longfellow. 2. To supply with water for drink; to cause or allow to drink; as, to water cattle and horses. 3. To wet and calender, as cloth, so as to impart to it a lustrous appearance in wavy lines; to diversify with wavelike lines; as, to water silk. Cf. Water, n., 6. 4. To add water to (anything), thereby extending the quantity or bulk while reducing the strength or quality; to extend; to dilute; to weaken. To water stock, to increase the capital stock of a company by issuing new stock, thus diminishing the value of the individual shares. Cf. Water, n., 7. [Brokers' Cant]\n\n1. To shed, secrete, or fill with, water or liquid matter; as, his eyes began to water. If thine eyes can water for his death. Shak. 2. To get or take in water; as, the ship put into port to water. The mouth waters, a phrase denoting that a person or animal has a longing desire for something, since the sight of food often causes one who is hungry to have an increased flow of saliva."}