{"word":"wave","definition":"See Wave. Sir H. Wotton. Burke.\n\n1. To play loosely; to move like a wave, one way and the other; to float; to flutter; to undulate. His purple robes waved careless to the winds. Trumbull. Where the flags of three nations has successively waved. Hawthorne. 2. To be moved to and fro as a signal. B. Jonson. 3. To fluctuate; to waver; to be in an unsettled state; to vacillate. [Obs.] He waved indifferently 'twixt doing them neither good nor harm. Shak.\n\n1. To move one way and the other; to brandish. \"[Æneas] waved his fatal sword.\" Dryden. 2. To raise into inequalities of surface; to give an undulating form a surface to. Horns whelked and waved like the enridged sea. Shak. 3. To move like a wave, or by floating; to waft. [Obs.] Sir T. Browne. 4. To call attention to, or give a direction or command to, by a waving motion, as of the hand; to signify by waving; to beckon; to signal; to indicate. Look, with what courteous action It waves you to a more removed ground. Shak. She spoke, and bowing waved Dismissal. Tennyson.\n\n1. An advancing ridge or swell on the surface of a liquid, as of the sea, resulting from the oscillatory motion of the particles composing it when disturbed by any force their position of rest; an undulation. The wave behind impels the wave before. Pope. 2. (Physics)  A vibration propagated from particle to particle through a body or elastic medium, as in the transmission of sound; an assemblage of vibrating molecules in all phases of a vibration, with no phase repeated; a wave of vibration; an undulation. See Undulation. 3. Water; a body of water. [Poetic] \"Deep drank Lord Marmion of the wave.\" Sir W. Scott. Build a ship to save thee from the flood, I 'll furnish thee with fresh wave, bread, and wine. Chapman. 4. Unevenness; inequality of surface. Sir I. Newton. 5. A waving or undulating motion; a signal made with the hand, a flag, etc. 6. The undulating line or streak of luster on cloth watered, or calendered, or on damask steel. 7. Fig.: A swelling or excitement of thought, feeling, or energy; a tide; as, waves of enthusiasm. Wave front (Physics), the surface of initial displacement of the particles in a medium, as a wave of vibration advances. -- Wave length (Physics), the space, reckoned in the direction of propagation, occupied by a complete wave or undulation, as of light, sound, etc.; the distance from a point or phase in a wave to the nearest point at which the same phase occurs. -- Wave line (Shipbuilding), a line of a vessel's hull, shaped in accordance with the wave-line system. -- Wave-line system, Wave-line theory (Shipbuilding), a system or theory of designing the lines of a vessel, which takes into consideration the length and shape of a wave which travels at a certain speed. -- Wave loaf, a loaf for a wave offering. Lev. viii. 27. -- Wave moth (Zoöl.), any one of numerous species of small geometrid moths belonging to Acidalia and allied genera; -- so called from the wavelike color markings on the wings. -- Wave offering, an offering made in the Jewish services by waving the object, as a loaf of bread, toward the four cardinal points. Num. xviii. 11. -- Wave of vibration (Physics), a wave which consists in, or is occasioned by, the production and transmission of a vibratory state from particle to particle through a body. -- Wave surface. (a) (Physics) A surface of simultaneous and equal displacement of the particles composing a wave of vibration. (b) (Geom.) A mathematical surface of the fourth order which, upon certain hypotheses, is the locus of a wave surface of light in the interior of crystals. It is used in explaining the phenomena of double refraction. See under Refraction. -- Wave theory. (Physics) See Undulatory theory, under Undulatory."}