{"word":"wear","definition":"Same as Weir.\n\nTo cause to go about, as a vessel, by putting the helm up, instead of alee as in tacking, so that the vessel's bow is turned away from, and her stern is presented to, the wind, and, as she turns still farther, her sails fill on the other side; to veer.\n\n1. To carry or bear upon the person; to bear upon one's self, as an article of clothing, decoration, warfare, bondage, etc.; to have appendant to one's body; to have on; as, to wear a coat; to wear a shackle. What compass will you wear your farthingale Shak. On her white breast a sparkling cross swore, Which Jews might kiss, and infidels adore. Pope. 2. To have or exhibit an appearance of, as an aspect or manner; to bear; as, she wears a smile on her countenance. \"He wears the rose of youth upon him.\" Shak. His innocent gestures wear A meaning half divine. Keble. 3. To use up by carrying or having upon one's self; hence, to consume by use; to waste; to use up; as, to wear clothes rapidly. 4. To impair, waste, or diminish, by continual attrition, scraping, percussion, on the like; to consume gradually; to cause to lower or disappear; to spend. That wicked wight his days doth wear. Spenser. The waters wear the stones. Job xiv. 19. 5. To cause or make by friction or wasting; as, to wear a channel; to wear a hole. 6. To form or shape by, or as by, attrition. Trials wear us into a liking of what, possibly, in the first essay, displeased us. Locke. To wear away, to consume; to impair, diminish, or destroy, by gradual attrition or decay. -- To wear off, to diminish or remove by attrition or slow decay; as, to wear off the nap of cloth. -- To wear on or upon, to wear. [Obs.] \"[I] weared upon my gay scarlet gites [gowns.]\" Chaucer. -- To wear out. (a) To consume, or render useless, by attrition or decay; as, to wear out a coat or a book. (b) To consume tediously. \"To wear out miserable days.\" Milton. (c) To harass; to tire. \"[He] shall wear out the saints of the Most High.\" Dan vii. 25. (d) To waste the strength of; as, an old man worn out in military service. -- To wear the breeches. See under Breeches. [Colloq.]\n\n1. To endure or suffer use; to last under employment; to bear the consequences of use, as waste, consumption, or attrition; as, a coat wears well or ill; -- hence, sometimes applied to character, qualifications, etc.; as, a man wears well as an acquaintance. 2. To be wasted, consumed, or diminished, by being used; to suffer injury, loss, or extinction by use or time; to decay, or be spent, gradually. \"Thus wore out night.\" Milton. Away, I say; time wears. Shak. Thou wilt surely wear away, both thou and this people that is with thee. Ex. xviii. 18. His stock of money began to wear very low. Sir W. Scott. The family . . . wore out in the earlier part of the century. Beaconsfield. To wear off, to pass away by degrees; as, the follies of youth wear off with age. -- To wear on, to pass on; as, time wears on. G. Eliot. -- To wear weary, to become weary, as by wear, long occupation, tedious employment, etc.\n\n1. The act of wearing, or the state of being worn; consumption by use; diminution by friction; as, the wear of a garment. 2. The thing worn; style of dress; the fashion. Motley wear. Shak. Wear and tear, the loss by wearing, as of machinery in use; the loss or injury to which anything is subjected by use, accident, etc.\n\n1. A dam in a river to stop and raise the water, for the purpose of conducting it to a mill, forming a fish pond, or the like. 2. A fence of stakes, brushwood, or the like, set in a stream, tideway, or inlet of the sea, for taking fish. 3. A long notch with a horizontal edge, as in the top of a vertical plate or plank, through which water flows, -- used in measuring the quantity of flowing water."}