{"word":"weight","definition":"1. The quality of being heavy; that property of bodies by which they tend toward the center of the earth; the effect of gravitative force, especially when expressed in certain units or standards, as pounds, grams, etc. Note: Weight differs from gravity in being the effect of gravity, or the downward pressure of a body under the influence of gravity; hence, it constitutes a measure of the force of gravity, and being the resultant of all the forces exerted by gravity upon the different particles of the body, it is proportional to the quantity of matter in the body. 2. The quantity of heaviness; comparative tendency to the center of the earth; the quantity of matter as estimated by the balance, or expressed numerically with reference to some standard unit; as, a mass of stone having the weight of five hundred pounds. For sorrow, like a heavy-hanging bell, Once set on ringing, with his own weight goes. Shak. 3. Hence, pressure; burden; as, the weight of care or business. \"The weight of this said time.\" Shak. For the public all this weight he bears. Milton. [He] who singly bore the world's sad weight. Keble. 4. Importance; power; influence; efficacy; consequence; moment; impressiveness; as, a consideration of vast weight. In such a point of weight, so near mine honor. Shak. 5. A scale, or graduated standard, of heaviness; a mode of estimating weight; as, avoirdupois weight; troy weight; apothecaries' weight. 6. A ponderous mass; something heavy; as, a clock weight; a paper weight. A man leapeth better with weights in his hands. Bacon. 7. A definite mass of iron, lead, brass, or other metal, to be used for ascertaining the weight of other bodies; as, an ounce weight. 8. (Mech.)  The resistance against which a machine acts, as opposed to the power which moves it. [Obs.] Atomic weight. (Chem.) See under Atomic, and cf. Element. -- Dead weight, Feather weight, Heavy weight, Light weight, etc. See under Dead, Feather, etc. -- Weight of observation (Astron. & Physics), a number expressing the most probable relative value of each observation in determining the result of a series of observations of the same kind. Syn. -- Ponderousness; gravity; heaviness; pressure; burden; load; importance; power; influence; efficacy; consequence; moment; impressiveness.\n\n1. To load with a weight or weights; to load down; to make heavy; to attach weights to; as, to weight a horse or a jockey at a race; to weight a whip handle. The arrows of satire, . . . weighted with sense. Coleridge. 2. (Astron. & Physics)  To assign a weight to; to express by a number the probable accuracy of, as an observation. See Weight of observations, under Weight."}