{"word":"weigh","definition":"A corruption of Way, used only in the phrase under weigh. An expedition was got under weigh from New York. Thackeray. The Athenians . . . hurried on board and with considerable difficulty got under weigh. Jowett (Thucyd.).\n\n1. To bear up; to raise; to lift into the air; to swing up; as, to weigh anchor. \"Weigh the vessel up.\" Cowper. 2. To examine by the balance; to ascertain the weight of, that is, the force with which a thing tends to the center of the earth; to determine the heaviness, or quantity of matter of; as, to weigh sugar; to weigh gold. Thou art weighed in the balances, and art found wanting. Dan. v. 27. 3. To be equivalent to in weight; to counterbalance; to have the heaviness of. \"A body weighing divers ounces.\" Boyle. 4. To pay, allot, take, or give by weight. They weighed for my price thirty pieces of silver. Zech. xi. 12. 5. To examine or test as if by the balance; to ponder in the mind; to consider or examine for the purpose of forming an opinion or coming to a conclusion; to estimate deliberately and maturely; to balance. A young man not weighed in state affairs. Bacon. Had no better weighed The strength he was to cope with, or his own. Milton. Regard not who it is which speaketh, but weigh only what is spoken. Hooker. In nice balance, truth with gold she weighs. Pope. Without sufficiently weighing his expressions. Sir W. Scott. 6. To consider as worthy of notice; to regard. [Obs. or Archaic] \"I weigh not you.\" Shak. All that she so dear did weigh. Spenser. To weigh down. (a) To overbalance. (b) To oppress with weight; to overburden; to depress. \"To weigh thy spirits down.\" Milton.\n\n1. To have weight; to be heavy. \"They only weigh the heavier.\" Cowper. 2. To be considered as important; to have weight in the intellectual balance. Your vows to her and me . . . will even weigh. Shak. This objection ought to weigh with those whose reading is designed for much talk and little knowledge. Locke. 3. To bear heavily; to press hard. Cleanse the stuffed bosom of that perilous stuff Which weighs upon the heart. Shak. 4. To judge; to estimate. [R.] Could not weigh of worthiness aright. Spenser. To weigh down, to sink by its own weight.\n\nA certain quantity estimated by weight; an English measure of weight. See Wey."}