{"word":"well","definition":"1. An issue of water from the earth; a spring; a fountain. Begin, then, sisters of the sacred well. Milton. 2. A pit or hole sunk into the earth to such a depth as to reach a supply of water, generally of a cylindrical form, and often walled with stone or bricks to prevent the earth from caving in. The woman said unto him, Sir, thou hast nothing to draw with, and the well is deep. John iv. 11. 3. A shaft made in the earth to obtain oil or brine. 4. Fig.: A source of supply; fountain; wellspring. \"This well of mercy.\" Chaucer. Dan Chaucer, well of English undefiled. Spenser. A well of serious thought and pure. Keble. 5. (Naut.) (a) An inclosure in the middle of a vessel's hold, around the pumps, from the bottom to the lower deck, to preserve the pumps from damage and facilitate their inspection. (b) A compartment in the middle of the hold of a fishing vessel, made tight at the sides, but having holes perforated in the bottom to let in water for the preservation of fish alive while they are transported to market. (c) A vertical passage in the stern into which an auxiliary screw propeller may be drawn up out of water. (d) A depressed space in the after part of the deck; -- often called the cockpit. 6. (Mil.)  A hole or excavation in the earth, in mining, from which run branches or galleries. 7. (Arch.)  An opening through the floors of a building, as for a staircase or an elevator; a wellhole. 8. (Metal.)  The lower part of a furnace, into which the metal falls. Artesian well, Driven well. See under Artesian, and Driven. -- Pump well. (Naut.) See Well, 5 (a), above. -- Well boring, the art or process of boring an artesian well. -- Well drain. (a) A drain or vent for water, somewhat like a well or pit, serving to discharge the water of wet land. (b) A drain conducting to a well or pit. -- Well room. (a) A room where a well or spring is situated; especially, one built over a mineral spring. (b) (Naut.) A depression in the bottom of a boat, into which water may run, and whence it is thrown out with a scoop. -- Well sinker, one who sinks or digs wells. -- Well sinking, the art or process of sinking or digging wells. -- Well staircase (Arch.), a staircase having a wellhole (see Wellhole (b)), as distinguished from one which occupies the whole of the space left for it in the floor. -- Well sweep. Same as Sweep, n., 12. -- Well water, the water that flows into a well from subterraneous springs; the water drawn from a well.\n\nTo issue forth, as water from the earth; to flow; to spring. \"[Blood] welled from out the wound.\" Dryden. \"[Yon spring] wells softly forth.\" Bryant. From his two springs in Gojam's sunny realm, Pure welling out, he through the lucid lake Of fair Dambea rolls his infant streams. Thomson.\n\nTo pour forth, as from a well. Spenser.\n\n1. In a good or proper manner; justly; rightly; not ill or wickedly. If thou doest not well, sin lieth at the door. Gen. iv. 7. 2. Suitably to one's condition, to the occasion, or to a proposed end or use; suitably; abundantly; fully; adequately; thoroughly. Lot . . . beheld all the plain of Jordan, that it was well watered everywhere. Gen. xiii. 10. WE are wellable to overcome it. Num. xiii. 30. She looketh well to the ways of her household. Prov. xxxi. 27. Servant of God, well done! well hast thou fought The better fight. Milton. 3. Fully or about; -- used with numbers. [Obs.] \"Well a ten or twelve.\" Chaucer. Well nine and twenty in a company. Chaucer. 4. In such manner as is desirable; so as one could wish; satisfactorily; favorably; advantageously; conveniently. \"It boded well to you.\" Dryden. Know In measure what the mind may well contain. Milton. All the world speaks well of you. Pope. 5. Considerably; not a little; far. Abraham and Sarah were old and well stricken in age. Gen. xviii. 11. Note: Well is sometimes used elliptically for it is well, as an expression of satisfaction with what has been said or done, and sometimes it expresses concession, or is merely expletive; as, well, the work is done; well, let us go; well, well, be it so. Note: Well, like above, ill, and so, is used before many participial adjectives in its usual adverbial senses, and subject to the same custom with regard to the use of the hyphen (see the Note under Ill, adv.); as, a well-affected supporter; he was well affected toward the project; a well-trained speaker; he was well trained in speaking; well-educated, or well educated; well-dressed, or well dressed; well- appearing; well-behaved; well-controlled; well-designed; well- directed; well-formed; well-meant; well-minded; well-ordered; well- performed; well-pleased; well-pleasing; well-seasoned; well-steered; well-tasted; well-told, etc. Such compound epithets usually have an obvious meaning, and since they may be formed at will, only a few of this class are given in the Vocabulary. As well. See under As. -- As well as, and also; together with; not less than; one as much as the other; as, a sickness long, as well as severe; London is the largest city in England, as well as the capital. -- Well enough, well or good in a moderate degree; so as to give satisfaction, or so as to require no alteration. -- Well off, in good condition; especially, in good condition as to property or any advantages; thriving; prosperous. -- Well to do, well off; prosperous; -- used also adjectively. \"The class well to do in the world.\" J. H. Newman. -- Well to live, in easy circumstances; well off; well to do. Shak.\n\n1. Good in condition or circumstances; desirable, either in a natural or moral sense; fortunate; convenient; advantageous; happy; as, it is well for the country that the crops did not fail; it is well that the mistake was discovered. It was well with us in Egypt. Num. xi. 18. 2. Being in health; sound in body; not ailing, diseased, or sick; healthy; as, a well man; the patient is perfectly well. \"Your friends are well.\" Shak. Is your father well, the old man of whom ye spake Gen. xliii. 27. 3. Being in favor; favored; fortunate. He followed the fortunes of that family, and was well with Henry the Fourth. Dryden. 4. (Marine Insurance)  Safe; as, a chip warranted well at a certain day and place. Burrill. WE'LL We'll.  Contraction for we will or we shall. \"We'll follow them.\" Shak."}