{"word":"what","definition":"1. As an interrogative pronoun, used in asking questions regarding either persons or things; as, what is this what did you say what poem is this what child is lost What see'st thou in the ground Shak. What is man, that thou art mindful of him Ps. viii. 4. What manner of man is this, that even the winds and the sea obey him! Matt. viii. 27. Note: Originally, what, when, where, which, who, why, etc., were interrogatives only, and it is often difficult to determine whether they are used as interrogatives or relatives. What in this sense, when it refers to things, may be used either substantively or adjectively; when it refers to persons, it is used only adjectively with a noun expressed, who being the pronoun used substantively. 2. As an exclamatory word: -- (a) Used absolutely or independently; - - often with a question following. \"What welcome be thou.\" Chaucer. What, could ye not watch with me one hour Matt. xxvi. 40. (b) Used adjectively, meaning how remarkable, or how great; as, what folly! what eloquence! what courage! What a piece of work is man! Shak. O what a riddle of absurdity! Young. Note: What in this use has a or an between itself and its noun if the qualitative or quantitative importance of the object is emphasized. (c) Sometimes prefixed to adjectives in an adverbial sense, as nearly equivalent to how; as, what happy boys! What partial judges are our and hate! Dryden. 3. As a relative pronoun: -- (a) Used substantively with the antecedent suppressed, equivalent to that which, or those [persons] who, or those [things] which; -- called a compound relative. With joy beyond what victory bestows. Cowper. I'm thinking Captain Lawton will count the noses of what are left before they see their whaleboats. Cooper. What followed was in perfect harmony with this beginning. Macaulay. I know well . . . how little you will be disposed to criticise what comes to you from me. J. H. Newman. (b) Used adjectively, equivalent to the . . . which; the sort or kind of . . . which; rarely, the . . . on, or at, which. See what natures accompany what colors. Bacon. To restrain what power either the devil or any earthly enemy hath to work us woe. Milton. We know what master laid thy keel, What workmen wrought thy ribs of steel. Longfellow. (c) Used adverbially in a sense corresponding to the adjectival use; as, he picked what good fruit he saw. 4. Whatever; whatsoever; what thing soever; -- used indefinitely. \"What after so befall.\" Chaucer. Whether it were the shortness of his foresight, the strength of his will, . . . or what it was. Bacon. 5. Used adverbially, in part; partly; somewhat; -- with a following preposition, especially, with, and commonly with repetition. What for lust [pleasure] and what for lore. Chaucer. Thus, what with the war, what with the sweat, what with the gallows, and what with poverty, I am custom shrunk. Shak. The year before he had so used the matter that what by force, what by policy, he had taken from the Christians above thirty small castles. Knolles. Note: In such phrases as I tell you what, what anticipates the following statement, being elliptical for what I think, what it is, how it is, etc. \"I tell thee what, corporal Bardolph, I could tear her.\" Shak. Here what relates to the last clause, \"I could tear her;\" this is what I tell you. What not is often used at the close of an enumeration of several particulars or articles, it being an abbreviated clause, the verb of which, being either the same as that of the principal clause or a general word, as be, say, mention, enumerate, etc., is omitted. \"Men hunt, hawk, and what not.\" Becon. \"Some dead puppy, or log, orwhat not.\" C. Kingsley. \"Battles, tournaments, hunts, and what not.\" De Quincey. Hence, the words are often used in a general sense with the force of a substantive, equivalent to anything you please, a miscellany, a variety, etc. From this arises the name whatnot, applied to an étagère, as being a piece of furniture intended for receiving miscellaneous articles of use or ornament. But what is used for but that, usually after a negative, and excludes everything contrary to the assertion in the following sentence. \"Her needle is not so absolutely perfect in tent and cross stitch but what my superintendence is advisable.\" Sir W. Scott. \"Never fear but what our kite shall fly as high.\" Ld. Lytton. What ho! an exclamation of calling. -- What if, what will it matter if; what will happen or be the result if. \"What if it be a poison\" Shak. -- What of this that it etc., what follows from this, that, it, etc., often with the implication that it is of no consequence. \"All this is so; but what of this, my lord\" Shak. \"The night is spent, why, what of that\" Shak. -- What though, even granting that; allowing that; supposing it true that. \"What though the rose have prickles, yet't is plucked.\" Shak. -- What time, or What time as, when. [Obs. or Archaic] \"What time I am afraid, I will trust in thee.\" Ps. lvi. 3. What time the morn mysterious visions brings. Pope.\n\nSomething; thing; stuff. [Obs.] And gave him for to feed, Such homely what as serves the simple Spenser.\n\nWhy For what purpose On what account [Obs.] What should I tell the answer of the knight. Chaucer. But what do I stand reckoning upon advantages and gains lost by the misrule and turbulency of the prelates What do I pick up so thriftily their scatterings and diminishings of the meaner subject Milton. WHATE'ER What*e'er\", pron.  A contraction of what-ever; -- used in poetry. \"Whate'er is in his way.\" Shak."}