{"word":"wheat","definition":"A cereal grass (Triticum vulgare) and its grain, which furnishes a white flour for bread, and, next to rice, is the grain most largely used by the human race. Note: Of this grain the varieties are numerous, as red wheat, white wheat, bald wheat, bearded wheat, winter wheat, summer wheat, and the like. Wheat is not known to exist as a wild native plant, and all statements as to its origin are either incorrect or at best only guesses. Buck wheat. (Bot.) See Buckwheat. -- German wheat. (Bot.) See 2d Spelt. -- Guinea wheat (Bot.), a name for Indian corn. -- Indian wheat, or Tartary wheat (Bot.), a grain (Fagopyrum Tartaricum) much like buckwheat, but only half as large. -- Turkey wheat (Bot.), a name for Indian corn. -- Wheat aphid, or Wheat aphis (Zoöl.), any one of several species of Aphis and allied genera, which suck the sap of growing wheat. -- Wheat beetle. (Zoöl.) (a) A small, slender, rusty brown beetle (Sylvanus Surinamensis) whose larvæ feed upon wheat, rice, and other grains. (b) A very small, reddish brown, oval beetle (Anobium paniceum) whose larvæ eat the interior of grains of wheat. -- Wheat duck (Zoöl.), the American widgeon. [Western U. S.] -- Wheat fly. (Zoöl.) Same as Wheat midge, below. -- Wheat grass (Bot.), a kind of grass (Agropyrum caninum) somewhat resembling wheat. It grows in the northern parts of Europe and America. -- Wheat jointworm. (Zoöl.) See Jointworm. -- Wheat louse (Zoöl.), any wheat aphid. -- Wheat maggot (Zoöl.), the larva of a wheat midge. -- Wheat midge. (Zoöl.) (a) A small two-winged fly (Diplosis tritici) which is very destructive to growing wheat, both in Europe and America. The female lays her eggs in the flowers of wheat, and the larvæ suck the juice of the young kernels and when full grown change to pupæ in the earth. (b) The Hessian fly. See under Hessian. -- Wheat moth (Zoöl.), any moth whose larvæ devour the grains of wheat, chiefly after it is harvested; a grain moth. See Angoumois Moth, also Grain moth, under Grain. -- Wheat thief (Bot.), gromwell; -- so called because it is a troublesome weed in wheat fields. See Gromwell. -- Wheat thrips (Zoöl.), a small brown thrips (Thrips cerealium) which is very injurious to the grains of growing wheat. -- Wheat weevil. (Zoöl.) (a) The grain weevil. (b) The rice weevil when found in wheat."}