{"word":"whistle","definition":"1. To make a kind of musical sound, or series of sounds, by forcing the breath through a small orifice formed by contracting the lips; also, to emit a similar sound, or series of notes, from the mouth or beak, as birds. The weary plowman leaves the task of day, And, trudging homeward, whistles on the way. Gay. 2. To make a shrill sound with a wind or steam instrument, somewhat like that made with the lips; to blow a sharp, shrill tone. 3. To sound shrill, or like a pipe; to make a sharp, shrill sound; as, a bullet whistles through the air. The wild winds whistle, and the billows roar. Pope.\n\n1. To form, utter, or modulate by whistling; as, to whistle a tune or an air. 2. To send, signal, or call by a whistle. He chanced to miss his dog; we stood still till he had whistled him up. Addison. To whistle off. (a) To dismiss by a whistle; -- a term in hawking. \"AS a long-winged hawk when he is first whistled off the fist, mounts aloft.\" Burton. (b) Hence, in general, to turn loose; to abandon; to dismiss. I 'ld whistle her off, and let her down the wind To prey at fortune. Shak. Note: \"A hawk seems to have been usually sent off in this way, against the wind when sent in search of prey; with or down the wind, when turned loose, and abandoned.\" Nares.\n\n1. A sharp, shrill, more or less musical sound, made by forcing the breath through a small orifice of the lips, or through or instrument which gives a similar sound; the sound used by a sportsman in calling his dogs; the shrill note of a bird; as, the sharp whistle of a boy, or of a boatswain's pipe; the blackbird's mellow whistle. Might we but hear The folded flocks, penned in their wattled cotes, . . . Or whistle from the lodge. Milton. The countryman could not forbear smiling, . . . and by that means lost his whistle. Spectator. They fear his whistle, and forsake the seas. Dryden. 2. The shrill sound made by wind passing among trees or through crevices, or that made by bullet, or the like, passing rapidly through the air; the shrill noise (much used as a signal, etc.) made by steam or gas escaping through a small orifice, or impinging against the edge of a metallic bell or cup. 3. An instrument in which gas or steam forced into a cavity, or against a thin edge, produces a sound more or less like that made by one who whistles through the compressed lips; as, a child's whistle; a boatswain's whistle; a steam whistle (see Steam whistle, under Steam). The bells she jingled, and the whistle blew. Pope. 4. The mouth and throat; -- so called as being the organs of whistling. [Colloq.] So was her jolly whistle well ywet. Chaucer. Let's drink the other cup to wet our whistles. Walton. Whistle duck (Zoöl.), the American golden-eye."}