{"word":"whole","definition":"1. Containing the total amount, number, etc.; comprising all the parts; free from deficiency; all; total; entire; as, the whole earth; the whole solar system; the whole army; the whole nation. \"On their whole host I flew unarmed.\" Milton. The whole race of mankind. Shak. 2. Complete; entire; not defective or imperfect; not broken or fractured; unimpaired; uninjured; integral; as, a whole orange; the egg is whole; the vessel is whole. My life is yet whole in me. 2 Sam. i. 9. 3. Possessing, or being in a state of, heath and soundness; healthy; sound; well. [She] findeth there her friends hole and sound. Chaucer. They that be whole need not a physician. Matt. ix. 12. When Sir Lancelot's deadly hurt was whole. Tennyson. Whole blood. (Law of Descent) See under Blood, n., 2. -- Whole note (Mus.), the note which represents a note of longest duration in common use; a semibreve. -- Whole number (Math.), a number which is not a fraction or mixed number; an integer. Whole snipe (Zoöl.), the common snipe, as distinguished from the smaller jacksnipe. [Prov. Eng.] Syn. -- All; total; complete; entire; integral; undivided; uninjured; unimpaired; unbroken; healthy. -- Whole, Total, Entire, Complete. When we use the word whole, we refer to a thing as made up of parts, none of which are wanting; as, a whole week; a whole year; the whole creation. When we use the word total, we have reference to all as taken together, and forming a single totality; as, the total amount; the total income. When we speak of a thing as entire, we have no reference to parts at all, but regard the thing as an integer, i. e., continuous or unbroken; as, an entire year; entire prosperity. When we speak of a thing as complete, there is reference to some progress which results in a filling out to some end or object, or a perfected state with no deficiency; as, complete success; a complete victory. All the whole army stood agazed on him. Shak. One entire and perfect chrysolite. Shak. Lest total darkness should by night regain Her old possession, and extinguish life. Milton. So absolute she seems, And in herself complete. Milton.\n\n1. The entire thing; the entire assemblage of parts; totality; all of a thing, without defect or exception; a thing complete in itself. \"This not the whole of life to live, Nor all of death to die. J. Montgomery. 2. A regular combination of parts; a system. Parts answering parts shall slide into a whole. Pope. Committee of the whole. See under Committee. -- Upon the whole, considering all things; taking everything into account; in view of all the circumstances or conditions. Syn. -- Totality; total; amount; aggregate; gross."}