{"word":"wild","definition":"1. Living in a state of nature; inhabiting natural haunts, as the forest or open field; not familiar with, or not easily approached by, man; not tamed or domesticated; as, a wild boar; a wild ox; a wild cat. Winter's not gone yet, if the wild geese fly that way. Shak. 2. Growing or produced without culture; growing or prepared without the aid and care of man; native; not cultivated; brought forth by unassisted nature or by animals not domesticated; as, wild parsnip, wild camomile, wild strawberry, wild honey. The woods and desert caves, With wild thyme and gadding vine o'ergrown. Milton. 3. Desert; not inhabited or cultivated; as, wild land. \"To trace the forests wild.\" Shak. 4. Savage; uncivilized; not refined by culture; ferocious; rude; as, wild natives of Africa or America. 5. Not submitted to restraint, training, or regulation; turbulent; tempestuous; violent; ungoverned; licentious; inordinate; disorderly; irregular; fanciful; imaginary; visionary; crazy. \"Valor grown wild by pride.\" Prior. \"A wild, speculative project.\" Swift. What are these So withered and so wild in their attire Shak. With mountains, as with weapons, armed; which makes Wild work in heaven. Milton. The wild winds howl. Addison. Search then the ruling passion, there, alone The wild are constant, and the cunning known. Pope. 6. Exposed to the wind and sea; unsheltered; as, a wild roadstead. 7. Indicating strong emotion, intense excitement, or as, a wild look. 8. (Naut.)  Hard to steer; -- said of a vessel. Note: Many plants are named by prefixing wild to the names of other better known or cultivated plants to which they a bear a real or fancied resemblance; as, wild allspice, wild pink, etc. See the Phrases below. To run wild, to go unrestrained or untamed; to live or untamed; to live or grow without culture or training. -- To sow one's wild oats. See under Oat. Wild allspice. (Bot.), spicewood. -- Wild balsam apple (Bot.), an American climbing cucurbitaceous plant (Echinocystis lobata). -- Wild basil (Bot.), a fragrant labiate herb (Calamintha Clinopodium) common in Europe and America. -- Wild bean (Bot.), a name of several leguminous plants, mostly species of Phaseolus and Apios. -- Wild bee (Zoöl.), any one of numerous species of undomesticated social bees, especially the domestic bee when it has escaped from domestication and built its nest in a hollow tree or among rocks. -- Wild bergamot. (Bot.) See under Bergamot. -- Wild boar (Zoöl.), the European wild hog (Sus scrofa), from which the common domesticated swine is descended. -- Wild brier (Bot.), any uncultivated species of brier. See Brier. -- Wild bugloss (Bot.), an annual rough-leaved plant (Lycopsis arvensis) with small blue flowers. -- Wild camomile (Bot.), one or more plants of the composite genus Matricaria, much resembling camomile. -- Wild cat. (Zoöl.) (a) A European carnivore (Felis catus) somewhat resembling the domestic cat, but larger stronger, and having a short tail. It is destructive to the smaller domestic animals, such as lambs, kids, poultry, and the like. (b) The common American lynx, or bay lynx. (c) (Naut.) A wheel which can be adjusted so as to revolve either with, or on, the shaft of a capstan. Luce. -- Wild celery. (Bot.) See Tape grass, under Tape. -- Wild cherry. (Bot.) (a) Any uncultivated tree which bears cherries. The wild red cherry is Prunus Pennsylvanica. The wild black cherry is P. serotina, the wood of which is much used for cabinetwork, being of a light red color and a compact texture. (b) The fruit of various species of Prunus. -- Wild cinnamon. See the Note under Canella. -- Wild comfrey (Bot.), an American plant (Cynoglossum Virginicum) of the Borage family. It has large bristly leaves and small blue flowers. -- Wild cumin (Bot.), an annual umbelliferous plant (Lagoecia cuminoides) native in the countries about the Mediterranean. -- Wild drake (Zoöl.) the mallard. -- Wild elder (Bot.), an American plant (Aralia hispida) of the Ginseng family. -- Wild fowl (Zoöl.) any wild bird, especially any of those considered as game birds. -- Wild goose (Zoöl.), any one of several species of undomesticated geese, especially the Canada goose (Branta Canadensis), the European bean goose, and the graylag. See Graylag, and Bean goose, under Bean. -- Wild goose chase, the pursuit of something unattainable, or of something as unlikely to be caught as the wild goose. Shak. -- Wild honey, honey made by wild bees, and deposited in trees, rocks, the like. -- Wild hyacinth. (Bot.) See Hyacinth, 1 (b). Wild Irishman (Bot.), a thorny bush (Discaria Toumatou) of the Buckthorn family, found in New Zealand, where the natives use the spines in tattooing. -- Wild land. (a) Land not cultivated, or in a state that renders it unfit for cultivation. (b) Land which is not settled and cultivated. -- Wild licorice. (Bot.) See under Licorice. -- Wild mammee (Bot.), the oblong, yellowish, acid fruit of a tropical American tree (Rheedia lateriflora); -- so called in the West Indies. -- Wild marjoram (Bot.), a labiate plant (Origanum vulgare) much like the sweet marjoram, but less aromatic. -- Wild oat. (Bot.) (a) A tall, oatlike kind of soft grass (Arrhenatherum avenaceum). (b) See Wild oats, under Oat. -- Wild pieplant (Bot.), a species of dock (Rumex hymenosepalus) found from Texas to California. Its acid, juicy stems are used as a substitute for the garden rhubarb. -- Wild pigeon. (Zoöl.) (a) The rock dove. (b) The passenger pigeon. -- Wild pink (Bot.), an American plant (Silene Pennsylvanica) with pale, pinkish flowers; a kind of catchfly. -- Wild plantain (Bot.), an arborescent endogenous herb (Heliconia Bihai), much resembling the banana. Its leaves and leaf sheaths are much used in the West Indies as coverings for packages of merchandise. -- Wild plum. (Bot.) (a) Any kind of plum growing without cultivation. (b) The South African prune. See under Prune. -- Wild rice. (Bot.) See Indian rice, under Rice. -- Wild rosemary (Bot.), the evergreen shrub Andromeda polifolia. See Marsh rosemary, under Rosemary. -- Wild sage. (Bot.) See Sagebrush. -- Wild sarsaparilla (Bot.), a species of ginseng (Aralia nudicaulis) bearing a single long-stalked leaf. -- Wild sensitive plant (Bot.), either one of two annual leguminous herbs (Cassia Chamæcrista, and C. nictitans), in both of which the leaflets close quickly when the plant is disturbed. -- Wild service.(Bot.) See Sorb. -- Wild Spaniard (Bot.), any one of several umbelliferous plants of the genus Aciphylla, natives of New Zealand. The leaves bear numerous bayonetlike spines, and the plants form an impenetrable thicket. -- Wild turkey. (Zoöl.) See 2d Turkey.\n\nAn uninhabited and uncultivated tract or region; a forest or desert; a wilderness; a waste; as, the wilds of America; the wilds of Africa. then Libya first, of all her moisture drained, Became a barren waste, a wild of sand. Addison.\n\nWildly; as, to talk wild. Shak."}