{"word":"with","definition":"See Withe.\n\nWith denotes or expresses some situation or relation of nearness, proximity, association, connection, or the like. It is used especially: -- 1. To denote a close or direct relation of opposition or hostility; - - equivalent to against. Thy servant will . . . fight with this Philistine. 1 Sam. xvii. 32. Note: In this sense, common in Old English, it is now obsolete except in a few compounds; as, withhold; withstand; and after the verbs fight, contend, struggle, and the like. 2. To denote association in respect of situation or environment; hence, among; in the company of. I will buy with you, talk with you, walk with you, and so following; but I will not eat with you, drink with you, nor pray with you. Shak. Pity your own, or pity our estate, Nor twist our fortunes with your sinking fate. Dryden. See where on earth the flowery glories lie; With her they flourished, and with her they die. Pope. There is no living with thee nor without thee. Tatler. Such arguments had invincible force with those pagan philosophers. Addison. 3. To denote a connection of friendship, support, alliance, assistance, countenance, etc.; hence, on the side of. Fear not, for I am with thee, and will bless thee. Gen. xxvi. 24. 4. To denote the accomplishment of cause, means, instrument, etc; -- sometimes equivalent to by. That with these fowls I be all to-rent. Chaucer. Thou wilt be like a lover presently, And tire the hearer with a book of words. Shak. [He] entertained a coffeehouse with the following narrative. Addison. With receiving your friends within and amusing them without, you lead a good, pleasant, bustling life of it. Goldsmith. 5. To denote association in thought, as for comparison or contrast. Can blazing carbuncles with her compare. Sandys. 6. To denote simultaneous happening, or immediate succession or consequence. With that she told me . . . that she would hide no truth from me. Sir P. Sidney. With her they flourished, and with her they die. Pope. With this he pointed to his face. Dryden. 7. To denote having as a possession or an appendage; as, the firmament with its stars; a bride with a large fortune. \"A maid with clean hands.\" Shak. Note: With and by are closely allied in many of their uses, and it is not easy to lay down a rule by which to distinguish their uses. See the Note under By."}