{"word":"witness","definition":"1. Attestation of a fact or an event; testimony. May we with . . . the witness of a good conscience, pursue him with any further revenge Shak. If I bear witness of myself, my witness is not true. John v. 31. 2. That which furnishes evidence or proof. Laban said to Jacob, . . . This heap be witness, and this pillar be witness. Gen. xxxi. 51, 52. 3. One who is cognizant; a person who beholds, or otherwise has personal knowledge of, anything; as, an eyewitness; an earwitness. \"Thyself art witness I am betrothed.\" Shak. Upon my looking round, I was witness to appearances which filled me with melancholy and regret. R. Hall. 4. (Law) (a) One who testifies in a cause, or gives evidence before a judicial tribunal; as, the witness in court agreed in all essential facts. (b) One who sees the execution of an instrument, and subscribes it for the purpose of confirming its authenticity by his testimony; one who witnesses a will, a deed, a marriage, or the like. Privileged witnesses. (Law) See under Privileged. -- With a witness, effectually; to a great degree; with great force, so as to leave some mark as a testimony. [Colloq.] This, I confess, is haste with a witness. South.\n\n1. To see or know by personal presence; to have direct cognizance of. This is but a faint sketch of the incalculable calamities and horrors we must expect, should we ever witness the triumphs of modern infidelity. R. Hall. General Washington did not live to witness the restoration of peace. Marshall. 2. To give testimony to; to testify to; to attest. Behold how many things they witness against thee. Mark xv. 4. 3. (Law)  To see the execution of, as an instrument, and subscribe it for the purpose of establishing its authenticity; as, to witness a bond or a deed.\n\nTo bear testimony; to give evidence; to testify. Chaucer. The men of Belial witnessed against him. 1 Kings xxi. 13. The witnessing of the truth was then so generally attended with this event [martyrdom] that martyrdom now signifies not only to witness, but to witness to death. South."}