{"word":"word","definition":"1. The spoken sign of a conception or an idea; an articulate or vocal sound, or a combination of articulate and vocal sounds, uttered by the human voice, and by custom expressing an idea or ideas; a single component part of human speech or language; a constituent part of a sentence; a term; a vocable. \"A glutton of words.\" Piers Plowman. You cram these words into mine ears, against The stomach of my sense. Shak. Amongst men who confound their ideas with words, there must be endless disputes. Locke. 2. Hence, the written or printed character, or combination of characters, expressing such a term; as, the words on a page. 3. pl.  Talk; discourse; speech; language. Why should calamity be full of words Shak. Be thy words severe; Sharp as he merits, but the sword forbear. Dryden. 4. Account; tidings; message; communication; information; -- used only in the singular. I pray you . . . bring me word thither How the world goes. Shak. 5. Signal; order; command; direction. Give the word through. Shak. 6. Language considered as implying the faith or authority of the person who utters it; statement; affirmation; declaration; promise. Obey thy parents; keep thy word justly. Shak. I know you brave, and take you at your word. Dryden. I desire not the reader should take my word. Dryden. 7. pl.  Verbal contention; dispute. Some words there grew 'twixt Somerset and me. Shak. 8. A brief remark or observation; an expression; a phrase, clause, or short sentence. All the law is fulfilled in one word, even in this; Thou shalt love thy neighbor as thyself. Gal. v. 14. She said; but at the happy word \"he lives,\" My father stooped, re- fathered, o'er my wound. Tennyson. There is only one other point on which I offer a word of remark. Dickens. By word of mouth, orally; by actual speaking. Boyle. -- Compound word. See under Compound, a. -- Good word, commendation; favorable account. \"And gave the harmless fellow a good word.\" Pope. -- In a word, briefly; to sum up. -- In word, in declaration; in profession. \"Let us not love in word, . . . but in deed and in truth.\" 1 John iii. 8. -- Nuns of the Word Incarnate (R. C. Ch.), an order of nuns founded in France in 1625, and approved in 1638. The order, which also exists in the United States, was instituted for the purpose of doing honor to the \"Mystery of the Incarnation of the Son of God.\" -- The word, or The Word. (Theol.) (a) The gospel message; esp., the Scriptures, as a revelation of God. \"Bold to speak the word without fear.\" Phil. i. 14. (b) The second person in the Trinity before his manifestation in time by the incarnation; among those who reject a Trinity of persons, some one or all of the divine attributes personified. John i. 1. -- To eat one's words, to retract what has been said. -- To have the words for, to speak for; to act as spokesman. [Obs.] \"Our host hadde the wordes for us all.\" Chaucer. -- Word blindness (Physiol.), inability to understand printed or written words or symbols, although the person affected may be able to see quite well, speak fluently, and write correctly. Landois & Stirling. -- Word deafness (Physiol.), inability to understand spoken words, though the person affected may hear them and other sounds, and hence is not deaf. -- Word dumbness (Physiol.), inability to express ideas in verbal language, though the power of speech is unimpaired. -- Word for word, in the exact words; verbatim; literally; exactly; as, to repeat anything word for word. -- Word painting, the act of describing an object fully and vividly by words only, so as to present it clearly to the mind, as if in a picture. -- Word picture, an accurate and vivid description, which presents an object clearly to the mind, as if in a picture. -- Word square, a series of words so arranged that they can be read vertically and horizontally with like results. Syn. -- See Term.\n\nTo use words, as in discussion; to argue; to dispute. [R.]\n\n1. To express in words; to phrase. The apology for the king is the same, but worded with greater deference to that great prince. Addison. 2. To ply with words; also, to cause to be by the use of a word or words. [Obs.] Howell. 3. To flatter with words; to cajole. [Obs.] Shak. To word it, to bandy words; to dispute. [Obs.] \"To word it with a shrew.\" L'Estrange."}