{"word":"world","definition":"1. The earth and the surrounding heavens; the creation; the system of created things; existent creation; the universe. The invisible things of him from the creation of the world are clearly seen. Rom. 1. 20. With desire to know, What nearer might concern him, how this world Of heaven and earth conspicuous first began. Milton. 2. Any planet or heavenly body, especially when considered as inhabited, and as the scene of interests analogous with human interests; as, a plurality of worlds. \"Lord of the worlds above.\" I. Watts. Amongst innumerable stars, that shone Star distant, but high-hand seemed other worlds. Milton. There may be other worlds, where the inhabitants have never violated their allegiance to their almighty Sovereign. W. B. Sprague. 3. The earth and its inhabitants, with their concerns; the sum of human affairs and interests. That forbidden tree, whose mortal taste Brought death into the world, and all our woe. Milton. 4. In a more restricted sense, that part of the earth and its concerns which is known to any one, or contemplated by any one; a division of the globe, or of its inhabitants; human affairs as seen from a certain position, or from a given point of view; also, state of existence; scene of life and action; as, the Old World; the New World; the religious world; the Catholic world; the upper world; the future world; the heathen world. One of the greatest in the Christian world Shall be my surety. Shak. Murmuring that now they must be put to make war beyond the world's end -- for so they counted Britain. Milton. 5. The customs, practices, and interests of men; general affairs of life; human society; public affairs and occupations; as, a knowledge of the world. Happy is she that from the world retires. Waller. If knowledge of the world makes man perfidious, May Juba ever live in ignorance. Addison. 6. Individual experience of, or concern with, life; course of life; sum of the affairs which affect the individual; as, to begin the world with no property; to lose all, and begin the world anew. 7. The inhabitants of the earth; the human race; people in general; the public; mankind. Since I do purpose to marry, I will think nothing to any purpose that the world can say against it. Shak. Tell me, wench, how will the world repute me For undertaking so unstaid a journey Shak. 8. The earth and its affairs as distinguished from heaven; concerns of this life as distinguished from those of the life to come; the present existence and its interests; hence, secular affairs; engrossment or absorption in the affairs of this life; worldly corruption; the ungodly or wicked part of mankind. I pray not for the world, but for them which thou hast given me; for they are thine. John xvii. 9. Love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him. For all that is in the world, the lust of the flesh, and the lust of the eyes, and the pride of life, is not of the Father, but is of the world. 1 John ii. 15, 16. 9. As an emblem of immensity, a great multitude or quantity; a large number. \"A world of men.\" Chapman. \"A world of blossoms for the bee.\" Bryant. Nor doth this wood lack worlds of company. Shak. A world of woes dispatched in little space. Dryden. All . . . in the world, all that exists; all that is possible; as, all the precaution in the world would not save him. -- A world to see, a wonder to see; something admirable or surprising to see. [Obs.] O, you are novices; 't is a world to see How tame, when men and women are alone, A meacock wretch can make the curstest shrew. Shak. -- For all the world. (a) Precisely; exactly. (b) For any consideration. -- Seven wonders of the world. See in the Dictionary of Noted Names in Fiction. -- To go to the world, to be married. [Obs.] \"Thus goes every one to the world but I . . . ; I may sit in a corner and cry heighho for a husband!\" Shak. -- World's end, the end, or most distant part, of the world; the remotest regions. -- World without end, eternally; forever; everlastingly; as if in a state of existence having no end. Throughout all ages, world without end. Eph. iii. 21."}