{"word":"year","definition":"1. The time of the apparent revolution of the sun trough the ecliptic; the period occupied by the earth in making its revolution around the sun, called the astronomical year; also, a period more or less nearly agreeing with this, adopted by various nations as a measure of time, and called the civil year; as, the common lunar year of 354 days, still in use among the Mohammedans; the year of 360 days, etc. In common usage, the year consists of 365 days, and every fourth year (called bissextile, or leap year) of 366 days, a day being added to February on that year, on account of the excess above 365 days (see Bissextile). Of twenty year of age he was, I guess. Chaucer. Note: The civil, or legal, year, in England, formerly commenced on the 25th of March. This practice continued throughout the British dominions till the year 1752. 2. The time in which any planet completes a revolution about the sun; as, the year of Jupiter or of Saturn. 3. pl.  Age, or old age; as, a man in years. Shak. Anomalistic year, the time of the earth's revolution from perihelion to perihelion again, which is 365 days, 6 hours, 13 minutes, and 48 seconds. -- A year's mind (Eccl.), a commemoration of a deceased person, as by a Mass, a year after his death. Cf. A month's mind, under Month. -- Bissextile year. See Bissextile. -- Canicular year. See under Canicular. -- Civil year, the year adopted by any nation for the computation of time. -- Common lunar year, the period of 12 lunar months, or 354 days. -- Common year, each year of 365 days, as distinguished from leap year. -- Embolismic year, or Intercalary lunar year, the period of 13 lunar months, or 384 days. -- Fiscal year (Com.), the year by which accounts are reckoned, or the year between one annual time of settlement, or balancing of accounts, and another. -- Great year. See Platonic year, under Platonic. -- Gregorian year, Julian year. See under Gregorian, and Julian. -- Leap year. See Leap year, in the Vocabulary. -- Lunar astronomical year, the period of 12 lunar synodical months, or 354 days, 8 hours, 48 minutes, 36 seconds. -- Lunisolar year. See under Lunisolar. -- Periodical year. See Anomalistic year, above. -- Platonic year, Sabbatical year. See under Platonic, and Sabbatical. -- Sidereal year, the time in which the sun, departing from any fixed star, returns to the same. This is 365 days, 6 hours, 9 minutes, and 9.3 seconds. -- Tropical year. See under Tropical. -- Year and a day (O. Eng. Law), a time to be allowed for an act or an event, in order that an entire year might be secured beyond all question. Abbott. -- Year of grace, any year of the Christian era; Anno Domini; A. D. or a. d."}