{"word":"yellow","definition":"Being of a bright saffronlike color; of the color of gold or brass; having the hue of that part of the rainbow, or of the solar spectrum, which is between the orange and the green. Her yellow hair was browded [braided] in a tress. Chaucer. A sweaty reaper from his tillage brought First fruits, the green ear and the yellow sheaf. Milton. The line of yellow light dies fast away. Keble. Yellow atrophy (Med.), a fatal affection of the liver, in which it undergoes fatty degeneration, and becomes rapidly smaller and of a deep yellow tinge. The marked symptoms are black vomit, delirium, convulsions, coma, and jaundice. -- Yellow bark, calisaya bark. -- Yellow bass (Zoöl.), a North American fresh-water bass (Morone interrupta) native of the lower parts of the Mississippi and its tributaries. It is yellow, with several more or less broken black stripes or bars. Called also barfish. -- Yellow berry. (Bot.) Same as Persian berry, under Persian. -- Yellow boy, a gold coin, as a guinea. [Slang] Arbuthnot. -- Yellow brier. (Bot.) See under Brier. -- Yellow bugle (Bot.), a European labiate plant (Ajuga Chamæpitys). -- Yellow bunting (Zoöl.), the European yellow-hammer. -- Yellow cat (Zoöl.), a yellow catfish; especially, the bashaw. -- Yellow copperas (Min.), a hydrous sulphate of iron; -- called also copiapite. -- Yellow copper ore, a sulphide of copper and iron; copper pyrites. See Chalcopyrite. -- Yellow cress (Bot.), a yellow-flowered, cruciferous plant (Barbarea præcox), sometimes grown as a salad plant. -- Yellow dock. (Bot.) See the Note under Dock. -- Yellow earth, a yellowish clay, colored by iron, sometimes used as a yellow pigment. -- Yellow fever (Med.), a malignant, contagious, febrile disease of warm climates, attended with jaundice, producing a yellow color of the skin, and with the black vomit. See Black vomit, in the Vocabulary. -- Yellow flag, the quarantine flag. See under Quarantine, and 3d Flag. -- Yellow jack. (a) The yellow fever. See under 2d Jack. (b) The quarantine flag. See under Quarantine. -- Yellow jacket (Zoöl.), any one of several species of American social wasps of the genus Vespa, in which the color of the body is partly bright yellow. These wasps are noted for their irritability, and for their painful stings. -- Yellow lead ore (Min.), wulfenite. -- Yellow lemur (Zoöl.), the kinkajou. -- Yellow macauco (Zoöl.), the kinkajou. -- Yellow mackerel (Zoöl.), the jurel. -- Yellow metal. Same as Muntz metal, under Metal. -- Yellow ocher (Min.), an impure, earthy variety of brown iron ore, which is used as a pigment. -- Yellow oxeye (Bot.), a yellow-flowered plant (Chrysanthemum segetum) closely related to the oxeye daisy. -- Yellow perch (Zoöl.), the common American perch. See Perch. -- Yellow pike (Zoöl.), the wall-eye. -- Yellow pine (Bot.), any of several kinds of pine; also, their yellowish and generally durable timber. Among the most common are valuable species are Pinus mitis and P. palustris of the Eastern and Southern States, and P. ponderosa and P. Arizonica of the Rocky Mountains and Pacific States. -- Yellow plover (Zoöl.), the golden plover. -- Yellow precipitate (Med. Chem.), an oxide of mercury which is thrown down as an amorphous yellow powder on adding corrosive sublimate to limewater. -- Yellow puccoon. (Bot.) Same as Orangeroot. -- Yellow rail (Zoöl.), a small American rail (Porzana Noveboracensis) in which the lower parts are dull yellow, darkest on the breast. The back is streaked with brownish yellow and with black, and spotted with white. Called also yellow crake. -- Yellow rattle, Yellow rocket. (Bot.) See under Rattle, and Rocket. -- Yellow Sally (Zoöl.), a greenish or yellowish European stone fly of the genus Chloroperla; -- so called by anglers. -- Yellow sculpin (Zoöl.), the dragonet. -- Yellow snake (Zoöl.), a West Indian boa (Chilobothrus inornatus) common in Jamaica. It becomes from eight to ten long. The body is yellowish or yellowish green, mixed with black, and anteriorly with black lines. -- Yellow spot. (a) (Anat.) A small yellowish spot with a central pit, the fovea centralis, in the center of the retina where vision is most accurate. See Eye. (b) (Zoöl.) A small American butterfly (Polites Peckius) of the Skipper family. Its wings are brownish, with a large, irregular, bright yellow spot on each of the hind wings, most conspicuous beneath. Called also Peck's skipper. See Illust. under Skipper, n., 5. -- Yellow tit (Zoöl.), any one of several species of crested titmice of the genus Machlolophus, native of India. The predominating colors of the plumage are yellow and green. -- Yellow viper (Zoöl.), the fer-de-lance. -- Yellow warbler (Zoöl.), any one of several species of American warblers of the genus Dendroica in which the predominant color is yellow, especially D. æstiva, which is a very abundant and familiar species; -- called also garden warbler, golden warbler, summer yellowbird, summer warbler, and yellow-poll warbler. -- Yellow wash (Pharm.), yellow oxide of mercury suspended in water, -- a mixture prepared by adding corrosive sublimate to limewater. -- Yellow wren (Zoöl.) (a) The European willow warbler. (b) The European wood warbler.\n\n1. A bright golden color, reflecting more light than any other except white; the color of that part of the spectrum which is between the orange and green. \"A long motley coat guarded with yellow.\" Shak. 2. A yellow pigment. Cadmium yellow, Chrome yellow, Indigo yellow, King's yellow, etc. See under Cadmium, Chrome, etc. -- Naples yellow, a yellow amorphous pigment, used in oil, porcelain, and enamel painting, consisting of a basic lead metantimonate, obtained by fusing together tartar emetic lead nitrate, and common salt. -- Patent yellow (Old Chem.), a yellow pigment consisting essentially of a lead oxychloride; -- called also Turner's yellow.\n\nTo make yellow; to cause to have a yellow tinge or color; to dye yellow.\n\nTo become yellow or yellower."}