{"word":"yoke","definition":"1. A bar or frame of wood by which two oxen are joined at the heads or necks for working together. A yearling bullock to thy name shall smoke, Untamed, unconscious of the galling yoke. Pope. Note: The modern yoke for oxen is usually a piece of timber hollowed, or made curving, near each end, and laid on the necks of the oxen, being secured in place by two bows, one inclosing each neck, and fastened through the timber. In some countries the yoke consists of a flat piece of wood fastened to the foreheads of the oxen by thongs about the horns. 2. A frame or piece resembling a yoke, as in use or shape. Specifically: (a) A frame of wood fitted to a person's shoulders for carrying pails, etc., suspended on each side; as, a milkmaid's yoke. (b) A frame worn on the neck of an animal, as a cow, a pig, a goose, to prevent passage through a fence. (c) A frame or convex piece by which a bell is hung for ringing it. See Illust. of Bell. (d) A crosspiece upon the head of a boat's rudder. To its ends lines are attached which lead forward so that the boat can be steered from amidships. (e) (Mach.) A bent crosspiece connecting two other parts. (f) (Arch.) A tie securing two timbers together, not used for part of a regular truss, but serving a temporary purpose, as to provide against unusual strain. (g) (Dressmaking) A band shaped to fit the shoulders or the hips, and joined to the upper full edge of the waist or the skirt. 3. Fig.: That which connects or binds; a chain; a link; a bond connection. Boweth your neck under that blissful yoke . . . Which that men clepeth spousal or wedlock. Chaucer. This yoke of marriage from us both remove. Dryden. 4. A mark of servitude; hence, servitude; slavery; bondage; service. Our country sinks beneath the yoke. Shak. My yoke is easy, and my burden is light. Matt. xi. 30. 5. Two animals yoked together; a couple; a pair that work together. I have bought five yoke of oxen, and I go to prove them. Luke xiv. 19. 6. The quantity of land plowed in a day by a yoke of oxen. [Obs.] Gardner. 7. A portion of the working day; as, to work two yokes, that is, to work both portions of the day, or morning and afternoon. [Prov. Eng.] Halliwell. Neck yoke, Pig yoke. See under Neck, and Pig. -- Yoke elm (Bot.), the European hornbeam (Carpinus Betulus), a small tree with tough white wood, often used for making yokes for cattle.\n\n1. To put a yoke on; to join in or with a yoke; as, to yoke oxen, or pair of oxen. 2. To couple; to join with another. \"Be ye not unequally yoked with unbelievers.\" 2 Cor. vi. 14. Cassius, you are yoked with a lamb. Shak. 3. To enslave; to bring into bondage; to restrain; to confine. Then were they yoked with garrisons. Milton. The words and promises that yoke The conqueror are quickly broke. Hudibras.\n\nTo be joined or associated; to be intimately connected; to consort closely; to mate. We 'll yoke together, like a double shadow. Shak."}