{"word":"zebra","definition":"Either one of two species of South African wild horses remarkable for having the body white or yellowish white, and conspicuously marked with dark brown or brackish bands. Note: The true or mountain zebra (Equus, or Asinus, zebra) is nearly white, and the bands which cover the body and legs are glossy black. Its tail has a tuft of black hair at the tip. It inhabits the mountains of Central and Southern Africa, and is noted for its wariness and wildness, as well as for its swiftness. The second species (Equus, or Asinus, Burchellii), known as Burchell's zebra, and dauw, inhabits the grassy plains of South Africa, and differs from the preceding in not having dark bands on the legs, while those on the body are more irregular. It has a long tail, covered with long white flowing hair. Zebra caterpillar, the larva of an American noctuid moth (Mamestra picta). It is light yellow, with a broad black stripe on the back and one on each side; the lateral stripes are crossed with withe lines. It feeds on cabbages, beets, clover, and other cultivated plants. -- Zebra opossum, the zebra wolf. See under Wolf. -- Zebra parrakeet, an Australian grass parrakeet, often kept as a cage bird. Its upper parts are mostly pale greenish yellow, transversely barred with brownish black crescents; the under parts, rump, and upper tail coverts, are bright green; two central tail feathers and the cheek patches are blue. Called also canary parrot, scallop parrot, shell parrot, and undulated parrot. -- Zebra poison (Bot.), a poisonous tree (Euphorbia arborea) of the Spurge family, found in South Africa. Its milky juice is so poisonous that zebras have been killed by drinking water in which its branches had been placed, and it is also used as an arrow poison. J. Smith (Dict. Econ. Plants). -- Zebra shark. Same as Tiger shark, under Tiger. -- Zebra spider, a hunting spider. -- Zebra swallowtail, a very large North American swallow-tailed butterfly (Iphiclides ajax), in which the wings are yellow, barred with black; -- called also ajax. -- Zebra wolf. See under Wolf."}