{"word":"about","definition":"1. Around; all round; on every side of. \"Look about you.\" Shak. \"Bind them about thy neck.\" Prov. iii. 3. 2. In the immediate neighborhood of; in contiguity or proximity to; near, as to place; by or on (one's person). \"Have you much money about you\" Bulwer. 3. Over or upon different parts of; through or over in various directions; here and there in; to and fro in; throughout. Lampoons . . . were handed about the coffeehouses. Macaulay. Roving still about the world. Milton. 4. Near; not far from; -- determining approximately time, size, quantity. \"To-morrow, about this time.\" Exod. ix. 18. \"About my stature.\" Shak. He went out about the third hour. Matt. xx. 3. Note: This use passes into the adverbial sense. 5. In concern with; engaged in; intent on. I must be about my Father's business. Luke ii. 49. 6. Before a verbal noun or an infinitive:  On the point or verge of; going; in act of. Paul was now aboutto open his mouth. Acts xviii. 14. 7. Concerning; with regard to; on account of; touching. \"To treat about thy ransom.\" Milton. She must have her way about Sarah. Trollope.\n\n1. On all sides; around. 'Tis time to look about. Shak. 2. In circuit; circularly; by a circuitous way; around the outside; as, a mile about, and a third of a mile across. 3. Here and there; around; in one place and another. Wandering about from house to house. 1 Tim. v. 13. 4. Nearly; approximately; with close correspondence, in quality, manner, degree, etc.; as, about as cold; about as high; -- also of quantity, number, time. \"There fell . . . about three thousand men.\" Exod. xxii. 28. 5. To a reserved position; half round; in the opposite direction; on the opposite tack; as, to face about; to turn one's self about. To bring about, to cause to take place; to accomplish. -- To come about, to occur; to take place. See under Come. -- To go about, To set about, to undertake; to arrange; to prepare. \"Shall we set about some revels Shak. -- Round about, in every direction around."}