{"word":"absolute","definition":"1. Loosed from any limitation or condition; uncontrolled; unrestricted; unconditional; as, absolute authority, monarchy, sovereignty, an absolute promise or command; absolute power; an absolute monarch. 2. Complete in itself; perfect; consummate; faultless; as, absolute perfection; absolute beauty. So absolute she seems, And in herself complete. Milton. 3. Viewed apart from modifying influences or without comparison with other objects; actual; real; -- opposed to relative and comparative; as, absolute motion; absolute time or space. Note: Absolute rights and duties are such as pertain to man in a state of nature as contradistinguished from relative rights and duties, or such as pertain to him in his social relations. 4. Loosed from, or unconnected by, dependence on any other being; self-existent; self-sufficing. Note: In this sense God is called the Absolute by the Theist. The term is also applied by the Pantheist to the universe, or the total of all existence, as only capable of relations in its parts to each other and to the whole, and as dependent for its existence and its phenomena on its mutually depending forces and their laws. 5. Capable of being thought or conceived by itself alone; unconditioned; non-relative. Note: It is in dispute among philosopher whether the term, in this sense, is not applied to a mere logical fiction or abstraction, or whether the absolute, as thus defined, can be known, as a reality, by the human intellect. To Cusa we can indeed articulately trace, word and thing, the recent philosophy of the absolute. Sir W. Hamilton. 6. Positive; clear; certain; not doubtful. [R.] I am absolute 't was very Cloten. Shak. 7. Authoritative; peremptory. [R.] The peddler stopped, and tapped her on the head, With absolute forefinger, brown and ringed. Mrs. Browning. 8. (Chem.)  Pure; unmixed; as, absolute alcohol. 9. (Gram.)  Not immediately dependent on the other parts of the sentence in government; as, the case absolute. See Ablative absolute, under Ablative. Absolute curvature (Geom.), that curvature of a curve of double curvature, which is measured in the osculating plane of the curve. -- Absolute equation (Astron.), the sum of the optic and eccentric equations. -- Absolute space (Physics), space considered without relation to material limits or objects. -- Absolute terms. (Alg.), such as are known, or which do not contain the unknown quantity. Davies & Peck. -- Absolute temperature (Physics), the temperature as measured on a scale determined by certain general thermo-dynamic principles, and reckoned from the absolute zero. -- Absolute zero (Physics), the be ginning, or zero point, in the scale of absolute temperature. It is equivalent to -273ยบ centigrade or -459.4ยบ Fahrenheit. Syn. -- Positive; peremptory; certain; unconditional; unlimited; unrestricted; unqualified; arbitrary; despotic; autocratic.\n\nIn a plane, the two imaginary circular points at infinity; in space of three dimensions, the imaginary circle at infinity."}