{"word":"abuse","definition":"1. To put to a wrong use; to misapply; to misuse; to put to a bad use; to use for a wrong purpose or end; to pervert; as, to abuse inherited gold; to make an excessive use of; as, to abuse one's authority. This principle (if one may so abuse the word) shoots rapidly into popularity. Froude. 2. To use ill; to maltreat; to act injuriously to; to punish or to tax excessively; to hurt; as, to abuse prisoners, to abuse one's powers, one's patience. 3. To revile; to reproach coarsely; to disparage. The . . . tellers of news abused the general. Macaulay. 4. To dishonor. \"Shall flight abuse your name\" Shak. 5. To violate; to ravish. Spenser. 6. To deceive; to impose on. [Obs.] Their eyes red and staring, cozened with a moist cloud, and abused by a double object. Jer. Taylor. Syn. -- To maltreat; injure; revile; reproach; vilify; vituperate; asperse; traduce; malign.\n\n1. Improper treatment or use; application to a wrong or bad purpose; misuse; as, an abuse of our natural powers; an abuse of civil rights, or of privileges or advantages; an abuse of language. Liberty may be endangered by the abuses of liberty, as well as by the abuses of power. Madison. 2. Physical ill treatment; injury. \"Rejoice . . . at the abuse of Falstaff.\" Shak. 3. A corrupt practice or custom; offense; crime; fault; as, the abuses in the civil service. Abuse after disappeared without a struggle.. Macaulay. 4. Vituperative words; coarse, insulting speech; abusive language; virulent condemnation; reviling. The two parties, after exchanging a good deal of abuse, came to blows. Macaulay. 5. Violation; rape; as, abuse of a female child. [Obs.] Or is it some abuse, and no such thing Shak. Abuse of distress (Law), a wrongful using of an animal or chattel distrained, by the distrainer. Syn. -- Invective; contumely; reproach; scurrility; insult; opprobrium. -- Abuse, Invective. Abuse is generally prompted by anger, and vented in harsh and unseemly words. It is more personal and coarse than invective. Abuse generally takes place in private quarrels; invective in writing or public discussions. Invective may be conveyed in refined language and dictated by indignation against what is blameworthy. C. J. Smith."}