{"word":"accent","definition":"1. A superior force of voice or of articulative effort upon some particular syllable of a word or a phrase, distinguishing it from the others. Note: Many English words have two accents, the primary and the secondary; the primary being uttered with a greater stress of voice than the secondary; as in as'pira''tion, where the chief stress is on the third syllable, and a slighter stress on the first. Some words, as an'tiap'o-plec''tic, in-com'pre-hen'si-bil''i-ty, have two secondary accents. See Guide to Pron., tt 30-46. 2. A mark or character used in writing, and serving to regulate the pronunciation; esp.: (a) a mark to indicate the nature and place of the spoken accent; (b) a mark to indicate the quality of sound of the vowel marked; as, the French accents. Note: In the ancient Greek the acute accent (') meant a raised tone or pitch, the grave (`), the level tone or simply the negation of accent, the circumflex ( ~ or ^) a tone raised and then depressed. In works on elocution, the first is often used to denote the rising inflection of the voice; the second, the falling inflection; and the third (^), the compound or waving inflection. In dictionaries, spelling books, and the like, the acute accent is used to designate the syllable which receives the chief stress of voice. 3. Modulation of the voice in speaking; manner of speaking or pronouncing; peculiar or characteristic modification of the voice; tone; as, a foreign accent; a French or a German accent. \"Beguiled you in a plain accent.\" Shak. \"A perfect accent.\" Thackeray. The tender accent of a woman's cry. Prior. 4. A word; a significant tone; (pl.) expressions in general; speech. Winds! on your wings to Heaven her accents bear, Such words as Heaven alone is fit to hear. Dryden. 5. (Pros.)  Stress laid on certain syllables of a verse. 6. (Mus.) (a) A regularly recurring stress upon the tone to mark the beginning, and, more feebly, the third part of the measure. (b) A special emphasis of a tone, even in the weaker part of the measure. (c) The rythmical accent, which marks phrases and sections of a period. (d) The expressive emphasis and shading of a passage. J. S. Dwight. 7. (Math.) (a) A mark placed at the right hand of a letter, and a little above it, to distinguish magnitudes of a similar kind expressed by the same letter, but differing in value, as y', y''. (b) (Trigon.) A mark at the right hand of a number, indicating minutes of a degree, seconds, etc.; as, 12'27'', i. e., twelve minutes twenty seven seconds. (c) (Engin.) A mark used to denote feet and inches; as, 6' 10'' is six feet ten inches.\n\n1. To express the accent of (either by the voice or by a mark); to utter or to mark with accent. 2. To mark emphatically; to emphasize."}