{"word":"accidental","definition":"1. Happening by chance, or unexpectedly; taking place not according to the usual course of things; casual; fortuitous; as, an accidental visit. 2. Nonessential; not necessary belonging; incidental; as, are accidental to a play. Accidental chords (Mus.), those which contain one or more tones foreign to their proper harmony. -- Accidental colors (Opt.), colors depending on the hypersensibility of the retina of the eye for complementary colors. They are purely subjective sensations of color which often result from the contemplation of actually colored bodies. -- Accidental point (Persp.), the point in which a right line, drawn from the eye, parallel to a given right line, cuts the perspective plane; so called to distinguish it from the principal point, or point of view, where a line drawn from the eye perpendicular to the perspective plane meets this plane. -- Accidental lights (Paint.), secondary lights; effects of light other than ordinary daylight, such as the rays of the sun darting through a cloud, or between the leaves of trees; the effect of moonlight, candlelight, or burning bodies. Fairholt. Syn. -- Casual; fortuitous; contingent; occasional; adventitious. -- Accidental, Incidental, Casual, Fortuitous, Contingent. We speak of a thing as accidental when it falls out as by chance, and not in the regular course of things; as, an accidental meeting, an accidental advantage, etc. We call a thing incidental when it falls, as it were, into some regular course of things, but is secondary, and forms no essential part thereof; as, an incremental remark, an incidental evil, an incidental benefit. We speak of a thing as casual, when it falls out or happens, as it were, by mere chance, without being prearranged or premeditated; as, a casual remark or encounter; a casual observer. An idea of the unimportant is attached to what is casual. Fortuitous is applied to what occurs without any known cause, and in opposition to what has been foreseen; as, a fortuitous concourse of atoms. We call a thing contingent when it is such that, considered in itself, it may or may not happen, but is dependent for its existence on something else; as, the time of my coming will be contingent on intelligence yet to be received.\n\n1. A property which is not essential; a nonessential; anything happening accidentally. He conceived it just that accidentals . . . should sink with the substance of the accusation. Fuller. 2. pl. (Paint.)  Those fortuitous effects produced by luminous rays falling on certain objects so that some parts stand forth in abnormal brightness and other parts are cast into a deep shadow. 3. (Mus.)  A sharp, flat, or natural, occurring not at the commencement of a piece of music as the signature, but before a particular note."}