{"word":"action","definition":"1. A process or condition of acting or moving, as opposed to rest; the doing of something; exertion of power or force, as when one body acts on another; the effect of power exerted on one body by another; agency; activity; operation; as, the action of heat; a man of action. One wise in council, one in action brave. Pope. 2. An act; a thing done; a deed; an enterprise. (pl.): Habitual deeds; hence, conduct; behavior; demeanor. The Lord is a Good of knowledge, and by him actions are weighed. 1 Sam. ii. 3. 3. The event or connected series of events, either real or imaginary, forming the subject of a play, poem, or other composition; the unfolding of the drama of events. 4. Movement; as, the horse has a spirited action. 5. (Mech.)  Effective motion; also, mechanism; as, the breech action of a gun. 6. (Physiol.)  Any one of the active processes going on in an organism; the performance of a function; as, the action of the heart, the muscles, or the gastric juice. 7. (Orat.)  Gesticulation; the external deportment of the speaker, or the suiting of his attitude, voice, gestures, and countenance, to the subject, or to the feelings. 8. (Paint. & Sculp.)  The attitude or position of the several parts of the body as expressive of the sentiment or passion depicted. 9. (Law) (a) A suit or process, by which a demand is made of a right in a court of justice; in a broad sense, a judicial proceeding for the enforcement or protection of a right, the redress or prevention of a wrong, or the punishment of a public offense. (b) A right of action; as, the law gives an action for every claim. 10. (Com.)  A share in the capital stock of a joint-stock company, or in the public funds; hence, in the plural, equivalent to stocks. [A Gallicism] [Obs.] The Euripus of funds and actions. Burke. 11. An engagement between troops in war, whether on land or water; a battle; a fight; as, a general action, a partial action. 12. (Music)  The mechanical contrivance by means of which the impulse of the player's finger is transmitted to the strings of a pianoforte or to the valve of an organ pipe. Grove. Chose in action. (Law) See Chose. -- Quantity of action (Physics), the product of the mass of a body by the space it runs through, and its velocity. Syn. -- Action, Act. In many cases action and act are synonymous; but some distinction is observable. Action involves the mode or process of acting, and is usually viewed as occupying some time in doing. Act has more reference to the effect, or the operation as complete. To poke the fire is an act, to reconcile friends who have quarreled is a praiseworthy action. C. J. Smith."}