{"word":"address","definition":"1. To aim; to direct. [Obs.] Chaucer. And this good knight his way with me addrest. Spenser. 2. To prepare or make ready. [Obs.] His foe was soon addressed. Spenser. Turnus addressed his men to single fight. Dryden. The five foolish virgins addressed themselves at the noise of the bridegroom's coming. Jer. Taylor. 3. Reflexively: To prepare one's self; to apply one's skill or energies (to some object); to betake. These men addressed themselves to the task. Macaulay. 4. To clothe or array; to dress. [Archaic] Tecla . . . addressed herself in man's apparel. Jewel. 5. To direct, as words (to any one or any thing); to make, as a speech, petition, etc. (to any one, an audience). The young hero had addressed his players to him for his assistance. Dryden. 6. To direct speech to; to make a communication to, whether spoken or written; to apply to by words, as by a speech, petition, etc., to speak to; to accost. Are not your orders to address the senate Addison. The representatives of the nation addressed the king. Swift. 7. To direct in writing, as a letter; to superscribe, or to direct and transmit; as, he addressed a letter. 8. To make suit to as a lover; to court; to woo. 9. (Com.)  To consign or intrust to the care of another, as agent or factor; as, the ship was addressed to a merchant in Baltimore. To address one's self to. (a) To prepare one's self for; to apply one's self to. (b) To direct one's speech or discourse to.\n\n1. To prepare one's self. [Obs.] \"Let us address to tend on Hector's heels.\" Shak. 2. To direct speech. [Obs.] Young Turnus to the beauteous maid addrest. Dryden. Note: The intransitive uses come from the dropping out of the reflexive pronoun.\n\n1. Act of preparing one's self. [Obs.] Jer Taylor. 2. Act of addressing one's self to a person; verbal application. 3. A formal communication, either written or spoken; a discourse; a speech; a formal application to any one; a petition; a formal statement on some subject or special occasion; as, an address of thanks, an address to the voters. 4. Direction or superscription of a letter, or the name, title, and place of residence of the person addressed. 5. Manner of speaking to another; delivery; as, a man of pleasing or insinuating address. 6. Attention in the way one's addresses to a lady. Addison. 7. Skill; skillful management; dexterity; adroitness. Syn. -- Speech; discourse; harangue; oration; petition; lecture; readiness; ingenuity; tact; adroitness."}