{"word":"advance","definition":"1. To bring forward; to move towards the van or front; to make to go on. 2. To raise; to elevate. [Archaic] They . . . advanced their eyelids. Shak. 3. To raise to a higher rank; to promote. Ahasueres . . . advanced him, and set his seat above all the princes. Esther iii. 1. 4. To accelerate the growth or progress; to further; to forward; to help on; to aid; to heighten; as, to advance the ripening of fruit; to advance one's interests. 5. To bring to view or notice; to offer or propose; to show; as, to advance an argument. Some ne'er advance a judgment of their own. Pope. 6. To make earlier, as an event or date; to hasten. 7. To furnish, as money or other value, before it becomes due, or in aid of an enterprise; to supply beforehand; as, a merchant advances money on a contract or on goods consigned to him. 8. To raise to a higher point; to enhance; to raise in rate; as, to advance the price of goods. 9. To extol; to laud. [Obs.] Greatly advancing his gay chivalry. Spenser. Syn. -- To raise; elevate; exalt; aggrandize; improve; heighten; accelerate; allege; adduce; assign.\n\n1. To move or go forward; to proceed; as, he advanced to greet me. 2. To increase or make progress in any respect; as, to advance in knowledge, in stature, in years, in price. 3. To rise in rank, office, or consequence; to be preferred or promoted. Advanced to a level with ancient peers. Prescott.\n\n1. The act of advancing or moving forward or upward; progress. 2. Improvement or progression, physically, mentally, morally, or socially; as, an advance in health, knowledge, or religion; an advance in rank or office. 3. An addition to the price; rise in price or value; as, an advance on the prime cost of goods. 4. The first step towards the attainment of a result; approach made to gain favor, to form an acquaintance, to adjust a difference, etc.; an overture; a tender; an offer; -- usually in the plural. [He] made the like advances to the dissenters. Swift. 5. A furnishing of something before an equivalent is received (as money or goods), towards a capital or stock, or on loan; payment beforehand; the money or goods thus furnished; money or value supplied beforehand. I shall, with pleasure, make the necessary advances. Jay. The account was made up with intent to show what advances had been made. Kent. In advance (a) In front; before. (b) Beforehand; before an equivalent is received. (c) In the state of having advanced money on account; as, A is advance to B a thousand dollars or pounds.\n\nBefore in place, or beforehand in time; -- used for advanced; as, an advance guard, or that before the main guard or body of an army; advance payment, or that made before it is due; advance proofs, advance sheets, pages of a forthcoming volume, received in advance of the time of publication."}