{"word":"age","definition":"1. The whole duration of a being, whether animal, vegetable, or other kind; lifetime. Mine age is as nothing before thee. Ps. xxxix. 5. 2. That part of the duration of a being or a thing which is between its beginning and any given time; as, what is the present age of a man, or of the earth 3. The latter part of life; an advanced period of life; seniority; state of being old. Nor wrong mine age with this indignity. Shak. 4. One of the stages of life; as, the age of infancy, of youth, etc. Shak. 5. Mature age; especially, the time of life at which one attains full personal rights and capacities; as, to come of age; he (or she) is of age. Abbott. Note: In the United States, both males and females are of age when twenty-one years old. 6. The time of life at which some particular power or capacity is understood to become vested; as, the age of consent; the age of discretion. Abbott. 7. A particular period of time in history, as distinguished from others; as, the golden age, the age of Pericles. \"The spirit of the age.\" Prescott. Truth, in some age or other, will find her witness. Milton. Archeological ages are designated as three: The Stone age (the early and the later stone age, called paleolithic and neolithic), the Bronze age, and the Iron age. During the Age of Stone man is supposed to have employed stone for weapons and implements. See Augustan, Brazen, Golden, Heroic, Middle. 8. A great period in the history of the Earth. Note: The geologic ages are as follows: 1. The Archæan, including the time when was no life and the time of the earliest and simplest forms of life. 2. The age of Invertebrates, or the Silurian, when the life on the globe consisted distinctively of invertebrates. 3. The age of Fishes, or the Devonian, when fishes were the dominant race. 4. The age of Coal Plants, or Acrogens, or the Carboniferous age. 5. The Mesozoic or Secondary age, or age of Reptiles, when reptiles prevailed in great numbers and of vast size. 6. The Tertiary age, or age of Mammals, when the mammalia, or quadrupeds, abounded, and were the dominant race. 7. The Quaternary age, or age of Man, or the modern era. Dana. 9. A century; the period of one hundred years. Fleury . . . apologizes for these five ages. Hallam. 10. The people who live at a particular period; hence, a generation. \"Ages yet unborn.\" Pope. The way which the age follows. J. H. Newman. Lo! where the stage, the poor, degraded stage, Holds its warped mirror to a gaping age. C. Sprague. 11. A long time. [Colloq.] \"He made minutes an age.\" Tennyson. Age of a tide, the time from the origin of a tide in the South Pacific Ocean to its arrival at a given place. -- Moon's age, the time that has elapsed since the last preceding conjunction of the sun and moon. Note: Age is used to form the first part of many compounds; as, agelasting, age-adorning, age-worn, age-enfeebled, agelong. Syn. -- Time; period; generation; date; era; epoch.\n\nTo grow aged; to become old; to show marks of age; as, he grew fat as he aged. They live one hundred and thirty years, and never age for all that. Holland. I am aging; that is, I have a whitish, or rather a light-colored, hair here and there. Landor.\n\nTo cause to grow old; to impart the characteristics of age to; as, grief ages us."}