{"word":"air","definition":"1. The fluid which we breathe, and which surrounds the earth; the atmosphere. It is invisible, inodorous, insipid, transparent, compressible, elastic, and ponderable. Note: By the ancient philosophers, air was regarded as an element; but modern science has shown that it is essentially a mixture of oxygen and nitrogen, with a small amount of carbon dioxide, the average proportions being, by volume: oxygen, 20.96 per cent.; nitrogen, 79.00 per cent.; carbon dioxide, 0.04 per cent. These proportions are subject to a very slight variability. Air also always contains some vapor of water. 2. Symbolically: Something unsubstantial, light, or volatile. \"Charm ache with air.\" Shak. He was still all air and fire. Macaulay . [Air and fire being the finer and quicker elements as opposed to earth and water.] 3. A particular state of the atmosphere, as respects heat, cold, moisture, etc., or as affecting the sensations; as, a smoky air, a damp air, the morning air, etc. 4. Any aëriform body; a gas; as, oxygen was formerly called vital air. [Obs.] 5. Air in motion; a light breeze; a gentle wind. Let vernal airs through trembling osiers play. Pope. 6. Odoriferous or contaminated air. 7. That which surrounds and influences. The keen, the wholesome air of poverty. Wordsworth. 8. Utterance abroad; publicity; vent. You gave it air before me. Dryden. 9. Intelligence; information. [Obs.] Bacon. 10. (Mus.) (a) A musical idea, or motive, rhythmically developed in consecutive single tones, so as to form a symmetrical and balanced whole, which may be sung by a single voice to the stanzas of a hymn or song, or even to plain prose, or played upon an instrument; a melody; a tune; an aria. (b) In harmonized chorals, psalmody, part songs, etc., the part which bears the tune or melody -- in modern harmony usually the upper part -- is sometimes called the air. 11. The peculiar look, appearance, and bearing of a person; mien; demeanor; as, the air of a youth; a heavy air; a lofty air. \"His very air.\" Shak. 12. Peculiar appearance; apparent character; semblance; manner; style. It was communicated with the air of a secret. Pope. 12. pl.  An artificial or affected manner; show of pride or vanity; haughtiness; as, it is said of a person, he puts on airs. Thackeray. 14. (Paint.) (a) The representation or reproduction of the effect of the atmospheric medium through which every object in nature is viewed. New Am. Cyc. (b) Carriage; attitude; action; movement; as, the head of that portrait has a good air. Fairholt. 15. (Man.)  The artificial motion or carriage of a horse. Note: Air is much used adjectively or as the first part of a compound term. In most cases it might be written indifferently, as a separate limiting word, or as the first element of the compound term, with or without the hyphen; as, air bladder, air-bladder, or airbladder; air cell, air-cell, or aircell; air-pump, or airpump. Air balloon. See Balloon. -- Air bath. (a) An apparatus for the application of air to the body. (b) An arrangement for drying substances in air of any desired temperature. -- Air castle. See Castle in the air, under Castle. -- Air compressor, a machine for compressing air to be used as a motive power. -- Air crossing, a passage for air in a mine. -- Air cushion, an air-tight cushion which can be inflated; also, a device for arresting motion without shock by confined air. -- Air fountain, a contrivance for producing a jet of water by the force of compressed air. -- Air furnace, a furnace which depends on a natural draft and not on blast. -- Air line, a straight line; a bee line. Hence Air-line, adj.; as, air-line road. -- Air lock (Hydr. Engin.), an intermediate chamber between the outer air and the compressed-air chamber of a pneumatic caisson. Knight. -- Air port (Nav.), a scuttle or porthole in a ship to admit air. -- Air spring, a spring in which the elasticity of air is utilized. -- Air thermometer, a form of thermometer in which the contraction and expansion of air is made to measure changes of temperature. -- Air threads, gossamer. -- Air trap, a contrivance for shutting off foul air or gas from drains, sewers, etc.; a stench trap. -- Air trunk, a pipe or shaft for conducting foul or heated air from a room. -- Air valve, a valve to regulate the admission or egress of air; esp. a valve which opens inwardly in a steam boiler and allows air to enter. -- Air way, a passage for a current of air; as the air way of an air pump; an air way in a mine. -- In the air. (a) Prevalent without traceable origin or authority, as rumors. (b) Not in a fixed or stable position; unsettled. (c) (Mil.) Unsupported and liable to be turned or taken in flank; as, the army had its wing in the air. -- To take air, to be divulged; to be made public. -- To take the air, to go abroad; to walk or ride out.\n\n1. To expose to the air for the purpose of cooling, refreshing, or purifying; to ventilate; as, to air a room. It were good wisdom . . . that the jail were aired. Bacon. Were you but riding forth to air yourself. Shak. 2. To expose for the sake of public notice; to display ostentatiously; as, to air one's opinion. Airing a snowy hand and signet gem. Tennyson. 3. To expose to heat, for the purpose of expelling dampness, or of warming; as, to air linen; to air liquors."}