{"word":"anchor","definition":"1. A iron instrument which is attached to a ship by a cable (rope or chain), and which, being cast overboard, lays hold of the earth by a fluke or hook and thus retains the ship in a particular station. Note: The common anchor consists of a straight bar called a shank, having at one end a transverse bar called a stock, above which is a ring for the cable, and at the other end the crown, from which branch out two or more arms with flukes, forming with the shank a suitable angle to enter the ground. Note: Formerly the largest and strongest anchor was the sheet anchor (hence, Fig., best hope or last refuge), called also waist anchor. Now the bower and the sheet anchor are usually alike. Then came the best bower and the small bower (so called from being carried on the bows). The stream anchor is one fourth the weight of the bower anchor. Kedges or kedge anchors are light anchors used in warping. 2. Any instrument or contrivance serving a purpose like that of a ship's anchor, as an arrangement of timber to hold a dam fast; a contrivance to hold the end of a bridge cable, or other similar part; a contrivance used by founders to hold the core of a mold in place. 3. Fig.: That which gives stability or security; that on which we place dependence for safety. Which hope we have as an anchor of the soul. Heb. vi. 19. 4. (Her.)  An emblem of hope. 5. (Arch.) (a) A metal tie holding adjoining parts of a building together. (b) Carved work, somewhat resembling an anchor or arrowhead; -- a part of the ornaments of certain moldings. It is seen in the echinus, or egg-and-anchor (called also egg-and-dart, egg-and-tongue) ornament. 6. (Zoöl.)  One of the anchor-shaped spicules of certain sponges; also, one of the calcareous spinules of certain Holothurians, as in species of Synapta. Anchor ice. See under Ice. -- Anchor ring. (Math.) Same as Annulus, 2 (b). -- Anchor stock (Naut.), the crossbar at the top of the shank at right angles to the arms. -- The anchor comes home, when it drags over the bottom as the ship drifts. -- Foul anchor, the anchor when it hooks, or is entangled with, another anchor, or with a cable or wreck, or when the slack cable entangled. -- The anchor is acockbill, when it is suspended perpendicularly from the cathead, ready to be let go. -- The anchor is apeak, when the cable is drawn in do tight as to bring to ship directly over it. -- The anchor is atrip, or aweigh, when it is lifted out of the ground. -- The anchor is awash, when it is hove up to the surface of the water. -- At anchor, anchored. -- To back an anchor, to increase the holding power by laying down a small anchor ahead of that by which the ship rides, with the cable fastened to the crown of the latter to prevent its coming home. -- To cast anchor, to drop or let go an anchor to keep a ship at rest. -- To cat the anchor, to hoist the anchor to the cathead and pass the ring-stopper. -- To fish the anchor, to hoist the flukes to their resting place (called the bill-boards), and pass the shank painter. -- To weigh anchor, to heave or raise the anchor so as to sail away.\n\n1. To place at anchor; to secure by an anchor; as, to anchor a ship. 2. To fix or fasten; to fix in a stable condition; as, to anchor the cables of a suspension bridge. Till that my nails were anchored in thine eyes. Shak.\n\n1. To cast anchor; to come to anchor; as, our ship (or the captain) anchored in the stream. 2. To stop; to fix or rest. My invention . . . anchors on Isabel. Shak.\n\nAn anchoret. [Obs.] Shak."}