{"word":"ancient","definition":"1. Old; that happened or existed in former times, usually at a great distance of time; belonging to times long past; specifically applied to the times before the fall of the Roman empire; -- opposed to modern; as, ancient authors, literature, history; ancient days. Witness those ancient empires of the earth. Milton. Gildas Albanius . . . much ancienter than his namesake surnamed the Wise. Fuller. 2. Old; that has been of long duration; of long standing; of great age; as, an ancient forest; an ancient castle. \"Our ancient bickerings.\" Shak. Remove not the ancient landmarks, which thy fathers have set. Prov. xxii. 28. An ancient man, strangely habited, asked for quarters. Scott. 3. Known for a long time, or from early times; -- opposed to recent or new; as, the ancient continent. A friend, perhaps, or an ancient acquaintance. Barrow. 4. Dignified, like an aged man; magisterial; venerable. [Archaic] He wrought but some few hours of the day, and then would he seem very grave and ancient. Holland. 5. Experienced; versed. [Obs.] Though [he] was the youngest brother, yet he was the most ancient in the business of the realm. Berners. 6. Former; sometime. [Obs.] They mourned their ancient leader lost. Pope. Ancient demesne (Eng. Law), a tenure by which all manors belonging to the crown, in the reign of William the Conqueror, were held. The numbers, names, etc., of these were all entered in a book called Domesday Book. -- Ancient lights (Law), windows and other openings which have been enjoined without molestation for more than twenty years. In England, and in some of the United States, they acquire a prescriptive right. Syn. -- Old; primitive; pristine; antique; antiquated; old-fashioned; obsolete. -- Ancient, Antiquated, Obsolete, Antique, Antic, Old. -- Ancient is opposed to modern, and has antiquity; as, an ancient family, ancient landmarks, ancient institutions, systems of thought, etc. Antiquated describes that which has gone out of use or fashion; as, antiquated furniture, antiquated laws, rules, etc. Obsolete is commonly used, instead of antiquated, in reference to language, customs, etc.; as, an obsolete word or phrase, an obsolete expression. Antique is applied, in present usage, either to that which has come down from the ancients; as, an antique cameo, bust, etc. ; or to that which is made to imitate some ancient work of art; as, an antique temple. In the days of Shakespeare, antique was often used for ancient; as, \"an antique song,\" \"an antique Roman;\" and hence, from singularity often attached to what is ancient, it was used in the sense of grotesque; as, \"an oak whose antique root peeps out; \" and hence came our present word antic, denoting grotesque or ridiculous. We usually apply both ancient and old to things subject to gradual decay. We say, an old man, an ancient record; but never, the old stars, an old river or mountain. In general, however, ancient is opposed to modern, and old to new, fresh, or recent. When we speak of a thing that existed formerly, which has ceased to exist, we commonly use ancient; as, ancient republics, ancient heroes; and not old republics, old heroes. But when the thing which began or existed in former times is still in existence, we use either ancient or old; as, ancient statues or paintings, or old statues or paintings; ancient authors, or old authors, meaning books.\n\n1. pl.  Those who lived in former ages, as opposed to the moderns. 2. An aged man; a patriarch. Hence: A governor; a ruler; a person of influence. The Lord will enter into judgment with the ancients of his people, and the princes thereof. Isa. iii. 14. 3. A senior; an elder; a predecessor. [Obs.] Junius and Andronicus . . . in Christianity . . . were his ancients. Hooker. 4. pl. (Eng. Law)  One of the senior members of the Inns of Court or of Chancery. Council of Ancients (French Hist.), one of the two assemblies composing the legislative bodies in 1795. Brande.\n\n1. An ensign or flag. [Obs.] More dishonorable ragged than an old-faced ancient. Shak. 2. The bearer of a flag; an ensign. [Obs.] This is Othello's ancient, as I take it. Shak."}