{"word":"animal","definition":"1. An organized living being endowed with sensation and the power of voluntary motion, and also characterized by taking its food into an internal cavity or stomach for digestion; by giving carbonic acid to the air and taking oxygen in the process of respiration; and by increasing in motive power or active aggressive force with progress to maturity. 2. One of the lower animals; a brute or beast, as distinguished from man; as, men and animals.\n\n1. Of or relating to animals; as, animal functions. 2. Pertaining to the merely sentient part of a creature, as distinguished from the intellectual, rational, or spiritual part; as, the animal passions or appetites. 3. Consisting of the flesh of animals; as, animal food. Animal magnetism. See Magnetism and Mesmerism. -- Animal electricity, the electricity developed in some animals, as the electric eel, torpedo, etc. -- Animal flower (Zoöl.), a name given to certain marine animals resembling a flower, as any species of actinia or sea anemone, and other Anthozoa, hydroids, starfishes, etc. -- Animal heat (Physiol.), the heat generated in the body of a living animal, by means of which the animal is kept at nearly a uniform temperature. -- Animal spirits. See under Spirit. -- Animal kingdom, the whole class of beings endowed with animal life. It embraces several subkingdoms, and under these there are Classes, Orders, Families, Genera, Species, and sometimes intermediate groupings, all in regular subordination, but variously arranged by different writers. Note: The following are the grand divisions, or subkingdoms, and the principal classes under them, generally recognized at the present time: -Vertebrata, including Mammalia or Mammals, Aves or Birds, Reptilia, Amphibia, Pisces or Fishes, Marsipobranchiata (Craniota); and Leptocardia (Acrania). Tunicata, including the Thaliacea, and Ascidioidea or Ascidians. Articulata or Annulosa, including Insecta, Myriapoda, Malacapoda, Arachnida, Pycnogonida, Merostomata, Crustacea (Arthropoda); and Annelida, Gehyrea (Anarthropoda). Helminthes or Vermes, including Rotifera, Chætognatha, Nematoidea, Acanthocephala, Nemertina, Turbellaria, Trematoda, Cestoidea, Mesozea. Molluscoidea, including Brachiopoda and Bryozoa. Mollusca, including Cephalopoda, Gastropoda, Pteropoda, Scaphopoda, Lamellibranchiata or Acephala. Echinodermata, including Holothurioidea, Echinoidea, Asterioidea, Ophiuroidea, and Crinoidea. Coelenterata, including Anthozoa or Polyps, Ctenophora, and Hydrozoa or Acalephs. Spongiozoa or Porifera, including the sponges. Protozoa, including Infusoria and Rhizopoda. For definitions, see these names in the Vocabulary."}