{"word":"appreciate","definition":"1. To set a price or value on; to estimate justly; to value. To appreciate the motives of their enemies. Gibbon. 3. To raise the value of; to increase the market price of; -- opposed to depreciate. [U.S.] Lest a sudden peace should appreciate the money. Ramsay. 4. To be sensible of; to distinguish. To test the power of bappreciate color. Lubbock. Syn. -- To Appreciate, Estimate, Esteem. Estimate is an act of judgment; esteem is an act of valuing or prizing, and when applied to individuals, denotes a sentiment of moral approbation. See Estimate. Appreciate lies between the two. As compared with estimate, it supposes a union of sensibility with judgment, producing a nice and delicate perception. As compared with esteem, it denotes a valuation of things according to their appropriate and distinctive excellence, and not simply their moral worth. Thus, with reference to the former of these (delicate perception), an able writer says. \"Women have a truer appreciation of character than men;\" and another remarks, \"It is difficult to appreciate the true force and distinctive sense of terms which we are every day using.\" So, also, we speak of the difference between two things, as sometimes hardly appreciable. With reference to the latter of these (that of valuation as the result of a nice perception), we say, \"It requires a peculiar cast of character to appreciate the poetry of Wordsworth;\" \"He who has no delicacy himself, can not appreciate it in others;\" \"The thought of death is salutary, because it leads us to appreciate worldly things aright.\" Appreciate is much used in cases where something is in danger of being overlooked or undervalued; as when we speak of appreciating the difficulties of a subject, or the risk of an undertaking. So Lord Plunket, referring to an \"ominous silence\" which prevailed among the Irish peasantry, says, \"If you knew now to appreciate that silence, it is more formidable than the most clamorous opposition.\" In like manner, a person who asks some favor of another is apt to say, \"I trust you will appreciate my motives in this request.\" Here we have the key to a very frequent use of the word. It is hardly necessary to say that appreciate looks on the favorable side of things. we never speak of appreciating a man's faults, but his merits. This idea of regarding things favorably appears more fully in the word appreciative; as when we speak of an appreciative audience, or an appreciative review, meaning one that manifests a quick perception and a ready valuation of excellence.\n\nTo rise in value. [See note under Rise, v. i.] J. Morse."}