{"word":"arm","definition":"1. The limb of the human body which extends from the shoulder to the hand; also, the corresponding limb of a monkey. 2. Anything resembling an arm; as, (a) The fore limb of an animal, as of a bear. (b) A limb, or locomotive or prehensile organ, of an invertebrate animal. (c) A branch of a tree. (d) A slender part of an instrument or machine, projecting from a trunk, axis, or fulcrum; as, the arm of a steelyard. (e) (Naut) The end of a yard; also, the part of an anchor which ends in the fluke. (f) An inlet of water from the sea. (g) A support for the elbow, at the side of a chair, the end of a sofa, etc. 3. Fig.: Power; might; strength; support; as, the secular arm; the arm of the law. To whom is the arm of the Lord revealed Isa. lii. 1. Arm's end, the end of the arm; a good distance off. Dryden. -- Arm's length, the length of the arm. -- Arm's reach, reach of the arm; the distance the arm can reach. -- To go (or walk) arm in arm, to go with the arm or hand of one linked in the arm of another. \"When arm in armwe went along.\" Tennyson. -- To keep at arm's length, to keep at a distance (literally or figuratively); not to allow to come into close contact or familiar intercourse. -- To work at arm's length, to work disadvantageously.\n\n(a) A branch of the military service; as, the cavalry arm was made efficient. (b) A weapon of offense or defense; an instrument of warfare; -- commonly in the pl.\n\n1. To take by the arm; to take up in one's arms. [Obs.] And make him with our pikes and partisans A grave: come, arm him. Shak. Arm your prize; I know you will not lose him. Two N. Kins. 2. To furnish with arms or limbs. [R.] His shoulders broad and strong, Armed long and round. Beau. & Fl. 3. To furnish or equip with weapons of offense or defense; as, to arm soldiers; to arm the country. Abram . . . armed his trained servants. Gen. xiv. 14. 4. To cover or furnish with a plate, or with whatever will add strength, force, security, or efficiency; as, to arm the hit of a sword; to arm a hook in angling. 5. Fig.: To furnish with means of defense; to prepare for resistance; to fortify, in a moral sense. Arm yourselves . . . with the same mind. 1 Pet. iv. 1. To arm a magnet, to fit it with an armature.\n\nTo provide one's self with arms, weapons, or means of attack or resistance; to take arms. \" 'Tis time to arm.\" Shak."}