{"word":"art","definition":"The second person singular, indicative mode, present tense, of the substantive verb Be; but formed after the analogy of the plural are, with the ending -t, as in thou shalt, wilt, orig. an ending of the second person sing. pret. Cf. Be. Now used only in solemn or poetical style.\n\n1. The employment of means to accomplish some desired end; the adaptation of things in the natural world to the uses of life; the application of knowledge or power to practical purposes. Blest with each grace of nature and of art. Pope. 2. A system of rules serving to facilitate the performance of certain actions; a system of principles and rules for attaining a desired end; method of doing well some special work; -- often contradistinguished from science or speculative principles; as, the art of building or engraving; the art of war; the art of navigation. Science is systematized knowledge . . . Art is knowledge made efficient by skill. J. F. Genung. 3. The systematic application of knowledge or skill in effecting a desired result. Also, an occupation or business requiring such knowledge or skill. The fishermen can't employ their art with so much success in so troubled a sea. Addison. 4. The application of skill to the production of the beautiful by imitation or design, or an occupation in which skill is so employed, as in painting and sculpture; one of the fine arts; as, he prefers art to literature. 5. pl.  Those branches of learning which are taught in the academical course of colleges; as, master of arts. In fearless youth we tempt the heights of arts. Pope. Four years spent in the arts (as they are called in colleges) is, perhaps, laying too laborious a foundation. Goldsmith. 6. Learning; study; applied knowledge, science, or letters. [Archaic] So vast is art, so narrow human wit. Pope. 7. Skill, dexterity, or the power of performing certain actions, asquired by experience, study, or observation; knack; a, a man has the art of managing his business to advantage. 8. Skillful plan; device. They employed every art to soothe . . . the discontented warriors. Macaulay. 9. Cunning; artifice; craft. Madam, I swear I use no art at all. Shak. Animals practice art when opposed to their superiors in strength. Crabb. 10 10  To black art; magic. [Obs.] Shak. Art and part (Scots Law), share or concern by aiding and abetting a criminal in the perpetration of a crime, whether by advice or by assistance in the execution; complicity. Note: The arts are divided into various classes. The useful, mechanical, or industrial arts are those in which the hands and body are concerned than the mind; as in making clothes and utensils. These are called trades. The fine arts are those which have primarily to do with imagination taste, and are applied to the production of what is beautiful. They include poetry, music, painting, engraving, sculpture, and architecture; but the term is often confined to painting, sculpture, and architecture. The liberal arts (artes liberales, the higher arts, which, among the Romans, only freemen were permitted to pursue) were, in the Middle Ages, these seven branches of learning, -- grammar, logic, rhetoric, arithmetic, geometry, music, and astronomy. In modern times the liberal arts include the sciences, philosophy, history, etc., which compose the course of academical or collegiate education. Hence, degrees in the arts; master and bachelor of arts. In America, literature and the elegant arts must grow up side by side with the coarser plants of daily necessity. Irving. Syn. -- Science; literature; aptitude; readiness; skill; dexterity; adroitness; contrivance; profession; business; trade; calling; cunning; artifice; duplicity. See Science."}