{"word":"article","definition":"1. A distinct portion of an instrument, discourse, literary work, or any other writing, consisting of two or more particulars, or treating of various topics; as, an article in the Constitution. Hence: A clause in a contract, system of regulations, treaty, or the like; a term, condition, or stipulation in a contract; a concise statement; as, articles of agreement. 2. A literary composition, forming an independent portion of a magazine, newspaper, or cyclopedia. 3. Subject; matter; concern; distinct. [Obs.] A very great revolution that happened in this article of good breeding. Addison. This last article will hardly be believed. De Foe. 4. A distinct part. \"Upon each article of human duty.\" Paley. \"Each article of time.\" Habington. The articles which compose the blood. E. Darwin. 5. A particular one of various things; as, an article of merchandise; salt is a necessary article. They would fight not for articles of faith, but for articles of food. Landor. 6. Precise point of time; moment. [Obs. or Archaic] This fatal news coming to Hick's Hall upon the article of my Lord Russell's trial, was said to have had no little influence on the jury and all the bench to his prejudice. Evelyn. 7. (Gram.)  One of the three words, a, an, the, used before nouns to limit or define their application. A (or an) is called the indefinite article, the the definite article. 8. (Zoöl.)  One of the segments of an articulated appendage. Articles of Confederation, the compact which was first made by the original thirteen States of the United States. They were adopted March 1, 1781, and remained the supreme law until March, 1789. -- Articles of impeachment, an instrument which, in cases of impeachment, performs the same office which an indictment does in a common criminal case. -- Articles of war, rules and regulations, fixed by law, for the better government of the army. -- In the article of death Etym: [L. in articulo mortis], at the moment of death; in the dying struggle. -- Lords of the articles (Scot. Hist.), a standing committee of the Scottish Parliament to whom was intrusted the drafting and preparation of the acts, or bills for laws. -- The Thirty-nine Articles, statements (thirty-nine in number) of the tenets held by the Church of England.\n\n1. To formulate in articles; to set forth in distinct particulars. If all his errors and follies were articled against him, the man would seem vicious and miserable. Jer. Taylor. 2. To accuse or charge by an exhibition of articles. He shall be articled against in the high court of admiralty. Stat. 33 Geo. III. 3. To bind by articles of covenant or stipulation; as, to article an apprentice to a mechanic.\n\nTo agree by articles; to stipulate; to bargain; to covenant. [R.] Then he articled with her that he should go away when he pleased. Selden."}