{"word":"as","definition":"1. Denoting equality or likeness in kind, degree, or manner; like; similar to; in the same manner with or in which; in accordance with; in proportion to; to the extent or degree in which or to which; equally; no less than; as, ye shall be as gods, knowing good and evil; you will reap as you sow; do as you are bidden. His spiritual attendants adjured him, as he loved his soul, to emancipate his brethren. Macaulay. Note: As is often preceded by one of the antecedent or correlative words such, same, so, or as, in expressing an equality or comparison; as, give us such things as you please, and so long as you please, or as long as you please; he is not so brave as Cato; she is as amiable as she is handsome; come as quickly as possible. \"Bees appear fortunately to prefer the same colors as we do.\" Lubbock. As, in a preceding part of a sentence, has such or so to answer correlatively to it; as with the people, so with the priest. 2. In the idea, character, or condition of, -- limiting the view to certain attributes or relations; as, virtue considered as virtue; this actor will appear as Hamlet. The beggar is greater as a man, than is the man merely as a king. Dewey. 3. While; during or at the same time that; when; as, he trembled as he spoke. As I return I will fetch off these justices. Shak. 4. Because; since; it being the case that. As the population of Scotland had been generally trained to arms . . . they were not indifferently prepared. Sir W. Scott. [See Synonym under Because.] 5. Expressing concession. (Often approaching though in meaning). We wish, however, to avail ourselves of the interest, transient as it may be, which this work has excited. Macaulay. 6. That, introducing or expressing a result or consequence, after the correlatives so and such. [Obs.] I can place thee in such abject state, as help shall never find thee. Rowe. So as, so that. [Obs.] The relations are so uncertain as they require a great deal of examination. Bacon. 7. As if; as though. [Obs. or Poetic] He lies, as he his bliss did know. Waller. 8. For instance; by way of example; thus; -- used to introduce illustrative phrases, sentences, or citations. 9. Than. [Obs. & R.] The king was not more forward to bestow favors on them as they free to deal affronts to others their superiors. Fuller. 10. Expressing a wish. [Obs.] \"As have,\" i. e., may he have. Chaucer. As . . . as. See So . . . as, under So. -- As far as, to the extent or degree. \"As far as can be ascertained.\" Macaulay. -- As far forth as, as far as. [Obs.] Chaucer. -- As for, or As to, in regard to; with respect to. -- As good as, not less than; not falling short of. -- As good as one's word, faithful to a promise. -- As if, or As though, of the same kind, or in the same condition or manner, that it would be if. -- As it were (as if it were), a qualifying phrase used to apologize for or to relieve some expression which might be regarded as inappropriate or incongruous; in a manner. -- As now, just now. [Obs.] Chaucer. -- As swythe, as quickly as possible. [Obs.] Chaucer. -- As well, also; too; besides. Addison. -- As well as, equally with, no less than. \"I have understanding as well as you.\" Job xii. 3. -- As yet, until now; up to or at the present time; still; now.\n\nAn ace. [Obs.] Chaucer. Ambes-as, double aces.\n\n1. A Roman weight, answering to the libra or pound, equal to nearly eleven ounces Troy weight. It was divided into twelve ounces. 2. A Roman copper coin, originally of a pound weight (12 oz.); but reduced, after the first Punic war, to two ounces; in the second Punic war, to one ounce; and afterwards to half an ounce."}