{"word":"at","definition":"Primarily, this word expresses the relations of presence, nearness in place or time, or direction toward; as, at the ninth hour; at the house; to aim at a mark. It is less definite than in or on; at the house may be in or near the house. From this original import are derived all the various uses of at. It expresses: - 1. A relation of proximity to, or of presence in or on, something; as, at the door; at your shop; at home; at school; at hand; at sea and on land. 2. The relation of some state or condition; as, at war; at peace; at ease; at your service; at fault; at liberty; at risk; at disadvantage. 3. The relation of some employment or action; occupied with; as, at engraving; at husbandry; at play; at work; at meat (eating); except at puns. 4. The relation of a point or position in a series, or of degree, rate, or value; as, with the thermometer at 80ยบ; goods sold at a cheap price; a country estimated at 10,000 square miles; life is short at the longest. 5. The relations of time, age, or order; as, at ten o'clock; at twenty-one; at once; at first. 6. The relations of source, occasion, reason, consequence, or effect; as, at the sight; at this news; merry at anything; at this declaration; at his command; to demand, require, receive, deserve, endure at your hands. 7. Relation of direction toward an object or end; as, look at it; to point at one; to aim at a mark; to throw, strike, shoot, wink, mock, laugh at any one. At all, At home, At large, At last, At length, At once, etc. See under All, Home, Large, Last (phrase and syn.), Length, Once, etc. -- At it, busily or actively engaged. -- At least. See Least and However. -- At one. See At one, in the Vocabulary. Syn. -- In, At. When reference to the interior of any place is made prominent in is used. It is used before the names of countries and cities (esp. large cities); as, we live in America, in New York, in the South. At is commonly employed before names of houses, institutions, villages, and small places; as, Milton was educated at Christ's College; money taken in at the Customhouse; I saw him at the jeweler's; we live at Beachville. At may be used before the name of a city when it is regarded as a mere point of locality. \"An English king was crowned at Paris.\" Macaulay. \"Jean Jacques Rousseau was born at Geneva, June, 28, 1712.\" J. Morley. In regard to time, we say at the hour, on the day, in the year; as, at 9 o'clock, on the morning of July 5th, in the year 1775."}