{"word":"attachment","definition":"1. The act attaching, or state of being attached; close adherence or affection; fidelity; regard; anas, an attachment to a friend, or to a party. 2. That by which one thing is attached to another; connection; as, to cut the attachments of a muscle. The human mind . . . has exhausted its forces in the endeavor to rend the supernatural from its attachment to this history. I. Taylor. 3. Something attached; some adjunct attached to an instrument, machine, or other object; as, a sewing machine attachment (i. e., a device attached to a sewing machine to enable it to do special work, as tucking, etc.). 4. (Giv. Law) (a) A seizure or taking into custody by virtue of a legal process. (b) The writ or percept commanding such seizure or taking. Note: The term is applied to a seizure or taking either of persons or property. In the serving of process in a civil suit, it is most generally applied to the taking of property, whether at common law, as a species of distress, to compel defendant's appearance, or under local statutes, to satisfy the judgment the plaintiff may recover in the action. The terms attachment and arrest are both applied to the taking or apprehension of a defendant to compel an appearance in a civil action. Attachments are issued at common law and in chancery, against persons for contempt of court. In England, attachment is employed in some cases where capias is with us, as against a witness who fails to appear on summons. In some of the New England States a writ of attachment is a species of mesne process upon which the property of a defendant may be seized at the commencement of a suit and before summons to him, and may be held to satisfy the judgment the plaintiff may recover. In other States this writ can issue only against absconding debtors and those who conceal themselves. See Foreign, Garnishment, Trustee process. Bouvier. Burrill. Blackstone. Syn. -- Attachment, Affection. The leading idea of affection is that of warmth and tenderness; the leading idea of attachment is that of being bound to some object by strong and lasting ties. There is more of sentiment (and sometimes of romance) in affection, and more of principle in preserving attachment. We speak of the ardor of the one, and the fidelity of the other. There is another distinction in the use and application of these words. The term attachment is applied to a wider range of objects than affection. A man may have a strong attachment to his country, to his profession, to his principles, and even to favorite places; in respect to none of these could we use the word affection."}