{"word":"attraction","definition":"1. (Physics)  An invisible power in a body by which it draws anything to itself; the power in nature acting mutually between bodies or ultimate particles, tending to draw them together, or to produce their cohesion or combination, and conversely resisting separation. Note: Attraction is exerted at both sensible and insensible distances, and is variously denominated according to its qualities or phenomena. Under attraction at sensible distances, there are, --(1.) Attraction of gravitation, which acts at all distances throughout the universe, with a force proportional directly to the product of the masses of the bodies and inversely to the square of their distances apart. (2.) Magnetic, diamagnetic, and electrical attraction, each of which is limited in its sensible range and is polar in its action, a property dependent on the quality or condition of matter, and not on its quantity. Under attraction at insensible distances, there are, -- (1.) Adhesive attraction, attraction between surfaces of sensible extent, or by the medium of an intervening substance. (2.) Cohesive attraction, attraction between ultimate particles, whether like or unlike, and causing simply an aggregation or a union of those particles, as in the absorption of gases by charcoal, or of oxygen by spongy platinum, or the process of solidification or crystallization. The power in adhesive attraction is strictly the same as that of cohesion. (3.) Capillary attraction, attraction causing a liquid to rise, in capillary tubes or interstices, above its level outside, as in very small glass tubes, or a sponge, or any porous substance, when one end is inserted in the liquid. It is a special case of cohesive attraction. (4.) Chemical attraction, or affinity, that peculiar force which causes elementary atoms, or groups of atoms, to unite to form molecules. 2. The act or property of attracting; the effect of the power or operation of attraction. Newton. 3. The power or act of alluring, drawing to, inviting, or engaging; an attractive quality; as, the attraction of beauty or eloquence. 4. That which attracts; an attractive object or feature. Syn. -- Allurement; enticement; charm."}