{"word":"back","definition":"1. A large shallow vat; a cistern, tub, or trough, used by brewers, distillers, dyers, picklers, gluemakers, and others, for mixing or cooling wort, holding water, hot glue, etc. Hop back, Jack back, the cistern which receives the infusion of malt and hops from the copper. -- Wash back, a vat in which distillers ferment the wort to form wash. -- Water back, a cistern to hold a supply of water; esp. a small cistern at the back of a stove, or a group of pipes set in the fire box of a stove or furnace, through which water circulates and is heated. 2. A ferryboat. See Bac, 1\n\n1. In human beings, the hinder part of the body, extending from the neck to the end of the spine; in other animals, that part of the body which corresponds most nearly to such part of a human being; as, the back of a horse, fish, or lobster. 2. An extended upper part, as of a mountain or ridge. [The mountains] their broad bare backs upheave Into the clouds. Milton. 3. The outward or upper part of a thing, as opposed to the inner or lower part; as, the back of the hand, the back of the foot, the back of a hand rail. Methought Love pitying me, when he saw this, Gave me your hands, the backs and palms to kiss. Donne. 4. The part opposed to the front; the hinder or rear part of a thing; as, the back of a book; the back of an army; the back of a chimney. 5. The part opposite to, or most remote from, that which fronts the speaker or actor; or the part out of sight, or not generally seen; as, the back of an island, of a hill, or of a village. 6. The part of a cutting tool on the opposite side from its edge; as, the back of a knife, or of a saw. 7. A support or resource in reserve. This project Should have a back or second, that might hold, If this should blast in proof. Shak. 8. (Naut.)  The keel and keelson of a ship. 9. (Mining)  The upper part of a lode, or the roof of a horizontal underground passage. 10. A garment for the back; hence, clothing. A bak to walken inne by daylight. Chaucer. Behind one's back, when one is absent; without one's knowledge; as, to ridicule a person behind his back. -- Full back, Half back, Quarter back (Football), players stationed behind those in the front line. -- To be or lie on one's back, to be helpless. -- To put, or get, one's back up, to assume an attitude of obstinate resistance (from the action of a cat when attacked.). [Colloq.] -- To see the back of, to get rid of. -- To turn the back, to go away; to flee. -- To turn the back on one, to forsake or neglect him.\n\n1. Being at the back or in the rear; distant; remote; as, the back door; back settlements. 2. Being in arrear; overdue; as, back rent. 3. Moving or operating backward; as, back action. Back charges, charges brought forward after an account has been made up. -- Back filling (Arch.), the mass of materials used in filling up the space between two walls, or between the inner and outer faces of a wall, or upon the haunches of an arch or vault. -- Back pressure. (Steam Engine) See under Pressure. -- Back rest, a guide attached to the slide rest of a lathe, and placed in contact with the work, to steady it in turning. -- Back slang, a kind of slang in which every word is written or pronounced backwards; as, nam for man. -- Back stairs, stairs in the back part of a house; private stairs. Also used adjectively. See Back stairs, Backstairs, and Backstair, in the Vocabulary. -- Back step (Mil.), the retrograde movement of a man or body of men, without changing front. -- Back stream, a current running against the main current of a stream; an eddy. -- To take the back track, to retrace one's steps; to retreat. [Colloq.]\n\n1. To get upon the back of; to mount. I will back him [a horse] straight. Shak. 2. To place or seat upon the back. [R.] Great Jupiter, upon his eagle backed, Appeared to me. Shak. 3. To drive or force backward; to cause to retreat or recede; as, to back oxen. 4. To make a back for; to furnish with a back; as, to back books. 5. To adjoin behind; to be at the back of. A garden . . . with a vineyard backed. Shak. The chalk cliffs which back the beach. Huxley. 6. To write upon the back of; as, to back a letter; to indorse; as, to back a note or legal document. 7. To support; to maintain; to second or strengthen by aid or influence; as, to back a friend. \"Parliament would be backed by the people.\" Macaulay. Have still found it necessary to back and fortify their laws with rewards and punishments. South. The mate backed the captain manfully. Blackw. Mag. 8. To bet on the success of; -- as, to back a race horse. To back an anchor (Naut.), to lay down a small anchor ahead of a large one, the cable of the small one being fastened to the crown of the large one. -- To back the field, in horse racing, to bet against a particular horse or horses, that some one of all the other horses, collectively designated \"the field\", will win. -- To back the oars, to row backward with the oars. -- To back a rope, to put on a preventer. -- To back the sails, to arrange them so as to cause the ship to move astern. -- To back up, to support; to sustain; as, to back up one's friends. -- To back a warrant (Law), is for a justice of the peace, in the county where the warrant is to be executed, to sign or indorse a warrant, issued in another county, to apprehend an offender. -- To back water (Naut.), to reverse the action of the oars, paddles, or propeller, so as to force the boat or ship backward.\n\n1. To move or go backward; as, the horse refuses to back. 2. (Naut.)  To change from one quarter to another by a course opposite to that of the sun; -- used of the wind. 3. (Sporting)  To stand still behind another dog which has poined; -- said of a dog. [Eng.] To back and fill, to manage the sails of a ship so that the wind strikes them alternately in front and behind, in order to keep the ship in the middle of a river or channel while the current or tide carries the vessel against the wind. Hence: (Fig.) To take opposite positions alternately; to assert and deny. [Colloq.] -- To back out, To back down, to retreat or withdraw from a promise, engagement, or contest; to recede. [Colloq.] Cleon at first . . . was willing to go; but, finding that he [Nicias] was in earnest, he tried to back out. Jowett (Thucyd. )\n\n1. In, to, or toward, the rear; as, to stand back; to step back. 2. To the place from which one came; to the place or person from which something is taken or derived; as, to go back for something left behind; to go back to one's native place; to put a book back after reading it. 3. To a former state, condition, or station; as, to go back to private life; to go back to barbarism. 4. ( Of time) In times past; ago. \"Sixty or seventy years back.\" Gladstone. 5. Away from contact; by reverse movement. The angel of the Lord . . . came, and rolled back the stone from the door. Matt. xxvii. 2. 6. In concealment or reserve; in one's own possession; as, to keep back the truth; to keep back part of the money due to another. 7. In a state of restraint or hindrance. The Lord hath kept thee back from honor. Numb. xxiv. 11. 8. In return, repayment, or requital. What have I to give you back! Shak. 9. In withdrawal from a statement, promise, or undertaking; as, he took back0 the offensive words. 10. In arrear; as, to be back in one's rent. [Colloq.] Back and forth, backwards and forwards; to and fro. -- To go back on, to turn back from; to abandon; to betray; as, to go back on a friend; to go back on one's professions. [Colloq.]"}