{"word":"band","definition":"1. A fillet, strap, or any narrow ligament with which a thing is encircled, or fastened, or by which a number of things are tied, bound together, or confined; a fetter. Every one's bands were loosed. Acis xvi 26. 2. (Arch.) (a) A continuous tablet, stripe, or series of ornaments, as of carved foliage, of color, or of brickwork, etc. (b) In Gothic architecture, the molding, or suite of moldings, which encircles the pillars and small shafts. 3. That which serves as the means of union or connection between persons; a tie. \"To join in Hymen's bands.\" Shak. 4. A linen collar or ruff worn in the 16th and 17th centuries. 5. pl.  Two strips of linen hanging from the neck in front as part of a clerical, legal, or academic dress. 6. A narrow strip of cloth or other material on any article of dress, to bind, strengthen, ornament, or complete it. \"Band and gusset and seam.\" Hood. 7. A company of persons united in any common design, especially a body of armed men. Troops of horsemen with his bands of foot. Shak. 8. A number of musicians who play together upon portable musical instruments, especially those making a loud sound, as certain wind instruments (trumpets, clarinets, etc.), and drums, or cymbals. 9. (Bot.)  A space between elevated lines or ribs, as of the fruits of umbelliferous plants. 10. (Zoöl.)  A stripe, streak, or other mark transverse to the axis of the body. 11. (Mech.)  A belt or strap. 12. A bond [Obs.] \"Thy oath and band.\" Shak. 13. Pledge; security. [Obs.] Spenser. Band saw, a saw in the form of an endless steel belt, with teeth on one edge, running over wheels.\n\n1. To bind or tie with a band. 2. To mark with a band. 3. To unite in a troop, company, or confederacy. \"Banded against his throne.\" Milton. Banded architrave, pier, shaft, etc. (Arch.), an architrave, pier, etc., of which the regular profile is interrupted by blocks or projections crossing it at right angles.\n\nTo confederate for some common purpose; to unite; to conspire together. Certain of the Jews banded together. Acts xxiii. 12.\n\nTo bandy; to drive away. [Obs.]\n\nof Bind. [Obs.]"}