{"word":"bank","definition":"A bench; a high seat, or seat of distinction or judgment; a tribunal or court. In banc, In banco (the ablative of bancus), In bank, in full court, or with full judicial authority; as, sittings in banc (distinguished from sittings at nisi prius).\n\n1. A mound, pile, or ridge of earth, raised above the surrounding level; hence, anything shaped like a mound or ridge of earth; as, a bank of clouds; a bank of snow. They cast up a bank against the city. 2 Sam. xx. 15. 2. A steep acclivity, as the slope of a hill, or the side of a ravine. 3. The margin of a watercourse; the rising ground bordering a lake, river, or sea, or forming the edge of a cutting, or other hollow. Tiber trembled underneath her banks. Shak. 4. An elevation, or rising ground, under the sea; a shoal, shelf, or shallow; as, the banks of Newfoundland. 5. (Mining) (a) The face of the coal at which miners are working. (b) A deposit of ore or coal, worked by excavations above water level. (c) The ground at the top of a shaft; as, ores are brought to bank. Bank beaver (Zoöl.), the otter. [Local, U.S.] -- Bank swallow, a small American and European swallow (Clivicola riparia) that nests in a hole which it excavates in a bank.\n\n1. To raise a mound or dike about; to inclose, defend, or fortify with a bank; to embank. \"Banked well with earth.\" Holland. 2. To heap or pile up; as, to bank sand. 3. To pass by the banks of. [Obs.] Shak. To bank a fire, To bank up a fire, to cover the coals or embers with ashes or cinders, thus keeping the fire low but alive.\n\n1. A bench, as for rowers in a galley; also, a tier of oars. Placed on their banks, the lusty Trojan sweep Neptune's smooth face, and cleave the yielding deep. Waller. 2. (Law) (a) The bench or seat upon which the judges sit. (b) The regular term of a court of law, or the full court sitting to hear arguments upon questions of law, as distinguished from a sitting at Nisi Prius, or a court held for jury trials. See Banc. Burrill. 3. (Printing)  A sort of table used by printers. 4. (Music)  A bench, or row of keys belonging to a keyboard, as in an organ. Knight.\n\n1. An establishment for the custody, loan, exchange, or issue, of money, and for facilitating the transmission of funds by drafts or bills of exchange; an institution incorporated for performing one or more of such functions, or the stockholders (or their representatives, the directors), acting in their corporate capacity. 2. The building or office used for banking purposes. 3. A fund from deposits or contributions, to be used in transacting business; a joint stock or capital. [Obs.] Let it be no bank or common stock, but every man be master of his own money. Bacon. 4. (Gaming)  The sum of money or the checks which the dealer or banker has as a fund, from which to draw his stakes and pay his losses. 5. In certain games, as dominos, a fund of pieces from which the players are allowed to draw. Bank credit, a credit by which a person who has give -- Bank of deposit, a bank which receives money for safe keeping. -- Bank of issue, a bank which issues its own notes payable to bearer.\n\nTo deposit in a bank.\n\n1. To keep a bank; to carry on the business of a banker. 2. To deposit money in a bank; to have an account with a banker."}