{"word":"bar","definition":"1. A piece of wood, metal, or other material, long in proportion to its breadth or thickness, used as a lever and for various other purposes, but especially for a hindrance, obstruction, or fastening; as, the bars of a fence or gate; the bar of a door. Thou shalt make bars of shittim wood. Ex. xxvi. 26. 2. An indefinite quantity of some substance, so shaped as to be long in proportion to its breadth and thickness; as, a bar of gold or of lead; a bar of soap. 3. Anything which obstructs, hinders, or prevents; an obstruction; a barrier. Must I new bars to my own joy create Dryden. 4. A bank of sand, gravel, or other matter, esp. at the mouth of a river or harbor, obstructing navigation. 5. Any railing that divides a room, or office, or hall of assembly, in order to reserve a space for those having special privileges; as, the bar of the House of Commons. 6. (Law) (a) The railing that incloses the place which counsel occupy in courts of justice. Hence, the phrase at the bar of the court signifies in open court. (b) The place in court where prisoners are stationed for arraignment, trial, or sentence. (c) The whole body of lawyers licensed in a court or district; the legal profession. (d) A special plea constituting a sufficient answer to plaintiff's action. 7. Any tribunal; as, the bar of public opinion; the bar of God. 8. A barrier or counter, over which liquors and food are passed to customers; hence, the portion of the room behind the counter where liquors for sale are kept. 9. (Her.)  An ordinary, like a fess but narrower, occupying only one fifth part of the field. 10. A broad shaft, or band, or stripe; as, a bar of light; a bar of color. 11. (Mus.)  A vertical line across the staff. Bars divide the staff into spaces which represent measures, and are themselves called measures. Note: A double bar marks the end of a strain or main division of a movement, or of a whole piece of music; in psalmody, it marks the end of a line of poetry. The term bar is very often loosely used for measure, i.e., for such length of music, or of silence, as is included between one bar and the next; as, a passage of eight bars; two bars' rest. 12. (Far.) pl. (a) The space between the tusks and grinders in the upper jaw of a horse, in which the bit is placed. (b) The part of the crust of a horse's hoof which is bent inwards towards the frog at the heel on each side, and extends into the center of the sole. 13. (Mining) (a) A drilling or tamping rod. (b) A vein or dike crossing a lode. 14. (Arch.) (a) A gatehouse of a castle or fortified town. (b) A slender strip of wood which divides and supports the glass of a window; a sash bar. Bar shoe (Far.), a kind of horseshoe having a bar across the usual opening at the heel, to protect a tender frog from injury. -- Bar shot, a double headed shot, consisting of a bar, with a ball or half ball at each end; -- formerly used for destroying the masts or rigging in naval combat. -- Bar sinister (Her.), a term popularly but erroneously used for baton, a mark of illegitimacy. See Baton. -- Bar tracery (Arch.), ornamental stonework resembling bars of iron twisted into the forms required. -- Blank bar (Law). See Blank. -- Case at bar (Law), a case presently before the court; a case under argument. -- In bar of, as a sufficient reason against; to prevent. -- Matter in bar, or Defence in bar, a plea which is a final defense in an action. -- Plea in bar, a plea which goes to bar or defeat the plaintiff's action absolutely and entirely. -- Trial at bar (Eng. Law), a trial before all the judges of one the superior courts of Westminster, or before a quorum representing the full court.\n\n1. To fasten with a bar; as, to bar a door or gate. 2. To restrict or confine, as if by a bar; to hinder; to obstruct; to prevent; to prohibit; as, to bar the entrance of evil; distance bars our intercourse; the statute bars my right; the right is barred by time; a release bars the plaintiff's recovery; -- sometimes with up. He barely looked the idea in the face, and hastened to bar it in its dungeon. Hawthorne. 3. To except; to exclude by exception. Nay, but I bar to-night: you shall not gauge me By what we do to- night. Shak. 4. To cross with one or more stripes or lines. For the sake of distinguishing the feet more clearly, I have barred them singly. Burney."}