{"word":"base","definition":"1. Of little, or less than the usual, height; of low growth; as, base shrubs. [Archaic] Shak. 2. Low in place or position. [Obs.] Shak. 3. Of humble birth; or low degree; lowly; mean. [Archaic] \"A pleasant and base swain.\" Bacon. 4. Illegitimate by birth; bastard. [Archaic] Why bastard wherefore base Shak. 5. Of little comparative value, as metal inferior to gold and silver, the precious metals. 6. Alloyed with inferior metal; debased; as, base coin; base bullion. 7. Morally low. Hence: Low-minded; unworthy; without dignity of sentiment; ignoble; mean; illiberal; menial; as, a base fellow; base motives; base occupations. \"A cruel act of a base and a cowardish mind.\" Robynson (More's Utopia). \"Base ingratitude.\" Milton. 8. Not classical or correct. \"Base Latin.\" Fuller. 9. Deep or grave in sound; as, the base tone of a violin. [In this sense, commonly written bass.] 10. (Law)  Not held by honorable service; as, a base estate, one held by services not honorable; held by villenage. Such a tenure is called base, or low, and the tenant, a base tenant. Base fee, formerly, an estate held at the will of the lord; now, a qualified fee. See note under Fee, n., 4. -- Base metal. See under Metal. Syn. -- Dishonorable; worthless; ignoble; low-minded; infamous; sordid; degraded. -- Base, Vile, Mean. These words, as expressing moral qualities, are here arranged in the order of their strength, the strongest being placed first. Base marks a high degree of moral turpitude; vile and mean denote, in different degrees, the want of what is valuable or worthy of esteem. What is base excites our abhorrence; what is vile provokes our disgust or indignation; what is mean awakens contempt. Base is opposed to high-minded; vile, to noble; mean, to liberal or generous. Ingratitude is base; sycophancy is vile; undue compliances are mean.\n\n1. The bottom of anything, considered as its support, or that on which something rests for support; the foundation; as, the base of a statue. \"The base of mighty mountains.\" Prescott. 2. Fig.: The fundamental or essential part of a thing; the essential principle; a groundwork. 3. (Arch.) (a) The lower part of a wall, pier, or column, when treated as a separate feature, usually in projection, or especially ornamented. (b) The lower part of a complete architectural design, as of a monument; also, the lower part of any elaborate piece of furniture or decoration. 4. (Bot.)  That extremity of a leaf, fruit, etc., at which it is attached to its support. 5. (Chem.)  The positive, or non-acid component of a salt; a substance which, combined with an acid, neutralizes the latter and forms a salt; -- applied also to the hydroxides of the positive elements or radicals, and to certain organic bodies resembling them in their property of forming salts with acids. 6. (Pharmacy)  The chief ingredient in a compound. 7. (Dyeing)  A substance used as a mordant. Ure. 8. (Fort.)  The exterior side of the polygon, or that imaginary line which connects the salient angles of two adjacent bastions. 9. (Geom.)  The line or surface constituting that part of a figure on which it is supposed to stand. 10. (Math.)  The number from which a mathematical table is constructed; as, the base of a system of logarithms. 11. Etym: [See Base low.]  A low, or deep, sound. (Mus.) (a) The lowest part; the deepest male voice. (b) One who sings, or the instrument which plays, base. [Now commonly written bass.] The trebles squeak for fear, the bases roar. Dryden. 12. (Mil.)  A place or tract of country, protected by fortifications, or by natural advantages, from which the operations of an army proceed, forward movements are made, supplies are furnished, etc. 13. (Mil.)  The smallest kind of cannon. [Obs.] 14. (Zoöl.)  That part of an organ by which it is attached to another more central organ. 15. (Crystallog.)  The basal plane of a crystal. 16. (Geol.)  The ground mass of a rock, especially if not distinctly crystalline. 17. (Her.)  The lower part of the field. See Escutcheon. 18. The housing of a horse. [Obs.] 19. pl.  A kind of skirt ( often of velvet or brocade, but sometimes of mailed armor) which hung from the middle to about the knees, or lower. [Obs.] 20. The lower part of a robe or petticoat. [Obs.] 21. An apron. [Obs.] \"Bakers in their linen bases.\" Marston. 22. The point or line from which a start is made; a starting place or a goal in various games. To their appointed base they went. Dryden. 23. (Surv.)  A line in a survey which, being accurately determined in length and position, serves as the origin from which to compute the distances and positions of any points or objects connected with it by a system of triangles. Lyman. 24. A rustic play; -- called also prisoner's base, prison base, or bars. \"To run the country base.\" Shak. 25. (Baseball)  Any one of the four bounds which mark the circuit of the infield. Altern base. See under Altern. -- Attic base. (Arch.) See under Attic. -- Base course. (Arch.) (a) The first or lower course of a foundation wall, made of large stones of a mass of concrete; -- called also foundation course. (b) The architectural member forming the transition between the basement and the wall above. -- Base hit (Baseball), a hit, by which the batsman, without any error on the part of his opponents, is able to reach the first base without being put out. -- Base line. (a) A main line taken as a base, as in surveying or in military operations. (b) A line traced round a cannon at the rear of the vent. -- Base plate, the foundation plate of heavy machinery, as of the steam engine; the bed plate. -- Base ring (Ordnance), a projecting band of metal around the breech, connected with the body of the gun by a concave molding. H. L. Scott.\n\nTo put on a base or basis; to lay the foundation of; to found, as an argument or conclusion; -- used with on or upon. Bacon.\n\n1. To abase; to let, or cast, down; to lower. [Obs.] If any . . . based his pike. Sir T. North. 2. To reduce the value of; to debase. [Obs.] Metals which we can not base. Bacon."}