{"word":"bath","definition":"1. The act of exposing the body, or part of the body, for purposes of cleanliness, comfort, health, etc., to water, vapor, hot air, or the like; as, a cold or a hot bath; a medicated bath; a steam bath; a hip bath. 2. Water or other liquid for bathing. 3. A receptacle or place where persons may immerse or wash their bodies in water. 4. A building containing an apartment or a series of apartments arranged for bathing. Among the ancients, the public baths were of amazing extent and magnificence. Gwilt. 5. (Chem.)  A medium, as heated sand, ashes, steam, hot air, through which heat is applied to a body. 6. (Photog.)  A solution in which plates or prints are immersed; also, the receptacle holding the solution. Note: Bath is used adjectively or in combination, in an obvious sense of or for baths or bathing; as, bathroom, bath tub, bath keeper. Douche bath. See Douche. -- Order of the Bath, a high order of British knighthood, composed of three classes, viz., knights grand cross, knights commanders, and knights companions, abbreviated thus: G. C. B., K. C. B., K. B. -- Russian bath, a kind of vapor bath which consists in a prolonged exposure of the body to the influence of the steam of water, followed by washings and shampooings. -- Turkish bath, a kind of bath in which a profuse perspiration is produced by hot air, after which the body is washed and shampooed. -- Bath house, a house used for the purpose of bathing; -- also a small house, near a bathing place, where a bather undresses and dresses.\n\nA Hebrew measure containing the tenth of a homer, or five gallons and three pints, as a measure for liquids; and two pecks and five quarts, as a dry measure.\n\nA city in the west of England, resorted to for its hot springs, which has given its name to various objects. Bath brick, a preparation of calcareous earth, in the form of a brick, used for cleaning knives, polished metal, etc. -- Bath chair, a kind of chair on wheels, as used by invalids at Bath. \"People walked out, or drove out, or were pushed out in their Bath chairs.\" Dickens. -- Bath metal, an alloy consisting of four and a half ounces of zinc and one pound of copper. -- Bath note, a folded writing paper, 8 1/2 by 14 inches. -- Bath stone, a species of limestone (oölite) found near Bath, used for building."}