{"word":"battery","definition":"1. The act of battering or beating. 2. (Law)  The unlawful beating of another. It includes every willful, angry and violent, or negligent touching of another's person or clothes, or anything attached to his person or held by him. 3. (Mil.) (a) Any place where cannon or mortars are mounted, for attack or defense. (b) Two or more pieces of artillery in the field. (c) A company or division of artillery, including the gunners, guns, horses, and all equipments. In the United States, a battery of flying artillery consists usually of six guns. Barbette battery. See Barbette. -- Battery d'enfilade, or Enfilading battery, one that sweeps the whole length of a line of troops or part of a work. -- Battery en écharpe, one that plays obliquely. -- Battery gun, a gun capable of firing a number, of shots simultaneously or successively without stopping to load. -- Battery wagon, a wagon employed to transport the tools and materials for repair of the carriages, etc., of the battery. -- In battery, projecting, as a gun, into an embrasure or over a parapet in readiness for firing. -- Masked battery, a battery artificially concealed until required to open upon the enemy. -- Out of battery, or From battery, withdrawn, as a gun, to a position for loading. 4. (Elec.) (a) A number of coated jars (Leyden jars) so connected that they may be charged and discharged simultaneously. (b) An apparatus for generating voltaic electricity. Note: In the trough battery, copper and zinc plates, connected in pairs, divide the trough into cells, which are filled with an acid or oxidizing liquid; the effect is exhibited when wires connected with the two end-plates are brought together. In Daniell's battery, the metals are zinc and copper, the former in dilute sulphuric acid, or a solution of sulphate of zinc, the latter in a saturated solution of sulphate of copper. A modification of this is the common gravity battery, so called from the automatic action of the two fluids, which are separated by their specific gravities. In Grove's battery, platinum is the metal used with zinc; two fluids are used, one of them in a porous cell surrounded by the other. In Bunsen's or the carbon battery, the carbon of gas coke is substituted for the platinum of Grove's. In Leclanché's battery, the elements are zinc in a solution of ammonium chloride, and gas carbon surrounded with manganese dioxide in a porous cell. A secondary battery is a battery which usually has the two plates of the same kind, generally of lead, in dilute sulphuric acid, and which, when traversed by an electric current, becomes charged, and is then capable of giving a current of itself for a time, owing to chemical changes produced by the charging current. A storage battery is a kind of secondary battery used for accumulating and storing the energy of electrical charges or currents, usually by means of chemical work done by them; an accumulator. 5. A number of similar machines or devices in position; an apparatus consisting of a set of similar parts; as, a battery of boilers, of retorts, condensers, etc. 6. (Metallurgy)  A series of stamps operated by one motive power, for crushing ores containing the precious metals. Knight. 7. The box in which the stamps for crushing ore play up and down. 8. (Baseball)  The pitcher and catcher together."}