{"word":"battle","definition":"Fertile. See Battel, a. [Obs.]\n\n1. A general action, fight, or encounter, in which all the divisions of an army are or may be engaged; an engagement; a combat. 2. A struggle; a contest; as, the battle of life. The whole intellectual battle that had at its center the best poem of the best poet of that day. H. Morley. 3. A division of an army; a battalion. [Obs.] The king divided his army into three battles. Bacon. The cavalry, by way of distinction, was called the battle, and on it alone depended the fate of every action. Robertson. 4. The main body, as distinct from the van and rear; battalia. [Obs.] Hayward. Note: Battle is used adjectively or as the first part of a self- explaining compound; as, battle brand, a \"brand\" or sword used in battle; battle cry; battlefield; battle ground; battlearray; battle song. Battle piece, a painting, or a musical composition, representing a battle. -- Battle royal. (a) A fight between several gamecocks, where the one that stands longest is the victor. Grose. (b) A contest with fists or cudgels in which more than two are engaged; a mêlée. Thackeray. -- Drawn battle, one in which neither party gains the victory. -- To give battle, to attack an enemy. -- To join battle, to meet the attack; to engage in battle. -- Pitched battle, one in which the armies are previously drawn up in form, with a regular disposition of the forces. -- Wager of battle. See under Wager, n. Syn. -- Conflict; encounter; contest; action. Battle, Combat, Fight, Engagement. These words agree in denoting a close encounter between contending parties. Fight is a word of less dignity than the others. Except in poetry, it is more naturally applied to the encounter of a few individuals, and more commonly an accidental one; as, a street fight. A combat is a close encounter, whether between few or many, and is usually premeditated. A battle is commonly more general and prolonged. An engagement supposes large numbers on each side, engaged or intermingled in the conflict.\n\nTo join in battle; to contend in fight; as, to battle over theories. To meet in arms, and battle in the plain. Prior.\n\nTo assail in battle; to fight."}