{"word":"bay","definition":"Reddish brown; of the color of a chestnut; -- applied to the color of horses. Bay cat (Zoöl.), a wild cat of Africa and the East Indies (Felis aurata). -- Bay lynx (Zoöl.), the common American lynx (Felis, or Lynx, rufa).\n\n1. (Geol.)  An inlet of the sea, usually smaller than a gulf, but of the same general character. Note: The name is not used with much precision, and is often applied to large tracts of water, around which the land forms a curve; as, Hudson's Bay. The name is not restricted to tracts of water with a narrow entrance, but is used foe any recess or inlet between capes or headlands; as, the Bay of Biscay. 2. A small body of water set off from the main body; as a compartment containing water for a wheel; the portion of a canal just outside of the gates of a lock, etc. 3. A recess or indentation shaped like a bay. 4. A principal compartment of the walls, roof, or other part of a building, or of the whole building, as marked off by the buttresses, vaulting, mullions of a window, etc.; one of the main divisions of any structure, as the part of a bridge between two piers. 5. A compartment in a barn, for depositing hay, or grain in the stalks. 6. A kind of mahogany obtained from Campeachy Bay. Sick bay, in vessels of war, that part of a deck appropriated to the use of the sick. Totten.\n\n1. A berry, particularly of the laurel. [Obs.] 2. The laurel tree (Laurus nobilis). Hence, in the plural, an honorary garland or crown bestowed as a prize for victory or excellence, anciently made or consisting of branches of the laurel. The patriot's honors and the poet's bays. Trumbull. 3. A tract covered with bay trees. [Local, U. S.] Bay leaf, the leaf of the bay tree (Laurus nobilis). It has a fragrant odor and an aromatic taste.\n\nTo bark, as a dog with a deep voice does, at his game. The hounds at nearer distance hoarsely bayed. Dryden.\n\nTo bark at; hence, to follow with barking; to bring or drive to bay; as, to bay the bear. Shak.\n\n1. Deep-toned, prolonged barking. \"The bay of curs.\" Cowper. 2. Etym: [OE. bay, abay, OF. abai, F. aboi barking, pl. abois, prop. the extremity to which the stag is reduced when surrounded by the dogs, barking (aboyant); aux abois at bay.]  A state of being obliged to face an antagonist or a difficulty, when escape has become impossible. Embolden'd by despair, he stood at bay. Dryden. The most terrible evils are just kept at bay by incessant efforts. I. Taylor\n\nTo bathe. [Obs.] Spenser.\n\nA bank or dam to keep back water.\n\nTo dam, as water; -- with up or back."}