{"word":"bear","definition":"1. To support or sustain; to hold up. 2. To support and remove or carry; to convey. I 'll bear your logs the while. Shak. 3. To conduct; to bring; -- said of persons. [Obs.] Bear them to my house. Shak. 4. To possess and use, as power; to exercise. Every man should bear rule in his own house. Esther i. 22. 5. To sustain; to have on (written or inscribed, or as a mark), as, the tablet bears this inscription. 6. To possess or carry, as a mark of authority or distinction; to wear; as, to bear a sword, badge, or name. 7. To possess mentally; to carry or hold in the mind; to entertain; to harbor Dryden. The ancient grudge I bear him. Shak. 8. To endure; to tolerate; to undergo; to suffer. Should such a man, too fond to rule alone, Bear, like the Turk, no brother near the throne. Pope. I cannot bear The murmur of this lake to hear. Shelley. My punishment is greater than I can bear. Gen. iv. 13. 9. To gain or win. [Obs.] Some think to bear it by speaking a great word. Bacon. She was . . . found not guilty, through bearing of friends and bribing of the judge. Latimer. 10. To sustain, or be answerable for, as blame, expense, responsibility, etc. He shall bear their iniquities. Is. liii. 11. Somewhat that will bear your charges. Dryden. 11. To render or give; to bring forward. \"Your testimony bear\" Dryden. 12. To carry on, or maintain; to have. \"The credit of bearing a part in the conversation.\" Locke. 13. To admit or be capable of; that is, to suffer or sustain without violence, injury, or change. In all criminal cases the most favorable interpretation should be put on words that they can possibly bear. Swift. 14. To manage, wield, or direct. \"Thus must thou thy body bear.\" Shak. Hence: To behave; to conduct. Hath he borne himself penitently in prison Shak. 15. To afford; to be to ; to supply with. bear him company. Pope. 16. To bring forth or produce; to yield; as, to bear apples; to bear children; to bear interest. Here dwelt the man divine whom Samos bore. Dryden. Note: In the passive form of this verb, the best modern usage restricts the past participle born to the sense of brought forth, while borne is used in the other senses of the word. In the active form, borne alone is used as the past participle. To bear down. (a) To force into a lower place; to carry down; to depress or sink. \"His nose, . . . large as were the others, bore them down into insignificance.\" Marryat. (b) To overthrow or crush by force; as, to bear down an enemy. -- To bear a hand. (a) To help; to give assistance. (b) (Naut.) To make haste; to be quick. -- To bear in hand, to keep (one) up in expectation, usually by promises never to be realized; to amuse by false pretenses; to delude. [Obs.] \"How you were borne in hand, how crossed.\" Shak. -- To bear in mind, to remember. -- To bear off. (a) To restrain; to keep from approach. (b) (Naut.) To remove to a distance; to keep clear from rubbing against anything; as, to bear off a blow; to bear off a boat. (c) To gain; to carry off, as a prize. -- To bear one hard, to owe one a grudge. [Obs.] \"Cæsar doth bear me hard.\" Shak. -- To bear out. (a) To maintain and support to the end; to defend to the last. \"Company only can bear a man out in an ill thing.\" South. (b) To corroborate; to confirm. -- To bear up, to support; to keep from falling or sinking. \"Religious hope bears up the mind under sufferings.\" Addison. Syn. -- To uphold; sustain; maintain; support; undergo; suffer; endure; tolerate; carry; convey; transport; waft.\n\n1. To produce, as fruit; to be fruitful, in opposition to barrenness. This age to blossom, and the next to bear. Dryden. 2. To suffer, as in carrying a burden. But man is born to bear. Pope. 3. To endure with patience; to be patient. I can not, can not bear. Dryden. 4. To press; -- with on or upon, or against. These men bear hard on the suspected party. Addison. 5. To take effect; to have influence or force; as, to bring matters to bear. 6. To relate or refer; -- with on or upon; as, how does this bear on the question 7. To have a certain meaning, intent, or effect. Her sentence bore that she should stand a certain time upon the platform. Hawthorne. 8. To be situated, as to the point of compass, with respect to something else; as, the land bears N. by E. To bear against, to approach for attack or seizure; as, a lion bears against his prey. [Obs.] -- To bear away (Naut.), to change the course of a ship, and make her run before the wind. -- To bear back, to retreat. \"Bearing back from the blows of their sable antagonist.\" Sir W. Scott. -- To bear down upon (Naut.), to approach from the windward side; as, the fleet bore down upon the enemy. -- To bear in with (Naut.), to run or tend toward; as, a ship bears in with the land. -- To bear off (Naut.), to steer away, as from land. -- To bear up. (a) To be supported; to have fortitude; to be firm; not to sink; as, to bear up under afflictions. (b) (Naut.) To put the helm up (or to windward) and so put the ship before the wind; to bear away. Hamersly. -- To bear upon (Mil.), to be pointed or situated so as to affect; to be pointed directly against, or so as to hit (the object); as, to bring or plant guns so as to bear upon a fort or a ship; the artillery bore upon the center. -- To bear up to, to tend or move toward; as, to bear up to one another. -- To bear with, to endure; to be indulgent to; to forbear to resent, oppose, or punish.\n\nA bier. [Obs.] Spenser.\n\n1. (Zoöl.)  Any species of the genus Ursus, and of the closely allied genera. Bears are plantigrade Carnivora, but they live largely on fruit and insects. Note: The European brown bear (U. arctos), the white polar bear (U. maritimus), the grizzly bear (U. horribilis), the American black bear, and its variety the cinnamon bear (U. Americanus), the Syrian bear (Ursus Syriacus), and the sloth bear, are among the notable species. 2. (Zoöl.)  An animal which has some resemblance to a bear in form or habits, but no real affinity; as, the woolly bear; ant bear; water bear; sea bear. 3. (Astron.)  One of two constellations in the northern hemisphere, called respectively the Great Bear and the Lesser Bear, or Ursa Major and Ursa Minor. 4. Metaphorically: A brutal, coarse, or morose person. 5. (Stock Exchange)  A person who sells stocks or securities for future delivery in expectation of a fall in the market. Note: The bears and bulls of the Stock Exchange, whose interest it is, the one to depress, and the other to raise, stocks, are said to be so called in allusion to the bear's habit of pulling down, and the bull's of tossing up. 6. (Mach.)  A portable punching machine. 7. (Naut.)  A block covered with coarse matting; -- used to scour the deck. Australian bear. (Zoöl.) See Koala. -- Bear baiting, the sport of baiting bears with dogs. -- Bear caterpillar (Zoöl.), the hairy larva of a moth, esp. of the genus Euprepia. -- Bear garden. (a) A place where bears are kept for diversion or fighting. (b) Any place where riotous conduct is common or permitted. M. Arnold. -- Bear leader, one who leads about a performing bear for money; hence, a facetious term for one who takes charge of a young man on his travels.\n\nTo endeavor to depress the price of, or prices in; as, to bear a railroad stock; to bear the market.\n\nBarley; the six-rowed barley or the four-rowed barley, commonly the former (Hord. vulgare). [Obs. except in North of Eng. and Scot.]"}