{"word":"bearing","definition":"1. The manner in which one bears or conducts one's self; mien; behavior; carriage. I know him by his bearing. Shak. 2. Patient endurance; suffering without complaint. 3. The situation of one object, with respect to another, such situation being supposed to have a connection with the object, or influence upon it, or to be influenced by it; hence, relation; connection. But of this frame, the bearings and the ties, The strong connections, nice dependencies. Pope. 4. Purport; meaning; intended significance; aspect. 5. The act, power, or time of producing or giving birth; as, a tree in full bearing; a tree past bearing. [His mother] in travail of his bearing. R. of Gloucester. 6. (Arch.) (a) That part of any member of a building which rests upon its supports; as, a lintel or beam may have four inches of bearing upon the wall. (b) The portion of a support on which anything rests. (c) Improperly, the unsupported span; as, the beam has twenty feet of bearing between its supports. 7. (Mach.) (a) The part of an axle or shaft in contact with its support, collar, or boxing; the journal. (b) The part of the support on which a journal rests and rotates. 8. (Her.)  Any single emblem or charge in an escutcheon or coat of arms -- commonly in the pl. A carriage covered with armorial bearings. Thackeray. 9. (Naut.) (a) The situation of a distant object, with regard to a ship's position, as on the bow, on the lee quarter, etc.; the direction or point of the compass in which an object is seen; as, the bearing of the cape was W. N. W. (b) pl.  The widest part of a vessel below the plank-sheer. (c) pl.  The line of flotation of a vessel when properly trimmed with cargo or ballast. Ball bearings. See under Ball. -- To bring one to his bearings, to bring one to his senses. -- To lose one's bearings, to become bewildered. -- To take bearings, to ascertain by the compass the position of an object; to ascertain the relation of one object or place to another; to ascertain one's position by reference to landmarks or to the compass; hence (Fig.), to ascertain the condition of things when one is in trouble or perplexity. Syn. -- Deportment; gesture; mien; behavior; manner; carriage; demeanor; port; conduct; direction; relation; tendency; influence."}