{"word":"bed","definition":"1. An article of furniture to sleep or take rest in or on; a couch. Specifically: A sack or mattress, filled with some soft material, in distinction from the bedstead on which it is placed (as, a feather bed), or this with the bedclothes added. In a general sense, any thing or place used for sleeping or reclining on or in, as a quantity of hay, straw, leaves, or twigs. And made for him [a horse] a leafy bed. Byron. I wash, wring, brew, bake, . . . make the beds. Shak. In bed he slept not for my urging it. Shak. 2. (Used as the symbol of matrimony) Marriage. George, the eldest son of his second bed. Clarendon. 3. A plat or level piece of ground in a garden, usually a little raised above the adjoining ground. \"Beds of hyacinth and roses.\" Milton. 4. A mass or heap of anything arranged like a bed; as, a bed of ashes or coals. 5. The bottom of a watercourse, or of any body of water; as, the bed of a river. So sinks the daystar in the ocean bed. Milton. 6. (Geol.)  A layer or seam, or a horizontal stratum between layers; as, a bed of coal, iron, etc. 7. (Gun.)  See Gun carriage, and Mortar bed. 8. (Masonry) (a) The horizontal surface of a building stone; as, the upper and lower beds. (b) A course of stone or brick in a wall. (c) The place or material in which a block or brick is laid. (d) The lower surface of a brick, slate, or tile. Knight. 9. (Mech.)  The foundation or the more solid and fixed part or framing of a machine; or a part on which something is laid or supported; as, the bed of an engine. 10. The superficial earthwork, or ballast, of a railroad. 11. (Printing)  The flat part of the press, on which the form is laid. Note: Bed is much used adjectively or in combination; as, bed key or bedkey; bed wrench or bedwrench; bedchamber; bedmaker, etc. Bed of justice (French Hist.), the throne (F. lit bed) occupied by the king when sitting in one of his parliaments (judicial courts); hence, a session of a refractory parliament, at which the king was present for the purpose of causing his decrees to be registered. -- To be brought to bed, to be delivered of a child; -- often followed by of; as, to be brought to bed of a son. -- To make a bed, to prepare a bed; to arrange or put in order a bed and its bedding. -- From bed and board (Law), a phrase applied to a separation by partial divorce of man and wife, without dissolving the bonds of matrimony. If such a divorce (now commonly called a judicial separation) be granted at the instance of the wife, she may have alimony.\n\n1. To place in a bed. [Obs.] Bacon. 2. To make partaker of one's bed; to cohabit with. I'll to the Tuscan wars, and never bed her. Shak. 3. To furnish with a bed or bedding. 4. To plant or arrange in beds; to set, or cover, as in a bed of soft earth; as, to bed the roots of a plant in mold. 5. To lay or put in any hollow place, or place of rest and security, surrounded or inclosed; to embed; to furnish with or place upon a bed or foundation; as, to bed a stone; it was bedded on a rock. Among all chains or clusters of mountains where large bodies of still water are bedded. Wordsworth. 6. (Masonry)  To dress or prepare the surface of stone) so as to serve as a bed. 7. To lay flat; to lay in order; to place in a horizontal or recumbent position. \"Bedded hair.\" Shak.\n\nTo go to bed; to cohabit. If he be married, and bed with his wife. Wiseman."}