{"word":"bell","definition":"1. A hollow metallic vessel, usually shaped somewhat like a cup with a flaring mouth, containing a clapper or tongue, and giving forth a ringing sound on being struck. Note: Bells have been made of various metals, but the best have always been, as now, of an alloy of copper and tin. The Liberty Bell, the famous bell of the Philadelphia State House, which rang when the Continental Congress declared the Independence of the United States, in 1776. It had been cast in 1753, and upon it were the words \"Proclaim liberty throughout all the land, to all the inhabitants thereof.\" 2. A hollow perforated sphere of metal containing a loose ball which causes it to sound when moved. 3. Anything in the form of a bell, as the cup or corol of a flower. \"In a cowslip's bell I lie.\" Shak. 4. (Arch.)  That part of the capital of a column included between the abacus and neck molding; also used for the naked core of nearly cylindrical shape, assumed to exist within the leafage of a capital. 5. pl. (Naut.)  The strikes of the bell which mark the time; or the time so designated. Note: On shipboard, time is marked by a bell, which is struck eight times at 4, 8, and 12 o'clock. Half an hour after it has struck \"eight bells\" it is struck once, and at every succeeding half hour the number of strokes is increased by one, till at the end of the four hours, which constitute a watch, it is struck eight times. To bear away the bell, to win the prize at a race where the prize was a bell; hence, to be superior in something. Fuller. -- To bear the bell, to be the first or leader; -- in allusion to the bellwether or a flock, or the leading animal of a team or drove, when wearing a bell. -- To curse by bell, book, and candle, a solemn form of excommunication used in the Roman Catholic church, the bell being tolled, the book of offices for the purpose being used, and three candles being extinguished with certain ceremonies. Nares. -- To lose the bell, to be worsted in a contest. \"In single fight he lost the bell.\" Fairfax. -- To shake the bells, to move, give notice, or alarm. Shak. Note: Bell is much used adjectively or in combinations; as, bell clapper; bell foundry; bell hanger; bell-mouthed; bell tower, etc., which, for the most part, are self-explaining. Bell arch (Arch.), an arch of unusual form, following the curve of an ogee. -- Bell cage, or Bell carriage (Arch.), a timber frame constructed to carry one or more large bells. -- Bell cot (Arch.), a small or subsidiary construction, frequently corbeled out from the walls of a structure, and used to contain and support one or more bells. -- Bell deck (Arch.), the floor of a belfry made to serve as a roof to the rooms below. -- Bell founder, one whose occupation it is to found or cast bells. -- Bell foundry, or Bell foundery, a place where bells are founded or cast. -- Bell gable (Arch.), a small gable-shaped construction, pierced with one or more openings, and used to contain bells. -- Bell glass. See Bell jar. -- Bell hanger, a man who hangs or puts up bells. -- Bell pull, a cord, handle, or knob, connecting with a bell or bell wire, and which will ring the bell when pulled. Aytoun. -- Bell punch, a kind of conductor's punch which rings a bell when used. -- Bell ringer, one who rings a bell or bells, esp. one whose business it is to ring a church bell or chime, or a set of musical bells for public entertainment. -- Bell roof (Arch.), a roof shaped according to the general lines of a bell. -- Bell rope, a rope by which a church or other bell is rung. -- Bell tent, a circular conical-topped tent. -- Bell trap, a kind of bell shaped stench trap.\n\nTo put a bell upon; as, to bell the cat. 2. To make bell-mouthed; as, to bell a tube.\n\nTo develop bells or corollas; to take the form of a bell; to blossom; as, hops bell.\n\nTo utter by bellowing. [Obs.]\n\nTo call or bellow, as the deer in rutting time; to make a bellowing sound; to roar. As loud as belleth wind in hell. Chaucer. The wild buck bells from ferny brake. Sir W. Scott."}