{"word":"bend","definition":"1. To strain or move out of a straight line; to crook by straining; to make crooked; to curve; to make ready for use by drawing into a curve; as, to bend a bow; to bend the knee. 2. To turn toward some certain point; to direct; to incline. \"Bend thine ear to supplication.\" Milton. Towards Coventry bend we our course. Shak. Bending her eyes . . . upon her parent. Sir W. Scott. 3. To apply closely or with interest; to direct. To bend his mind to any public business. Temple. But when to mischief mortals bend their will. Pope. 4. To cause to yield; to render submissive; to subdue. \"Except she bend her humor.\" Shak. 5. (Naut.)  To fasten, as one rope to another, or as a sail to its yard or stay; or as a cable to the ring of an anchor. Totten. To bend the brow, to knit the brow, as in deep thought or in anger; to scowl; to frown. Camden. Syn. -- To lean; stoop; deflect; bow; yield.\n\n1. To be moved or strained out of a straight line; to crook or be curving; to bow. The green earth's end Where the bowed welkin slow doth bend. Milton. 2. To jut over; to overhang. There is a cliff, whose high and bending head Looks fearfully in the confined deep. Shak. 3. To be inclined; to be directed. To whom our vows and wished bend. Milton. 4. To bow in prayer, or in token of submission. While each to his great Father bends. Coleridge.\n\n1. A turn or deflection from a straight line or from the proper direction or normal position; a curve; a crook; as, a slight bend of the body; a bend in a road. 2. Turn; purpose; inclination; ends. [Obs.] Farewell, poor swain; thou art not for my bend. Fletcher. 3. (Naut.)  A knot by which one rope is fastened to another or to an anchor, spar, or post. Totten. 4. (Leather Trade)  The best quality of sole leather; a butt. See Butt. 5. (Mining)  Hard, indurated clay; bind. Bends of a ship, the thickest and strongest planks in her sides, more generally called wales. They have the beams, knees, and foothooks bolted to them. Also, the frames or ribs that form the ship's body from the keel to the top of the sides; as, the midship bend.\n\n1. A band. [Obs.] Spenser. 2. Etym: [OF. bende, bande, F. bande. See Band.] (Her.)  One of the honorable ordinaries, containing a third or a fifth part of the field. It crosses the field diagonally from the dexter chief to the sinister base. Bend sinister (Her.), an honorable ordinary drawn from the sinister chief to the dexter base."}