{"word":"bent","definition":"imp. & p. p. of Bend.\n\n1. Changed by pressure so as to be no longer straight; crooked; as, a bent pin; a bent lever. 2. Strongly inclined toward something, so as to be resolved, determined, set, etc.; -- said of the mind, character, disposition, desires, etc., and used with on; as, to be bent on going to college; he is bent on mischief.\n\n1. The state of being curved, crooked, or inclined from a straight line; flexure; curvity; as, the bent of a bow. [Obs.] Wilkins. 2. A declivity or slope, as of a hill. [R.] Dryden. 3. A leaning or bias; proclivity; tendency of mind; inclination; disposition; purpose; aim. Shak. With a native bent did good pursue. Dryden. 4. Particular direction or tendency; flexion; course. Bents and turns of the matter. Locke. 5. (Carp.)  A transverse frame of a framed structure. 6. Tension; force of acting; energy; impetus. [Archaic] The full bent and stress of the soul. Norris. Syn. -- Predilection; turn. Bent, Bias, Inclination, Prepossession. These words agree in describing a permanent influence upon the mind which tends to decide its actions. Bent denotes a fixed tendency of the mind in a given direction. It is the widest of these terms, and applies to the will, the intellect, and the affections, taken conjointly; as, the whole bent of his character was toward evil practices. Bias is literally a weight fixed on one side of a ball used in bowling, and causing it to swerve from a straight course. Used figuratively, bias applies particularly to the judgment, and denotes something which acts with a permanent force on the character through that faculty; as, the bias of early education, early habits, etc. Inclination is an excited state of desire or appetency; as, a strong inclination to the study of the law. Prepossession is a mingled state of feeling and opinion in respect to some person or subject, which has laid hold of and occupied the mind previous to inquiry. The word is commonly used in a good sense, an unfavorable impression of this kind being denominated a prejudice. \"Strong minds will be strongly bent, and usually labor under a strong bias; but there is no mind so weak and powerless as not to have its inclinations, and none so guarded as to be without its prepossessions.\" Crabb.\n\n1. A reedlike grass; a stalk of stiff, coarse grass. His spear a bent, both stiff and strong. Drayton. 2. (Bot.)  A grass of the genus Agrostis, esp. Agrostis vulgaris, or redtop. The name is also used of many other grasses, esp. in America. 3. Any neglected field or broken ground; a common; a moor. [Obs.] Wright. Bowmen bickered upon the bent. Chevy Chase."}