{"word":"better","definition":"1. Having good qualities in a greater degree than another; as, a better man; a better physician; a better house; a better air. Could make the worse appear The better reason. Milton. 2. Preferable in regard to rank, value, use, fitness, acceptableness, safety, or in any other respect. To obey is better than sacrifice. 1 Sam. xv. 22. It is better to trust in the Lord than to put confidence in princes. Ps. cxviii. 9. 3. Greater in amount; larger; more. 4. Improved in health; less affected with disease; as, the patient is better. 5. More advanced; more perfect; as, upon better acquaintance; a better knowledge of the subject. All the better. See under All, adv. -- Better half, an expression used to designate one's wife. My dear, my better half (said he), I find I must now leave thee. Sir P. Sidney. -- To be better off, to be in a better condition. -- Had better. (See under Had). Note: The phrase had better, followed by an infinitive without to, is idiomatic. The earliest form of construction was \"were better\" with a dative; as, \"Him were better go beside.\" (Gower.) i. e., It would be better for him, etc. At length the nominative (I, he, they, etc.) supplanted the dative and had took the place of were. Thus we have the construction now used. By all that's holy, he had better starve Than but once think this place becomes thee not. Shak.\n\n1. Advantage, superiority, or victory; -- usually with of; as, to get the better of an enemy. 2. One who has a claim to precedence; a superior, as in merit, social standing, etc.; -- usually in the plural. Their betters would hardly be found. Hooker. For the better, in the way of improvement; so as to produce improvement. \"If I have altered him anywhere for the better.\" Dryden.\n\n1. In a superior or more excellent manner; with more skill and wisdom, courage, virtue, advantage, or success; as, Henry writes better than John; veterans fight better than recruits. I could have better spared a better man. Shak. 2. More correctly or thoroughly. The better to understand the extent of our knowledge. Locke. 3. In a higher or greater degree; more; as, to love one better than another. Never was monarch better feared, and loved. Shak. 4. More, in reference to value, distance, time, etc.; as, ten miles and better. [Colloq.] To think better of (any one), to have a more favorable opinion of any one. -- To think better of (an opinion, resolution, etc.), to reconsider and alter one's decision.\n\n1. To improve or ameliorate; to increase the good qualities of. Love betters what is best. Wordsworth. He thought to better his circumstances. Thackeray. 2. To improve the condition of, morally, physically, financially, socially, or otherwise. The constant effort of every man to better himself. Macaulay. 3. To surpass in excellence; to exceed; to excel. The works of nature do always aim at that which can not be bettered. Hooker. 4. To give advantage to; to support; to advance the interest of. [Obs.] Weapons more violent, when next we meet, May serve to better us and worse our foes. Milton. Syn. -- To improve; meliorate; ameliorate; mend; amend; correct; emend; reform; advance; promote.\n\nTo become better; to improve. Carlyle.\n\nOne who bets or lays a wager."}