{"word":"bind","definition":"1. To tie, or confine with a cord, band, ligature, chain, etc.; to fetter; to make fast; as, to bind grain in bundles; to bind a prisoner. 2. To confine, restrain, or hold by physical force or influence of any kind; as, attraction binds the planets to the sun; frost binds the earth, or the streams. He bindeth the floods from overflowing. Job xxviii. 11. Whom Satan hath bound, lo, these eighteen years. Luke xiii. 16. 3. To cover, as with a bandage; to bandage or dress; -- sometimes with up; as, to bind up a wound. 4. To make fast ( a thing) about or upon something, as by tying; to encircle with something; as, to bind a belt about one; to bind a compress upon a part. 5. To prevent or restrain from customary or natural action; as, certain drugs bind the bowels. 6. To protect or strengthen by a band or binding, as the edge of a carpet or garment. 7. To sew or fasten together, and inclose in a cover; as, to bind a book. 8. Fig.: To oblige, restrain, or hold, by authority, law, duty, promise, vow, affection, or other moral tie; as, to bind the conscience; to bind by kindness; bound by affection; commerce binds nations to each other. Who made our laws to bind us, not himself. Milton. 9. (Law) (a) To bring (any one) under definite legal obligations; esp. under the obligation of a bond or covenant. Abbott. (b) To place under legal obligation to serve; to indenture; as, to bind an apprentice; -- sometimes with out; as, bound out to service. To bind over, to put under bonds to do something, as to appear at court, to keep the peace, etc. -- To bind to, to contract; as, to bind one's self to a wife. -- To bind up in, to cause to be wholly engrossed with; to absorb in. Syn. -- To fetter; tie; fasten; restrain; restrict; oblige.\n\n1. To tie; to confine by any ligature. They that reap must sheaf and bind. Shak. 2. To contract; to grow hard or stiff; to cohere or stick together in a mass; as, clay binds by heat. Mortimer. 3. To be restrained from motion, or from customary or natural action, as by friction. 4. To exert a binding or restraining influence. Locke.\n\n1. That which binds or ties. 2. Any twining or climbing plant or stem, esp. a hop vine; a bine. 3. (Metal.)  Indurated clay, when much mixed with the oxide of iron. Kirwan. 4. (Mus.)  A ligature or tie for grouping notes."}