{"word":"black","definition":"1. Destitute of light, or incapable of reflecting it; of the color of soot or coal; of the darkest or a very dark color, the opposite of white; characterized by such a color; as, black cloth; black hair or eyes. O night, with hue so black! Shak. 2. In a less literal sense: Enveloped or shrouded in darkness; very dark or gloomy; as, a black night; the heavens black with clouds. I spy a black, suspicious, threatening cloud. Shak. 3. Fig.: Dismal, gloomy, or forbidding, like darkness; destitute of moral light or goodness; atrociously wicked; cruel; mournful; calamitous; horrible. \"This day's black fate.\" \"Black villainy.\" \"Arise, black vengeance.\" \"Black day.\" \"Black despair.\" Shak. 4. Expressing menace, or discontent; threatening; sullen; foreboding; as, to regard one with black looks. Note: Black is often used in self-explaining compound words; as, black-eyed, black-faced, black-haired, black-visaged. Black act, the English statute 9 George I, which makes it a felony to appear armed in any park or warren, etc., or to hunt or steal deer, etc., with the face blackened or disguised. Subsequent acts inflicting heavy penalties for malicious injuries to cattle and machinery have been called black acts. -- Black angel (Zoöl.), a fish of the West Indies and Florida (Holacanthus tricolor), with the head and tail yellow, and the middle of the body black. -- Black antimony (Chem.), the black sulphide of antimony, Sb2S3, used in pyrotechnics, etc. -- Black bear (Zoöl.), the common American bear (Ursus Americanus). -- Black beast. See Bête noire. -- Black beetle (Zoöl.), the common large cockroach (Blatta orientalis). -- Black and blue, the dark color of a bruise in the flesh, which is accompanied with a mixture of blue. \"To pinch the slatterns black and blue.\" Hudibras. -- Black bonnet (Zoöl.), the black-headed bunting (Embriza Schoeniclus) of Europe. -- Black canker, a disease in turnips and other crops, produced by a species of caterpillar. -- Black cat (Zoöl.), the fisher, a quadruped of North America allied to the sable, but larger. See Fisher. -- Black cattle, any bovine cattle reared for slaughter, in distinction from dairy cattle. [Eng.] -- Black cherry. See under Cherry. -- Black cockatoo (Zoöl.), the palm cockatoo. See Cockatoo. -- Black copper. Same as Melaconite. -- Black currant. (Bot.) See Currant. -- Black diamond. (Min.) See Carbonado. -- Black draught (Med.), a cathartic medicine, composed of senna and magnesia. -- Black drop (Med.), vinegar of opium; a narcotic preparation consisting essentially of a solution of opium in vinegar. -- Black earth, mold; earth of a dark color. Woodward. -- Black flag, the flag of a pirate, often bearing in white a skull and crossbones; a signal of defiance. -- Black flea (Zoöl.), a flea beetle (Haltica nemorum) injurious to turnips. -- Black flux, a mixture of carbonate of potash and charcoal, obtained by deflagrating tartar with half its weight of niter. Brande & C. -- Black fly. (Zoöl.) (a) In the United States, a small, venomous, two-winged fly of the genus Simulium of several species, exceedingly abundant and troublesome in the northern forests. The larvæ are aquatic. (b) A black plant louse, as the bean aphis (A. fabæ). -- Black Forest Etym: [a translation of G. Schwarzwald], a forest in Baden and Würtemburg, in Germany; a part of the ancient Hercynian forest. -- Black game, or Black grouse. (Zoöl.) See Blackcock, Grouse, and Heath grouse. -- Black grass (Bot.), a grasslike rush of the species Juncus Gerardi, growing on salt marshes, and making good hay. -- Black gum (Bot.), an American tree, the tupelo or pepperidge. See Tupelo. -- Black Hamburg (grape) (Bot.), a sweet and juicy variety of dark purple or \"black\" grape. -- Black horse (Zoöl.), a fish of the Mississippi valley (Cycleptus elongatus), of the sucker family; the Missouri sucker. -- Black lemur (Zoöl.), the Lemurniger of Madagascar; the acoumbo of the natives. -- Black list, a list of persons who are for some reason thought deserving of censure or punishment; -- esp. a list of persons stigmatized as insolvent or untrustworthy, made for the protection of tradesmen or employers. See Blacklist, v. t. -- Black manganese (Chem.), the black oxide of manganese, MnO2. -- Black Maria, the close wagon in which prisoners are carried to or from jail. -- Black martin (Zoöl.), the chimney swift. See Swift. -- Black moss (Bot.), the common so-called long moss of the southern United States. See Tillandsia. -- Black oak. See under Oak. -- Black ocher. See Wad. -- Black pigment, a very fine, light carbonaceous substance, or lampblack, prepared chiefly for the manufacture of printers' ink. It is obtained by burning common coal tar. -- Black plate, sheet iron before it is tinned. Knight. -- Black quarter, malignant anthrax with engorgement of a shoulder or quarter, etc., as of an ox. -- Black rat (Zoöl.), one of the species of rats (Mus rattus), commonly infesting houses. -- Black rent. See Blackmail, n., 3. -- Black rust, a disease of wheat, in which a black, moist matter is deposited in the fissures of the grain. -- Black sheep, one in a family or company who is unlike the rest, and makes trouble. -- Black silver. (Min.) See under Silver. -- Black and tan, black mixed or spotted with tan color or reddish brown; -- used in describing certain breeds of dogs. -- Black tea. See under Tea. -- Black tin (Mining), tin ore (cassiterite), when dressed, stamped and washed, ready for smelting. It is in the form of a black powder, like fine sand. Knight. -- Black walnut. See under Walnut. -- Black warrior (Zoöl.), an American hawk (Buteo Harlani). Syn. -- Dark; murky; pitchy; inky; somber; dusky; gloomy; swart; Cimmerian; ebon; atrocious.\n\nSullenly; threateningly; maliciously; so as to produce blackness.\n\n1. That which is destitute of light or whiteness; the darkest color, or rather a destitution of all color; as, a cloth has a good black. Black is the badge of hell, The hue of dungeons, and the suit of night. Shak. 2. A black pigment or dye. 3. A negro; a person whose skin is of a black color, or shaded with black; esp. a member or descendant of certain African races. 4. A black garment or dress; as, she wears black; pl. (Obs.)  Mourning garments of a black color; funereal drapery. Friends weeping, and blacks, and obsequies, and the like show death terrible. Bacon. That was the full time they used to wear blacks for the death of their fathers. Sir T. North. 5. The part of a thing which is distinguished from the rest by being black. The black or sight of the eye. Sir K. Digby. 6. A stain; a spot; a smooch. Defiling her white lawn of chastity with ugly blacks of lust. Rowley. Black and white, writing or print; as, I must have that statement in black and white. -- Blue black, a pigment of a blue black color. -- Ivory black, a fine kind of animal charcoal prepared by calcining ivory or bones. When ground it is the chief ingredient of the ink used in copperplate printing. -- Berlin black. See under Berlin.\n\n1. To make black; to blacken; to soil; to sully. They have their teeth blacked, both men and women, for they say a dog hath his teeth white, therefore they will black theirs. Hakluyt. Sins which black thy soul. J. Fletcher. 2. To make black and shining, as boots or a stove, by applying blacking and then polishing with a brush."}