{"word":"blaze","definition":"1. A stream of gas or vapor emitting light and heat in the process of combustion; a bright flame. \"To heaven the blaze uprolled.\" Croly. 2. Intense, direct light accompanied with heat; as, to seek shelter from the blaze of the sun. O dark, dark, dark, amid the blaze of noon! Milton. 3. A bursting out, or active display of any quality; an outburst; a brilliant display. \"Fierce blaze of riot.\" \"His blaze of wrath.\" Shak. For what is glory but the blaze of fame Milton. 4. [Cf. D. bles; akin to E. blaze light.]  A white spot on the forehead of a horse. 5. A spot made on trees by chipping off a piece of the bark, usually as a surveyor's mark. Three blazes in a perpendicular line on the same tree indicating a legislative road, the single blaze a settlement or neighborhood road. Carlton. In a blaze, on fire; burning with a flame; filled with, giving, or reflecting light; excited or exasperated. -- Like blazes, furiously; rapidly. [Low] \"The horses did along like blazes tear.\" Poem in Essex dialect. Note: In low language in the U. S., blazes is frequently used of something extreme or excessive, especially of something very bad; as, blue as blazes. Neal. Syn. -- Blaze, Flame. A blaze and a flame are both produced by burning gas. In blaze the idea of light rapidly evolved is prominent, with or without heat; as, the blaze of the sun or of a meteor. Flame includes a stronger notion of heat; as, he perished in the flames.\n\n1. To shine with flame; to glow with flame; as, the fire blazes. 2. To send forth or reflect glowing or brilliant light; to show a blaze. And far and wide the icy summit blazed. Wordsworth. 3. To be resplendent. Macaulay. To blaze away, to discharge a firearm, or to continue firing; -- said esp. of a number of persons, as a line of soldiers. Also used (fig.) of speech or action. [Colloq.]\n\n1. To mark (a tree) by chipping off a piece of the bark. I found my way by the blazed trees. Hoffman. 2. To designate by blazing; to mark out, as by blazed trees; as, to blaze a line or path. Champollion died in 1832, having done little more than blaze out the road to be traveled by others. Nott.\n\n1. To make public far and wide; to make known; to render conspicuous. On charitable lists he blazed his name. Pollok. To blaze those virtues which the good would hide. Pope. 2. (Her.)  To blazon. [Obs.] Peacham."}