{"word":"block","definition":"1. A piece of wood more or less bulky; a solid mass of wood, stone, etc., usually with one or more plane, or approximately plane, faces; as, a block on which a butcher chops his meat; a block by which to mount a horse; children's playing blocks, etc. Now all our neighbors' chimneys smoke, And Christmas blocks are burning. Wither. All her labor was but as a block Left in the quarry. Tennyson. 2. The solid piece of wood on which condemned persons lay their necks when they are beheaded. Noble heads which have been brought to the block. E. Everett. 3. The wooden mold on which hats, bonnets, etc., are shaped. Hence: The pattern on shape of a hat. He wears his faith but as the fashion of his hat; it ever changes with the next block. Shak. 4. A large or long building divided into separate houses or shops, or a number of houses or shops built in contact with each other so as to form one building; a row of houses or shops. 5. A square, or portion of a city inclosed by streets, whether occupied by buildings or not. The new city was laid out in rectangular blocks, each block containing thirty building lots. Such an average block, comprising 282 houses and covering nine acres of ground, exists in Oxford Street. Lond. Quart. Rev. 6. A grooved pulley or sheave incased in a frame or shell which is provided with a hook, eye, or strap, by which it may be attached to an object. It is used to change the direction of motion, as in raising a heavy object that can not be conveniently reached, and also, when two or more such sheaves are compounded, to change the rate of motion, or to exert increased force; -- used especially in the rigging of ships, and in tackles. 7. (Falconry)  The perch on which a bird of prey is kept. 8. Any obstruction, or cause of obstruction; a stop; a hindrance; an obstacle; as, a block in the way. 9. A piece of box or other wood for engravers' work. 10. (Print.)  A piece of hard wood (as mahogany or cherry) on which a stereotype or electrotype plate is mounted to make it type high. 11. A blockhead; a stupid fellow; a dolt. [Obs.] What a block art thou ! Shak. 12. A section of a railroad where the block system is used. See Block system, below. A block of shares (Stock Exchange), a large number of shares in a stock company, sold in a lump. Bartlett. -- Block printing. (a) A mode of printing (common in China and Japan) from engraved boards by means of a sheet of paper laid on the linked surface and rubbed with a brush. S. W. Williams. (b) A method of printing cotton cloth and paper hangings with colors, by pressing them upon an engraved surface coated with coloring matter. -- Block system on railways, a system by which the track is divided into sections of three or four miles, and trains are so run by the guidance of electric signals that no train enters a section or block before the preceding train has left it.\n\n1. To obstruct so as to prevent passage or progress; to prevent passage from, through, or into, by obstructing the way; -- used both of persons and things; -- often followed by up; as, to block up a road or harbor. With moles . . . would block the port. Rowe. A city . . . besieged and blocked about. Milton. 2. To secure or support by means of blocks; to secure, as two boards at their angles of intersection, by pieces of wood glued to each. 3. To shape on, or stamp with, a block; as, to block a hat. To block out, to begin to reduce to shape; to mark out roughly; to lay out; as, to block out a plan."}