{"word":"blow","definition":"To flower; to blossom; to bloom. How blows the citron grove. Milton.\n\nTo cause to blossom; to put forth (blossoms or flowers). The odorous banks, that blow Flowers of more mingled hue. Milton.\n\nA blossom; a flower; also, a state of blossoming; a mass of blossoms. \"Such a blow of tulips.\" Tatler.\n\n1. A forcible stroke with the hand, fist, or some instrument, as a rod, a club, an ax, or a sword. Well struck ! there was blow for blow. Shak. 2. A sudden or forcible act or effort; an assault. A vigorous blow might win [Hanno's camp]. T. Arnold. 3. The infliction of evil; a sudden calamity; something which produces mental, physical, or financial suffering or loss (esp. when sudden); a buffet. A most poor man, made tame to fortune's blows. Shak. At a blow, suddenly; at one effort; by a single vigorous act. \"They lose a province at a blow.\" Dryden. -- To come to blows, to engage in combat; to fight; -- said of individuals, armies, and nations. Syn. -- Stroke; knock; shock; misfortune.\n\n1. To produce a current of air; to move, as air, esp. to move rapidly or with power; as, the wind blows. Hark how it rains and blows ! Walton. 2. To send forth a forcible current of air, as from the mouth or from a pair of bellows. 3. To breathe hard or quick; to pant; to puff. Here is Mistress Page at the door, sweating and blowing. Shak. 4. To sound on being blown into, as a trumpet. There let the pealing organ blow. Milton. 5. To spout water, etc., from the blowholes, as a whale. 6. To be carried or moved by the wind; as, the dust blows in from the street. The grass blows from their graves to thy own. M. Arnold. 7. To talk loudly; to boast; to storm. [Colloq.] You blow behind my back, but dare not say anything to my face. Bartlett. To blow hot and cold Etym: (a saying derived from a fable of , to favor a thing at one time and treat it coldly at another; or to appear both to favor and to oppose. -- To blow off, to let steam escape through a passage provided for the purpose; as, the engine or steamer is blowing off. -- To blow out. (a) To be driven out by the expansive force of a gas or vapor; as, a steam cock or valve sometimes blows out. (b) To talk violently or abusively. [Low] -- To blow over, to pass away without effect; to cease, or be dissipated; as, the storm and the clouds have blown over. -- To blow up, to be torn to pieces and thrown into the air as by an explosion of powder or gas or the expansive force of steam; to burst; to explode; as, a powder mill or steam boiler blows up. \"The enemy's magazines blew up.\" Tatler.\n\n1. To force a current of air upon with the mouth, or by other means; as, to blow the fire. 2. To drive by a current air; to impel; as, the tempest blew the ship ashore. Off at sea northeast winds blow Sabean odors from the spicy shore. Milton. 3. To cause air to pass through by the action of the mouth, or otherwise; to cause to sound, as a wind instrument; as, to blow a trumpet; to blow an organ. Hath she no husband That will take pains to blow a horn before her Shak. Boy, blow the pipe until the bubble rise, Then cast it off to float upon the skies. Parnell. 4. To clear of contents by forcing air through; as, to blow an egg; to blow one's nose. 5. To burst, shatter, or destroy by an explosion; -- usually with up, down, open, or similar adverb; as, to blow up a building. 6. To spread by report; to publish; to disclose. Through the court his courtesy was blown. Dryden. His language does his knowledge blow. Whiting. 7. To form by inflation; to swell by injecting air; as, to blow bubbles; to blow glass. 8. To inflate, as with pride; to puff up. Look how imagination blows him. Shak. 9. To put out of breath; to cause to blow from fatigue; as, to blow a horse. Sir W. Scott. 10. To deposit eggs or larvæ upon, or in (meat, etc.). To suffer The flesh fly blow my mouth. Shak. To blow great guns, to blow furiously and with roaring blasts; -- said of the wind at sea or along the coast. -- To blow off, to empty (a boiler) of water through the blow-off pipe, while under steam pressure; also, to eject (steam, water, sediment, etc.) from a boiler. -- To blow one's own trumpet, to vaunt one's own exploits, or sound one's own praises. -- To blow out, to extinguish by a current of air, as a candle. -- To blow up. (a) To fill with air; to swell; as, to blow up a bladder or bubble. (b) To inflate, as with pride, self-conceit, etc.; to puff up; as, to blow one up with flattery. \"Blown up with high conceits engendering pride.\" Milton. (c) To excite; as, to blow up a contention.(d) To burst, to raise into the air, or to scatter, by an explosion; as, to blow up a fort. (e) To scold violently; as, to blow up a person for some offense. [Colloq.] I have blown him up well -- nobody can say I wink at what he does. G. Eliot. To blow upon. (a) To blast; to taint; to bring into discredit; to render stale, unsavory, or worthless. (b) To inform against. [Colloq.] How far the very custom of hearing anything spouted withers and blows upon a fine passage, may be seen in those speeches from [Shakespeare's] Henry V. which are current in the mouths of schoolboys. C. Lamb. A lady's maid whose character had been blown upon. Macaulay.\n\n1. A blowing, esp., a violent blowing of the wind; a gale; as, a heavy blow came on, and the ship put back to port. 2. The act of forcing air from the mouth, or through or from some instrument; as, to give a hard blow on a whistle or horn; to give the fire a blow with the bellows. 3. The spouting of a whale. 4. (Metal.)  A single heat or operation of the Bessemer converter. Raymond. 5. An egg, or a larva, deposited by a fly on or in flesh, or the act of depositing it. Chapman."}