{"word":"blue","definition":"1. Having the color of the clear sky, or a hue resembling it, whether lighter or darker; as, the deep, blue sea; as blue as a sapphire; blue violets. \"The blue firmament.\" Milton. 2. Pale, without redness or glare, -- said of a flame; hence, of the color of burning brimstone, betokening the presence of ghosts or devils; as, the candle burns blue; the air was blue with oaths. 3. Low in spirits; melancholy; as, to feel blue. 4. Suited to produce low spirits; gloomy in prospect; as, thongs looked blue. [Colloq.] 5. Severe or over strict in morals; gloom; as, blue and sour religionists; suiting one who is over strict in morals; inculcating an impracticable, severe, or gloomy mortality; as, blue laws. 6. Literary; -- applied to women; -- an abbreviation of bluestocking. [Colloq.] The ladies were very blue and well informed. Thackeray. Blue asbestus. See Crocidolite. -- Blue black, of, or having, a very dark blue color, almost black. -- Blue blood. See under Blood. -- Blue buck (Zoöl.), a small South African antelope (Cephalophus pygmæus); also applied to a larger species (Ægoceras leucophæus); the blaubok. -- Blue cod (Zoöl.), the buffalo cod. -- Blue crab (Zoöl.), the common edible crab of the Atlantic coast of the United States (Callinectes hastatus). -- Blue curls (Bot.), a common plant (Trichostema dichotomum), resembling pennyroyal, and hence called also bastard pennyroyal. -- Blue devils, apparitions supposed to be seen by persons suffering with delirium tremens; hence, very low spirits. \"Can Gumbo shut the hall door upon blue devils, or lay them all in a red sea of claret\" Thackeray. -- Blue gage. See under Gage, a plum. -- Blue gum, an Australian myrtaceous tree (Eucalyptus globulus), of the loftiest proportions, now cultivated in tropical and warm temperate regions for its timber, and as a protection against malaria. The essential oil is beginning to be used in medicine. The timber is very useful. See Eucalyptus. -- Blue jack, Blue stone, blue vitriol; sulphate of copper. -- Blue jacket, a man-of war's man; a sailor wearing a naval uniform. -- Blue jaundice. See under Jaundice. -- Blue laws, a name first used in the eighteenth century to describe certain supposititious laws of extreme rigor reported to have been enacted in New Haven; hence, any puritanical laws. [U. S.] -- Blue light, a composition which burns with a brilliant blue flame; -- used in pyrotechnics and as a night signal at sea, and in military operations. -- Blue mantle (Her.), one of the four pursuivants of the English college of arms; -- so called from the color of his official robes. -- Blue mass, a preparation of mercury from which is formed the blue pill. McElrath. -- Blue mold, or mould, the blue fungus (Aspergillus glaucus) which grows on cheese. Brande & C. -- Blue Monday, a Monday following a Sunday of dissipation, or itself given to dissipation (as the Monday before Lent). -- Blue ointment (Med.), mercurial ointment. -- Blue Peter (British Marine), a blue flag with a white square in the center, used as a signal for sailing, to recall boats, etc. It is a corruption of blue repeater, one of the British signal flags. -- Blue pill. (Med.) (a) A pill of prepared mercury, used as an aperient, etc. (b) Blue mass. -- Blue ribbon. (a) The ribbon worn by members of the order of the Garter; -- hence, a member of that order. (b) Anything the attainment of which is an object of great ambition; a distinction; a prize. \"These [scholarships] were the blue ribbon of the college.\" Farrar. (c) The distinctive badge of certain temperance or total abstinence organizations, as of the Blue ribbon Army. -- Blue ruin, utter ruin; also, gin. [Eng. Slang] Carlyle. -- Blue spar (Min.), azure spar; lazulite. See Lazulite. -- Blue thrush (Zoöl.), a European and Asiatic thrush (Petrocossyphus cyaneas). -- Blue verditer. See Verditer. -- Blue vitriol (Chem.), sulphate of copper, a violet blue crystallized salt, used in electric batteries, calico printing, etc. -- Blue water, the open ocean. -- To look blue, to look disheartened or dejected. -- True blue, genuine and thorough; not modified, nor mixed; not spurious; specifically, of uncompromising Presbyterianism, blue being the color adopted by the Covenanters. For his religion . . . 'T was Presbyterian, true blue. Hudibras.\n\n1. One of the seven colors into which the rays of light divide themselves, when refracted through a glass prism; the color of the clear sky, or a color resembling that, whether lighter or darker; a pigment having such color. Sometimes, poetically, the sky. 2. A pedantic woman; a bluestocking. [Colloq.] 3. pl. Etym: [Short for blue devils.]  Low spirits; a fit of despondency; melancholy. [Colloq.] Berlin blue, Prussian blue. -- Mineral blue. See under Mineral. -- Prussian blue. See under Prussian.\n\nTo make blue; to dye of a blue color; to make blue by heating, as metals, etc."}