{"word":"board","definition":"1. A piece of timber sawed thin, and of considerable length and breadth as compared with the thickness, -- used for building, etc. Note: When sawed thick, as over one and a half or two inches, it is usually called a plank. 2. A table to put food upon. Note: The term board answers to the modern table, but it was often movable, and placed on trestles. Halliwell. Fruit of all kinds . . . She gathers, tribute large, and on the board Heaps with unsparing hand. Milton. 3. Hence: What is served on a table as food; stated meals; provision; entertainment; -- usually as furnished for pay; as, to work for one's board; the price of board. 4. A table at which a council or court is held. Hence: A council, convened for business, or any authorized assembly or meeting, public or private; a number of persons appointed or elected to sit in council for the management or direction of some public or private business or trust; as, the Board of Admiralty; a board of trade; a board of directors, trustees, commissioners, etc. Both better acquainted with affairs than any other who sat then at that board. Clarendon. We may judge from their letters to the board. Porteus. 5. A square or oblong piece of thin wood or other material used for some special purpose, as, a molding board; a board or surface painted or arranged for a game; as, a chessboard; a backgammon board. 6. Paper made thick and stiff like a board, for book covers, etc.; pasteboard; as, to bind a book in boards. 7. pl.  The stage in a theater; as, to go upon the boards, to enter upon the theatrical profession. 8. Etym: [In this use originally perh. a different word meaning border, margin; cf. D. boord, G. bord, shipboard, and G. borte trimming; also F. bord (fr. G.) the side of a ship. Cf. Border.]  The border or side of anything. (Naut.) (a) The side of a ship. \"Now board to board the rival vessels row.\" Dryden. See On board, below. (b) The stretch which a ship makes in one tack. Note: Board is much used adjectively or as the last part of a compound; as, fir board, clapboard, floor board, shipboard, sideboard, ironing board, chessboard, cardboard, pasteboard, seaboard; board measure. The American Board, a shortened form of \"The American Board of Commissioners for Foreign Missions\" (the foreign missionary society of the American Congregational churches). -- Bed and board. See under Bed. -- Board and board (Naut.), side by side. -- Board of control, six privy councilors formerly appointed to superintend the affairs of the British East Indies. Stormonth. -- Board rule, a figured scale for finding without calculation the number of square feet in a board. Haldeman. -- Board of trade, in England, a committee of the privy council appointed to superintend matters relating to trade. In the United States, a body of men appointed for the advancement and protection of their business interests; a chamber of commerce. -- Board wages. (a) Food and lodging supplied as compensation for services; as, to work hard, and get only board wages. (b) Money wages which are barely sufficient to buy food and lodging. (c) A separate or special allowance of wages for the procurement of food, or food and lodging. Dryden. -- By the board, over the board, or side. \"The mast went by the board.\" Totten. Hence (Fig.), To go by the board, to suffer complete destruction or overthrow. -- To enter on the boards, to have one's name inscribed on a board or tablet in a college as a student. [Cambridge, England.] \"Having been entered on the boards of Trinity college.\" Hallam. -- To make a good board (Naut.), to sail in a straight line when close-hauled; to lose little to leeward. -- To make short boards, to tack frequently. -- On board. (a) On shipboard; in a ship or a boat; on board of; as, I came on board early; to be on board ship. (b) In or into a railway car or train. [Colloq. U. S.] -- Returning board, a board empowered to canvass and make an official statement of the votes cast at an election. [U.S.]\n\n1. To cover with boards or boarding; as, to board a house. \"The boarded hovel.\" Cowper. 2. Etym: [Cf. Board to accost, and see Board, n.]  To go on board of, or enter, as a ship, whether in a hostile or a friendly way. You board an enemy to capture her, and a stranger to receive news or make a communication. Totten. 3. To enter, as a railway car. [Colloq. U. S.] 4. To furnish with regular meals, or with meals and lodgings, for compensation; to supply with daily meals. 5. To place at board, for compensation; as, to board one's horse at a livery stable.\n\nTo obtain meals, or meals and lodgings, statedly for compensation; as, he boards at the hotel. We are several of us, gentlemen and ladies, who board in the same house. Spectator.\n\nTo approach; to accost; to address; hence, to woo. [Obs.] I will board her, though she chide as loud As thunder when the clouds in autumn crack. Shak."}