{"word":"body","definition":"1. The material organized substance of an animal, whether living or dead, as distinguished from the spirit, or vital principle; the physical person. Absent in body, but present in spirit. 1 Cor. v. 3 For of the soul the body form doth take. For soul is form, and doth the body make. Spenser. 2. The trunk, or main part, of a person or animal, as distinguished from the limbs and head; the main, central, or principal part, as of a tree, army, country, etc. Who set the body and the limbs Of this great sport together Shak. The van of the king's army was led by the general; . . . in the body was the king and the prince. Clarendon. Rivers that run up into the body of Italy. Addison. 3. The real, as opposed to the symbolical; the substance, as opposed to the shadow. Which are a shadow of things to come; but the body is of Christ. Col. ii. 17. 4. A person; a human being; -- frequently in composition; as, anybody, nobody. A dry, shrewd kind of a body. W. Irving. 5. A number of individuals spoken of collectively, usually as united by some common tie, or as organized for some purpose; a collective whole or totality; a corporation; as, a legislative body; a clerical body. A numerous body led unresistingly to the slaughter. Prescott. 6. A number of things or particulars embodied in a system; a general collection; as, a great body of facts; a body of laws or of divinity. 7. Any mass or portion of matter; any substance distinct from others; as, a metallic body; a moving body; an aëriform body. \"A body of cold air.\" Huxley. By collision of two bodies, grind The air attrite to fire. Milton. 8. Amount; quantity; extent. 9. That part of a garment covering the body, as distinguished from the parts covering the limbs. 10. The bed or box of a vehicle, on or in which the load is placed; as, a wagon body; a cart body. 11. (Print.)  The shank of a type, or the depth of the shank (by which the size is indicated); as, a nonpareil face on an agate body. 12. (Geom.)  A figure that has length, breadth, and thickness; any solid figure. 13. Consistency; thickness; substance; strength; as, this color has body; wine of a good body. Note: Colors bear a body when they are capable of being ground so fine, and of being mixed so entirely with oil, as to seem only a very thick oil of the same color. After body (Naut.), the part of a ship abaft the dead flat. -- Body cavity (Anat.), the space between the walls of the body and the inclosed viscera; the cælum; -- in mammals, divided by the diaphragm into thoracic and abdominal cavities. -- Body of a church, the nave. -- Body cloth; pl. Body cloths, a cloth or blanket for covering horses. -- Body clothes. (pl.) 1. Clothing for the body; esp. underclothing. 2. Body cloths for horses. [Obs.] Addison. -- Body coat, a gentleman's dress coat. -- Body color (Paint.), a pigment that has consistency, thickness, or body, in distinction from a tint or wash. -- Body of a law (Law), the main and operative part. -- Body louse (Zoöl.), a species of louse (Pediculus vestimenti), which sometimes infests the human body and clothes. See Grayback. -- Body plan (Shipbuilding), an end elevation, showing the conbour of the sides of a ship at certain points of her length. -- Body politic, the collective body of a nation or state as politically organized, or as exercising political functions; also, a corporation. Wharton. As to the persons who compose the body politic or associate themselves, they take collectively the name of \"people\", or \"nation\". Bouvier. -- Body servant, a valet. -- The bodies seven (Alchemy), the metals corresponding to the planets. [Obs.] Sol gold is, and Luna silver we threpe (=call), Mars yren (=iron), Mercurie quicksilver we clepe, Saturnus lead, and Jupiter is tin, and Venus coper. Chaucer. -- Body snatcher, one who secretly removes without right or authority a dead body from a grave, vault, etc.; a resurrectionist. -- Body snatching (Law), the unauthorized removal of a dead body from the grave; usually for the purpose of dissection.\n\nTo furnish with, or as with, a body; to produce in definite shape; to embody. To body forth, to give from or shape to mentally. Imagination bodies forth The forms of things unknown. Shak."}