{"word":"boil","definition":"1. To be agitated, or tumultuously moved, as a liquid by the generation and rising of bubbles of steam (or vapor), or of currents produced by heating it to the boiling point; to be in a state of ebullition; as, the water boils. 2. To be agitated like boiling water, by any other cause than heat; to bubble; to effervesce; as, the boiling waves. He maketh the deep to boil like a pot. Job xii. 31. 3. To pass from a liquid to an aëriform state or vapor when heated; as, the water boils away. 4. To be moved or excited with passion; to be hot or fervid; as, his blood boils with anger. Then boiled my breast with flame and burning wrath. Surrey. 5. To be in boiling water, as in cooking; as, the potatoes are boiling. To boil away, to vaporize; to evaporate or be evaporated by the action of heat. -- To boil over, to run over the top of a vessel, as liquid when thrown into violent agitation by heat or other cause of effervescence; to be excited with ardor or passion so as to lose self-control.\n\n1. To heat to the boiling point, or so as to cause ebullition; as, to boil water. 2. To form, or separate, by boiling or evaporation; as, to boil sugar or salt. 3. To subject to the action of heat in a boiling liquid so as to produce some specific effect, as cooking, cleansing, etc.; as, to boil meat; to boil clothes. The stomach cook is for the hall, And boileth meate for them all. Gower. 4. To steep or soak in warm water. [Obs.] To try whether seeds be old or new, the sense can not inform; but if you boil them in water, the new seeds will sprout sooner. Bacon. To boil down, to reduce in bulk by boiling; as, to boil down sap or sirup.\n\nAct or state of boiling. [Colloq.]\n\nA hard, painful, inflamed tumor, which, on suppuration, discharges pus, mixed with blood, and discloses a small fibrous mass of dead tissue, called the core. A blind boil, one that suppurates imperfectly, or fails to come to a head. -- Delhi boil (Med.), a peculiar affection of the skin, probably parasitic in origin, prevailing in India (as among the British troops) and especially at Delhi."}