{"word":"bolt","definition":"1. A shaft or missile intended to be shot from a crossbow or catapult, esp. a short, stout, blunt-headed arrow; a quarrel; an arrow, or that which resembles an arrow; a dart. Look that the crossbowmen lack not bolts. Sir W. Scott. A fool's bolt is soon shot. Shak. 2. Lightning; a thunderbolt. 3. A strong pin, of iron or other material, used to fasten or hold something in place, often having a head at one end and screw thread cut upon the other end. 4. A sliding catch, or fastening, as for a door or gate; the portion of a lock which is shot or withdrawn by the action of the key. 5. An iron to fasten the legs of a prisoner; a shackle; a fetter. [Obs.] Away with him to prison! lay bolts enough upon him. Shak. 6. A compact package or roll of cloth, as of canvas or silk, often containing about forty yards. 7. A bundle, as of oziers. Bolt auger, an auger of large size; an auger to make holes for the bolts used by shipwrights. -- Bolt and nut, a metallic pin with a head formed upon one end, and a movable piece (the nut) screwed upon a thread cut upon the other end. See B, C, and D, in illust. above. Note: See Tap bolt, Screw bolt, and Stud bolt.\n\n1. To shoot; to discharge or drive forth. 2. To utter precipitately; to blurt or throw out. I hate when Vice can bolt her arguments. Milton. 3. To swallow without chewing; as, to bolt food. 4. (U. S. Politics)  To refuse to support, as a nomination made by a party to which one has belonged or by a caucus in which one has taken part. 5. (Sporting)  To cause to start or spring forth; to dislodge, as conies, rabbits, etc. 6. To fasten or secure with, or as with, a bolt or bolts, as a door, a timber, fetters; to shackle; to restrain. Let tenfold iron bolt my door. Langhorn. Which shackles accidents and bolts up change. Shak.\n\n1. To start forth like a bolt or arrow; to spring abruptly; to come or go suddenly; to dart; as, to bolt out of the room. This Puck seems but a dreaming dolt, . . . And oft out of a bush doth bolt. Drayton. 2. To strike or fall suddenly like a bolt. His cloudless thunder bolted on their heads. Milton. 3. To spring suddenly aside, or out of the regular path; as, the horse bolted. 4. (U.S. Politics)  To refuse to support a nomination made by a party or a caucus with which one has been connected; to break away from a party.\n\nIn the manner of a bolt; suddenly; straight; unbendingly. [He] came bolt up against the heavy dragoon. Thackeray. Bolt upright. (a) Perfectly upright; perpendicular; straight up; unbendingly erect. Addison. (b) On the back at full length. [Obs.] Chaucer.\n\n1. A sudden spring or start; a sudden spring aside; as, the horse made a bolt. 2. A sudden flight, as to escape creditors. This gentleman was so hopelessly involved that he contemplated a bolt to America -- or anywhere. Compton Reade. 3. (U. S. Politics)  A refusal to support a nomination made by the party with which one has been connected; a breaking away from one's party.\n\n1. To sift or separate the coarser from the finer particles of, as bran from flour, by means of a bolter; to separate, assort, refine, or purify by other means. He now had bolted all the flour. Spenser. Ill schooled in bolted language. Shak. 2. To separate, as if by sifting or bolting; -- with out. Time and nature will bolt out the truth of things. L'Estrange. 3. (Law)  To discuss or argue privately, and for practice, as cases at law. Jacob. To bolt to the bran, to examine thoroughly, so as to separate or discover everything important. Chaucer. This bolts the matter fairly to the bran. Harte. The report of the committee was examined and sifted and bolted to the bran. Burke.\n\nA sieve, esp. a long fine sieve used in milling for bolting flour and meal; a bolter. B. Jonson."}