{"word":"bond","definition":"1. That which binds, ties, fastens,or confines, or by which anything is fastened or bound, as a cord, chain, etc.; a band; a ligament; a shackle or a manacle. Gnawing with my teeth my bonds in sunder, I gained my freedom. Shak. 2. pl.  The state of being bound; imprisonment; captivity, restraint. \"This man doeth nothing worthy of death or of bonds.\" Acts xxvi. 3. A binding force or influence; a cause of union; a uniting tie; as, the bonds of fellowship. A people with whom I have no tie but the common bond of mankind. Burke. 4. Moral or political duty or obligation. I love your majesty According to my bond, nor more nor less. Shak. 5. (Law)  A writing under seal, by which a person binds himself, his heirs, executors, and administrators, to pay a certain sum on or before a future day appointed. This is a single bond. But usually a condition is added, that, if the obligor shall do a certain act, appear at a certain place, conform to certain rules, faithfully perform certain duties, or pay a certain sum of money, on or before a time specified, the obligation shall be void; otherwise it shall remain in full force. If the condition is not performed, the bond becomes forfeited, and the obligor and his heirs are liable to the payment of the whole sum. Bouvier. Wharton. 6. An instrument (of the nature of the ordinary legal bond) made by a government or a corporation for purpose of borrowing money; as, a government, city, or railway bond. 7. The state of goods placed in a bonded warehouse till the duties are paid; as, merchandise in bond. 8. (Arch.)  The union or tie of the several stones or bricks forming a wall. The bricks may be arranged for this purpose in several different ways, as in English or block bond (Fig. 1), where one course consists of bricks with their ends toward the face of the wall, called headers, and the next course of bricks with their lengths parallel to the face of the wall, called stretchers; Flemish bond (Fig.2), where each course consists of headers and stretchers alternately, so laid as always to break joints; Cross bond, which differs from the English by the change of the second stretcher line so that its joints come in the middle of the first, and the same position of stretchers comes back every fifth line; Combined cross and English bond, where the inner part of the wall is laid in the one method, the outer in the other. 9. (Chem.)  A unit of chemical attraction; as, oxygen has two bonds of affinity. It is often represented in graphic formulæ by a short line or dash. See Diagram of Benzene nucleus, and Valence. Arbitration bond. See under Arbitration. -- Bond crediter (Law), a creditor whose debt is secured by a bond. Blackstone. -- Bond debt (Law), a debt contracted under the obligation of a bond. Burrows. -- Bond (or lap) of a slate, the distance between the top of one slate and the bottom or drip of the second slate above, i. e., the space which is covered with three thicknesses; also, the distance between the nail of the under slate and the lower edge of the upper slate. -- Bond timber, timber worked into a wall to tie or strengthen it longitudinally. Syn. -- Chains; fetters; captivity; imprisonment.\n\n1. To place under the conditions of a bond; to mortgage; to secure the payment of the duties on (goods or merchandise) by giving a bond. 2. (Arch.)  To dispose in building, as the materials of a wall, so as to secure solidity.\n\nA xassal or serf; a slave. [Obs. or Archaic]\n\nIn a state of servitude or slavery; captive. By one Spirit are we all baptized .. whether we be Jews or Bentiles, whether we be bond or free. 1 Cor. xii. 13."}