{"word":"bone","definition":"1. (Anat.)  The hard, calcified tissue of the skeleton of vertebrate animals, consisting very largely of calcic carbonate, calcic phosphate, and gelatine; as, blood and bone. Note: Even in the hardest parts of bone there are many minute cavities containing living matter and connected by minute canals, some of which connect with larger canals through which blood vessels ramify. 2. One of the pieces or parts of an animal skeleton; as, a rib or a thigh bone; a bone of the arm or leg; also, any fragment of bony substance. (pl.) The frame or skeleton of the body. 3. Anything made of bone, as a bobbin for weaving bone lace. 4. pl.  Two or four pieces of bone held between the fingers and struck together to make a kind of music. 5. pl.  Dice. 6. Whalebone; hence, a piece of whalebone or of steel for a corset. 7. Fig.: The framework of anything. A bone of contention, a subject of contention or dispute. -- A bone to pick, something to investigate, or to busy one's self about; a dispute to be settled (with some one). -- Bone ash, the residue from calcined bones; -- used for making cupels, and for cleaning jewelry. -- Bone black (Chem.), the black, carbonaceous substance into which bones are converted by calcination in close vessels; -- called also animal charcoal. It is used as a decolorizing material in filtering sirups, extracts, etc., and as a black pigment. See Ivory black, under Black. -- Bone cave, a cave in which are found bones of extinct or recent animals, mingled sometimes with the works and bones of man. Am. Cyc. -- Bone dust, ground or pulverized bones, used as a fertilizer. -- Bone earth (Chem.), the earthy residuum after the calcination of bone, consisting chiefly of phosphate of calcium. -- Bone lace, a lace made of linen thread, so called because woven with bobbins of bone. -- Bone oil, an oil obtained by, heating bones (as in the manufacture of bone black), and remarkable for containing the nitrogenous bases, pyridine and quinoline, and their derivatives; -- also called Dippel's oil. -- Bone setter. Same as Bonesetter. See in the Vocabulary. -- Bone shark (Zoöl.), the basking shark. -- Bone spavin. See under Spavin. -- Bone turquoise, fossil bone or tooth of a delicate blue color, sometimes used as an imitation of true turquoise. -- Bone whale (Zoöl.), a right whale. -- To be upon the bones of, to attack. [Obs.] -- To make no bones, to make no scruple; not to hesitate. [Low] -- To pick a bone with, to quarrel with, as dogs quarrel over a bone; to settle a disagreement. [Colloq.]\n\n1. To withdraw bones from the flesh of, as in cookery. \"To bone a turkey.\" Soyer. 2. To put whalebone into; as, to bone stays. Ash. 3. To fertilize with bone. 4. To steal; to take possession of. [Slang]\n\nTo sight along an object or set of objects, to see if it or they be level or in line, as in carpentry, masonry, and surveying. Knight. Joiners, etc., bone their work with two straight edges. W. M. Buchanan."}