{"word":"bottom","definition":"1. The lowest part of anything; the foot; as, the bottom of a tree or well; the bottom of a hill, a lane, or a page. Or dive into the bottom of the deep. Shak. 2. The part of anything which is beneath the contents and supports them, as the part of a chair on which a person sits, the circular base or lower head of a cask or tub, or the plank floor of a ship's hold; the under surface. Barrels with the bottom knocked out. Macaulay. No two chairs were alike; such high backs and low backs and leather bottoms and worsted bottoms. W. Irving. 3. That upon which anything rests or is founded, in a literal or a figurative sense; foundation; groundwork. 4. The bed of a body of water, as of a river, lake, sea. 5. The fundament; the buttocks. 6. An abyss. [Obs.] Dryden. 7. Low land formed by alluvial deposits along a river; low-lying ground; a dale; a valley. \"The bottoms and the high grounds.\" Stoddard. 8. (Naut.)  The part of a ship which is ordinarily under water; hence, the vessel itself; a ship. My ventures are not in one bottom trusted. Shak. Not to sell the teas, but to return them to London in the same bottoms in which they were shipped. Bancroft. Full bottom, a hull of such shape as permits carrying a large amount of merchandise. 9. Power of endurance; as, a horse of a good bottom. 10. Dregs or grounds; lees; sediment. Johnson. At bottom, At the bottom, at the foundation or basis; in reality. \"He was at the bottom a good man.\" J. F. Cooper. -- To be at the bottom of, to be the cause or originator of; to be the source of. [Usually in an opprobrious sense.] J. H. Newman. He was at the bottom of many excellent counsels. Addison. -- To go to the bottom, to sink; esp. to be wrecked. -- To touch bottom, to reach the lowest point; to find something on which to rest.\n\nOf or pertaining to the bottom; fundamental; lowest; under; as, bottom rock; the bottom board of a wagon box; bottom prices. Bottom glade, a low glade or open place; a valley; a dale. Milton. -Bottom grass, grass growing on bottom lands. -- Bottom land. See 1st Bottom, n., 7.\n\n1. To found or build upon; to fix upon as a support; -- followed by on or upon. Action is supposed to be bottomed upon principle. Atterbury. Those false and deceiving grounds upon which many bottom their eternal state]. South. 2. To furnish with a bottom; as, to bottom a chair. 3. To reach or get to the bottom of. Smiles.\n\n1. To rest, as upon an ultimate support; to be based or grounded; -- usually with on or upon. Find on what foundation any proposition bottoms. Locke. 2. To reach or impinge against the bottom, so as to impede free action, as when the point of a cog strikes the bottom of a space between two other cogs, or a piston the end of a cylinder.\n\nA ball or skein of thread; a cocoon. [Obs.] Silkworms finish their bottoms in . . . fifteen days. Mortimer.\n\nTo wind round something, as in making a ball of thread. [Obs.] As you unwind her love from him, Lest it should ravel and be good to none, You must provide to bottom it on me. Shak."}