{"word":"bound","definition":"The external or limiting line, either real or imaginary, of any object or space; that which limits or restrains, or within which something is limited or restrained; limit; confine; extent; boundary. He hath compassed the waters with bounds. Job xxvi. 10. On earth's remotest bounds. Campbell. And mete the bounds of hate and love. Tennyson. To keep within bounds, not to exceed or pass beyond assigned limits; to act with propriety or discretion. Syn. -- See Boundary.\n\n1. To limit; to terminate; to fix the furthest point of extension of; -- said of natural or of moral objects; to lie along, or form, a boundary of; to inclose; to circumscribe; to restrain; to confine. Where full measure only bounds excess. Milton. Phlegethon . . . Whose fiery flood the burning empire bounds. Dryden. 2. To name the boundaries of; as, to bound France.\n\n1. To move with a sudden spring or leap, or with a succession of springs or leaps; as the beast bounded from his den; the herd bounded across the plain. Before his lord the ready spaniel bounds. Pope. And the waves bound beneath me as a steed That knows his rider. Byron. 2. To rebound, as an elastic ball.\n\n1. To make to bound or leap; as, to bound a horse. [R.] Shak. 2. To cause to rebound; to throw so that it will rebound; as, to bound a ball on the floor. [Collog.]\n\n1. A leap; an elastic spring; a jump. A bound of graceful hardihood. Wordsworth. 2. Rebound; as, the bound of a ball. Johnson. 3. (Dancing)  Spring from one foot to the other.\n\nimp. & p. p. of Bind.\n\n1. Restrained by a hand, rope, chain, fetters, or the like. 2. Inclosed in a binding or cover; as, a bound volume. 3. Under legal or moral restraint or obligation. 4. Constrained or compelled; destined; certain; -- followed by the infinitive; as, he is bound to succeed; he is bound to fail. 5. Resolved; as, I am bound to do it. [Collog. U. S.] 6. Constipated; costive. Note: Used also in composition; as, icebound, windbound, hidebound, etc. Bound bailiff (Eng. Law), a sheriff's officer who serves writs, makes arrests, etc. The sheriff being answerable for the bailiff's misdemeanors, the bailiff is usually under bond for the faithful discharge of his trust. -- Bound up in, entirely devoted to; inseparable from.\n\nReady or intending to go; on the way toward; going; -- with to or for, or with an adverb of motion; as, a ship is bound to Cadiz, or for Cadiz. \"The mariner bound homeward.\" Cowper."}