{"word":"box","definition":"A tree or shrub, flourishing in different parts of the world. The common box (Buxus sempervirens) has two varieties, one of which, the dwaft box (B.suffruticosa), is much used for borders in gardens. The wood of the tree varieties, being very hard and smooth, is extensively used in the arts, as by turners, engravers, mathematical instrument makers, etc. Box elder, the ash-leaved maple (Negundo aceroides), of North America. -- Box holly, the butcher's broom (Russus aculeatus). -- Box thorn, a shrub (Lycium barbarum). -- Box tree, the tree variety of the common box.\n\n1. A receptacle or case of any firm material and of various shapes. 2. The quantity that a box contain. 3. A space with a few seats partitioned off in a theater, or other place of public amusement. Laughed at by the pit, box, galleries, nay, stage. Dorset. The boxes and the pit are sovereign judges. Dryden. 4. A chest or any receptacle for the deposit of money; as, a poor box; a contribution box. Yet since his neighbors give, the churl unlocks, Damning the poor, his tripple-bolted box. J. Warton. 5. A small country house. \"A shooting box.\" Wilson. Tight boxes neatly sashed. Cowper. 6. A boxlike shed for shelter; as, a sentry box. 7. (Mach) (a) An axle box, journal box, journal bearing, or bushing. (b) A chamber or section of tube in which a valve works; the bucket of a lifting pump. 8. The driver's seat on a carriage or coach. 9. A present in a box; a present; esp. a Christmas box or gift. \"A Christmas box.\" Dickens. 10. (Baseball)  The square in which the pitcher stands. 11. (Zoöl.)  A Mediterranean food fish; the bogue. Note: Box is much used adjectively or in composition; as box lid, box maker, box circle, etc.; also with modifying substantives; as money box, letter box, bandbox, hatbox or hat box, snuff box or snuffbox. Box beam (Arch.), a beam made of metal plates so as to have the form of a long box. -- Box car (Railroads), a freight car covered with a roof and inclosed on the sides to protect its contents. -- Box chronometer, a ship's chronometer, mounted in gimbals, to preserve its proper position. -- Box coat, a thick overcoat for driving; sometimes with a heavy cape to carry off the rain. -- Box coupling, a metal collar uniting the ends of shafts or other parts in machinery. -- Box crab (Zoöl.), a crab of the genus Calappa, which, when at rest with the legs retracted, resembles a box. -- Box drain (Arch.), a drain constructed with upright sides, and with flat top and bottom. -- Box girder (Arch.), a box beam. -- Box groove (Metal Working), a closed groove between two rolls, formed by a collar on one roll fitting between collars on another. R. W. Raymond. -- Box metal, an alloy of copper and tin, or of zinc, lead, and antimony, for the bearings of journals, etc. -- Box plait, a plait that doubles both to the rigth and the left. -- Box turtle or Box tortoise (Zoöl.), a land tortoise or turtle of the genera Cistudo and Emys; -- so named because it can withdraw entirely within its shell, which can be closed by hinged joints in the lower shell. Also, humorously, an exceedingly reticent person. Emerson. -- In a box, in a perplexity or an embarrassing position; in difficulty. (Colloq.) -- In the wrong box, out of one's place; out of one's element; awkwardly situated. (Colloq.) Ridley (1554)\n\n1. To inclose in a box. 2. To furnish with boxes, as a wheel. 3. (Arch.)  To inclose with boarding, lathing, etc., so as to bring to a required form. To box a tree, to make an incision or hole in a tree for the purpose of procuring the sap. -- To box off, to divide into tight compartments. -- To box up. (a) To put into a box in order to save; as, he had boxed up twelve score pounds. (b) To confine; as, to be boxed up in narrow quarters.\n\nA blow on the head or ear with the hand. A good-humored box on the ear. W. Irving.\n\nTo fight with the fist; to combat with, or as with, the hand or fist; to spar.\n\nTo strike with the hand or fist, especially to strike on the ear, or on the side of the head.\n\nTo boxhaul. To box off (Naut.), to turn the head of a vessel either way by bracing the headyards aback. -- To box the compass (Naut.), to name the thirty-two points of the compass in their order."}