{"word":"branch","definition":"1. (Bot.)  A shoot or secondary stem growing from the main stem, or from a principal limb or bough of a tree or other plant. 2. Any division extending like a branch; any arm or part connected with the main body of thing; ramification; as, the branch of an antler; the branch of a chandelier; a branch of a river; a branch of a railway. Most of the branches , or streams, were dried up. W. Irving. 3. Any member or part of a body or system; a distinct article; a section or subdivision; a department. \"Branches of knowledge.\" Prescott. It is a branch and parcel of mine oath. Shak. 4. (Geom.)  One of the portions of a curve that extends outwards to an indefinitely great distance; as, the branches of an hyperbola. 5. A line of family descent, in distinction from some other line or lines from the same stock; any descendant in such a line; as, the English branch of a family. His father, a younger branch of the ancient stock. Carew. 6. (Naut.)  A warrant or commission given to a pilot, authorizing him to pilot vessels in certain waters. Branches of a bridle, two pieces of bent iron, which bear the bit, the cross chains, and the curb. -- Branch herring. See Alewife. -- Root and branch , totally, wholly. Syn. -- Bough; limb; shoot; offshoot; twig; sprig.\n\nDiverging from, or tributary to, a main stock, line, way, theme, etc.; as, a branch vein; a branch road or line; a branch topic; a branch store.\n\n1. To shoot or spread in branches; to separate into branches; to ramify. 2. To divide into separate parts or subdivision. To branch off, to form a branch or a separate part; to diverge. -- To branch out, to speak diffusively; to extend one's discourse to other topics than the main one; also, to enlarge the scope of one's business, etc. To branch out into a long disputation. Spectator.\n\n1. To divide as into branches; to make subordinate division in. 2. To adorn with needlework representing branches, flowers, or twigs. The train whereof loose far behind her strayed, Branched with gold and pearl, most richly wrought. Spenser."}