{"word":"breathe","definition":"1. To respire; to inhale and exhale air; hence;, to live. \"I am in health, I breathe.\" Shak. Breathes there a man with soul so dead Sir W. Scott. 2. To take breath; to rest from action. Well! breathe awhile, and then to it again! Shak. 3. To pass like breath; noiselessly or gently; to exhale; to emanate; to blow gently. The air breathes upon us here most sweetly. Shak. There breathes a living fragrance from the shore. Byron.\n\n1. To inhale and exhale in the process of respiration; to respire. To view the light of heaven, and breathe the vital air. Dryden. 2. To inject by breathing; to infuse; -- with into. Able to breathe life into a stone. Shak. And the Lord God formed man of the dust of the ground, and breathed into his nostrils the breath of life. Gen. ii. 7. 3. To emit or utter by the breath; to utter softly; to whisper; as, to breathe a vow. He softly breathed thy name. Dryden. Or let the church, our mother, breathe her curse, A mother's curse, on her revolting son. Shak. 4. To exhale; to emit, as breath; as, the flowers breathe odors or perfumes. 5. To express; to manifest; to give forth. Others articles breathe the same severe spirit. Milner. 6. To act upon by the breath; to cause to sound by breathing. \"They breathe the flute.\" Prior. 7. To promote free respiration in; to exercise. And every man should beat thee. I think thou wast created for men to breathe themselves upon thee. Shak. 8. To suffer to take breath, or recover the natural breathing; to rest; as, to breathe a horse. A moment breathed his panting steed. Sir W. Scott. 9. To put out of breath; to exhaust. Mr. Tulkinghorn arrives in his turret room, a little breathed by the journey up. Dickens. 10. (Phonetics)  To utter without vocality, as the nonvocal consonants. The same sound may be pronounces either breathed, voiced, or whispered. H. Sweet. Breathed elements, being already voiceless, remain unchanged Note: [in whispering]. H. Sweet. To breathe again, to take breath; to feel a sense of relief, as from danger, responsibility, or press of business. -- To breathe one's last, to die; to expire. -- To breathe a vein, to open a vein; to let blood. Dryden."}