{"word":"breed","definition":"1. To produce as offspring; to bring forth; to bear; to procreate; to generate; to beget; to hatch. Yet every mother breeds not sons alike. Shak. If the sun breed maggots in a dead dog. Shak. 2. To take care of in infancy, and through the age of youth; to bring up; to nurse and foster. To bring thee forth with pain, with care to breed. Dryden. Born and bred on the verge of the wilderness. Everett. 3. To educate; to instruct; to form by education; to train; -- sometimes followed by up. But no care was taken to breed him a Protestant. Bp. Burnet. His farm may not remove his children too far from him, or the trade he breeds them up in. Locke. 4. To engender; to cause; to occasion; to originate; to produce; as, to breed a storm; to breed disease. Lest the place And my quaint habits breed astonishment. Milton. 5. To give birth to; to be the native place of; as, a pond breeds fish; a northern country breeds stout men. 6. To raise, as any kind of stock. 7. To produce or obtain by any natural process. [Obs.] Children would breed their teeth with less danger. Locke. Syn. -- To engender; generate; beget; produce; hatch; originate; bring up; nourish; train; instruct.\n\n1. To bear and nourish young; to reproduce or multiply itself; to be pregnant. That they breed abundantly in the earth. Gen. viii. 17. The mother had never bred before. Carpenter. Ant. Is your gold and silver ewes and rams Shy. I can not tell. I make it breed as fast. Shak. 2. To be formed in the parent or dam; to be generated, or to grow, as young before birth. 3. To have birth; to be produced or multiplied. Heavens rain grace On that which breeds between them. Shak. 4. To raise a breed; to get progeny. The kind of animal which you wish to breed from. Gardner. To breed in and in, to breed from animals of the same stock that are closely related.\n\n1. A race or variety of men or other animals (or of plants), perpetuating its special or distinctive characteristics by inheritance. Twice fifteen thousand hearts of England's breed. Shak. Greyhounds of the best breed. Carpenter. 2. Class; sort; kind; -- of men, things, or qualities. Are these the breed of wits so wondered at Shak. This courtesy is not of the right breed. Shak. 3. A number produced at once; a brood. [Obs.] Note: Breed is usually applied to domestic animals; species or variety to wild animals and to plants; and race to men."}