{"word":"brick","definition":"1. A block or clay tempered with water, sand, etc., molded into a regular form, usually rectangular, and sun-dried, or burnt in a kiln, or in a heap or stack called a clamp. The Assyrians appear to have made much less use of bricks baked in the furnace than the Babylonians. Layard. 2. Bricks, collectively, as designating that kind of material; as, a load of brick; a thousand of brick. Some of Palladio's finest examples are of brick. Weale. 3. Any oblong rectangular mass; as, a brick of maple sugar; a penny brick (of bread). 4. A good fellow; a merry person; as, you 're a brick. [Slang] \"He 's a dear little brick.\" Thackeray. To have a brick in one's hat, to be drunk. [Slang] Note: Brick is used adjectively or in combination; as, brick wall; brick clay; brick color; brick red. Brick clay, clay suitable for, or used in making, bricks. -- Brick dust, dust of pounded or broken bricks. -- Brick earth, clay or earth suitable for, or used in making, bricks. -- Brick loaf, a loaf of bread somewhat resembling a brick in shape. -- Brick nogging (Arch.), rough brickwork used to fill in the spaces between the uprights of a wooden partition; brick filling. -- Brick tea, tea leaves and young shoots, or refuse tea, steamed or mixed with fat, etc., and pressed into the form of bricks. It is used in Northern and Central Asia. S. W. Williams. -- Brick trimmer (Arch.), a brick arch under a hearth, usually within the thickness of a wooden floor, to guard against accidents by fire. -- Brick trowel. See Trowel. -- Brick works, a place where bricks are made. -- Bath brick. See under Bath, a city. -- Pressed brick, bricks which, before burning, have been subjected to pressure, to free them from the imperfections of shape and texture which are common in molded bricks.\n\n1. To lay or pave with bricks; to surround, line, or construct with bricks. 2. To imitate or counterfeit a brick wall on, as by smearing plaster with red ocher, making the joints with an edge tool, and pointing them. To brick up, to fill up, inclose, or line, with brick."}