{"word":"bridge","definition":"1. A structure, usually of wood, stone, brick, or iron, erected over a river or other water course, or over a chasm, railroad, etc., to make a passageway from one bank to the other. 2. Anything supported at the ends, which serves to keep some other thing from resting upon the object spanned, as in engraving, watchmaking, etc., or which forms a platform or staging over which something passes or is conveyed. 3. (Mus.)  The small arch or bar at right angles to the strings of a violin, guitar, etc., serving of raise them and transmit their vibrations to the body of the instrument. 4. (Elec.)  A device to measure the resistance of a wire or other conductor forming part of an electric circuit. 5. A low wall or vertical partition in the fire chamber of a furnace, for deflecting flame, etc.; -- usually called a bridge wall. Aqueduct bridge. See Aqueduct. -- Asses' bridge, Bascule bridge, Bateau bridge. See under Ass, Bascule, Bateau. -- Bridge of a steamer (Naut.), a narrow platform across the deck, above the rail, for the convenience of the officer in charge of the ship; in paddlewheel vessels it connects the paddle boxes. -- Bridge of the nose, the upper, bony part of the nose. -- Cantalever bridge. See under Cantalever. -- Draw bridge. See Drawbridge. -- Flying bridge, a temporary bridge suspended or floating, as for the passage of armies; also, a floating structure connected by a cable with an anchor or pier up stream, and made to pass from bank to bank by the action of the current or other means. -- Girder bridge or Truss bridge, a bridge formed by girders, or by trusses resting upon abutments or piers. -- Lattice bridge, a bridge formed by lattice girders. -- Pontoon bridge, Ponton bridge. See under Pontoon. -- Skew bridge, a bridge built obliquely from bank to bank, as sometimes required in railway engineering. -- Suspension bridge. See under Suspension. -- Trestle bridge, a bridge formed of a series of short, simple girders resting on trestles. -- Tubular bridge, a bridge in the form of a hollow trunk or rectangular tube, with cellular walls made of iron plates riveted together, as the Britannia bridge over the Menai Strait, and the Victoria bridge at Montreal. -- Wheatstone's bridge (Elec.), a device for the measurement of resistances, so called because the balance between the resistances to be measured is indicated by the absence of a current in a certain wire forming a bridge or connection between two points of the apparatus; -- invented by Sir Charles Wheatstone.\n\n1. To build a bridge or bridges on or over; as, to bridge a river. Their simple engineering bridged with felled trees the streams which could not be forded. Palfrey. 2. To open or make a passage, as by a bridge. Xerxes . . . over Hellespont Bridging his way, Europe with Asia joined. Milton. 3. To find a way of getting over, as a difficulty; -- generally with over."}