{"word":"brief","definition":"1. Short in duration. How brief the life of man. Shak. 2. Concise; terse; succinct. The brief style is that which expresseth much in little. B. Jonson. 3. Rife; common; prevalent. [Prov. Eng.] In brief. See under Brief, n. Syn. -- Short; concise; succinct; summary; compendious; condensed; terse; curt; transistory; short-lived.\n\n1. Briefly. [Obs. or Poetic] Adam, faltering long, thus answered brief. Milton. 2. Soon; quickly. [Obs.] Shak.\n\n1. A short concise writing or letter; a statement in few words. Bear this sealed brief, With winged hastle, to the lord marshal. Shak. And she told me In a sweet, verbal brief. Shak. 2. An epitome. Each woman is a brief of womankind. Overbury. 3. (Law)  An abridgment or concise statement of a client's case, made out for the instruction of counsel in a trial at law. This word is applied also to a statement of the heads or points of a law argument. It was not without some reference to it that I perused many a brief. Sir J. Stephen. Note: In England, the brief is prepared by the attorney; in the United States, counsel generally make up their own briefs. 4. (Law)  A writ; a breve. See Breve, n., 2. 5. (Scots Law)  A writ issuing from the chancery, directed to any judge ordinary, commanding and authorizing that judge to call a jury to inquire into the case, and upon their verdict to pronounce sentence. 6. A letter patent, from proper authority, authorizing a collection or charitable contribution of money in churches, for any public or private purpose. [Eng.] Apostolical brief, a letter of the pope written on fine parchment in modern characters, subscribed by the secretary of briefs, dated \"a die Nativitatis,\" i. e., \"from the day of the Nativity,\" and sealed with the ring of the fisherman. It differs from a bull, in its parchment, written character, date, and seal. See Bull. -- Brief of title, an abstract or abridgment of all the deeds and other papers constituting the chain of title to any real estate. -- In brief, in a few words; in short; briefly. \"Open the matter in brief.\" Shak.\n\nTo make an abstract or abridgment of; to shorten; as, to brief pleadings."}