{"word":"buffalo","definition":"1. (Zoöl.)  A species of the genus Bos or Bubalus (B. bubalus), originally from India, but now found in most of the warmer countries of the eastern continent. It is larger and less docile than the common ox, and is fond of marshy places and rivers. 2. (Zoöl.)  A very large and savage species of the same genus (B. Caffer) found in South Africa; -- called also Cape buffalo. 3. (Zoöl.)  Any species of wild ox. 4. (Zoöl.)  The bison of North America. 5. A buffalo robe. See Buffalo robe, below. 6. (Zoöl.)  The buffalo fish. See Buffalo fish, below. Buffalo berry (Bot.), a shrub of the Upper Missouri (Sherherdia argentea) with acid edible red berries. -- Buffalo bird (Zoöl.), an African bird of the genus Buphaga, of two species. These birds perch upon buffaloes and cattle, in search of parasites. -- Buffalo bug, the carpet beetle. See under Carpet. -- Buffalo chips, dry dung of the buffalo, or bison, used for fuel. [U.S.] -- Buffalo clover (Bot.), a kind of clover (Trifolium reflexum and T.soloniferum) found in the ancient grazing grounds of the American bison. -- Buffalo cod (Zoöl.), a large, edible, marine fish (Ophiodon elongatus) of the northern Pacific coast; -- called also blue cod, and cultus cod. -- Buffalo fish (Zoöl.), one of several large fresh-water fishes of the family Catostomidæ, of the Mississippi valley. The red-mouthed or brown (Ictiobus bubalus), the big-mouthed or black (Bubalichthys urus), and the small-mouthed (B. altus), are among the more important species used as food. -- Buffalo fly, or Buffalo gnat (Zoöl.), a small dipterous insect of the genus Simulium, allied to the black fly of the North. It is often extremely abundant in the lower part of the Mississippi valley and does great injury to domestic animals, often killing large numbers of cattle and horses. In Europe the Columbatz fly is a species with similar habits. -- Buffalo grass (Bot.), a species of short, sweet grass (Buchloë dactyloides), from two to four inches high, covering the prairies on which the buffaloes, or bisons, feed. [U.S.] -- Buffalo nut (Bot.), the oily and drupelike fruit of an American shrub (Pyrularia oleifera); also, the shrub itself; oilnut. -- Buffalo robe, the skin of the bison of North America, prepared with the hair on; -- much used as a lap robe in sleighs."}