{"word":"burn","definition":"1. To consume with fire; to reduce to ashes by the action of heat or fire; -- frequently intensified by up: as, to burn up wood. \"We'll burn his body in the holy place.\" Shak. 2. To injure by fire or heat; to change destructively some property or properties of, by undue exposure to fire or heat; to scorch; to scald; to blister; to singe; to char; to sear; as, to burn steel in forging; to burn one's face in the sun; the sun burns the grass. 3. To perfect or improve by fire or heat; to submit to the action of fire or heat for some economic purpose; to destroy or change some property or properties of, by exposure to fire or heat in due degree for obtaining a desired residuum, product, or effect; to bake; as, to burn clay in making bricks or pottery; to burn wood so as to produce charcoal; to burn limestone for the lime. 4. To make or produce, as an effect or result, by the application of fire or heat; as, to burn a hole; to burn charcoal; to burn letters into a block. 5. To consume, injure, or change the condition of, as if by action of fire or heat; to affect as fire or heat does; as, to burn the mouth with pepper. This tyrant fever burns me up. Shak. This dry sorrow burns up all my tears. Dryden. When the cold north wind bloweth, . . . it devoureth the mountains, and burneth the wilderness, and consumeth the Ecclus. xliii. 20, 21. 6. (Surg.)  To apply a cautery to; to cauterize. 7. (Chem.)  To cause to combine with oxygen or other active agent, with evolution of heat; to consume; to oxidize; as, a man burns a certain amount of carbon at each respiration; to burn iron in oxygen. To burn, To burn together, as two surfaces of metal (Engin.), to fuse and unite them by pouring over them a quantity of the same metal in a liquid state. -- To burn a bowl (Game of Bowls), to displace it accidentally, the bowl so displaced being said to be burned. -- To burn daylight, to light candles before it is dark; to waste time; to perform superfluous actions. Shak. -- To burn one's fingers, to get one's self into unexpected trouble, as by interfering the concerns of others, speculation, etc. -- To burn out, to destroy or obliterate by burning. \"Must you with hot irons burn out mine eyes\" Shak. -- To be burned out, to suffer loss by fire, as the burning of one's house, store, or shop, with the contents. -- To burn up, To burn down, to burn entirely.\n\n1. To be of fire; to flame. \"The mount burned with fire.\" Deut. ix. 15. 2. To suffer from, or be scorched by, an excess of heat. Your meat doth burn, quoth I. Shak. 3. To have a condition, quality, appearance, sensation, or emotion, as if on fire or excessively heated; to act or rage with destructive violence; to be in a state of lively emotion or strong desire; as, the face burns; to burn with fever. Did not our heart burn within us, while he talked with us by the way Luke xxiv. 32. The barge she sat in, like a burnished throne, Burned on the water. Shak. Burning with high hope. Byron. The groan still deepens, and the combat burns. Pope. The parching air Burns frore, and cold performs the effect of fire. Milton. 4. (Chem.)  To combine energetically, with evolution of heat; as, copper burns in chlorine. 5. In certain games, to approach near to a concealed object which is sought. [Colloq.] To burn out, to burn till the fuel is exhausted. -- To burn up, To burn down, to be entirely consumed.\n\n1. A hurt, injury, or effect caused by fire or excessive or intense heat. 2. The operation or result of burning or baking, as in brickmaking; as, they have a good burn. 3. A disease in vegetables. See Brand, n., 6.\n\nA small stream. [Scot.]"}