{"word":"burr","definition":"1. (Bot.)  Any rough or prickly envelope of the seeds of plants, whether a pericarp, a persistent calyx, or an involucre, as of the chestnut and burdock. Also, any weed which bears burs. Amongst rude burs and thistles. Milton. Bur and brake and brier. Tennyson. 2. The thin ridge left by a tool in cutting or shaping metal. See Burr, n., 2. 3. A ring of iron on a lance or spear. See Burr, n., 4. 4. The lobe of the ear. See Burr, n., 5. 5. The sweetbread. 6. A clinker; a partially vitrified brick. 7. (Mech.) (a) A small circular saw. (b) A triangular chisel. (c) A drill with a serrated head larger than the shank; -- used by dentists. 8. Etym: [Cf. Gael. borr, borra, a knob, bunch.] (Zoöl.)  The round knob of an antler next to a deer's head. [Commonly written burr.] Bur oak (Bot.), a useful and ornamental species of oak (Quercus macrocarpa) with ovoid acorns inclosed in deep cups imbricated with pointed scales. It grows in the Middle and Western United States, and its wood is tough, close-grained, and durable. -- Bur reed (Bot.), a plant of the genus Sparganium, having long ribbonlike leaves.\n\n1. A prickly seed vessel. See Bur, 1. 2. The thin edge or ridge left by a tool in cutting or shaping metal, as in turning, engraving, pressing, etc.; also, the rough neck left on a bullet in casting. The graver, in plowing furrows in the surface of the copper, raises corresponding ridges or burrs. Tomlinson. 3. A thin flat piece of metal, formed from a sheet by punching; a small washer put on the end of a rivet before it is swaged down. 4. A broad iron ring on a tilting lance just below the gripe, to prevent the hand from slipping. 5. The lobe or lap of the ear. 6. Etym: [Probably of imitative origin.]  A guttural pronounciation of the letter r, produced by trilling the extremity of the soft palate against the back part of the tongue; rotacism; -- often called the Newcastle, Northumberland, or Tweedside, burr. 7. The knot at the bottom of an antler. See Bur, n., 8.\n\nTo speak with burr; to make a hoarse or guttural murmur. Mrs. Browning."}