{"word":"burst","definition":"1. To fly apart or in pieces; of break open; to yield to force or pressure, especially to a sudden and violent exertion of force, or to pressure from within; to explode; as, the boiler had burst; the buds will burst in spring. From the egg that soon Bursting with kindly rupture, forth disclosed Their callow young. Milton. Note: Often used figuratively, as of the heart, in reference to a surcharge of passion, grief, desire, etc. No, no, my heart will burst, an if I speak: And I will speak, that so my heart may burst. Shak. 2. To exert force or pressure by which something is made suddenly to give way; to break through obstacles or limitations; hence, to appear suddenly and unexpecedly or unaccountably, or to depart in such manner; -- usually with some qualifying adverb or preposition, as forth, out, away, into, upon, through, etc. Tears, such as angels weep, burst forth. Milton. And now you burst (ah cruel!) from my arms. Pope. A resolved villain Whose bowels suddenly burst out. Shak. We were the first that ever burst Into that silent sea. Coleridge. To burst upon him like an earthquake. Goldsmith.\n\n1. To break or rend by violence, as by an overcharge or by strain or pressure, esp. from within; to force open suddenly; as, to burst a cannon; to burst a blood vessel; to burst open the doors. My breast I'll burst with straining of my courage. Shak. 2. To break. [Obs.] You will not pay for the glasses you have burst Shak. He burst his lance against the sand below. Fairfax (Tasso). 3. To produce as an effect of bursting; as, to burst a hole through the wall. Bursting charge. See under Charge.\n\n1. A sudden breaking forth; a violent rending; an explosion; as, a burst of thunder; a burst of applause; a burst of passion; a burst of inspiration. Bursts of fox-hunting melody. W. Irving. 2. Any brief, violent evertion or effort; a spurt; as, a burst of speed. 3. A sudden opening, as of landscape; a stretch; an expanse. [R.] \"A fine burst of country.\" Jane Austen. 4. A rupture of hernia; a breach."}