{"word":"bush","definition":"1. A thicket, or place abounding in trees or shrubs; a wild forest. Note: This was the original sense of the word, as in the Dutch bosch, a wood, and was so used by Chaucer. In this sense it is extensively used in the British colonies, especially at the Cape of Good Hope, and also in Australia and Canada; as, to live or settle in the bush. 2. A shrub; esp., a shrub with branches rising from or near the root; a thick shrub or a cluster of shrubs. To bind a bush of thorns among sweet-smelling flowers. Gascoigne. 3. A shrub cut off, or a shrublike branch of a tree; as, bushes to support pea vines. 4. A shrub or branch, properly, a branch of ivy (as sacred to Bacchus), hung out at vintners' doors, or as a tavern sign; hence, a tavern sign, and symbolically, the tavern itself. If it be true that good wine needs no bush, 't is true that a good play needs no epilogue. Shak. 5. (Hunting)  The tail, or brush, of a fox. To beat about the bush, to approach anything in a round-about manner, instead of coming directly to it; -- a metaphor taken from hunting. -- Bush bean (Bot.), a variety of bean which is low and requires no support (Phaseolus vulgaris, variety nanus). See Bean, 1. -- Bush buck, or Bush goat (Zoöl.), a beautiful South African antelope (Tragelaphus sylvaticus); -- so called because found mainly in wooden localities. The name is also applied to other species. -- Bush cat (Zoöl.), the serval. See Serval. -- Bush chat (Zoöl.), a bird of the genus Pratincola, of the Thrush family. -- Bush dog. (Zoöl.) See Potto. -- Bush hammer. See Bushhammer in the Vocabulary. -- Bush harrow (Agric.) See under Harrow. -- Bush hog (Zoöl.), a South African wild hog (Potamochoerus Africanus); -- called also bush pig, and water hog. -- Bush master (Zoöl.), a venomous snake (Lachesis mutus) of Guinea; -- called also surucucu. -- Bush pea (Bot.), a variety of pea that needs to be bushed. -- Bush shrike (Zoöl.), a bird of the genus Thamnophilus, and allied genera; -- called also batarg. Many species inhabit tropical America. -- Bush tit (Zoöl.), a small bird of the genus Psaltriparus, allied to the titmouse. P. minimus inhabits California.\n\nTo branch thickly in the manner of a bush. \"The bushing alders.\" Pope.\n\n1. To set bushes for; to support with bushes; as, to bush peas. 2. To use a bush harrow on (land), for covering seeds sown; to harrow with a bush; as, to bush a piece of land; to bush seeds into the ground.\n\n1. (Mech.)  A lining for a hole to make it smaller; a thimble or ring of metal or wood inserted in a plate or other part of machinery to receive the wear of a pivot or arbor. Knight. Note: In the larger machines, such a piece is called a box, particularly in the United States. 2. (Gun.)  A piece of copper, screwed into a gun, through which the venthole is bored. Farrow.\n\nTo furnish with a bush, or lining; as, to bush a pivot hole."}