{"word":"but","definition":"1. Except with; unless with; without. [Obs.] So insolent that he could not go but either spurning equals or trampling on his inferiors. Fuller. Touch not the cat but a glove. Motto of the Mackintoshes. 2. Except; besides; save. Who can it be, ye gods! but perjured Lycon E. Smith. Note: In this sense, but is often used with other particles; as, but for, without, had it not been for. \"Uncreated but for love divine.\" Young. 3. Excepting or excluding the fact that; save that; were it not that; unless; -- elliptical, for but that. And but my noble Moor is true of mind . . . it were enough to put him to ill thinking. Shak. 4. Otherwise than that; that not; -- commonly, after a negative, with that. It cannot be but nature hath some director, of infinite power, to guide her in all her ways. Hooker. There is no question but the king of Spain will reform most of the abuses. Addison. 5. Only; solely; merely. Observe but how their own principles combat one another. Milton. If they kill us, we shall but die. 2 Kings vii. 4. A formidable man but to his friends. Dryden. 6. On the contrary; on the other hand; only; yet; still; however; nevertheless; more; further; -- as connective of sentences or clauses of a sentence, in a sense more or less exceptive or adversative; as, the House of Representatives passed the bill, but the Senate dissented; our wants are many, but quite of another kind. Now abideth faith hope, charity, these three; but the greatest of these is charity. 1 Cor. xiii. 13. When pride cometh, then cometh shame; but with the lowly is wisdom. Prov. xi. 2. All but. See under All. -- But and if, but if; an attempt on the part of King James's translators of the Bible to express the conjunctive and adversative force of the Greek But and if that servant say in his heart, My lord delayeth his coming; . . . the lord of that servant will come in a day when he looketh not for him. Luke xii. 45, 46. But if, unless. [Obs.] Chaucer. But this I read, that but if remedy Thou her afford, full shortly I her dead shall see. Spenser. Syn. -- But, However, Still. These conjunctions mark opposition in passing from one thought or topic to another. But marks the opposition with a medium degree of strength; as, this is not winter, but it is almost as cold; he requested my assistance, but I shall not aid him at present. However is weaker, and throws the opposition (as it were) into the background; as, this is not winter; it is, however, almost as cold; he required my assistance; at present, however, I shall not afford him aid. The plan, however, is still under consideration, and may yet be adopted. Still is stronger than but, and marks the opposition more emphatically; as, your arguments are weighty; still they do not convince me. See Except, However. Note: \"The chief error with but is to use it where and is enough; an error springing from the tendency to use strong words without sufficient occasio,.\" Bain.\n\nThe outer apartment or kitchen of a two-roomed house; -- opposed to ben, the inner room. [Scot.]\n\n1. A limit; a boundary. 2. The end; esp. the larger or thicker end, or the blunt, in distinction from the sharp, end. See 1st Butt. But end, the larger or thicker end; as, the but end of a log; the but end of a musket. See Butt, n.\n\nSee Butt, v., and Abut, v.\n\n1. A limit; a bound; a goal; the extreme bound; the end. Here is my journey's end, here my butt And very sea mark of my utmost sail. Shak. Note: As applied to land, the word is nearly synonymous with mete, and signifies properly the end line or boundary; the abuttal. 2. The thicker end of anything. See But. 3. A mark to be shot at; a target. Sir W. Scott. The groom his fellow groom at butts defies, And bends his bow, and levels with his eyes. Dryden. 4. A person at whom ridicule, jest, or contempt is directed; as, the butt of the company. I played a sentence or two at my butt, which I thought very smart. Addison. 5. A push, thrust, or sudden blow, given by the head of an animal; as, the butt of a ram. 6. A thrust in fencing. To prove who gave the fairer butt, John shows the chalk on Robert's coat. Prior. 7. A piece of land left unplowed at the end of a field. The hay was growing upon headlands and butts in cornfields. Burrill. 8. (Mech.) (a) A joint where the ends of two objects come squarely together without scrafing or chamfering; -- also called butt joint. (b) The end of a connecting rod or other like piece, to which the boxing is attached by the strap, cotter, and gib. (c) The portion of a half-coupling fastened to the end of a hose. 9. (Shipbuilding)  The joint where two planks in a strake meet. 10. (Carp.)  A kind of hinge used in hanging doors, etc.; -- so named because fastened on the edge of the door, which butts against the casing, instead of on its face, like the strap hinge; also called butt hinge. 11. (Leather Trade)  The thickest and stoutest part of tanned oxhides, used for soles of boots, harness, trunks. 12. The hut or shelter of the person who attends to the targets in rifle practice. Butt chain (Saddlery), a short chain attached to the end of a tug. -- Butt end. The thicker end of anything. See But end, under 2d But. Amen; and make me die a good old man! That's the butt end of a mother's blessing. Shak. A butt's length, the ordinary distance from the place of shooting to the butt, or mark. -- Butts and bounds (Conveyancing), abuttals and boundaries. In lands of the ordinary rectangular shape, butts are the lines at the ends (F. bouts), and bounds are those on the sides, or sidings, as they were formerly termed. Burrill. -- Bead and butt. See under Bead. -- Butt and butt, joining end to end without overlapping, as planks. -- Butt weld (Mech.), a butt joint, made by welding together the flat ends, or edges, of a piece of iron or steel, or of separate pieces, without having them overlap. See Weld. -- Full butt, headfirst with full force. [Colloq.] \"The corporal . . . ran full butt at the lieutenant.\" Marryat."}