{"word":"butt","definition":"1. A limit; a bound; a goal; the extreme bound; the end. Here is my journey's end, here my butt And very sea mark of my utmost sail. Shak. Note: As applied to land, the word is nearly synonymous with mete, and signifies properly the end line or boundary; the abuttal. 2. The thicker end of anything. See But. 3. A mark to be shot at; a target. Sir W. Scott. The groom his fellow groom at butts defies, And bends his bow, and levels with his eyes. Dryden. 4. A person at whom ridicule, jest, or contempt is directed; as, the butt of the company. I played a sentence or two at my butt, which I thought very smart. Addison. 5. A push, thrust, or sudden blow, given by the head of an animal; as, the butt of a ram. 6. A thrust in fencing. To prove who gave the fairer butt, John shows the chalk on Robert's coat. Prior. 7. A piece of land left unplowed at the end of a field. The hay was growing upon headlands and butts in cornfields. Burrill. 8. (Mech.) (a) A joint where the ends of two objects come squarely together without scrafing or chamfering; -- also called butt joint. (b) The end of a connecting rod or other like piece, to which the boxing is attached by the strap, cotter, and gib. (c) The portion of a half-coupling fastened to the end of a hose. 9. (Shipbuilding)  The joint where two planks in a strake meet. 10. (Carp.)  A kind of hinge used in hanging doors, etc.; -- so named because fastened on the edge of the door, which butts against the casing, instead of on its face, like the strap hinge; also called butt hinge. 11. (Leather Trade)  The thickest and stoutest part of tanned oxhides, used for soles of boots, harness, trunks. 12. The hut or shelter of the person who attends to the targets in rifle practice. Butt chain (Saddlery), a short chain attached to the end of a tug. -- Butt end. The thicker end of anything. See But end, under 2d But. Amen; and make me die a good old man! That's the butt end of a mother's blessing. Shak. A butt's length, the ordinary distance from the place of shooting to the butt, or mark. -- Butts and bounds (Conveyancing), abuttals and boundaries. In lands of the ordinary rectangular shape, butts are the lines at the ends (F. bouts), and bounds are those on the sides, or sidings, as they were formerly termed. Burrill. -- Bead and butt. See under Bead. -- Butt and butt, joining end to end without overlapping, as planks. -- Butt weld (Mech.), a butt joint, made by welding together the flat ends, or edges, of a piece of iron or steel, or of separate pieces, without having them overlap. See Weld. -- Full butt, headfirst with full force. [Colloq.] \"The corporal . . . ran full butt at the lieutenant.\" Marryat.\n\n1. To join at the butt, end, or outward extremity; to terminate; to be bounded; to abut. [Written also but.] And Barnsdale there doth butt on Don's well-watered ground. Drayton. 2. To thrust the head forward; to strike by thrusting the head forward, as an ox or a ram. [See Butt, n.] A snow-white steer before thine altar led, Butts with his threatening brows. Dryden.\n\nTo strike by thrusting the head against; to strike with the head. Two harmless lambs are butting one the other. Sir H. Wotton.\n\nA large cask or vessel for wine or beer. It contains two hogsheads. Note: A wine butt contains 126 wine gallons (= 105 imperial gallons, nearly); a beer butt 108 ale gallons (= about 110 imperial gallons).\n\nThe common English flounder."}