{"word":"by","definition":"1. In the neighborhood of; near or next to; not far from; close to; along with; as, come and sit by me. By foundation or by shady rivulet He sought them both. Milton. 2. On; along; in traversing. Compare 5. Long labors both by sea and land he bore. Dryden. By land, by water, they renew the charge. Pope. 3. Near to, while passing; hence, from one to the other side of; past; as, to go by a church. 4. Used in specifying adjacent dimensions; as, a cabin twenty feet by forty. 5. Against. [Obs.] Tyndale [1. Cor. iv. 4]. 6. With, as means, way, process, etc.; through means of; with aid of; through; through the act or agency of; as, a city is destroyed by fire; profit is made by commerce; to take by force. Note: To the meaning of by, as denoting means or agency, belong, more or less closely, most of the following uses of the word: (a) It points out the author and producer; as, \"Waverley\", a novel by Sir W.Scott; a statue by Canova; a sonata by Beethoven. (b) In an oath or adjuration, it indicates the being or thing appealed to as sanction; as, I affirm to you by all that is sacred; he swears by his faith as a Christian; no, by Heaven. (c) According to; by direction, authority, or example of; after; -- in such phrases as, it appears by his account; ten o'clock by my watch; to live by rule; a model to build by. (d) At the rate of; according to the ratio or proportion of; in the measure or quantity of; as, to sell cloth by the yard, milk by the quart, eggs by the dozen, meat by the pound; to board by the year. (e) In comparison, it denotes the measure of excess or deficiency; when anything is increased or diminished, it indicates the measure of increase or diminution; as, larger by a half; older by five years; to lessen by a third. (f) It expresses continuance or duration; during the course of; within the period of; as, by day, by night. (g) As soon as; not later than; near or at; -- used in expressions of time; as, by this time the sun had risen; he will be here by two o'clock. Note: In boxing the compass, by indicates a pint nearer to, or towards, the next cardinal point; as, north by east, i.e., a point towards the east from the north; northeast by east, i.e., on point nearer the east than northeast is. Note: With is used instead of by before the instrument with which anything is done; as, to beat one with a stick; the board was fastened by the carpenter with nails. But there are many words which may be regarded as means or processes, or, figuratively, as instruments; and whether with or by shall be used with them is a matter of arbitrary, and often, of unsettled usage; as, to a reduce a town by famine; to consume stubble with fire; he gained his purpose by flattery; he entertained them with a story; he distressed us with or by a recital of his sufferings. see With. By all means, most assuredly; without fail; certainly. -- By and by. (a) Close together (of place). [Obs.] \"Two yonge knightes liggyng [lying] by and by.\" Chaucer. (b) Immediately; at once. [Obs.] \"When . . . persecution ariseth because of the word, by and by he is offended.\" Matt. xiii. 21. (c) Presently; pretty soon; before long. Note: In this phrase, by seems to be used in the sense of nearness in time, and to be repeated for the sake of emphasis, and thus to be equivalent to \"soon, and soon,\" that is instantly; hence, -- less emphatically, -- pretty soon, presently. -- By one's self, with only one's self near; alone; solitary.- By the bye. See under Bye. -- By the head (Naut.), having the bows lower than the stern; -- said of a vessel when her head is lower in the water than her stern. If her stern is lower, she is by the stern. -- By the lee, the situation of a vessel, going free, when she has fallen off so much as to bring the wind round her stern, and to take her sails aback on the other side. -- By the run, to let go by the run, to let go altogether, instead of slacking off. -- By the way, by the bye; -- used to introduce an incidental or secondary remark or subject. -Day by day, One by one, Piece by piece, etc., each day, each one, each piece, etc., by itself singly or separately; each severally. -- To come by, to get possession of; to obtain. -- To do by, to treat, to behave toward. -- To set by, to value, to esteem. -- To stand by, to aid, to support. Note: The common phrase good-by is equivalent to farewell, and would be better written good-bye, as it is a corruption of God be with you (b'w'ye).\n\n1. Near; in the neighborhood; present; as, there was no person by at the time. 2. Passing near; going past; past; beyond; as, the procession has gone by; a bird flew by. 3. Aside; as, to lay by; to put by.\n\nOut of the common path; aside; -- used in composition, giving the meaning of something aside, secondary, or incidental, or collateral matter, a thing private or avoiding notice; as, by-line, by-place, by-play, by-street. It was formerly more freely used in composition than it is now; as, by-business, by-concernment, by- design, by-interest, etc."}