{"word":"cabbage","definition":"1. An esculent vegetable of many varieties, derived from the wild Brassica oleracea of Europe. The common cabbage has a compact head of leaves. The cauliflower, Brussels sprouts, etc., are sometimes classed as cabbages. 2. The terminal bud of certain palm trees, used, like, cabbage, for food. See Cabbage tree, below. 3. The cabbage palmetto. See below. Cabbage aphis (Zoöl.), a green plant-louse (Aphis brassicæ) which lives upon the leaves of the cabbage. -- Cabbage Beetle (Zoöl.), a small, striped flea-beetle (Phyllotreta vittata) which lives, in the larval state, on the roots, and when adult, on the leaves, of cabbage and other cruciferous plants. -- Cabbage butterfly (Zoöl.), a white butterfly (Pieris rapæ of both Europe and America, and the Allied P. oleracea, a native American species) which, in the larval state, devours the leaves of the cabbage and the turnip. See Cabbage worm, below. -- Cabbage Fly (Zoöl.), a small two-winged fly (Anthomyia brassicæ), which feeds, in the larval or maggot state, on the roots of the cabbage, often doing much damage to the crop. -- Cabbage head, the compact head formed by the leaves of a cabbage; -- contemptuously or humorously, and colloquially, a very stupid and silly person; a numskull. -- Cabbage palmetto, a species of palm tree (Sabal Palmetto) found along the coast from North Carolina to Florida. -- Cabbage rose (Bot.), a species of rose (Rosa centifolia) having large and heavy blossoms. -- Cabbage tree, Cabbage palm, a name given to palms having a terminal bud called a cabbage, as the Sabal Palmetto of the United States, and the Euterpe oleracea and Oreodoxa oleracea of the West Indies. -- Cabbage worm (Zoöl.), the larva of several species of moths and butterfies, which attacks cabbages. The most common is usully the larva of a white butterfly. See Cabbage Butterfly, above. The cabbage cutworms, which eat off the stalks or young plants during the night, are the larvæ of several species of moths, of the genus Agrotis. See Cutworm. -- Sea cabbage.(Bot.) (a) Sea kale (b). The original Plant (Brassica oleracea), from which the cabbage, cauliflower, , broccoli, etc., have been derived by cultivation. -- Thousand-headed cabbage. See Brussels sprouts.\n\nTo form a head like that the cabbage; as, to make lettuce cabbage. Johnson.\n\nTo purloin or embezzle, as the pieces of cloth remaining after cutting out a garment; to pilfer. Your tailor . . . cabbages whole yards of cloth. Arbuthnot.\n\nCloth or clippings cabbaged or purloined by one who cuts out garments."}