{"word":"call","definition":"1. To command or request to come or be present; to summon; as, to call a servant. Call hither Clifford; bid him come amain Shak. 2. To summon to the discharge of a particular duty; to designate for an office, or employment, especially of a religious character; -- often used of a divine summons; as, to be called to the ministry; sometimes, to invite; as, to call a minister to be the pastor of a church. Paul . . . called to be an apostle Rom. i. 1. The Holy Ghost said, Separate me Barnabas and Saul for the work whereunto I have called them. Acts xiii. 2. 3. To invite or command to meet; to convoke; -- often with together; as, the President called Congress together; to appoint and summon; as, to call a meeting of the Board of Aldermen. Now call we our high court of Parliament. Shak. 4. To give name to; to name; to address, or speak of, by a specifed name. If you would but call me Rosalind. Shak. And God called the light Day, and the darkness he called Night. Gen. i. 5. 5. To regard or characterize as of a certain kind; to denominate; to designate. What God hath cleansed, that call not thou common. Acts x. 15. 6. To state, or estimate, approximately or loosely; to characterize without strict regard to fact; as, they call the distance ten miles; he called it a full day's work. [The] army is called seven hundred thousand men. Brougham. 7. To show or disclose the class, character, or nationality of. [Obs.] This speech calls him Spaniard. Beau. & Fl. 8. To utter in a loud or distinct voice; -- often with off; as, to call, or call off, the items of an account; to call the roll of a military company. No parish clerk who calls the psalm so clear. Gay. 9. To invoke; to appeal to. I call God for a witness. 2 Cor. i. 23 [Rev. Ver. ] 10. To rouse from sleep; to awaken. If thou canst awake by four o' the clock. I prithee call me. Sleep hath seized me wholly. Shak. To call a bond, to give notice that the amount of the bond will be paid. -- To call a party (Law), to cry aloud his name in open court, and command him to come in and perform some duty requiring his presence at the time on pain of what may befall him. -- To call back, to revoke or retract; to recall; to summon back. -- To call down, to pray for, as blessing or curses. -- To call forth, to bring or summon to action; as, to call forth all the faculties of the mind. -- To call in, (a) To collect; as, to call in debts or money; ar to withdraw from cirulation; as, to call in uncurrent coin. (b) To summon to one's side; to invite to come together; as, to call in neighbors. -- To call (any one) names, to apply contemptuous names (to any one). -- To call off, to summon away; to divert; as, to call off the attention; to call off workmen from their employment. -- To call out. (a) To summon to fight; to challenge. (b) To summon into service; as, to call out the militia. -- To call over, to recite separate particulars in order, as a roll of names. -- To call to account, to demand explanation of. -- To call to mind, to recollect; to revive in memory. -- To call to order, to request to come to order; as: (a) A public meeting, when opening it for business. (b) A person, when he is transgressing the rules of debate. -- To call to the bar, to admit to practice in courts of law. -- To call up. (a) To bring into view or recollection; as to call up the image of deceased friend. (b) To bring into action or discussion; to demand the consideration of; as, to call up a bill before a legislative body. Syn. -- To name; denominate; invite; bid; summon; convoke; assemble; collect; exhort; warn; proclaim; invoke; appeal to; designate. To Call, Convoke, Summon. Call is the generic term; as, to call a public meeting. To convoke is to require the assembling of some organized body of men by an act of authority; as, the king convoked Parliament. To summon is to require attendance by an act more or less stringent anthority; as, to summon a witness.\n\n1. To speak in loud voice; to cry out; to address by name; -- sometimes with to. You must call to the nurse. Shak. The angel of God called to Hagar. Gen. xxi. 17. 2. To make a demand, requirement, or request. They called for rooms, and he showed them one. Bunyan. 3. To make a brief visit; also, to stop at some place designated, as for orders. He ordered her to call at the house once a week. Temple. To call for (a) To demand; to require; as, a crime calls for punishment; a survey, grant, or deed calls for the metes and bounds, or the quantity of land, etc., which it describes. (b) To give an order for; to request. \"Whenever the coach stopped, the sailor called for more ale.\" Marryat. -- To call on, To call upon, (a) To make a short visit to; as, call on a friend. (b) To appeal to; to invite; to request earnestly; as, to call upon a person to make a speech. (c) To solicit payment, or make a demand, of a debt. (d) To invoke or play to; to worship; as, to call upon God. -- To call out To call or utter loudly; to brawl.\n\n1. The act of calling; -- usually with the voice, but often otherwise, as by signs, the sound of some instrument, or by writing; a summons; an entreaty; an invitation; as, a call for help; the bugle's call. \"Call of the trumpet.\" Shak. I rose as at thy call, but found thee not. Milton. 2. A signal, as on a drum, bugle, trumpet, or pipe, to summon soldiers or sailors to duty. 3. (Eccl.)  An invitation to take charge of or serve a church as its pastor. 4. A requirement or appeal arising from the circumstances of the case; a moral requirement or appeal. Dependence is a perpetual call upon hummanity. Addison. Running into danger without any call of duty. Macaulay. 5. A divine vocation or summons. St. Paul himself believed he did well, and that he had a call to it, when he persecuted the Christians. Locke. 6. Vocation; employment. Note: [In this sense, calling is generally used.] 7. A short visit; as, to make a call on a neighbor; also, the daily coming of a tradesman to solicit orders. The baker's punctual call. Cowper. 8. (Hunting)  A note blown on the horn to encourage the hounds. 9. (Naut.)  A whistle or pipe, used by the boatswain and his mate, to summon the sailors to duty. 10. (Fowling)  The cry of a bird; also a noise or cry in imitation of a bird; or a pipe to call birds by imitating their note or cry. 11. (Amer. Land Law)  A reference to, or statement of, an object, course, distance, or other matter of description in a survey or grant reguiring or calling for a carresponding object, etc., on the land. 12. The privilege to demand the delivery of stock, grain, or any commodity, at a fixed, price, at or within a certain time agreed on. [Brokers' Cant] 13. See Assessment, 4. At call, or On call, liable to be demanded at any moment without previous notice; as money on deposit. -- Call bird, a bird taught to allure others into a snare. -- Call boy (a) A boy who calls the actors in a theater; a boy who transmits the orders of the captain of a vessel to the engineer, helmsman, etc. (b) A waiting boy who answers a cal, or cames at the ringing of a bell; a bell boy. -- Call note, the note naturally used by the male bird to call the female. It is artifically applied by birdcatchers as a decoy. Latham. -- Call of the house (Legislative Bodies), a calling over the names of members, to discover who is absent, or for other purposes; a calling of names with a view to obtaining the ayes and noes from the persons named. -- Call to the bar, admission to practice in the courts."}