{"word":"camp","definition":"1. The ground or spot on which tents, huts, etc., are erected for shelter, as for an army or for lumbermen, etc. Shzk. 2. A collection of tents, huts, etc., for shelter, commonly arranged in an orderly manner. Forming a camp in the neighborhood of Boston. W. Irving. 3. A single hut or shelter; as, a hunter's camp. 4. The company or body of persons encamped, as of soldiers, of surveyors, of lumbermen, etc. The camp broke up with the confusion of a flight. Macaulay. 5. (Agric.)  A mound of earth in which potatoes and other vegetables are stored for protection against frost; -- called also burrow and pie. [Prov. Eng.] 6. Etym: [Cf. OE. & AS. camp contest, battle. See champion.]  An ancient game of football, played in some parts of England. Halliwell. Camp bedstead, a light bedstead that can be folded up onto a small space for easy transportation. -- camp ceiling (Arch.), a kind ceiling often used in attics or garrets, in which the side walls are inclined inward at the top, following the slope of the rafters, to meet the plane surface of the upper ceiling. -- Camp chair, a light chair that can be folded up compactly for easy transportation; the seat and back are often made of strips or pieces of carpet. -- Camp fever, typhus fever. -- Camp follower, a civilian accompanying an army, as a sutler, servant, etc. -- Camp meeting, a religious gathering for open-air preaching, held in some retired spot, chiefty by Methodists. It usualy last for several days, during which those present lodge in tents, temporary houses, or cottages. -- Camp stool, the same as camp chair, except that the stool has no back. -- Flying camp (Mil.), a camp or body of troops formed for rapid motion from one place to another. Farrow. -- To pitch (a) camp, to set up the tents or huts of a camp. -- To strike camp, to take down the tents or huts of a camp.\n\nTo afford rest or lodging for, as an army or travelers. Had our great palace the capacity To camp this host, we all would sup together. Shak.\n\n1. To pitch or prepare a camp; to encamp; to lodge in a camp; -- often with out. They camped out at night, under the stars. W. Irving. 2. Etym: [See Camp, n., 6]  To play the game called camp. [Prov. Eng.] Tusser."}