{"word":"canon","definition":"1. A law or rule. Or that the Everlasting had not fixed His canon 'gainst self- slaughter. Shak. 2. (Eccl.)  A law, or rule of doctrine or discipline, enacted by a council and confirmed by the pope or the sovereign; a decision, regulation, code, or constitution made by ecclesiastical authority. Various canons which were made in councils held in the second centry. Hock. 3. The collection of books received as genuine Holy Scriptures, called the sacred canon, or general rule of moral and religious duty, given by inspiration; the Bible; also, any one of the canonical Scriptures. See Canonical books, under Canonical, a. 4. In monasteries, a book containing the rules of a religious order. 5. A catalogue of saints sckowledged and canonized in the Roman Catholic Church. 6. A member of a cathedral chapter; a person who possesses a prebend in a cathedral or collegiate church. 7. (Mus.)  A musical composition in which the voice begin one after another, at regular intervals, succesively taking up the same subject. It either winds up with a coda (tailpiece), or, as each voice finishes, commences anew, thus forming a perpetual fugue or round. It is the strictest form of imitation. See Imitation. 8. (Print.)  The largest size of type having a specific name; -- so called from having been used for printing the canons of the church. 9. The part of a bell by which it is suspended; -- called also ear and shank. Note: [See Illust. of Bell.] Knight. 10. (Billiards)  See Carom. Apostolical canons. See under Apostolical. -- Augustinian canons, Black canons. See under Augustinian. -- Canon capitular, Canon residentiary, a resident member of a cathedral chapter (during a part or the whole of the year). -- Canon law. See under Law. -- Canon of the Mass (R. C. Ch.), that part of the mass, following the Sanctus, which never changes. -- Honorary canon, a canon who neither lived in a monastery, nor kept the canonical hours. -- Minor canon (Ch. of Eng.), one who has been admitted to a chapter, but has not yet received a prebend. -- Regular canon (R. C. Ch.), one who lived in a conventual community and follower the rule of St. Austin; a Black canon. -- Secular canon (R. C. Ch.), one who did not live in a monastery, but kept the hours.\n\nA deep gorge, ravine, or gulch, between high and steep banks, worn by water courses. [Mexico & Western U. S.]"}