{"word":"capital","definition":"1. Of or pertaining to the head. [Obs.] Needs must the Serpent now his capital bruise Expect with mortal pain. Milton. 2. Having reference to, or involving, the forfeiture of the head or life; affecting life; punishable with death; as, capital trials; capital punishment. Many crimes that are capital among us. Swift. To put to death a capital offender. Milton. 3. First in importance; chief; principal. A capital article in religion Atterbury. Whatever is capital and essential in Christianity. I. Taylor. 4. Chief, in a political sense, as being the seat of the general government of a state or nation; as, Washington and Paris are capital cities. 5. Of first rate quality; excellent; as, a capital speech or song. [Colloq.] Capital letter Etym: [F, lettre capitale] (Print.), a leading or heading letter, used at the beginning of a sentence and as the first letter of certain words, distinguished, for the most part, both by different form and larger size, from the small (lower-case) letters, which form the greater part of common print or writing. -- Small capital letters have the form of capital letters and height of the body of the lower-case letters. -- Capital stock, money, property, or stock invested in any business, or the enterprise of any corporation or institution. Abbott. Syn. -- Chief; leading; controlling; prominent.\n\n1. (Arch.)  The head or uppermost member of a column, pilaster, etc. It consists generally of three parts, abacus, bell (or vase), and necking. See these terms, and Column. 2. Etym: [Cf. F. capilate, fem., sc. ville.] (Geog.)  The seat of government; the chief city or town in a country; a metropolis. \"A busy and splendid capital\" Macauly. 3. Etym: [Cf. F. capital.]  Money, property, or stock employed in trade, manufactures, etc.; the sum invested or lent, as distinguished from the income or interest. See Capital stock, under Capital, a. 4. (Polit. Econ.)  That portion of the produce of industry, which may be directly employed either to support human beings or to assist in production. M'Culloch. Note: When wealth is used to assist production it is called capital. The capital of a civilized community includes fixed capital (i.e. buildings, machines, and roads used in the course of production and exchange) amd circulating capital (i.e., food, fuel, money, etc., spent in the course of production and exchange). T. Raleing. 5. Anything which can be used to increase one's power or influence. He tried to make capital out of his rival's discomfiture. London Times. 6. (Fort.)  An imaginary line dividing a bastion, ravelin, or other work, into two equal parts. 7. A chapter, or section, of a book. [Obs.] Holy St. Bernard hath said in the 59th capital. Sir W. Scott. 8. (Print.)  See Capital letter, under Capital, a. Active capital. See under Active, -- Small capital (Print.), a small capital letter. See under Capital, a. -- To live on one's capital, to consume one's capital without producing or accumulating anything to replace it."}