{"word":"card","definition":"1. A piece of pasteboard, or thick paper, blank or prepared for various uses; as, a playing card; a visiting card; a card of invitation; pl. a game played with cards. Our first cards were to Carabas House. Thackeray. 2. A published note, containing a brief statement, explanation, request, expression of thanks, or the like; as, to put a card in the newspapers. Also, a printed programme, and (fig.), an attraction or inducement; as, this will be a good card for the last day of the fair. 3. A paper on which the points of the compass are marked; the dial or face of the mariner's compass. All the quartere that they know I' the shipman's card. Shak. 4. (Weaving)  A perforated pasteboard or sheet-metal plate for warp threads, making part of the Jacquard apparatus of a loom. See Jacquard. 5. An indicator card. See under Indicator. Business card, a card on which is printed an advertisement or business address. -- Card basket (a) A basket to hold visiting cards left by callers. (b) A basket made of cardboard. -- Card catalogue. See Catalogue. -- Card rack, a rack or frame for holding and displaying business or visiting card. -- Card table, a table for use inplaying cards, esp. one having a leaf which folds over. -- On the cards, likely to happen; foretold and expected but not yet brought to pass; -- a phrase of fortune tellers that has come into common use; also, according to the programme. -- Playing card, cards used in playing games; specifically, the cards cards used playing which and other games of chance, and having each pack divided onto four kinds or suits called hearts, diamonds, clubs, and spades. The full or whist pack contains fifty-two cards. -- To have the cards in one's own hands, to have the winning cards; to have the means of success in an undertaking. -- To play one's cards well, to make no errors; to act shrewdly. -- To play snow one's cards, to expose one's plants to rivals or foes. -- To speak by the card, to speak from information and definitely, not by guess as in telling a ship's bearing by the compass card. -- Visiting card, a small card bearing the name, and sometimes the address, of the person presenting it.\n\nTo play at cards; to game. Johnson.\n\n1. An instrument for disentangling and arranging the fibers of cotton, wool, flax, etc.; or for cleaning and smoothing the hair of animals; -- usually consisting of bent wire teeth set closely in rows in a thick piece of leather fastened to a back. 2. A roll or sliver of fiber (as of wool) delivered from a carding machine. Card clothing, strips of wire-toothed card used for covering the cylinders of carding machines.\n\n1. To comb with a card; to cleanse or disentangle by carding; as, to card wool; to card a horse. These card the short comb the longer flakes. Dyer. 2. To clean or clear, as if by using a card. [Obs.] This book [must] be carded and purged. T. Shelton. 3. To mix or mingle, as with an inferior or weaker article. [Obs.] You card your beer, if you guests being to be drunk. -- half small, half strong. Greene. Note: In the manufacture of wool, cotton, etc., the process of carding disentangles and collects together all the fibers, of whatever length, and thus differs from combing, in which the longer fibers only are collected, while the short straple is combed away. See Combing."}