{"word":"case","definition":"1. A box, sheath, or covering; as, a case for holding goods; a case for spectacles; the case of a watch; the case (capsule) of a cartridge; a case (cover) for a book. 2. A box and its contents; the quantity contained in a box; as, a case of goods; a case of instruments. 3. (Print.)  A shallow tray divided into compartments or \"boxes\" for holding type. Note: Cases for type are usually arranged in sets of two, called respectively the upper and the lower case. The upper case contains capitals, small capitals, accented; the lower case contains the small letters, figures, marks of punctuation, quadrats, and spaces. 4. An inclosing frame; a casing; as, a door case; a window case. 5. (Mining)  A small fissure which admits water to the workings. Knight.\n\n1. To cover or protect with, or as with, a case; to inclose. The man who, cased in steel, had passed whole days and nights in the saddle. Prescott. 2. To strip the skin from; as, to case a box. [Obs.]\n\n1. Chance; accident; hap; opportunity. [Obs.] By aventure, or sort, or cas. Chaucer. 2. That which befalls, comes, or happens; an event; an instance; a circumstance, or all the circumstamces; condition; state of things; affair; as, a strange case; a case of injustice; the case of the Indian tribes. In any case thou shalt deliver him the pledge. Deut. xxiv. 13. If the case of the man be so with his wife. Matt. xix. 10. And when a lady's in the case. You know all other things give place. Gay. You think this madness but a common case. Pope. I am in case to justle a constable, Shak. 3. (Med. & Surg.)  A patient under treatment; an instance of sickness or injury; as, ten cases of fever; also, the history of a disease or injury. A proper remedy in hypochondriacal cases. Arbuthnot. 4. (Law)  The matters of fact or conditions involved in a suit, as distinguished from the questions of law; a suit or action at law; a cause. Let us consider the reason of the case, for nothing is law that is not reason. Sir John Powell. Not one case in the reports of our courts. Steele. 5. (Gram.)  One of the forms, or the inflections or changes of form, of a noun, pronoun, or adjective, which indicate its relation to other words, and in the aggregate constitute its declension; the relation which a noun or pronoun sustains to some other word. Case is properly a falling off from the nominative or first state of word; the name for which, however, is now, by extension of its signification, applied also to the nominative. J. W. Gibbs. Note: Cases other than the nominative are oblique cases. Case endings are terminations by which certain cases are distinguished. In old English, as in Latin, nouns had several cases distinguished by case endings, but in modern English only that of the possessive case is retained. Action on the case (Law), according to the old classification (now obsolete), was an action for redress of wrongs or injuries to person or property not specially provided against by law, in which the whole cause of complaint was set out in the writ; -- called also trespass on the case, or simply case. -- All a case, a matter of indifference. [Obs.] \"It is all a case to me.\" L'Estrange. -- Case at bar. See under Bar, n. -- Case divinity, casuistry. -- Case lawyer, one versed in the reports of cases rather than in the science of the law. -- Case stated or agreed on (Law), a statement in writing of facts agreed on and submitted to the court for a decision of the legal points arising on them. -- A hard case, an abandoned or incorrigible person. [Colloq.] -- In any case, whatever may be the state of affairs; anyhow. -- In case, or In case that, if; supposing that; in the event or contingency; if it should happen that. \"In case we are surprised, keep by me.\" W. Irving. -- In good case, in good condition, health, or state of body. -- To put a case, to suppose a hypothetical or illustrative case. Syn. -- Situation, condition, state; circumstances; plight; predicament; occurrence; contingency; accident; event; conjuncture; cause; action; suit.\n\nTo propose hypothetical cases. [Obs.] \"Casing upon the matter.\" L'Estrange."}