{"word":"cat","definition":"1. (Zoöl.)  An animal of various species of the genera Felis and Lynx. The domestic cat is Felis domestica. The European wild cat (Felis catus) is much larger than the domestic cat. In the United States the name wild cat is commonly applied to the bay lynx (Lynx rufus) See Wild cat, and Tiger cat. Note: The domestic cat includes many varieties named from their place of origin or from some peculiarity; as, the Angora cat; the Maltese cat; the Manx cat. Note: The word cat is also used to designate other animals, from some fancied resemblance; as, civet cat, fisher cat, catbird, catfish shark, sea cat. 2. (Naut.) (a) A strong vessel with a narrow stern, projecting quarters, and deep waist. It is employed in the coal and timber trade. (b) A strong tackle used to draw an anchor up to the cathead of a ship. Totten. 3. A double tripod (for holding a plate, etc.), having six feet, of which three rest on the ground, in whatever position in is placed. 4. An old game; (a) The game of tipcat and the implement with which it is played. See Tipcat. (c) A game of ball, called, according to the number of batters, one old cat, two old cat, etc. 5. A cat o' nine tails. See below. Angora cat, blind cat, See under Angora, Blind. -- Black cat the fisher. See under Black. -- Cat and dog, like a cat and dog; quarrelsome; inharmonius. \"I am sure we have lived a cat and dog life of it.\" Coleridge. -- Cat block (Naut.), a heavy iron-strapped block with a large hook, part of the tackle used in drawing an anchor up to the cathead. -- Cat hook (Naut.), a strong hook attached to a cat block. -- Cat nap, a very short sleep. [Colloq.] -- Cat o' nine tails, an instrument of punishment consisting of nine pieces of knotted line or cord fastened to a handle; -- formerly used to flog offenders on the bare back. -- Cat's cradle, game played, esp. by children, with a string looped on the fingers so, as to resemble small cradle. The string is transferred from the fingers of one to those of another, at each transfer with a change of form. See Cratch, Cratch cradle. -- To let the cat out of the bag, to tell a secret, carelessly or willfully. [Colloq.] -- Bush cat, the serval. See Serval.\n\nTo bring to the cathead; as, to cat an anchor. See Anchor. Totten."}