{"word":"cause","definition":"1. That which produces or effects a result; that from which anything proceeds, and without which it would not exist. Cause is substance exerting its power into act, to make one thing begin to be. Locke. 2. That which is the occasion of an action or state; ground; reason; motive; as, cause for rejoicing. 3. Sake; interest; advantage. [Obs.] I did it not for his cause. 2 Cor. vii. 12. 4. (Law)  A suit or action in court; any legal process by which a party endeavors to obtain his claim, or what he regards as his right; case; ground of action. 5. Any subject of discussion or debate; matter; question; affair in general. What counsel give you in this weighty cause! Shak. 6. The side of a question, which is espoused, advocated, and upheld by a person or party; a principle which is advocated; that which a person or party seeks to attain. God befriend us, as our cause is just. Shak. The part they take against me is from zeal to the cause. Burke. Efficient cause, the agent or force that produces a change or redult. -- Final cause, the end, design, or object, for which anything is done. -- Formal cause, the elements of a conception which make the conception or the thing conceived to be what it is; or the idea viewed as a formative principle and coöperating with the matter. -- Material cause, that of which anything is made. -- Proximate cause. See under Proximate. -- To make common cause with, to join with in purposes and aims. Macaulay. Syn. -- Origin; source; mainspring; motive; reason; incitement; inducement; purpose; object; suit; action.\n\nTo effect as an agent; to produce; to be the occasion of; to bring about; to bring into existence; to make; -- usually followed by an infinitive, sometimes by that with a finite verb. I will cause it to rain upon the earth forty days. Gen. vii. 4. Cause that it be read also in the church of the Laodiceans. Col. iv. 16. Syn. -- To create; produce; beget; effect; occasion; originate; induce; bring about.\n\nTo assign or show cause; to give a reason; to make excuse. [Obs.] Spenser.\n\nAbbreviation of Because. B. Jonson."}