{"word":"center","definition":"1. A point equally distant from the extremities of a line, figure, or body, or from all parts of the circumference of a circle; the middle point or place. 2. The middle or central portion of anything. 3. A principal or important point of concentration; the nucleus around which things are gathered or to which they tend; an object of attention, action, or force; as, a center of attaction. 4. The earth. [Obs.] Shak. 5. Those members of a legislative assembly (as in France) who support the existing government. They sit in the middle of the legislative chamber, opposite the presiding officer, between the conservatives or monarchists, who sit on the right of the speaker, and the radicals or advanced republicans who occupy the seats on his left, See Right, and Left. 6. (Arch.)  A temporary structure upon which the materials of a vault or arch are supported in position util the work becomes self-supporting. 7. (Mech.) (a) One of the two conical steel pins, in a lathe, etc., upon which the work is held, and about which it revolves. (b) A conical recess, or indentation, in the end of a shaft or other work, to receive the point of a center, on which the work can turn, as in a lathe. Note: In a lathe the live center is in the spindle of the head stock; the dead center is on the tail stock. Planer centers are stocks carrying centers, when the object to be planed must be turned on its axis. Center of an army, the body or troops ossupying the place in the line between the wings. -- Center of a curve or surface (Geom.) (a) A point such that every line drawn through the point and terminated by the curve or surface is bisected at the point. (b) The fixed point of reference in polar coördinates. See Coördinates. -- Center of curvature of a curve (Geom.), the center of that circle which has at any given point of the curve closer contact with the curve than has any other circle whatever. See Circle. -- Center of a fleet, the division or column between the van and rear, or between the weather division and the lee. -- Center of gravity (Mech.), that point of a body about which all its parts can be balanced, or which being supported, the whole body will remain at rest, though acted upon by gravity. -- Center of gyration (Mech.), that point in a rotating body at which the whole mass might be concentrated (theoretically) without altering the resistance of the intertia of the body to angular acceleration or retardaton. -- Center of inertia (Mech.), the center of gravity of a body or system of bodies. -- Center of motion, the point which remains at rest, while all the other parts of a body move round it. -- Center of oscillation, the point at which, if the whole matter of a suspended body were collected, the time of oscillation would be the same as it is in the actual form and state of the body. -- Center of percussion, that point in a body moving about a fixed axis at which it may strike an obstacle without communicating a shock to the axis. -- Center of pressure (Hydros.), that point in a surface pressed by a fluid, at which, if a force equal to the whole pressure and in the same line be applied in a contrary direction, it will balance or counteract the whole pressure of the fluid.\n\n1. To be placed in a center; to be central. 2. To be collected to a point; to be concentrated; to rest on, or gather about, as a center. Where there is no visible truth wherein to center, error is as wide as men's fancies. Dr. H. More. Our hopes must center in ourselves alone. Dryden.\n\n1. To place or fix in the center or on a central point. Milton. 2. To collect to a point; to concentrate. Thy joys are centered all in me alome. Prior. 3. (Mech.)  To form a recess or indentation for the reception of a center."}