{"word":"chain","definition":"1. A series of links or rings, usually of metal, connected, or fitted into one another, used for various purposes, as of support, of restraint, of ornament, of the exertion and transmission of mechanical power, etc. [They] put a chain of gold about his neck. Dan. v. 29. 2. That which confines, fetters, or secures, as a chain; a bond; as, the chains of habit. Driven down To chains of darkness and the undying worm. Milton. 3. A series of things linked together; or a series of things connected and following each other in succession; as, a chain of mountains; a chain of events or ideas. 4. (Surv.)  An instrument which consists of links and is used in measuring land. Note: One commonly in use is Gunter's chain, which consists of one hundred links, each link being seven inches and ninety-two one hundredths in length; making up the total length of rods, or sixty- six, feet; hence, a measure of that length; hence, also, a unit for land measure equal to four rods square, or one tenth of an acre. 5. pl. (Naut.)  Iron links bolted to the side of a vessel to bold the dead-eyes connected with the shrouds; also, the channels. 6. (Weaving)  The warp threads of a web. Knight. Chain belt (Mach.), a belt made of a chain; -- used for transmitting power. -- Chain boat, a boat fitted up for recovering lost cables, anchors, etc. -- Chain bolt (a) (Naut.) The bolt at the lower end of the chain plate, which fastens it to the vessel's side. (b) A bolt with a chain attached for drawing it out of position. -- Chain bond. See Chain timber. -- Chain bridge, a bridge supported by chain cables; a suspension bridge. -- Chain cable, a cable made of iron links. -- Chain coral (Zoöl.), a fossil coral of the genus Halysites, common in the middle and upper Silurian rocks. The tubular corallites are united side by side in groups, looking in an end view like links of a chain. When perfect, the calicles show twelve septa. -- Chain coupling. (a) A shackle for uniting lengths of chain, or connecting a chain with an object. (b) (Railroad) Supplementary coupling together of cars with a chain. -- Chain gang, a gang of convicts chained together. -- Chain hook (Naut.), a hook, used for dragging cables about the deck. -- Chain mail, flexible, defensive armor of hammered metal links wrought into the form of a garment. -- Chain molding (Arch.), a form of molding in imitation of a chain, used in the Normal style. -- Chain pier, a pier suspended by chain. -- Chain pipe (Naut.), an opening in the deck, lined with iron, through which the cable is passed into the lockers or tiers. -- Chain plate (Shipbuilding), one of the iron plates or bands, on a vessel's side, to which the standing rigging is fastened. -- Chain pulley, a pulley with depressions in the periphery of its wheel, or projections from it, made to fit the links of a chain. -- Chain pumps. See in the Vocabulary. -- Chain rule (Arith.), a theorem for solving numerical problems by composition of ratios, or compound proportion, by which, when several ratios of equality are given, the consequent of each being the same as the antecedent of the next, the relation between the first antecedent and the last consequent is discovered. -- Chain shot (Mil.), two cannon balls united by a shot chain, formerly used in naval warfare on account of their destructive effect on a ship's rigging. -- Chain stitch. See in the Vocabulary. -- Chain timber. (Arch.) See Bond timber, under Bond. -- Chain wales. (Naut.) Same as Channels. -- Chain wheel. See in the Vocabulary. -- Closed chain, Open chain (Chem.), terms applied to the chemical structure of compounds whose rational formulæ are written respectively in the form of a closed ring (see Benzene nucleus, under Benzene), or in an open extended form. -- Endless chain, a chain whose ends have been united by a link.\n\n1. To fasten, bind, or connect with a chain; to fasten or bind securely, as with a chain; as, to chain a bulldog. Chained behind the hostile car. Prior. 2. To keep in slavery; to enslave. And which more blest who chained his country, say Or he whose virtue sighed to lose a day Pope. 3. To unite closely and strongly. And in this vow do chain my soul to thine. Shak. 4. (Surveying)  To measure with the chain. 5. To protect by drawing a chain across, as a harbor."}