{"word":"challenge","definition":"1. An invitation to engage in a contest or controversy of any kind; a defiance; specifically, a summons to fight a duel; also, the letter or message conveying the summons. A challenge to controversy. Goldsmith. 2. The act of a sentry in halting any one who appears at his post, and demanding the countersign. 3. A claim or demand. [Obs.] There must be no challenge of superiority. Collier. 4. (Hunting)  The opening and crying of hounds at first finding the scent of their game. 5. (Law)  An exception to a juror or to a member of a court martial, coupled with a demand that he should be held incompetent to act; the claim of a party that a certain person or persons shall not sit in trial upon him or his cause. Blackstone 6. An exception to a person as not legally qualifed to vote. The challenge must be made when the ballot is offered. [U. S.] Challenge to the array (Law), an exception to the whole panel. -- Challenge to the favor, the alleging a special cause, the sufficiency of which is to be left to those whose duty and office it is to decide upon it. -- Challenge to the polls, an exception taken to any one or more of the individual jurors returned. -- Peremptory challenge, a privilege sometimes allowed to defendants, of challenging a certain number of jurors (fixed by statute in different States) without assigning any cause. -- Principal challenge, that which the law allows to be sufficient if found to be true.\n\n1. To call to a contest of any kind; to call to answer; to defy. I challenge any man to make any pretense to power by right of fatherhood. Locke. 2. To call, invite, or summon to answer for an offense by personal combat. By this I challenge him to single fight. Shak. 3. To claim as due; to demand as a right. Challenge better terms. Addison. 4. To censure; to blame. [Obs.] He complained of the emperors . . . and challenged them for that he had no greater revenues . . . from them. Holland. 5. (Mil.)  To question or demand the countersign from (one who attempts to pass the lines); as, the sentinel challenged us, with \"Who comes there\" 6. To take exception to; question; as, to challenge the accuracy of a statement or of a quotation. 7. (Law)  To object to or take exception to, as to a juror, or member of a court. 8. To object to the reception of the vote of, as on the ground that the person in not qualifed as a voter. [U. S.] To challenge to the array, favor, polls. See under Challenge, n.\n\nTo assert a right; to claim a place. Where nature doth with merit challenge. Shak."}