{"word":"change","definition":"1. To alter; to make different; to cause to pass from one state to another; as, to change the position, character, or appearance of a thing; to change the countenance. Therefore will I change their glory into shame. Hosea. iv. 7. 2. To alter by substituting something else for, or by giving up for something else; as, to change the clothes; to change one's occupation; to change one's intention. They that do change old love for new, Pray gods, they change for worse! Peele. 3. To give and take reciprocally; to exchange; -- followed by with; as, to change place, or hats, or money, with another. Look upon those thousands with whom thou wouldst not, for any interest, change thy fortune and condition. Jer. Taylor. 4. Specifically: To give, or receive, smaller denominations of money (technically called change) for; as, to change a gold coin or a bank bill. He pulled out a thirty-pound note and bid me change it. Goldsmith. To change a horse, or To change hand (Man.), to turn or bear the horse's head from one hand to the other, from the left to right, or from the right to the left. -- To change hands, to change owners. -- To change one's tune, to become less confident or boastful. [Colloq.] -- To change step, to take a break in the regular succession of steps, in marching or walking, as by bringing the hollow of one foot against the heel of the other, and then stepping off with the foot which is in advance. Syn. -- To alter; vary; deviate; substitute; innovate; diversify; shift; veer; turn. See Alter.\n\n1. To be altered; to undergo variation; as, men sometimes change for the better. For I am Lord, I change not. Mal. iii. 6. 2. To pass from one phase to another; as, the moon changes to-morrow night.\n\n1. Any variation or alteration; a passing from one state or form to another; as, a change of countenance; a change of habits or principles. Apprehensions of a change of dynasty. Hallam. All the days of my appointed time will I wait, till my change come. Job xiv. 14. 2. A succesion or substitution of one thing in the place of another; a difference; novelty; variety; as, a change of seasons. Our fathers did for change to France repair. Dryden. The ringing grooves of change. Tennyson. 3. A passing from one phase to another; as, a change of the moon. 4. Alteration in the order of a series; permutation. 5. That which makes a variety, or may be substituted for another. Thirty change (R.V. changes) of garments. Judg. xiv. 12. 6. Small money; the money by means of which the larger coins and bank bills are made available in small dealings; hence, the balance returned when payment is tendered by a coin or note exceeding the sum due. 7. Etym: [See Exchange.]  A place where merchants and others meet to transact business; a building appropriated for mercantile transactions. [Colloq. for Exchange.] 8. A public house; an alehouse. [Scot.] They call an alehouse a change. Burt. 9. (Mus.)  Any order in which a number of bells are struck, other than that of the diatonic scale. Four bells admit twenty-four changes in ringing. Holder. Change of life, the period in the life of a woman when menstruation and the capacity for conception cease, usually occurring between forty-five and fifty years of age. -- Change ringing, the continual production, without repetition, of changes on bells, See def. 9. above. -- Change wheel (Mech.), one of a set of wheels of different sizes and number of teeth, that may be changed or substituted one for another in machinery, to produce a different but definite rate of angular velocity in an axis, as in cutting screws, gear, etc. -- To ring the changes on, to present the same facts or arguments in variety of ways. Syn. -- Variety; variation; alteration; mutation; transition; vicissitude; innovation; novelty; transmutation; revolution; reverse."}