{"word":"chancellor","definition":"A judicial court of chancery, which in England and in the United States is distinctively a court with equity jurisdiction. Note: The chancellor was originally a chief scribe or secretary under the Roman emperors, but afterward was invested with judicial powers, and had superintendence over the other officers of the empire. From the Roman empire this office passed to the church, and every bishop has his chancellor, the principal judge of his consistory. In later times, in most countries of Europe, the chancellor was a high officer of state, keeper of the great seal of the kingdom, and having the supervision of all charters, and like public instruments of the crown, which were authenticated in the most solemn manner. In France a secretary is in some cases called a chancellor. In Scotland, the appellation is given to the foreman of a jury, or assize. In the present German empire, the chancellor is the president of the federal council and the head of the imperial administration. In the United States, the title is given to certain judges of courts of chancery or equity, established by the statutes of separate States. Blackstone. Wharton. Chancellor of a bishop, or of a diocese (R. C. Ch. & ch. of Eng.), a law officer appointed to hold the bishop's court in his diocese, and to assist him in matter of ecclesiastical law. -- Chancellor of a cathedral, one of the four chief dignitaries of the cathedrals of the old foundation, and an officer whose duties are chiefly educational, with special reference to the cultivation of theology. -- Chancellor of the Duchy of Lancaster, an officer before whom, or his deputy, the court of the duchy chamber of Lancaster is held. This is a special jurisdiction. -- Chancellor of a university, the chief officer of a collegiate body. In Oxford, he is elected for life; in Cambridge, for a term of years; and his office is honorary, the chief duties of it devolving on the vice chancellor. -- Chancellor of the exchequer, a member of the British cabinet upon whom devolves the charge of the public income and expenditure as the highest finance minister of the government. -- Chancellor of the order of the Garter (or other military orders), an officer who seals the commissions and mandates of the chapter and assembly of the knights, keeps the register of their proceedings, and delivers their acts under the seal of their order. -- Lord high chancellor of England, the presiding judge in the court of chancery, the highest judicial officer of the crown, and the first lay person of the state after the blood royal. He is created chancellor by the delivery into his custody of the great seal, of which he becomes keeper. He is privy counselor by his office, and prolocutor of the House of Lords by prescription."}