{"word":"chance","definition":"1. A supposed material or psychical agent or mode of activity other than a force, law, or purpose; fortune; fate; -- in this sense often personifed. It is strictly and philosophically true in nature and reason that there is no such thing as chance or accident; it being evident that these words do not signify anything really existing, anything that is truly an agent or the cause of any event; but they signify merely men's ignorance of the real and immediate cause. Samuel Clark. Any society into which chance might throw him. Macaulay. That power Which erring men call Chance. Milton. 2. The operation or activity of such agent. By chance a priest came down that way. Luke x. 31. 3. The supposed effect of such an agent; something that befalls, as the result of unknown or unconsidered forces; the issue of uncertain conditions; an event not calculated upon; an unexpected occurrence; a happening; accident; fortuity; casualty. It was a chance that happened to us. 1 Sam. vi. 9. The Knave of Diamonds tries his wily arts, And wins (O shameful chance!) the Queen of Hearts. Pope. I spake of most disastrous chance. Shak. 4. A possibity; a likelihood; an opportunity; -- with reference to a doubtful result; as, a chance result; as, a chance to escape; a chance for life; the chances are all against him. So weary with disasters, tugged with fortune. That I would get my life on any chance, To mend it, or be rid on't Shak. 5. (Math.)  Probability. Note: The mathematical expression, of a chance is the ratio of frequency with which an event happens in the long run. If an event may happen in a ways and may fail in b ways, and each of these a + b ways is equally likely, the chance, or probability, that the event will happen is measured by the fraction a/(a + b), and the chance, or probability, that it will fail is measured by b/(a + b). Chance comer, one who, comes unexpectedly. -- The last chance, the sole remaining ground of hope. -- The main chance, the chief opportunity; that upon which reliance is had, esp. self-interest. -- Theory of chances, Doctrine of chances (Math.), that branch of mathematics which treats of the probability of the occurrence of particular events, as the fall of dice in given positions. -- To mind one's chances, to take advantage of every circumstance; to seize every opportunity.\n\nTo happen, come, or arrive, without design or expectation. \"Things that chance daily.\" Robynson (More's Utopia). If a bird's nest chance to be before thee. Deut. xxii. 6. I chanced on this letter. Shak. Note: Often used impersonally; as, how chances it How chance, thou art returned so soon Shak.\n\n1. To take the chances of; to venture upon; -- usually with it as object. Come what will, I will chance it. W. D. Howells. 2. To befall; to happen to. [Obs.] W. Lambarde.\n\nHappening by chance; casual.\n\nBy chance; perchance. Gray."}