{"word":"charge","definition":"1. To lay on or impose, as a load, tax, or burden; to load; to fill. A carte that charged was with hay. Chaucer. The charging of children's memories with rules. Locke. 2. To lay on or impose, as a task, duty, or trust; to command, instruct, or exhort with authority; to enjoin; to urge earnestly; as, to charge a jury; to charge the clergy of a diocese; to charge an agent. Moses . . . charged you to love the Lord your God. Josh. xxii. 5. Cromwell, I charge thee, fing away ambition. Shak. 3. To lay on, impose, or make subject to or liable for. When land shal be charged by any lien. Kent. 4. To fix or demand as a prince; as, he charges two dollars a barrelk for apples. 5. To place something to the account of as a debt; to debit, as to charge one with goods. Also, to enter upon the debit side of an account; as, to charge a sum to one. 6. To impute or ascribe; to lay to one's charge. No more accuse thy pen, but charge the crime On native loth and negligence of time. Dryden. 7. To accuse; to make a charge or assertion against (a) person or thing); to lay the responsibility (for something said or done) at the door of. If the did that wrong you charge with. Tennyson. 8. To place within or upon any firearm, piece of apparatus or machinery, the quantity it is intended and fitted to hold or bear; to load; to fill; as, to charge a gun; to charge an electrical machine, etc. Their battering cannon charged to the mouths. Shak. 9. To ornament with or cause to bear; as, to charge an architectural member with a molding. 10. (Her.)  To assume as a bearing; as, he charges three roses or; to add to or represent on; as, he charges his shield with three roses or. 11. To call to account; to challenge. [Obs.] To charge me to an answer. Shak. 12. To bear down upon; to rush upon; to attack. Charged our main battle's front. Shak. Syn. -- To intrust; command; exhort; instruct; accuse; impeach; arraign. See Accuse.\n\n1. To make an onset or rush; as, to charge with fixed bayonets. Like your heroes of antiquity, he charges in iron. Glanvill. \"Charge for the guns!\" he said. Tennyson. 2. To demand a price; as, to charge high for goods. 3. To debit on an account; as, to charge for purchases. 4. To squat on its belly and be still; -- a command given by a sportsman to a dog.\n\n1. A load or burder laid upon a person or thing. 2. A person or thing commited or intrusted to the care, custody, or management of another; a trust. Note: The people of a parish or church are called the charge of the clergyman who is set over them. 3. Custody or care of any person, thing, or place; office; responsibility; oversight; obigation; duty. 'Tis a great charge to come under one body's hand. Shak. 4. Heed; care; anxiety; trouble. [Obs.] Chaucer. 5. Harm. [Obs.] Chaucer. 6. An order; a mandate or command; an injunction. The king gave cherge concerning Absalom. 2. Sam. xviii. 5. 7. An address (esp. an earnest or impressive address) containing instruction or exhortation; as, the charge of a judge to a jury; the charge of a bishop to his clergy. 8. An accusation of a wrong of offense; allegation; indictment; specification of something alleged. The charge of confounding very different classes of phenomena. Whewell. 9. Whatever constitutes a burden on property, as rents, taxes, lines, etc.; costs; expense incurred; -- usually in the plural. 10. The price demanded for a thing or service. 11. An entry or a account of that which is due from one party to another; that which is debited in a business transaction; as, a charge in an account book. 12. That quantity, as of ammunition, electricity, ore, fuel, etc., which any apparatus, as a gun, battery, furnace, machine, etc., is intended to receive and fitted to hold, or which is actually in it at one time 13. The act of rushing upon, or towards, an enemy; a sudden onset or attack, as of troops, esp. cavalry; hence, the signal for attack; as, to sound the charge. Never, in any other war afore, gave the Romans a hotter charge upon the enemies. Holland. The charge of the light brigade. Tennyson. 14. A position (of a weapon) fitted for attack; as, to bring a weapon to the charge. 15. (Far.)  A soft of plaster or ointment. 16. (Her.)  A bearing. See Bearing, n., 8. 17. Etym: [Cf. Charre.]  Thirty-six pigs of lead, each pig weighing about seventy pounds; -- called also charre. 18. Weight; import; value. Many suchlike \"as's\" of great charge. Shak. Back charge. See under Back, a. -- Bursting charge. (a (Mil.) The charge which bursts a shell, etc. (b (Mining) A small quantity of fine powder to secure the ignition of a charge of coarse powder in blasting. -- Charge and discharge (Equity Practice), the old mode or form of taking an account before a master in chancery. -- Charge sheet, the paper on which are entered at a police station all arrests and accusations. -- To sound the charge, to give the signal for an attack. Syn. -- Care; custody; trust; management; office; expense; cost; price; assault; attack; onset; injunction; command; order; mandate; instruction; accusation; indictment."}