{"word":"character","definition":"1. A distinctive mark; a letter, figure, or symbol. It were much to be wished that there were throughout the world but one sort of character for each letter to express it to the eye. Holder. 2. Style of writing or printing; handwriting; the peculiar form of letters used by a particular person or people; as, an inscription in the Runic character. You know the character to be your brother's Shak. 3. The peculiar quality, or the sum of qualities, by which a person or a thing is distinguished from others; the stamp impressed by nature, education, or habit; that which a person or thing really is; nature; disposition. The character or that dominion. Milton. Know well each Ancient's proper character; His fable, subject, scope in every page; Religion, Country, genius of his Age. Pope. A man of . . . thoroughly subservient character. Motley. 4. Strength of mind; resolution; independence; individuality; as, he has a great deal of character. 5. Moral quality; the principles and motives that control the life; as, a man of character; his character saves him from suspicion. 6. Quality, position, rank, or capacity; quality or conduct with respect to a certain office or duty; as, in the miserable character of a slave; in his character as a magistrate; her character as a daughter. 7. The estimate, individual or general, put upon a person or thing; reputation; as, a man's character for truth and veracity; to give one a bad character. This subterraneous passage is much mended since Seneca gave so bad a character of it. Addison. 8. A written statement as to behavior, competency, etc., given to a servant. [Colloq.] 9. A unique or extraordinary individuality; a person characterized by peculiar or notable traits; a person who illustrates certain phases of character; as, Randolph was a character; Cæsar is a great historical character. 10. One of the persons of a drama or novel. Note: \"It would be well if character and reputation were used distinctively. In truth, character is what a person is; reputation is what he is supposed to be. Character is in himself, reputation is in the minds of others. Character is injured by temptations, and by wrongdoing; reputation by slanders, and libels. Character endures throughout defamation in every form, but perishes when there is a voluntary transgression; reputation may last through numerous transgressions, but be destroyed by a single, and even an unfounded, accusation or aspersion.\" Abbott.\n\n1. To engrave; to inscribe. [R.] These trees shall be my books. And in their barks my thoughts I 'll character. Shak. 2. To distinguish by particular marks or traits; to describe; to characterize. [R.] Mitford."}