{"word":"check","definition":"1. (Chess)  A word of warning denoting that the king is in danger; such a menace of a player's king by an adversary's move as would, if it were any other piece, expose it to immediate capture. A king so menaced is said to be in check, and must be made safe at the next move. 2. A condition of interrupted or impeded progress; arrest; stop; delay; as, to hold an enemy in check. Which gave a remarkable check to the first progress of Christianity. Addison. No check, no stay, this streamlet fears. Wordsworth. 3. Whatever arrests progress, or limits action; an obstacle, guard, restraint, or rebuff. Useful check upon the administration of government. Washington. A man whom no check could abash. Macaulay. 4. A mark, certificate, or token, by which, errors may be prevented, or a thing or person may be identified; as, checks placed against items in an account; a check given for baggage; a return check on a railroad. 5. A written order directing a bank or banker to pay money as therein stated. See Bank check, below. 6. A woven or painted design in squares resembling the patten of a checkerboard; one of the squares of such a design; also, cloth having such a figure. 7. (Falconry)  The forsaking by a hawk of its proper game to follow other birds. 8. Small chick or crack. Bank check, a written order on a banker or broker to pay money in his keeping belonging to the signer. -- Check book, a book containing blank forms for checks upon a bank. -- Check hook, a hook on the saddle of a harness, over which a checkrein is looped. -- Check list, a list or catalogue by which things may be verified, or on which they may be checked. -- Check nut (Mech.), a secondary nut, screwing down upon the primary nut to secure it. Knight. -- Check valve (Mech.), a valve in the feed pipe of a boiler to prevent the return of the feed water. -- To take check, to take offense. [Obs.] Dryden. Syn. -- Hindrance; setback; interruption; obstruction; reprimand; censure; rebuke; reproof; repulse; rebuff; tally; counterfoil; counterbalance; ticket; draft.\n\n1. (Chess)  To make a move which puts an adversary's piece, esp. his king, in check; to put in check. 2. To put a sudden restraint upon; to stop temporarily; to hinder; to repress; to curb. So many clogs to check and retard the headlong course of violence and oppression. Burke. 3. To verify, to guard, to make secure, by means of a mark, token, or other check; to distinguish by a check; to put a mark against (an item) after comparing with an original or a counterpart in order to secure accuracy; as, to check an account; to check baggage. 4. To chide, rebuke, or reprove. The good king, his master, will check him for it. Shak. 5. (Naut.)  To slack or ease off, as a brace which is too stiffly extended. 6. To make checks or chinks in; to cause to crack; as, the sun checks timber. Syn. -- To restrain; curb; bridle; repress; control; hinder; impede; obstruct; interrupt; tally; rebuke; reprove; rebuff.\n\nTo make a stop; to pause; -- with at. The mind, once jaded by an attempt above its power, either is disabled for the future, or else checks at any vigorous undertaking ever after. Locke. 2. To clash or interfere. [R.] Bacon. 3. To act as a curb or restraint. It [his presence] checks too strong upon me. Dryden. 4. To crack or gape open, as wood in drying; or to crack in small checks, as varnish, paint, etc. 5. (Falconry)  To turn, when in pursuit of proper game, and fly after other birds. And like the haggard, check at every feather That comes before his eye. Shak.\n\nCheckered; designed in checks."}