{"word":"chemistry","definition":"1. That branch of science which treats of the composition of substances, and of the changes which they undergo in consequence of alterations in the constitution of the molecules, which depend upon variations of the number, kind, or mode of arrangement, of the constituent atoms. These atoms are not assumed to be indivisible, but merely the finest grade of subdivision hitherto attained. Chemistry deals with the changes in the composition and constitution of molecules. See Atom, Molecule. Note: Historically, chemistry is an outgrowth of alchemy (or alchemistry), with which it was anciently identified. 2. An application of chemical theory and method to the consideration of some particular subject; as, the chemistry of iron; the chemistry of indigo. 3. A treatise on chemistry. Note: This word and its derivatives were formerly written with y, and sometimes with i, instead of e, in the first syllable, chymistry, chymist, chymical, etc., or chimistry, chimist, chimical, etc.; and the pronunciation was conformed to the orthography. Inorganic chemistry, that which treats of inorganic or mineral substances. -- Organic chemistry, that which treats of the substances which from the structure of organized beings and their products, whether animal or vegetable; -- called also chemistry of the carbon compounds. There is no fundamental difference between organic and inorganic chemistry. -- Physiological chemistry, the chemistry of the organs and tissues of the body, and of the various physiological processes incident to life. -- Practical chemistry, or Applied chemistry, that which treats of the modes of manufacturing the products of chemistry that are useful in the arts, of their applications to economical purposes, and of the conditions essential to their best use. -- Pure chemistry, the consideration of the facts and theories of chemistry in their purely scientific relations, without necessary reference to their practical applications or mere utility."}