{"word":"church","definition":"1. A building set apart for Christian worship. 2. A Jewish or heathen temple. [Obs.] Acts xix. 37. 3. A formally organized body of Christian believers worshiping together. \"When they had ordained them elders in every church.\" Acts xiv. 23. 4. A body of Christian believers, holding the same creed, observing the same rites, and acknowledging the same ecclesiastical authority; a denomination; as, the Roman Catholic church; the Presbyterian church. 5. The collective body of Christians. 6. Any body of worshipers; as, the Jewish church; the church of Brahm. 7. The aggregate of religious influences in a community; ecclesiastical influence, authority, etc.; as, to array the power of the church against some moral evil. Remember that both church and state are properly the rulers of the people, only because they are their benefactors. Bulwer. Note: Church is often used in composition to denote something belonging or relating to the church; as, church authority; church history; church member; church music, etc. Apostolic church. See under Apostolic. -- Broad church. See Broad Church. -- Catholic or Universal church, the whole body of believers in Christ throughout the world. -- Church of England, or English church, the Episcopal church established and endowed in England by law. -- Church living, a benefice in an established church. -- Church militant. See under Militant. -- Church owl (Zoöl.), the white owl. See Barn owl. -- Church rate, a tax levied on parishioners for the maintenance of the church and its services. -- Church session. See under Session. -- Church triumphant. See under Triumphant. -- Church work, work on, or in behalf of, a church; the work of a particular church for the spread of religion. -- Established church, the church maintained by the civil authority; a state church.\n\nTo bless according to a prescribed form, or to unite with in publicly returning thanks in church, as after deliverance from the dangers of childbirth; as, the churching of women."}