{"word":"circle","definition":"1. A plane figure, bounded by a single curve line called its circumference, every part of which is equally distant from a point within it, called the center. 2. The line that bounds sush a figure; a circumference; a ring. 3. (Astron.)  An instrument of observation, the graduated limb of which consists of an entire circle. Note: When it is fixed to a wall in an observatory, it is called a mural circle; when mounted with a telescope on an axis and in Y's, in the plane of the meridian, a meridian or transit circle; when involving the principle of reflection, like the sextant, a reflecting circle; and when that of repeating an angle several times continuously along the graduated limb, a repeating circle. 4. A round body; a sphere; an orb. It is he that sitteth upon the circle of the earth. Is. xi. 22. 5. Compass; circuit; inclosure. In the circle of this forest. Shak. 6. A company assembled, or conceived to assemble, about a central point of interest, or bound by a common tie; a class or division of society; a coterie; a set. As his name gradually became known, the circle of his acquaintance widened. Macaulay. 7. A circular group of persons; a ring. 8. A series ending where it begins, and repeating itself. Thus in a circle runs the peasant's pain. Dryden. 9. (Logic)  A form of argument in which two or more unproved statements are used to prove each other; inconclusive reasoning. That heavy bodies descend by gravity; and, again, that gravity is a quality whereby a heavy body descends, is an impertinent circle and teaches nothing. Glanvill. 10. Indirect form of words; circumlocution. [R.] Has he given the lie, In circle, or oblique, or semicircle. J. Fletcher. 11. A territorial division or district. Note: The Circles of the Holy Roman Empire, ten in number, were those principalities or provinces which had seats in the German Diet. Azimuth circle. See under Azimuth. -- Circle of altitude (Astron.), a circle parallel to the horizon, having its pole in the zenith; an almucantar. -- Circle of curvature. See Osculating circle of a curve (Below). -- Circle of declination. See under Declination. -- Circle of latitude. (a) (Astron.) A great circle perpendicular to the plane of the ecliptic, passing through its poles. (b) (Spherical Projection) A small circle of the sphere whose plane is perpendicular to the axis. -- Circles of longitude, lesser circles parallel to the ecliptic, diminishing as they recede from it. -- Circle of perpetual apparition, at any given place, the boundary of that space around the elevated pole, within which the stars never set. Its distance from the pole is equal to the latitude of the place. -- Circle of perpetual occultation, at any given place, the boundary of the space around the depressed pole, within which the stars never rise. -- Circle of the sphere, a circle upon the surface of the sphere, called a great circle when its plane passes through the center of the sphere; in all other cases, a small circle. -- Diurnal circle. See under Diurnal. -- Dress circle, a gallery in a theater, generally the one containing the prominent and more expensive seats. -- Druidical circles (Eng. Antiq.), a popular name for certain ancient inclosures formed by rude stones circularly arranged, as at Stonehenge, near Salisbury. -- Family circle, a gallery in a theater, usually one containing inexpensive seats. -- Horary circles (Dialing), the lines on dials which show the hours. -- Osculating circle of a curve (Geom.), the circle which touches the curve at some point in the curve, and close to the point more nearly coincides with the curve than any other circle. This circle is used as a measure of the curvature of the curve at the point, and hence is called circle of curvature. -- Pitch circle. See under Pitch. -- Vertical circle, an azimuth circle. -- Voltaic circle or circuit. See under Circuit. -- To square the circle. See under Square. Syn. -- Ring; circlet; compass; circuit; inclosure.\n\n1. To move around; to revolve around. Other planets circle other suns. Pope. 2. To encompass, as by a circle; to surround; to inclose; to encircle. Prior. Pope. Their heads are circled with a short turban. Dampier. So he lies, circled with evil. Coleridge. To circle in, to confine; to hem in; to keep together; as, to circle bodies in. Sir K. Digby.\n\nTo move circularly; to form a circle; to circulate. Thy name shall circle round the gaping through. Byron."}