{"word":"circuit","definition":"1. The act of moving or revolving around, or as in a circle or orbit; a revolution; as, the periodical circuit of the earth round the sun. Watts. 2. The circumference of, or distance round, any space; the measure of a line round an area. The circuit or compass of Ireland is 1,800 miles. J. Stow. 3. That which encircles anything, as a ring or crown. The golden circuit on my head. Shak. 4. The space inclosed within a circle, or within limits. A circuit wide inclosed with goodliest trees. Milton. 5. A regular or appointed journeying from place to place in the exercise of one's calling, as of a judge, or a preacher. 6. (a) (Law) A certain division of a state or country, established by law for a judge or judges to visit, for the administration of justice. Bouvier. (b) (Methodist Church) A district in which an itinerant preacher labors. 7. Circumlocution. [Obs.] \"Thou hast used no circuit of words.\" Huloet. Circuit court (Law), a court which sits successively in different places in its circuit (see Circuit, 6). In the United States, the federal circuit courts are commonly presided over by a judge of the supreme court, or a special circuit judge, together with the judge of the district court. They have jurisdiction within statutory limits, both in law and equity, in matters of federal cognizance. Some of the individual States also have circuit courts, which have general statutory jurisdiction of the same class, in matters of State cognizance. -- Circuit or Circuity of action (Law), a longer course of proceedings than is necessary to attain the object in view. -- To make a circuit, to go around; to go a roundabout way. -- Voltaic or Galvanic circuit or circle, a continous electrical communication between the two poles of a battery; an arrangement of voltaic elements or couples with proper conductors, by which a continuous current of electricity is established.\n\nTo move in a circle; to go round; to circulate. [Obs.] J. Philips.\n\nTo travel around. [Obs.] \"Having circuited the air.\" T. Warton."}