{"word":"circular","definition":"1. In the form of, or bounded by, a circle; round. 2. repeating itself; ending in itself; reverting to the point of beginning; hence, illogical; inconclusive; as, circular reasoning. 3. Adhering to a fixed circle of legends; cyclic; hence, mean; inferior. See Cyclic poets, under Cyclic. Had Virgil been a circular poet, and closely adhered to history, how could the Romans have had Dido Dennis. 4. Addressed to a circle, or to a number of persons having a common interest; circulated, or intended for circulation; as, a circular letter. A proclamation of Henry III., . . . doubtless circular throughout England. Hallam. 5. Perfect; complete. [Obs.] A man so absolute and circular In all those wished-for rarities that may take A virgin captive. Massinger. Circular are, any portion of the circumference of a circle. -- Circular cubics (Math.), curves of the third order which are imagined to pass through the two circular points at infinity. -- Circular functions. (Math.) See under Function. -- Circular instruments, mathematical instruments employed for measuring angles, in which the graduation extends round the whole circumference of a circle, or 360ยบ. -- Circular lines, straight lines pertaining to the circle, as sines, tangents, secants, etc. -- Circular note or letter. (a) (Com.) See under Credit. (b) (Diplomacy) A letter addressed in identical terms to a number of persons. -- Circular numbers (Arith.), those whose powers terminate in the same digits as the roots themselves; as 5 and 6, whose squares are 25 and 36. Bailey. Barlow. -- Circular points at infinity (Geom.), two imaginary points at infinite distance through which every circle in the plane is, in the theory of curves, imagined to pass. -- Circular polarization. (Min.) See under Polarization. -- Circular or Globular sailing (Naut.), the method of sailing by the arc of a great circle. -- Circular saw. See under Saw.\n\n1. A circular letter, or paper, usually printed, copies of which are addressed or given to various persons; as, a business circular. 2. A sleeveless cloak, cut in circular form."}