{"word":"civil","definition":"1. Pertaining to a city or state, or to a citizen in his relations to his fellow citizens or to the state; within the city or state. 2. Subject to government; reduced to order; civilized; not barbarous; -- said of the community. England was very rude and barbarous; for it is but even the other day since England grew civil. Spenser. 3. Performing the duties of a citizen; obedient to government; -- said of an individual. Civil men come nearer the saints of God than others; they come within a step or two of heaven. Preston 4. Having the manners of one dwelling in a city, as opposed to those of savages or rustics; polite; courteous; complaisant; affable. Note: \"A civil man now is one observant of slight external courtesies in the mutual intercourse between man and man; a civil man once was one who fulfilled all the duties and obligations flowing from his position as a 'civis' and his relations to the other members of that 'civitas.'\" Trench 5. Pertaining to civic life and affairs, in distinction from military, ecclesiastical, or official state. 6. Relating to rights and remedies sought by action or suit distinct from criminal proceedings. Civil action, an action to enforce the rights or redress the wrongs of an individual, not involving a criminal proceeding. -- Civil architecture, the architecture which is employed in constructing buildings for the purposes of civil life, in distinction from military and naval architecture, as private houses, palaces, churches, etc. -- Civil death. (Law.) See under Death. -- Civil engineering. See under Engineering. -- Civil law. See under Law. -- Civil list. See under List. -- Civil remedy (Law), that given to a person injured, by action, as opposed to a criminal prosecution. -- Civil service, all service rendered to and paid for by the state or nation other than that pertaining to naval or military affairs. -- Civil service reform, the substitution of business principles and methods for the spoils system in the conduct of the civil service, esp. in the matter of appointments to office. -- Civil state, the whole body of the laity or citizens not included under the military, maritime, and ecclesiastical states. -- Civil suit. Same as Civil action. -- CCivil war. See under War. -- Civil year. See under Year."}