{"word":"close","definition":"1. To stop, or fill up, as an opening; to shut; as, to close the eyes; to close a door. 2. To bring together the parts of; to consolidate; as, to close the ranks of an army; -- often used with up. 3. To bring to an end or period; to conclude; to complete; to finish; to end; to consummate; as, to close a bargain; to close a course of instruction. One frugal supper did our studies close. Dryden. 4. To come or gather around; to inclose; to encompass; to confine. The depth closed me round about. Jonah ii. 5. But now thou dost thyself immure and close In some one corner of a feeble heart. Herbert. A closed sea, a sea within the jurisdiction of some particular nation, which controls its navigation.\n\n1. To come together; to unite or coalesce, as the parts of a wound, or parts separated. What deep wounds ever closed without a scar Byron. 2. To end, terminate, or come to a period; as, the debate closed at six o'clock. 3. To grapple; to engange in hand-to-hand fight. They boldly closed in a hand-to-hand contest. Prescott. To close on or upon, to come to a mutual agreement; to agree on or join in. \"Would induce France and Holland to close upon some measures between them to our disadvantage.\" Sir W. Temple. -- To close with. (a) To accede to; to consent or agree to; as, to close with the terms proposed. (b) To make an agreement with. -- To close with the land (Naut.), to approach the land.\n\n1. The manner of shutting; the union of parts; junction. [Obs.] The doors of plank were; their close exquisite. Chapman. 2. Conclusion; cessation; ending; end. His long and troubled life was drawing to a close. Macaulay. 3. A grapple in wrestling. Bacon. 4. (Mus.) (a) The conclusion of a strain of music; cadence. (b) A double bar marking the end. At every close she made, the attending throng Replied, and bore the burden of the song. Dryden. Syn. -- Conclusion; termination; cessation; end; ending; extremity; extreme.\n\n1. An inclosed place; especially, a small field or piece of land surrounded by a wall, hedge, or fence of any kind; -- specifically, the precinct of a cathedral or abbey. Closes surrounded by the venerable abodes of deans and canons. Macaulay. 2. A narrow passage leading from a street to a court, and the houses within. [Eng.] Halliwell 3. (Law)  The interest which one may have in a piece of ground, even though it is not inclosed. Bouvier.\n\n1. Shut fast; closed; tight; as, a close box. From a close bower this dainty music flowed. Dryden. 2. Narrow; confined; as, a close alley; close quarters. \"A close prison.\" Dickens. 3. Oppressive; without motion or ventilation; causing a feeling of lassitude; -- said of the air, weather, etc. If the rooms be low-roofed, or full of windows and doors, the one maketh the air close, . . . and the other maketh it exceeding unequal. Bacon. 4. Strictly confined; carefully quarded; as, a close prisoner. 5. Out of the way observation; secluded; secret; hidden. \"He yet kept himself close because of Saul.\" 1 Chron. xii. 1 \"Her close intent.\" Spenser. 6. Disposed to keep secrets; secretive; reticent. \"For servecy, no lady closer.\" Shak. 7. Having the parts near each other; dense; solid; compact; as applied to bodies; viscous; tenacious; not volatile, as applied to liquids. The golden globe being put into a press, . . . the water made itself way through the pores of that very close metal. Locke. 8. Concise; to the point; as, close reasoning. \"Where the original is close no version can reach it in the same compass.\" Dryden. 9. Adjoining; near; either in space; time, or thought; -- often followed by to. Plant the spring crocuses close to a wall. Mortimer. The thought of the Man of sorrows seemed a very close thing -- not a faint hearsay. G. Eliot. 10. Short; as, to cut grass or hair close. 11. Intimate; familiar; confidential. League with you I seek And mutual amity, so strait, so close, That I with you must dwell, or you with me. Milton. 12. Nearly equal; almost evenly balanced; as, a close vote. \"A close contest.\" Prescott. 13. Difficult to obtain; as, money is close. Bartlett. 14. Parsimonious; stingy. \"A crusty old fellow, as close as a vise.\" Hawthorne. 15. Adhering strictly to a standard or original; exact; strict; as, a close translation. Locke. 16. Accurate; careful; precise; also, attentive; undeviating; strict; not wandering; as, a close observer. 17. (Phon.)  Uttered with a relatively contracted opening of the mouth, as certain sounds of e and o in French, Italian, and German; -- opposed to open. Close borough. See under Borough. -- Close breeding. See under Breeding. -- Close communion, communion in the Lord's supper, restricted to those who have received baptism by immersion. -- Close corporation, a body or corporation which fills its own vacancies. -- Close fertilization. (Bot.) See Fertilization. -- Close harmony (Mus.), compact harmony, in which the tones composing each chord are not widely distributed over several octaves. -- Close time, a fixed period during which killing game or catching certain fish is prohibited by law. -- Close vowel (Pron.), a vowel which is pronounced with a diminished aperture of the lips, or with contraction of the cavity of the mouth. -- Close to the wind (Naut.), directed as nearly to the point from which the wind blows as it is possible to sail; closehauled; -- said of a vessel.\n\n1. In a close manner. 2. Secretly; darkly. [Obs.] A wondrous vision which did close imply The course of all her fortune and posterity. Spenser."}