{"word":"cloud","definition":"1. A collection of visible vapor, or watery particles, susponded in the upper atmosphere. I do set my bow in the cloud. Gen. ix. 13. Note: A classification of clouds according to their chief forms was first proposed by the meteorologist Howard, and this is still substantially employed. The following varieties and subvarieties are recognized: (a) Cirrus. This is the most elevated of all the forms of clouds; is thin, long-drawn, sometimes looking like carded wool or hair, sometimes like a brush or room, sometimes in curl-like or fleecelike patches. It is the cat's-tail of the sailor, and the mare's-tail of the landsman. (b) Cumulus. This form appears in large masses of a hemispherical form, or nearly so, above, but flat below, one often piled above another, forming great clouds, common in the summer, and presenting the appearance of gigantic mountains crowned with snow. It often affords rain and thunder gusts. (c) Stratus. This form appears in layers or bands extending horizontally. (d) Nimbus. This form is characterized by its uniform gray tint and ragged edges; it covers the sky in seasons of continued rain, as in easterly storms, and is the proper rain cloud. The name is sometimes used to denote a raining cumulus, or cumulostratus. (e) Cirro-cumulus. This form consists, like the cirrus, of thin, broken, fleecelice clouds, but the parts are more or less rounded and regulary grouped. It is popularly called mackerel sky. (f) Cirro-stratus. In this form the patches of cirrus coalesce in long strata, between cirrus and stratus. (g) Cumulo-stratus. A form between cumulus and stratus, often assuming at the horizon a black or bluish tint. -- Fog, cloud, motionless, or nearly so, lying near or in contact with the earth's surface. -- Storm scud, cloud lying quite low, without form, and driven rapidly with the wind. 2. A mass or volume of smoke, or flying dust, resembling vapor. \"A thick cloud of incense.\" Ezek. viii. 11. 3. A dark vein or spot on a lighter material, as in marble; hence, a blemish or defect; as, a cloud upon one's reputation; a cloud on a title. 4. That which has a dark, lowering, or threatening aspect; that which temporarily overshadows, obscures, or depresses; as, a cloud of sorrow; a cloud of war; a cloud upon the intellect. 5. A great crowd or multitude; a vast collection. \"So great a cloud of witnesses.\" Heb. xii. 1. 6. A large, loosely-knitted scarf, worn by women about the head. Cloud on a (or the) title (Law), a defect of title, usually superficial and capable of removal by release, decision in equity, or legislation. -- To be under a cloud, to be under suspicion or in disgrace; to be in disfavor. -- In the clouds, in the realm of facy and imagination; beyond reason; visionary.\n\n1. To overspread or hide with a cloud or clouds; as, the sky is clouded. 2. To darken or obscure, as if by hiding or enveloping with a cloud; hence, to render gloomy or sullen. One day too late, I fear me, noble lord, Hath clouded all thy happy days on earth. Shak. Be not disheartened, then, nor cloud those looks. Milton. Nothing clouds men's minds and impairs their honesty like prejudice. M. Arnold. 3. To blacken; to sully; to stain; to tarnish; to damage; -- esp. used of reputation or character. I would not be a stander-by to hear My sovereign mistress clouded so, without My present vengeance taken. Shak. 4. To mark with, or darken in, veins or sports; to variegate with colors; as, to cloud yarn. And the nice conduct of a clouded cane. Pope.\n\nTo grow cloudy; to become obscure with clouds; -- often used with up. Worthies, away! The scene begins to cloud. Shak."}