{"word":"coal","definition":"1. A thoroughly charred, and extinguished or still ignited, fragment from wood or other combustible substance; charcoal. 2. (Min.)  A black, or brownish black, solid, combustible substance, dug from beds or veins in the earth to be used for fuel, and consisting, like charcoal, mainly of carbon, but more compact, and often affording, when heated, a large amount of volatile matter. Note: This word is often used adjectively, or as the first part of self-explaining compounds; as, coal-black; coal formation; coal scuttle; coal ship. etc. Note: In England the plural coals is used, for the broken mineral coal burned in grates, etc.; as, to put coals on the fire. In the United States the singular in a collective sense is the customary usage; as, a hod of coal. Age of coal plants. See Age of Acrogens, under Acrogen. -- Anthracite or Glance coal. See Anthracite. -- Bituminous coal. See under Bituminous. -- Blind coal. See under Blind. -- Brown coal, or Lignite. See Lignite. -- Caking coal, a bituminous coal, which softens and becomes pasty or semi-viscid when heated. On increasing the heat, the volatile products are driven off, and a coherent, grayish black, cellular mass of coke is left. -- Cannel coal, a very compact bituminous coal, of fine texture and dull luster. See Cannel coal. -- Coal bed (Geol.), a layer or stratum of mineral coal. -- Coal breaker, a structure including machines and machinery adapted for crushing, cleansing, and assorting coal. -- Coal field (Geol.), a region in which deposits of coal occur. Such regions have often a basinlike structure, and are hence called coal basins. See Basin. -- Coal gas, a variety of carbureted hydrogen, procured from bituminous coal, used in lighting streets, houses, etc., and for cooking and heating. -- Coal heaver, a man employed in carrying coal, and esp. in putting it in, and discharging it from, ships. -- Coal measures. (Geol.) (a) Strata of coal with the attendant rocks. (b) A subdivision of the carboniferous formation, between the millstone grit below and the Permian formation above, and including nearly all the workable coal beds of the world. -- Coal oil, a general name for mineral oils; petroleum. -- Coal plant (Geol.), one of the remains or impressions of plants found in the strata of the coal formation. -- Coal tar. See in the Vocabulary. -- To haul over the coals, to call to account; to scold or censure. [Colloq.] -- Wood coal. See Lignite.\n\n1. To burn to charcoal; to char. [R.] Charcoal of roots, coaled into great pieces. Bacon. 2. To mark or delineate with charcoal. Camden. 3. To supply with coal; as, to coal a steamer.\n\nTo take in coal; as, the steaer coaled at Southampton."}