{"word":"coat","definition":"1. An outer garment fitting the upper part of the body; especially, such a garment worn by men. Let each His adamantine coat gird well. Milton. 2. A petticoat. [Obs.] \"A child in coats.\" Locke. 3. The habit or vesture of an order of men, indicating the order or office; cloth. Men of his coat should be minding their prayers. Swift. She was sought by spirits of richest coat. Shak. 4. An external covering like a garment, as fur, skin, wool, husk, or bark; as, the horses coats were sleek. Fruit of all kinds, in coat Rough or smooth rined, or bearded husk, or shell. Milton. 5. A layer of any substance covering another; a cover; a tegument; as, the coats of the eye; the coats of an onion; a coat of tar or varnish. 6. Same as Coat of arms. See below. Hark, countrymen! either renew the fight, Or tear the lions out of England's coat. Shak. 7. A coat card. See below. [Obs.] Here's a trick of discarded cards of us! We were ranked with coats as long as old master lived. Massinger. Coat armor. See under Armor. -- Coat of arms (Her.), a translation of the French cotte d'armes, a garment of light material worn over the armor in the 15th and 16th centuries. This was often charged with the heraldic bearings of the wearer. Hence, an heraldic achievement; the bearings of any person, taken together. -- Coat card, a card bearing a coated figure; the king, queen, or knave of playing cards. \"`I am a coat card indeed.' `Then thou must needs be a knave, for thou art neither king nor queen.'\" Rowley. -- Coat link, a pair of buttons or studs joined by a link, to hold together the lappels of a double-breasted coat; or a button with a loop for a single-breasted coat. -- Coat of mail, a defensive garment of chain mail. See Chain mail, under Chain. -- Mast coat (Naut.), a piece of canvas nailed around a mast, where it passes through the deck, to prevent water from getting below. -- Sail coat (Naut.), a canvas cover laced over furled sails, and the like, to keep them dry and clean.\n\n1. To cover with a coat or outer garment. 2. To cover with a layer of any substance; as, to coat a jar with tin foil; to coat a ceiling."}