{"word":"cock","definition":"1. The male of birds, particulary of gallinaceous or domestic fowls. 2. A vane in the shape of a cock; a weathercock. Drenched our steeples, drowned the cocks! Shak. 3. A chief man; a leader or master. [Humorous] Sir Andrew is the cock of the club, since he left us. Addison. 4. The crow of a cock, esp. the first crow in the morning; cockcrow. [Obs.] He begins at curfew, and walks till the first cock. Shak. 5. A faucet or valve. Note: Jonsons says, \"The handly probably had a cock on the top; things that were contrived to turn seem anciently to have had that form, whatever was the reason.\" Skinner says, because it used to be constructed in forma critæ galli, i.e., in the form of a cock's comb. 6. The style of gnomon of a dial. Chambers. 7. The indicator of a balance. Johnson. 8. The bridge piece which affords a bearing for the pivot of a balance in a clock or watch. Knight. Ball cock. See under Ball. -- Chaparral cock. See under Chaparral. -- Cock and bull story, an extravagant, boastful story; a canard. -- Cock of the plains (Zoöl.) See Sage cock. -- Cock of the rock (Zoöl.), a South American bird (Rupicola aurantia) having a beautiful crest. -- Cock of the walk, a chief or master; the hero of the hour; one who has overcrowed, or got the better of, rivals or competitors. -- Cock of the woods. See Capercailzie.\n\n1. To set erect; to turn up. Our Lightfoot barks, and cocks his ears. Gay. Dick would cock his nose in scorn. Swift. 2. To shape, as a hat, by turning up the brim. 3. To set on one side in a pert or jaunty manner. They cocked their hats in each other's faces. Macaulay. 4. To turn (the eye) obliquely and partially close its lid, as an expression of derision or insinuation. Cocked hat. (a) A hat with large, stiff flaps turned up to a peaked crown, thus making its form triangular; -- called also three-cornered hat. (b) A game similar to ninepins, except that only three pins are used, which are set up at the angles of a triangle.\n\nTo strut; to swagger; to look big, pert, or menacing. Addison.\n\nThe act of cocking; also, the turn so given; as, a cock of the eyes; to give a hat a saucy cock.\n\n1. The notch of an arrow or crossbow. 2. The hammer in the lock of a firearm. At cock, At full cock, with the hammer raised and ready to fire; -- said of firearms, also, jocularly, of one prepared for instant action. -- At half cock. See under Half. -- Cock feather (Archery), the feather of an arrow at right angles to the direction of the cock or notch. Nares.\n\nTo draw the hammer of (a firearm) fully back and set it for firing.\n\nTo draw back the hammer of a firearm, and set it for firing. Cocked, fired, and missed his man. Byron.\n\nA small concial pile of hay.\n\nTo put into cocks or heaps, as hay. Under the cocked hay. Spenser.\n\nA small boat. Yond tall anchoring bark [appears] Diminished to her cock; her cock, a buoy Almost too small for sight. Shak.\n\nA corruption or disguise of the word God, used in oaths. [Obs.] \"By cock and pie.\" Shak."}