{"word":"cold","definition":"1. Deprived of heat, or having a low temperature; not warm or hot; gelid; frigid. \"The snowy top of cold Olympis.\" Milton. 2. Lacking the sensation of warmth; suffering from the absence of heat; chilly; shivering; as, to be cold. 3. Not pungent or acrid. \"Cold plants.\" Bacon 4. Wanting in ardor, intensity, warmth, zeal, or passion; spiritless; unconcerned; reserved. A cold and unconcerned spectator. T. Burnet. No cold relation is a zealous citizen. Burke. 5. Unwelcome; disagreeable; unsatisfactory. \"Cold news for me.\" \"Cold comfort.\" Shak. 6. Wanting in power to excite; dull; uninteresting. What a deal of cold business doth a man misspend the better part of life in! B. Jonson. The jest grows cold . . . when in comes on in a second scene. Addison. 7. Affecting the sense of smell (as of hunting dogs) but feebly; having lost its odor; as, a cold scent. 8. Not sensitive; not acute. Smell this business with a sense as cold As is a dead man's nose. Shak. 9. Distant; -- said, in the game of hunting for some object, of a seeker remote from the thing concealed. 10. (Paint.)  Having a bluish effect. Cf. Warm, 8. Cold abscess. See under Abscess. -- Cold blast See under Blast, n., 2. Cold blood. See under Blood, n., 8. -- Cold chill, an ague fit. Wright. -- Cold chisel, a chisel of peculiar strength and hardness, for cutting cold metal. Weale. -- Cold cream. See under Cream. -- Cold slaw. See Cole slaw. -- In cold blood, without excitement or passion; deliberately. He was slain in cold blood after thefight was over. Sir W. Scott. To give one the cold shoulder, to treat one with neglect. Syn. -- Gelid; bleak; frigid; chill; indifferent; unconcerned; passionless; reserved; unfeeling; stoical.\n\n1. The relative absence of heat or warmth. 2. The sensation produced by the escape of heat; chilliness or chillness. When she saw her lord prepared to part, A deadly cold ran shivering to her heart. Dryden. 3. (Med.)  A morbid state of the animal system produced by exposure to cold or dampness; a catarrh. Cold sore (Med.), a vesicular eruption appearing about the mouth as the result of a cold, or in the course of any disease attended with fever. -- To leave one out in the cold, to overlook or neglect him. [Colloq.] Cold, v. i.  To become cold. [Obs.] Chaucer."}