{"word":"come","definition":"1. To move hitherward; to draw near; to approach the speaker, or some place or person indicated; -- opposed to go. Look, who comes yonder Shak. I did not come to curse thee. Tennyson. 2. To complete a movement toward a place; to arrive. When we came to Rome. Acts xxviii. 16. Lately come from Italy. Acts vviii. 2. 3. To approach or arrive, as if by a journey or form a distance. \"Thy kingdom come.\" Matt. vi. 10. The hour is comming, and now is. John. v. 25. So quik bright things come to confusion. Shak. 4. To approach or arrive, as the result of a cause, or of the act of another. From whence come wars James iv. 1. Both riches and honor come of thee! Chron. xxix. 12. 5. To arrive in sight; to be manifest; to appear. Then butter does refuse to come. Hudibras. 6. To get to be, as the result of change or progress; -- with a predicate; as, to come united. How come you thus estranged Shak. How come her eyes so bright Shak. Note: Am come, is come, etc., are frequently used instead of have come, has come, etc., esp. in poetry. The verb to be gives adjectival significance to the participle as expressing a state or condition of the subject, while the auxiliary have expresses simply the completion of the action signified by the verb. Think not that I am come to destroy. Matt. v. 17. We are come off like Romans. Shak. The melancholy days are come, the saddest of the year. Bryant. Note: Come may properly be used (instead of go) in speaking of a movement hence, or away, when there is reference to an approach to the person addressed; as, I shall come home next week; he will come to your house to-day. It is used with other verbs almost as an auxiliary, indicative of approach to the action or state expressed by the verb; as, how came you to do it Come is used colloquially, with reference to a definite future time approaching, without an auxilliary; as, it will be two years, come next Christmas; i. e., when Christmas shall come. They were cried In meeting, come next Sunday. Lowell. Come, in the imperative, is used to excite attention, or to invite to motion or joint action; come, let us go. \"This is the heir; come, let us kill him.\" Matt. xxi. 38. When repeated, it sometimes expresses haste, or impatience, and sometimes rebuke. \"Come, come, no time for lamentation now.\" Milton. To come, yet to arrive, future. \"In times to come.\" Dryden. \"There's pippins and cheese to come.\" Shak. -- To come about. (a) To come to pass; to arrive; to happen; to result; as, how did these things come about (b) To change; to come round; as, the ship comes about. \"The wind is come about.\" Shak. On better thoughts, and my urged reasons, They are come about, and won to the true side. B. Jonson. -- To come abroad. (a) To move or be away from one's home or country. \"Am come abroad to see the world.\" Shak. (b) To become public or known. [Obs.] \"Neither was anything kept secret, but that it should come abroad.\" Mark. iv. 22. -- To come across, to meet; to find, esp. by chance or suddenly. \"We come across more than one incidental mention of those wars.\" E. A. Freeman. \"Wagner's was certainly one of the strongest and most independent natures I ever came across.\" H. R. Heweis. -- To come after. (a) To follow. (b) To come to take or to obtain; as, to come after a book. -- To come again, to return. \"His spirit came again and he revived.\" Judges. xv. 19. -- To come and go. (a) To appear and disappear; to change; to alternate. \"The color of the king doth come and go.\" Shak. (b) (Mech.) To play backward and forward. -- To come at. (a) To reach; to arrive within reach of; to gain; as, to come at a true knowledge of ourselves. (b) To come toward; to attack; as, he came at me with fury. -- To come away, to part or depart. -- To come between, to interverne; to separate; hence, to cause estrangement. -- To come by. (a) To obtain, gain, acquire. \"Examine how you came by all your state.\" Dryden. (b) To pass near or by way of. -- To come down. (a) To descend. (b) To be humbled. -- To come down upon, to call to account, to reprimand. [Colloq.] Dickens. -- To come home. (a) To retuen to one's house or family. (b) To come close; to press closely; to touch the feelings, interest, or reason. (b) (Naut.) To be loosened from the ground; -- said of an anchor. -- To come in. (a) To enter, as a town, house, etc. \"The thief cometh in.\" Hos. vii. 1. (b) To arrive; as, when my ship comes in. (c) To assume official station or duties; as, when Lincoln came in. (d) To comply; to yield; to surrender. \"We need not fear his coming in\" Massinger. (e) To be brought into use. \"Silken garments did not come in till late.\" Arbuthnot. (f) To be added or inserted; to be or become a part of. (g) To accrue as gain from any business or investment. (h) To mature and yield a harvest; as, the crops come in well. (i) To have sexual intercourse; -- with to or unto. Gen. xxxviii. 16. (j) To have young; to bring forth; as, the cow will come in next May. [U. S.] -- To come in for, to claim or receive. \"The rest came in for subsidies.\" Swift. -- To come into, to join with; to take part in; to agree to; to comply with; as, to come into a party or scheme. -- To come it ever, to hoodwink; to get the advantage of. [Colloq.] -- To come near or nigh, to approach in place or quality to be equal to. \"Nothing ancient or modern seems to come near it.\" Sir W. Temple. -- To come of. (a) To descend or spring from. \"Of Priam's royal race my mother came.\" Dryden. (b) To result or follow from. \"This comes of judging by the eye.\" L'Estrange. -- To come off. (a) To depart or pass off from. (b) To get free; to get away; to escape. (c) To be carried through; to pass off; as, it came off well. (d) To acquit one's self; to issue from (a contest, etc.); as, he came off with honor; hence, substantively, a come off, an escape; an excuse; an evasion. [Colloq.] (e) To pay over; to give. [Obs.] (f) To take place; to happen; as, when does the race come off (g) To be or become after some delay; as, the weather came off very fine. (h) To slip off or be taken off, as a garment; to separate. (i) To hurry away; to get through. Chaucer. -- To come off by, to suffer. [Obs.] \"To come off by the worst.\" Calamy. -- To come off from, to leave. \"To come off from these grave disquisitions.\" Felton. -- To come on. (a) To advance; to make progress; to thrive. (b) To move forward; to approach; to supervene. -- To come out. (a) To pass out or depart, as from a country, room, company, etc. \"They shall come out with great substance.\" Gen. xv. 14. (b) To become public; to appear; to be published. \"It is indeed come out at last.\" Bp. Stillingfleet. (c) To end; to result; to turn out; as, how will this affair come out he has come out well at last. (d) To be introduced into society; as, she came out two seasons ago. (e) To appear; to show itself; as, the sun came out. (f) To take sides; to take a stand; as, he came out against the tariff.(g) To publicly admit oneself to be homosexual. -- To come out with, to give publicity to; to disclose. -- To come over. (a) To pass from one side or place to another. \"Perpetually teasing their friends to come over to them.\" Addison. (b) To rise and pass over, in distillation. -- To come over to, to join. -- To come round. (a) To recur in regular course. (b) To recover. [Colloq.] (c) To change, as the wind. (d) To relent. J. H. Newman. (e) To circumvent; to wheedle. [Colloq.] -- To come short, to be deficient; to fail of attaining. \"All have sinned and come short of the glory of God.\" Rom. iii. 23. -- To come to. (a) To consent or yield. Swift. (b) (Naut.) (with the accent on to) To luff; to brin the ship's head nearer the wind; to anchor. (c) (with the accent on to) To recover, as from a swoon. (d) To arrive at; to reach. (e) To amount to; as, the taxes come to a large sum. (f) To fall to; to be received by, as an inheritance. Shak. -- To come to blows. See under Blow. -- To come to grief. See under Grief. -- To come to a head. (a) To suppurate, as a boil. (b) To mature; to culminate; as a plot. -- To come to one's self, to recover one's senses. -- To come to pass, to happen; to fall out. -- To come to the scratch. (a) (Prize Fighting) To step up to the scratch or mark made in the ring to be toed by the combatants in beginning a contest; hence: (b) To meet an antagonist or a difficulty bravely. [Colloq.] -- To come to time. (a) (Prize Fighting) To come forward in order to resume the contest when the interval allowed for rest is over and \"time\" is called; hence: (b) To keep an appointment; to meet expectations. [Colloq.] -- To come together. (a) To meet for business, worship, etc.; to assemble. Acts i. 6. (b) To live together as man and wife. Matt. i. 18. -- To come true, to happen as predicated or expected. -- To come under, to belong to, as an individual to a class. -- To come up (a) to ascend; to rise. (b) To be brought up; to arise, as a question. (c) To spring; to shoot or rise above the earth, as a plant. (d) To come into use, as a fashion. -- To come up the capstan (Naut.), to turn it the contrary way, so as to slacken the rope about it. -- To come up the tackle fall (Naut.), to slacken the tackle gently. Totten. -- To come up to, to rise to; to equal. -- To come up with, to overtake or reach by pursuit. -- To come upon. (a) To befall. (b) To attack or invade. (c) To have a claim upon; to become dependent upon for support; as, to come upon the town. (d) To light or chance upon; to find; as, to come upon hid treasure.\n\nTo carry through; to succeed in; as, you can't come any tricks here. [Slang] To come it, to succeed in a trick of any sort. [Slang]\n\nComing. Chaucer."}