{"word":"command","definition":"1. To order with authority; to lay injunction upon; to direct; to bid; to charge. We are commanded to forgive our enemies, but you never read that we are commanded to forgive our friends. Bacon. Go to your mistress: Say, I command her come to me. Shak. 2. To exercise direct authority over; to have control of; to have at one's disposal; to lead. Monmouth commanded the English auxiliaries. Macaulay. Such aid as I can spare you shall command. Shak. 3. To have within a sphere of control, influence, access, or vision; to dominate by position; to guard; to overlook. Bridges commanded by a fortified house. Motley. Up to the eastern tower, Whose height commands as subject all the vale. Shak. One side commands a view of the finest garden. Addison. 4. To have power or influence of the nature of authority over; to obtain as if by ordering; to reeceive as a due; to challenge; to claim; as, justice commands the respect and affections of the people; the best goods command the best price. 'Tis not in mortals to command success. Addison. 5. To direct to come; to bestow. [Obs.] I will command my blessing upon you. Lev. xxv. 21. Syn. -- To bid; order; direct; dictate; charge; govern; rule; overlook.\n\n1. To have or to exercise direct authority; to govern; to sway; to influence; to give an order or orders. And reigned, commanding in his monarchy. Shak. For the king had so commanded concerning [Haman]. Esth. iii. 2. 2. To have a view, as from a superior position. Far and wide his eye commands. Milton.\n\n1. An authoritative order requiring obedience; a mandate; an injunction. A waiting what command their mighty chief Had to impose. Milton. 2. The possession or exercise of authority. Command and force may often create, but can never cure, an aversion. Locke. 3. Authority; power or right of control; leadership; as, the forces under his command. 4. Power to dominate, command, or overlook by means of position; scope of vision; survey. Te steepy stand Which overlooks the vale with wide command. Dryden. 5. Control; power over something; sway; influence; as, to have command over one's temper or voice; the fort has command of the bridge. He assumed an absolute command over his readers. Druden. 6. A body of troops, or any naval or military force or post, or the whole territory under the authority or control of a particular officer. Word of command (Mil.), a word or phrase of definite and established meaning, used in directing the movements of soldiers; as, aim; fire; shoulder arms, etc. Syn. -- Control; sway; power; authority; rule; dominion; sovereignty; mandate; order; injunction; charge; behest. See Direction."}