{"word":"commission","definition":"1. The act of committing, doing, or performing; the act of perpetrating. Every commission of sin introduces into the soul a certain degree of hardness. South. 2. The act of intrusting; a charge; instructions as to how a trust shall be executed. 3. The duty or employment intrusted to any person or persons; a trust; a charge. 4. A formal written warrant or authority, granting certain powers or privileges and authorizing or commanding the performance of certain duties. Let him see our commission. Shak. 5. A certificate conferring military or naval rank and authority; as, a colonel's commission. 6. A company of persons joined in the performance of some duty or the execution of some trust; as, the interstate commerce commission. A commission was at once appointed to examine into the matter. Prescott. 7. (Com.) (a) The acting under authority of, or on account of, another. (b) The thing to be done as agent for another; as, I have three commissions for the city. (c) The brokerage or allowance made to a factor or agent for transacting business for another; as, a commission of ten per cent on sales. See Del credere. Commission of array. (Eng. Hist.) See under Array. -- Commission of bankrupty, a commission apointing and empowering certain persons to examine into the facts relative to an alleged bankrupty, and to secure the bankrupt's lands and effects for the creditors. -- Commission of lunacy, a commission authoring and inquiry whether a person is a lunatic or not. -- Commission merchant, one who buys or sells goods on commission, as the agent of others, receiving a rate per cent as his compensation. -- Commission, or Commissioned, officer (Mil.), one who has a commission, in distingtion from a noncommossioned or warrant officer. -- Commission of the peace, a commission under the great seal, constituting one or more persons justices of the peace. [Eng.] -- To put a vessel into commission (Naut.), to equip and man a goverment vessel, and send it out on service after it has been laid up; esp., the formal act of tacking command of a vessel for service, hoisting the flag, reading the orders, etc. -- To put a vessel out of commission (Naut.), to detach the officers and crew and retire it from active service, temporarily or permanently. -- To put the great seal, or the Treasury, into commission, to place it in the hands of a commissioner or commissioners during the abeyance of the ordinary administration, as between the going out of one lord keeper and accession of another. [Eng.] -- The United States Christians Commission, an organization among the people of the North, during the Civil War, which afforded material comforts to the Union soldiers, and performed services of a religious character in the field and in hospitals. -- The United States Sanitary Commission, an organization formed by the people of the North to coöperate with and supplement the medical department of the Union armies during the Civil War. Syn. -- Charge; warrant; authority; mandate; office; trust; employment.\n\n1. To give a commission to; to furnish with a commission; to empower or authorize; as, to commission persons to perform certain acts; to commission an officer. 2. To send out with a charge or commission. A chosen band He first commissions to the Latian land. Dryden. Syn. -- To appoint; depute; authorize; empower; delegate; constitute; ordain."}