{"word":"condition","definition":"1. Mode or state of being; state or situation with regard to external circumstances or influences, or to physical or mental integrity, health, strength, etc.; predicament; rank; position, estate. I am in my condition A prince, Miranda; I do think, a king. Shak. And O, what man's condition can be worse Than his whom plenty starves and blessings curse Cowley. The new conditions of life. Darwin. 2. Essential quality; property; attribute. It seemed to us a condition and property of divine powers and beings to be hidden and unseen to others. Bacon. 3. Temperament; disposition; character. [Obs.] The condition of a saint and the complexion of a devil. Shak. 4. That which must exist as the occasion or concomitant of something else; that which is requisite in order that something else should take effect; an essential qualification; stipulation; terms specified. I had as lief take her dowry with this condition, to be whipped at the high cross every morning. Shak. Many are apt to believe remission of sins, but they believe it without the condition of repentance. Jer. Taylor. 5. (Law)  A clause in a contract, or agreement, which has for its object to suspend, to defeat, or in some way to modify, the principal obligation; or, in case of a will, to suspend, revoke, or modify a devise or bequest. It is also the case of a future uncertain event, which may or may not happen, and on the occurrence or non-occurrence of which, the accomplishment, recission, or modification of an obligation or testamentary disposition is made to depend. Blount. Tomlins. Bouvier. Wharton. Equation of condition. (Math.) See under Equation. -- On or Upon condition (that), used for if in introducing conditional sentences. \"Upon condition thou wilt swear to pay him tribute . . . thou shalt be placed as viceroy under him.\" Shak. -- Conditions of sale, the terms on which it is proposed to sell property by auction; also, the instrument containing or expressing these terms. Syn. -- State; situation; circumstances; station; case; mode; plight; predicament; stipulation; qualification; requisite; article; provision; arrangement. See State.\n\n1. To make terms; to stipulate. Pay me back my credit, And I'll condition with ye. Beau. & Fl. 2. (Metaph.)  To impose upon an object those relations or conditions without which knowledge and thought are alleged to be impossible. To think of a thing is to condition. Sir W. Hamilton.\n\n1. To invest with, or limit by, conditions; to burden or qualify by a condition; to impose or be imposed as the condition of. Seas, that daily gain upon the shore, Have ebb and flow conditioning their march. Tennyson. 2. To contract; to stipulate; to agree. It was conditioned between Saturn and Titan, that Saturn should put to death all his male children. Sir W. Raleigh. 3. (U. S. Colleges)  To put under conditions; to require to pass a new examination or to make up a specified study, as a condition of remaining in one's class or in college; as, to condition a student who has failed in some branch of study. 4. To test or assay, as silk (to ascertain the proportion of moisture it contains). McElrath.  train; acclimate."}