{"word":"conscience","definition":"1. Knowledge of one's own thoughts or actions; consciousness. [Obs.] The sweetest cordial we receive, at last, Is conscience of our virtuous actions past. Denham. 2. The faculty, power, or inward principle which decides as to the character of one's own actions, purposes, and affections, warning against and condemning that which is wrong, and approving and prompting to that which is right; the moral faculty passing judgment on one's self; the moral sense. My conscience hath a thousand several tongues, And every tongue brings in a several tale, And every tale condemns me for a villain. Shak. As science means knowledge, conscience etymologically means self- knowledge . . . But the English word implies a moral standard of action in the mind as well as a consciousness of our own actions. . . . Conscience is the reason, employed about questions of right and wrong, and accompanied with the sentiments of approbation and condemnation. Whewell. 3. The estimate or determination of conscience; conviction or right or duty. Conscience supposes the existence of some such [i.e., moral] faculty, and properly signifies our consciousness of having acted agreeably or contrary to its directions. Adam Smith. 4. Tenderness of feeling; pity. [Obs.] Chaucer. Conscience clause, a clause in a general law exempting persons whose religious scruples forbid compliance therewith, -- as from taking judicial oaths, rendering military service, etc. -- Conscience money, stolen or wrongfully acquired money that is voluntarily restored to the rightful possessor. Such money paid into the United States treasury by unknown debtors is called the Conscience fund. -- Court of Conscience, a court established for the recovery of small debts, in London and other trading cities and districts. [Eng.] Blackstone. -- In conscience, In all conscience, in deference or obedience to conscience or reason; in reason; reasonably. \"This is enough in conscience.\" Howell. \"Half a dozen fools are, in all conscience, as many as you should require.\" Swift. -- To make conscience of, To make a matter of conscience, to act according to the dictates of conscience concerning (any matter), or to scruple to act contrary to its dictates."}