{"word":"constant","definition":"1. Firm; solid; fixed; immovable; -- opposed to fluid. [Obs.] If . . . you mix them, you may turn these two fluid liquors into a constant body. Boyle. 2. Not liable, or given, to change; permanent; regular; continuous; continually recurring; steadfast; faithful; not fickle. Both loving one fair maid, they yet remained constant friends. Sir P. Sidney. I am constant to my purposes. Shak. His gifts, his constant ourtship, nothing gained. Dryden. Onward the constant current sweeps. Longfellow. 3. (Math. & Physics)  Remaining unchanged or invariable, as a quantity, forc, law, etc. 4. Consistent; logical. [Obs.] Shak. Syn. -- Fixed; steadfast; unchanging; permanent; unalterable; immutable; perpetual; continual; resolute; firm; unshaken; determined. -- Constant, Continual, Perpetual. These words are sometimes used in an absolute and sometimes in a qualified sense. Constant denotes, in its absolute sense, unchangeably fixed; as, a constant mind or purpose. In its qualified sense, it marks something as a \"standing\" fact or occurence; as, liable to constant interruptions; constantly called for. Continual, in its absolute sense, coincides with continuous. See Continuous. In its qualified sense, it describes, a thing as occuring in steady and rapid succession; as, a round of continual calls; continually changing. Perpetual denotes, in its absolute sense, what literally never ceases or comes to an end; as, perpetual motion. In its qualified sense, it is used hyperbolically, and denotes that which rarely ceases; as, perpetual disturbance; perpetual noise; perpetual intermeddling.\n\n1. That which is not subject to change; that which is invariable. 2. (Math.)  A quantity that does not change its value; -- used in countradistinction variable. Absolute costant (Math.), one whose value is absolutely the same under all cirumstanes, as the number 10, or any numeral. -- Arbitrary constant, an undetermined constant in a differential equation having the same value during all changes in the values of the variables."}