{"word":"converse","definition":"1. To keep company; to hold intimate intercourse; to commune; -- followed by with. To seek the distant hills, and there converse With nature. Thomson. Conversing with the world, we use the world's fashions. Sir W. Scott. But to converse with heaven -This is not easy. Wordsworth. 2. To engage, in familiar colloqui; to interchange thoughts and opinions in a free, informal manner; to chat; -- followed by with before a person; by on, about, concerning, etc., before a thing. Companions That do converse and waste the time together. Shak. We had conversed so often on that subject. Dryden. 3. To have knowledge of, from long intercourse or study; -- said of things. According as the objects they converse with afford greater or less variety. Locke. Syn. -- To associate; commune; discourse; talk; chat.\n\n1. Frequent intercourse; familiar communion; intimate association. Glanvill. \"T is but to hold Converse with Nature's charms, and view her stores unrolled. Byron. 2. Familiar discourse; free interchange of thoughts or views; conversation; chat. Formed by thy converse happily to steer From grave to gay, from lively to severe. Pope.\n\n, a. Etym: [L. conversus, p.p. of convertere. See Convert.] Turned about; reversed in order or relation; reciprocal; as, a converse proposition.\n\n1. (Logic)  A proposition which arises from interchanging the terms of another, as by putting the predicate for the subject, and the subject for the predicate; as, no virtue is vice, no vice is virtue. Note: It should not (as is often done) be confounded with the contrary or opposite of a proposition, which is formed by introducing the negative not or no. 2. (Math.)  A proposition in which, after a conclusion from something supposed has been drawn, the order is inverted, making the conclusion the supposition or premises, what was first supposed becoming now the conclusion or inference. Thus, if two sides of a sides of a triangle are equal, the angles opposite the sides are equal; and the converse is true, i.e., if these angles are equal, the two sides are equal."}