{"word":"coordinate","definition":"Equal in rank or order; not subordinate. Whether there was one Supreme Governor of the world, or many coördinate powers presiding over each country. Law. Conjunctions joint sentences and coördinate terms. Rev. R. Morris. Coördinate adjectives, adjectives disconnected as regards ane another, but referring equally to the same subject. -- Coördinate conjunctions, conjunctions joining independent propositions. Rev. R. Morris.\n\n1. To make coördinate; to put in the same order or rank; as, to coördinate ideas in classification. 2. To give a common action, movement, or condition to; to regulate and combine so as to produce harmonious action; to adjust; to harmonize; as, to coördinate muscular movements.\n\n1. A thing of the same rank with another thing; one two or more persons or things of equal rank, authority, or importance. It has neither coördinate nor analogon; it is absolutely one. Coleridge. 2. pl. (Math.)  Lines, or other elements of reference, by means of which the position of any point, as of a curve, is defined with respect to certain fixed lines, or planes, called coördinate axes and coördinate planes. See Abscissa. Note: Coördinates are of several kinds, consisting in some of the different cases, of the following elements, namely: (a) (Geom. of Two Dimensions) The abscissa and ordinate of any point, taken together; as the abscissa PY and ordinate PX of the point P (Fig. 2, referred to the coördinate axes AY and AX. (b) Any radius vector PA (Fig. 1), together with its angle of inclination to a fixed line, APX, by which any point A in the same plane is referred to that fixed line, and a fixed point in it, called the pole, P. (c) (Geom. of Three Dimensions) Any three lines, or distances, PB, PC, PD (Fig. 3), taken parallel to three coördinate axes, AX, AY, AZ, and measured from the corresponding coördinate fixed planes, YAZ, XAZ, XAY, to any point in space, P, whose position is thereby determined with respect to these planes and axes. (d) A radius vector, the angle which it makes with a fixed plane, and the angle which its projection on the plane makes with a fixed line line in the plane, by which means any point in space at the free extremity of the radius vector is referred to that fixed plane and fixed line, and a fixed point in that line, the pole of the radius vector. Cartesian coördinates. See under Cartesian. -- Geographical coördinates, the latitude and longitude of a place, by which its relative situation on the globe is known. The height of the above the sea level constitutes a third coördinate. -- Polar coördinates, coördinates made up of a radius vector and its angle of inclination to another line, or a line and plane; as those defined in (b) and (d) above. -- Rectangular coördinates, coördinates the axes of which intersect at right angles. -- Rectilinear coördinates, coördinates made up of right lines. Those defined in (a) and (c) above are called also Cartesian coördinates. -- Trigonometrical or Spherical coördinates, elements of reference, by means of which the position of a point on the surface of a sphere may be determined with respect to two great circles of the sphere. -- Trilinear coördinates, coördinates of a point in a plane, consisting of the three ratios which the three distances of the point from three fixed lines have one to another."}