{"word":"couch","definition":"1. To lay upon a bed or other resting place. Where unbruised youth, with unstuffed brain, Does couch his limbs, there golden sleep doth reign. Shak. 2. To arrauge or dispose as in a bed; -- sometimes followed by the reflexive pronoun. The waters couch themselves as may be to the center of this globe, in a spherical convexity. T. Burnet. 3. To lay or deposit in a bed or layer; to bed. It is at this day in use at Gaza, to couch potsherds, or vessels of earth, in their walls. Bacon. 4. (Paper Making)  To transfer (as sheets of partly dried pulp) from the wire clotch mold to a felt blanket, for further drying. 5. To conceal; to include or involve darkly. There is all this, and more, that lies naturally couched under this allegory. L'Estrange. 6. To arrange; to place; to inlay. [Obs.] Chaucer. 7. To put into some form of language; to express; to phrase; -- used with in and under. A well-couched invective. Milton. I had received a letter from Flora couched in rather cool terms. Blackw. Mag. 8. (Med.)  To treat by pushing down or displacing the opaque lens with a needle; as, to couch a cataract. To couch a spear or lance, to lower to the position of attack; to place in rest. He stooped his head, and couched his spear, And spurred his steed to full career. Sir W. Scott. To couch malt, to spread malt on a floor. Mortimer.\n\n1. To lie down or recline, as on a bed or other place of rest; to repose; to lie. Where souls do couch on flowers, we 'll hand in hand. Shak. If I court moe women, you 'll couch with moe men. Shak. 2. To lie down for concealment; to hide; to be concealed; to be included or involved darkly. We 'll couch in the castle ditch, till we see the light of our fairies. Shak. The half-hidden, hallf-revealed wonders, that yet couch beneath the words of the Scripture. I. Taylor. 3. To bend the body, as in reverence, pain, labor, etc.; to stoop; to crouch. [Obs.] An aged squire That seemed to couch under his shield three-square. Spenser.\n\n1. A bed or place for repose or sleep; particularly, in the United States, a lounge. Gentle sleep . . . why liest thou with the vile In loathsome beds, and leavest the kingly couch Shak. Like one that wraps the drapery of his couch About him, and lies down to pleasant dreams. Bryant. 2. Any place for repose, as the lair of a beast, etc. 3. A mass of steeped barley spread upon a floor to germinate, in malting; or the floor occupied by the barley; as, couch of malt. 4. (Painting & Gilding)  A preliminary layer, as of color, size, etc."}