{"word":"count","definition":"1. To tell or name one by one, or by groups, for the purpose of ascertaining the whole number of units in a collection; to number; to enumerate; to compute; to reckon. Who can count the dust of Jacob Num. xxiii. 10. In a journey of forty miles, Avaux counted only three miserable cabins. Macaulay. 2. To place to an account; to ascribe or impute; to consider or esteem as belonging. Abracham believed God, and it was counted unto him for righteousness. Rom. iv. 3. 3. To esteem; to account; to reckon; to think, judge, or consider. I count myself in nothing else so happy As in a soul remembering my good friends. Shak. To count out. (a) To exclude (one) will not particapate or cannot be depended upon. (b) (House of Commons) To declare adjourned, as a sitting of the House, when it is ascertained that a quorum is not present. (c) To prevent the accession of (a person) to office, by a fraudulent return or count of the votes cast; -- said of a candidate really elected. [Colloq.] Syn. -- To calculate; number; reckon; compute; enumerate. See Calculate.\n\n1. To number or be counted; to possess value or carry weight; hence, to increase or add to the strength or influence of some party or interest; as, every vote counts; accidents count for nothing. This excellent man . . . counted among the best and wisest of English statesmen. J. A. Symonds. 2. To reckon; to rely; to depend; -- with on or upon. He was brewer to the palace; and it was apprehended that the government counted on his voice. Macaulay. I think it a great error to count upon the genius of a nation as a standing argument in all ages. Swift. 3. To take account or note; -- with of. [Obs.] \"No man counts of her beauty.\" Shak. 4. (Eng. Law)  To plead orally; to argue a matter in court; to recite a count. Burrill.\n\n1. The act of numbering; reckoning; also, the number ascertained by counting. Of blessed saints for to increase the count. Spenser. By this count, I shall be much in years. Shak. 2. An object of interest or account; value; estimation. [Obs.] \"All his care and count.\" Spenser. 3. (Law)  A formal statement of the plaintiff's case in court; in a more technical and correct sense, a particular allegation or charge in a declaration or indictment, separately setting forth the cause of action or prosecution. Wharton. Note: In the old law books, count was used synonymously with declaration. When the plaintiff has but a single cause of action, and makes but one statement of it, that statement is called indifferently count or declaration, most generally, however, the latter. But where the suit embraces several causes, or the plaintiff makes several different statements of the same cause of action, each statement is called a count, and all of them combined, a declaration. Bouvier. Wharton.\n\nA nobleman on the continent of Europe, equal in rank to an English earl. Note: Though the tittle Count has never been introduced into Britain, the wives of Earls have, from the earliest period of its history, been designated as Countesses. Brande & C. Count palatine. (a) Formerly, the proprietor of a county who possessed royal prerogatives within his county, as did the Earl of Chester, the Bishop of Durham, and the Duke of Lancaster. [Eng.] See County palatine, under County. (b) Originally, a high judicial officer of the German emperors; afterward, the holder of a fief, to whom was granted the right to exercise certain imperial powers within his own domains. [Germany]"}