{"word":"crack","definition":"1. To break or burst, with or without entire separation of the parts; as, to crack glass; to crack nuts. 2. To rend with grief or pain; to affect deeply with sorrow; hence, to disorder; to distract; to craze. O, madam, my old hear is cracked. Shak. He thought none poets till their brains were cracked. Roscommon. 3. To cause to sound suddenly and sharply; to snap; as, to crack a whip. 4. To utter smartly and sententiously; as, to crack a joke. B. Jonson. 5. To cry up; to extol; -- followed by up. [Low] To crack a bottle, to open the bottle and drink its contents. -- To crack a crib, to commit burglary. [Slang] -- To crack on, to put on; as, to crack on more sail, or more steam. [Colloq.]\n\n1. To burst or open in chinks; to break, with or without quite separating into parts. By misfortune it cracked in the coling. Boyle. The mirror cracked from side to side. Tennyson. 2. To be ruined or impaired; to fail. [Collog.] The credit . . . of exchequers cracks, when little comes in and much goes out. Dryden. 3. To utter a loud or sharp, sudden sound. As thunder when the clouds in autumn crack. Shak. 4. To utter vain, pompous words; to brag; to boast; -- with of. [Archaic.] Ethoipes of their sweet complexion crack. Shak.\n\n1. A partial separation of parts, with or without a perceptible opening; a chink or fissure; a narrow breach; a crevice; as, a crack in timber, or in a wall, or in glass. 2. Ropture; flaw; breach, in a moral sense. My love to thee is sound, sans crack or flaw. Shak. 3. A sharp, sudden sound or report; the sound of anything suddenly burst or broken; as, the crack of a falling house; the crack of thunder; the crack of a whip. Will the stretch out to the crack of doom Shak. 4. The tone of voice when changed at puberty. Though now our voices Have got the mannish crack. Shak. 5. Mental flaw; a touch of craziness; partial insanity; as, he has a crack. 6. A crazy or crack-brained person. [Obs.] I . . . can not get the Parliament to listen to me, who look upon me as a crack and a projector. Addison. 7. A boast; boasting. [Obs.] \"Crack and brags.\" Burton. \"Vainglorius cracks.\" Spenser. 8. Breach of chastity. [Obs.] Shak. 9. A boy, generally a pert, lively boy. [Obs.] Val. 'Tis a noble child. Vir. A crack, madam. Shak. 10. A brief time; an instant; as, to be with one in a crack. [Eng. & Scot. Colloq.] 11. Free conversation; friendly chat. [Scot.] What is crack in English . . . Acrack . . . a chat with a good, kindly human heart in it. P. P. Alexander.\n\nOf superior excellence; having qualities to be boasted of. [Colloq.] One of our crack speakers in the Commons. Dickens."}