{"word":"crane","definition":"A measure for fresh herrings, -- as many as will fill a barrel. [Scot.] H. Miller.\n\n1. (Zoöl.)  A wading bird of the genus Grus, and allied genera, of various species, having a long, straight bill, and long legs and neck. Note: The common European crane is Grus cinerea. The sand-hill crane (G. Mexicana) and the whooping crane (G. Americana) are large American species. The Balearic or crowned crane is Balearica pavonina. The name is sometimes erroneously applied to the herons and cormorants. 2. A machine for raising and lowering heavy weights, and, while holding them suspended, transporting them through a limited lateral distance. In one form it consists of a projecting arm or jib of timber or iron, a rotating post or base, and the necessary tackle, windlass, etc.; -- so called from a fancied similarity between its arm and the neck of a crane See Illust. Of Derrick. 3. An iron arm with horizontal motion, attached to the side or back of a fireplace, for supporting kettles, etc., over a fire. 4. A siphon, or bent pipe, for drawing liquors out of a cask. 5. (Naut.)  A forked post or projecting bracket to support spars, etc., -- generally used in pairs. See Crotch, 2. Crane fly (Zoöl.), a dipterous insect with long legs, of the genus Tipula. -- Derrick crane. See Derrick. -- Gigantic crane. (Zoöl.) See Adjutant, n., 3. -- Traveling crane, Traveler crane, Traversing crane (Mach.), a crane mounted on wheels; esp., an overhead crane consisting of a crab or other hoisting apparatus traveling on rails or beams fixed overhead, as in a machine shop or foundry. -- Water crane, a kind of hydrant with a long swinging spout, for filling locomotive tenders, water carts, etc., with water.\n\n1. To cause to rise; to raise or lift, as by a crane; -- with up. [R.] What engines, what instruments are used in craning up a soul, sunk below the center, to the highest heavens. Bates. An upstart craned up to the height he has. Massinger. 2. To stretch, as a crane stretches its neck; as, to crane the neck disdainfully. G. Eliot.\n\nto reach forward with head and neck, in order to see better; as, a hunter cranes forward before taking a leap. Beaconsfield. Thackeray. The passengers eagerly craning forward over the bulwarks. Howells. CRANE'S-BILL Crane's\"-bill` (krnz\"bl`), n. 1. (Bot.)  The geranium; -- so named from the long axis of the fruit, which resembles the beak of a crane. Dr. Prior. 2. (Surg.)  A pair of long-beaked forceps."}