{"word":"credit","definition":"1. Reliance on the truth of something said or done; belief; faith; trust; confidence. When Jonathan and the people heard these words they gave no credit into them, nor received them. 1 Macc. x. 46. 2. Reputation derived from the confidence of others; esteem; honor; good name; estimation. John Gilpin was a citizen Of credit and renown. Cowper. 3. A ground of, or title to, belief or confidence; authority derived from character or reputation. The things which we properly believe, be only such as are received on the credit of divine testimony. Hooker. 4. That which tends to procure, or add to, reputation or esteem; an honor. I published, because I was told I might please such as it was a credit to please. Pope. 5. Influence derived from the good opinion, confidence, or favor of others; interest. Having credit enough with his master to provide for his own interest. Clarendon. 6. (Com.)  Trust given or received; expectation of future playment for property transferred, or of fulfillment or promises given; mercantile reputation entitling one to be trusted; -- applied to individuals, corporations, communities, or nations; as, to buy goods on credit. Credit is nothing but the expectation of money, within some limited time. Locke. 7. The time given for payment for lands or goods sold on trust; as, a long credit or a short credit. 8. (Bookkeeping)  The side of an account on which are entered all items reckoned as values received from the party or the category named at the head of the account; also, any one, or the sum, of these items; -- the opposite of debit; as, this sum is carried to one's credit, and that to his debit; A has several credits on the books of B. Bank credit, or Cash credit. See under Cash. -- Bill of credit. See under Bill. -- Letter of credit, a letter or notification addressed by a banker to his correspondent, informing him that the person named therein is entitled to draw a certain sum of money; when addressed to several different correspondents, or when the money can be drawn in fractional sums in several different places, it is called a circular letter of credit. -- Public credit. (a) The reputation of, or general confidence in, the ability or readiness of a government to fulfull its pecuniary engagements. (b) The ability and fidelity of merchants or others who owe largely in a community. He touched the dead corpse of Public Credit, and it sprung upon its feet. D. Webster.\n\n1. To confide in the truth of; to give credence to; to put trust in; to believe. How shall they credit A poor unlearned virgin Shak. 2. To bring honor or repute upon; to do credit to; to raise the estimation of. You credit the church as much by your government as you did the school formerly by your wit. South. 3. (Bookkeeping)  To enter upon the credit side of an account; to give credit for; as, to credit the amount paid; to set to the credit of; as, to credit a man with the interest paid on a bond. To credit with, to give credit for; to assign as justly due to any one. Crove, Helmholtz, and Meyer, are more than any others to be credited with the clear enunciation of this doctrine. Newman."}