{"word":"cut","definition":"1. To sparate the parts of with, or as with, a sharp instrument; to make an incision in; to gash; to sever; to divide. You must cut this flesh from off his breast. Shak. Before the whistling winds the vessels fly, With rapid swiftness cut the liquid way. Pope. 2. To sever and cause to fall for the purpose of gathering; to hew; to mow or reap. Thy servants can skill to cut timer. 2. Chron. ii. 8 3. To sever and remove by cutting; to cut off; to dock; as, to cut the hair; to cut the nails. 4. To castrate or geld; as, to cut a horse. 5. To form or shape by cutting; to make by incision, hewing, etc.; to carve; to hew out. Why should a man. whose blood is warm within, Sit like his grandsire cut in alabaster Shak. Loopholes cut through thickest shade. Milton. 6. To wound or hurt deeply the snsibilities of; to pierce; to lacerate; as, sarcasm cuts to the quick. The man was cut to the heart. Addison. 7. To intersect; to cross; as, one line cuts another at right angles. 8. To refuse to recognize; to ignorre; as, to cut a person in the street; to cut one's acquaintance. [Colloq.] 9. To absent one's self from; as, to cut an appointment, a recitation. etc. [Colloq.] An English tradesman is always solicitous to cut the shop whenever he can do so with impunity. Thomas Hamilton. To cut a caper. See under Caper. -- To cut the cards, to divide a pack of cards into portions, in order to determine the deal or the trump, or to change the cards to be dealt. -- To cut a dash or a figure, to make a display. [Colloq.] -- To cut down. (a) To sever and cause to fall; to fell; to prostrate. \"Timber . . . cut down in the mountains of Cilicia.\" Knolles. (b) To put down; to abash; to humble, [Obs] \"So great is his natural eloquence, that he cuts doun the finest orator.\" Addison (c) To lessen; to retrench; to curtail; as, to cut down expenses. (d) (Naut.) To raze; as, to cut down a frigate into a sloop. -- To cut the knot or the Gordian knot, to dispose of a difficulty summarily; to solve it by prompt, arbitrary action, rather than by skill or patience. -- To cut lots, to determine lots by cuttings cards; to draw lots. -- To cut off. (a) To sever; to separate. I would to God, . . . The king had cut off my brother's. Shak. (b) To put an untimely death; to put an end to; to destroy. \"Irencut off by martyrdom.\" Addison. (c) To interrupt; as, to cut off communication; to cut off (the flow of) steam from (the boiler to) a steam engine. (d) To intercept; as,, to cut off an enemy's retreat. (e) To end; to finish; as, to cut off further debate. -- To cut out. (a) To remove by cutting or carving; as, to cut out a piece from a board. (b) To shape or form by cutting; as, to cut out a garment. \" A large forest cut out into walks.\" Addison. (c) To scheme; to contrive; to prepare; as, to cut out work for another day. \"Every man had cut out a place for himself.\" Addison. (d) To step in and take the place of; to supplant; as, to cut out a rival. [Colloq.] (e) To debar. \"I am cut out from anything but common acknowledgments.\" Pope. (f) To seize and carry off (a vessel) from a harbor, or from under the guns of an enemy. -- To cut to pieces. (a) To cut into pieces; as, to cut cloth to pieces. (b) To slaughter; as, to cut an army to pieces. -- To cut a play (Drama), to shorten it by leaving out passages, to adapt it for the stage. -- To cut rates (Railroads, etc.), to reduce the charges for transportation below the rates established between competing lines. -- To cut short, to arrest or check abruptly; to bring to a sudden termination. \"Achilles cut him short, and thus replied.\" Dryden. -- To cut stick, to make off clandestinely or precipitately. [Slang] -- To cut teeth, to put forth teeth; to have the teeth pierce through the gum and appear. -- To have cut one's eyeteeth, to be sharp and knowing. [Colloq.] -- To cut one's wisdom teeth, to come to years of discretion. -- To cut under, to undersell; as, to cut under a competitor in trade. -- To cut up. (a) To cut to pieces; as, to cut up an animal, or bushes. (b) To damage or destroy; to injure; to wound; as, to cut up a book or its author by severe criticism. \"This doctrine cuts up all government by the roots.\" Locke. (c) To afflict; to discourage; to demoralize; as, the death of his friend cut him up terribly. [Colloq.] Thackeray.\n\n1. To do the work of an edged tool; to serve in dividing or gashing; as, a knife cuts well. 2. To admit of incision or severance; to yield to a cutting instrument. Panels of white wood that cuts like cheese. Holmes. 3. To perform the operation of dividing, severing, incising, intersecting, etc.; to use a cutting instrument. He saved the lives of thousands by manner of cutting for the stone. Pope. 4. To make a stroke with a whip. 5. To interfere, as a horse. 6. To move or make off quickly. [Colloq.] 7. To divide a pack of cards into two portion to decide the deal or trump, or to schange the order of the cards to be dealt. To cut across, to pass over or through in the most direct way; as, to cut across a field. -- To cut and run, to make off suddenly and quickly; -- from the cutting of a ship's cable, when there is not time to raise the anchor. [Colloq.] -- To cut in or into, to interrupt; to jont an anything suddenly. -- To cut up. (a) To play pranks. [Colloq.] (b) To divide into portions well or ill; to have the property left at one's death turn out well or poorly when divided among heirs, legatees, etc. [Slang.] \"When I die, may I cut up as well as Morgan Pendennis.\" Thackeray.\n\n1. An opening made with an edged instrument; a cleft; a gash; a slash; a wound made by cutting; as, a sword cut. 2. A stroke or blow or cutting motion with an edged instrument; a stroke or blow with a whip. 3. That which wounds the feelings, as a harsh remark or criticism, or a sarcasm; personal discourtesy, as neglecting to recognize an acquaintance when meeting him; a slight. Rip called him by name, but the cur snarled, snapped his teeth, and passed on. This was an unkind cut indeed. W. Irving. 4. A notch, passage, or channel made by cutting or digging; a furrow; a groove; as, a cut for a railroad. This great cut or ditch Secostris . . . purposed to have made a great deal wider and deeper. Knolles. 5. The surface left by a cut; as, a smooth or clear cut. 6. A portion severed or cut off; a division; as, a cut of beef; a cut of timber. It should be understood, moreover, . . . that the group are not arbitrary cuts, but natural groups or types. Dana. 7. An engraved block or plate; the impression from such an engraving; as, a book illustrated with fine cuts. 8. (a) The act of dividing a pack cards. (b) The right to divide; as, whose cut is it 9. Manner in which a thing is cut or formed; shape; style; fashion; as, the cut of a garment. With eyes severe and beard of formal cut. Shak. 10. A common work horse; a gelding. [Obs.] He'll buy me a cut, forth for to ride. Beau. & Fl. 11. The failure of a college officer or student to be present at any appointed exercise. [College Cant] 12. A skein of yarn. Wright. A cut in rates (Railroad), a reduction in fare, freight charges, etc., below the established rates. -- A short cut, a cross route which shortens the way and cuts off a circuitous passage. -- The cut of one's jib, the general appearance of a person. [Colloq.] -- To draw cuts, to draw lots, as of paper, etc., cut unequal lengths. Now draweth cut . . . The which that hath the shortest shall begin. Chaucer.\n\n1. Gashed or divided, as by a cutting instrument. 2. Formed or shaped as by cuttting; carved. 3. Overcome by liquor; tipsy. [Slang] Cut and dried, prepered beforehand; not spontaneous. -- Cut glass, glass having a surface ground and polished in facets or figures. -- Cut nail, a nail cut by machinery from a rolled plate of iron, in distinction from a wrought nail. -- Cut stone, stone hewn or chiseled to shape after having been split from the quarry."}