{"word":"cycle","definition":"1. An imaginary circle or orbit in the heavens; one of the celestial spheres. Milton. 2. An interval of time in which a certain succession of events or phenomena is completed, and then returns again and again, uniformly and continually in the same order; a periodical space of time marked by the recurrence of something peculiar; as, the cucle of the seasons, or of the year. Wages . . . bear a full proportion . . . to the medium of provision during the last bad cycle of twenty years. Burke. 3. An age; a long period of time. Better fifty years of Europe than a cycle of Cathay. Tennyson. 4. An orderly list for a given time; a calendar. [Obs.] We . . . present our gardeners with a complete cycle of what is requisite to be done throughout every month of the year. Evelyn. 5. The circle of subjects connected with the exploits of the hero or heroes of some particular period which have severed as a popular theme for poetry, as the legend aof Arthur and the knights of the Round Table, and that of Charlemagne and his paladins. 6. (Bot.)  One entire round in a circle or a spire; as, a cycle or set of leaves. Gray. 7. A bicycle or tricycle, or other light velocipede. Calippic cycle, a period of 76 years, or four Metonic cycles; -- so called from Calippus, who proposed it as an improvement on the Metonic cycle. -- Cycle of eclipses, a priod of about 6,586 days, the time of revolution of the moon's node; -- called Saros by the Chaldeans. -- Cycle of indiction, a period of 15 years, employed in Roman and ecclesiastical chronology, not founded on any astronomical period, but having reference to certain judicial acts which took place at stated epochs under the Greek emperors. -- Cycle of the moon, or Metonic cycle, a period of 19 years, after the lapse of which the new and full moon returns to the same day of the year; -- so called from Meton, who first proposed it. -- Cycle of the sun, Solar cycle, a period of 28 years, at the end of which time the days of the month return to the same days of the week. The dominical or Sunday letter follows the same order; hence the solar cycle is also called the cycle of the Sunday letter. In the Gregorian calendar the solar cycle is in general interrupted at the end of the century.\n\n1. To pass through a cycle of changes; to recur in cycles. Tennyson. Darwin. 2. To ride a bicycle, tricycle, or other form of cycle."}