{"word":"dare","definition":"To have adequate or sufficient courage for any purpose; to be bold or venturesome; not to be afraid; to venture. I dare do all that may become a man; Who dares do more is none. Shak. Why then did not the ministers use their new law Bacause they durst not, because they could not. Macaulay. Who dared to sully her sweet love with suspicion. Thackeray. The tie of party was stronger than the tie of blood, because a partisan was more ready to dare without asking why. Jowett (Thu Note: The present tense, I dare, is really an old past tense, so that the third person is he dare, but the form he dares is now often used, and will probably displace the obsolescent he dare, through grammatically as incorrect as he shalls or he cans. Skeat. The pore dar plede (the poor man dare plead). P. Plowman. You know one dare not discover you. Dryden. The fellow dares nopt deceide me. Shak. Here boldly spread thy hands, no venom'd weed Dares blister them, no slimly snail dare creep. Beau. & Fl. Note: Formerly durst was also used as the present. Sometimes the old form dare is found for durst or dared.\n\n1. To have courage for; to attempt courageously; to venture to do or to undertake. What high concentration of steady feeling makes men dare every thing and do anything Bagehot. To wrest it from barbarism, to dare its solitudes. The Century. 2. To challenge; to provoke; to defy. Time, I dare thee to discover Such a youth and such a lover. Dryden.\n\n1. The quality of daring; venturesomeness; boldness; dash. [R.] It lends a luster . . . A large dare to our great enterprise. Shak. 2. Defiance; challenge. Childish, unworthy dares Are not enought to part our powers. Chapman. Sextus Pompeius Hath given the dare to Cæsar. Shak.\n\nTo lurk; to lie hid. [Obs.] Chaucer.\n\nTo terrify; to daunt. [Obs.] For I have done those follies, those mad mischiefs, Would dare a woman. Beau. & Fl. To dare larks, to catch them by producing terror through to use of mirrors, scarlet cloth, a hawk, etc., so that they lie still till a net is thrown over them. Nares.\n\nA small fish; the dace."}