{"word":"day","definition":"1. The time of light, or interval between one night and the next; the time between sunrise and sunset, or from dawn to darkness; hence, the light; sunshine. 2. The period of the earth's revolution on its axis. -- ordinarily divided into twenty-four hours. It is measured by the interval between two successive transits of a celestial body over the same meridian, and takes a specific name from that of the body. Thus, if this is the sun, the day (the interval between two successive transits of the sun's center over the same meridian) is called a solar day; if it is a star, a sidereal day; if it is the moon, a lunar day. See Civil day, Sidereal day, below. 3. Those hours, or the daily recurring period, allotted by usage or law for work. 4. A specified time or period; time, considered with reference to the existence or prominence of a person or thing; age; time. A man who was great among the Hellenes of his day. Jowett (Thucyd. ) If my debtors do not keep their day, . . . I must with patience all the terms attend. Dryden. 5. (Preceded by the) Some day in particular, as some day of contest, some anniversary, etc. The field of Agincourt, Fought on the day of Crispin Crispianus. Shak. His name struck fear, his conduct won the day. Roscommon. Note: Day is much used in self-explaining compounds; as, daybreak, daylight, workday, etc. Anniversary day. See Anniversary, n. -- Astronomical day, a period equal to the mean solar day, but beginning at noon instead of at midnight, its twenty-four hours being numbered from 1 to 24; also, the sidereal day, as that most used by astronomers. -- Born days. See under Born. -- Canicular days. See Dog day. -- Civil day, the mean solar day, used in the ordinary reckoning of time, and among most modern nations beginning at mean midnight; its hours are usually numbered in two series, each from 1 to 12. This is the period recognized by courts as constituting a day. The Babylonians and Hindoos began their day at sunrise, the Athenians and Jews at sunset, the ancient Egyptians and Romans at midnight. -- Day blindness. (Med.) See Nyctalopia. -- Day by day, or Day after day, daily; every day; continually; without intermission of a day. See under By. \"Day by day we magnify thee.\" Book of Common Prayer. -- Days in bank (Eng. Law), certain stated days for the return of writs and the appearance of parties; -- so called because originally peculiar to the Court of Common Bench, or Bench (bank) as it was formerly termed. Burrill. -- Day in court, a day for the appearance of parties in a suit. -- Days of devotion (R. C. Ch.), certain festivals on which devotion leads the faithful to attend mass. Shipley. -- Days of grace. See Grace. -- Days of obligation (R. C. Ch.), festival days when it is obligatory on the faithful to attend Mass. Shipley. -- Day owl, (Zoöl.), an owl that flies by day. See Hawk owl. -- Day rule (Eng. Law), an order of court (now abolished) allowing a prisoner, under certain circumstances, to go beyond the prison limits for a single day. -- Day school, one which the pupils attend only in daytime, in distinction from a boarding school. -- Day sight. (Med.) See Hemeralopia. -- Day's work (Naut.), the account or reckoning of a ship's course for twenty-four hours, from noon to noon. -- From day to day, as time passes; in the course of time; as, he improves from day to day. -- Jewish day, the time between sunset and sunset. -- Mean solar day (Astron.), the mean or average of all the apparent solar days of the year. -- One day, One of these days, at an uncertain time, usually of the future, rarely of the past; sooner or later. \"Well, niece, I hope to see you one day fitted with a husband.\" Shak. -- Only from day to day, without certainty of continuance; temporarily. Bacon. -- Sidereal day, the interval between two successive transits of the first point of Aries over the same meridian. The Sidereal day is 23 h. 56 m. 4.09 s. of mean solar time. -- To win the day, to gain the victory, to be successful. S. Butler. -- Week day, any day of the week except Sunday; a working day. -- Working day. (a) A day when work may be legally done, in distinction from Sundays and legal holidays. (b) The number of hours, determined by law or custom, during which a workman, hired at a stated price per day, must work to be entitled to a day's pay."}