{"word":"dead","definition":"1. Deprived of life; -- opposed to alive and living; reduced to that state of a being in which the organs of motion and life have irrevocably ceased to perform their functions; as, a dead tree; a dead man. \"The queen, my lord, is dead.\" Shak. The crew, all except himself, were dead of hunger. Arbuthnot. Seek him with candle, bring him dead or living. Shak. 2. Destitute of life; inanimate; as, dead matter. 3. Resembling death in appearance or quality; without show of life; deathlike; as, a dead sleep. 4. Still as death; motionless; inactive; useless; as, dead calm; a dead load or weight. 5. So constructed as not to transmit sound; soundless; as, a dead floor. 6. Unproductive; bringing no gain; unprofitable; as, dead capital; dead stock in trade. 7. Lacking spirit; dull; lusterless; cheerless; as, dead eye; dead fire; dead color, etc. 8. Monotonous or unvaried; as, a dead level or pain; a dead wall. \"The ground is a dead flat.\" C. Reade. 9. Sure as death; unerring; fixed; complete; as, a dead shot; a dead certainty. I had them a dead bargain. Goldsmith. 10. Bringing death; deadly. Shak. 11. Wanting in religious spirit and vitality; as, dead faith; dead works. \"Dead in trespasses.\" Eph. ii. 1. 12. (Paint.) (a) Flat; without gloss; -- said of painting which has been applied purposely to have this effect. (b) Not brilliant; not rich; thus, brown is a dead color, as compared with crimson. 13. (Law)  Cut off from the rights of a citizen; deprived of the power of enjoying the rights of property; as, one banished or becoming a monk is civilly dead. 14. (Mach.)  Not imparting motion or power; as, the dead spindle of a lathe, etc. See Spindle. Dead ahead (Naut.), directly ahead; -- said of a ship or any object, esp. of the wind when blowing from that point toward which a vessel would go. -- Dead angle (Mil.), an angle or space which can not be seen or defended from behind the parapet. -- Dead block, either of two wooden or iron blocks intended to serve instead of buffers at the end of a freight car. -- Dead calm (Naut.), no wind at all. -- Dead center, or Dead point (Mach.), either of two points in the orbit of a crank, at which the crank and connecting rod lie a straight line. It corresponds to the end of a stroke; as, A and B are dead centers of the crank mechanism in which the crank C drives, or is driven by, the lever L. -- Dead color (Paint.), a color which has no gloss upon it. -- Dead coloring (Oil paint.), the layer of colors, the preparation for what is to follow. In modern painting this is usually in monochrome. -- Dead door (Shipbuilding), a storm shutter fitted to the outside of the quarter-gallery door. -- Dead flat (Naut.), the widest or midship frame. -- Dead freight (Mar. Law), a sum of money paid by a person who charters a whole vessel but fails to make out a full cargo. The payment is made for the unoccupied capacity. Abbott. -- Dead ground (Mining), the portion of a vein in which there is no ore. -- Dead hand, a hand that can not alienate, as of a person civilly dead. \"Serfs held in dead hand.\" Morley. See Mortmain. -- Dead head (Naut.), a rough block of wood used as an anchor buoy. -- Dead heat, a heat or course between two or more race horses, boats, etc., in which they come out exactly equal, so that neither wins. -- Dead horse, an expression applied to a debt for wages paid in advance. [Law] -- Dead language, a language which is no longer spoken or in common use by a people, and is known only in writings, as the Hebrew, Greek, and Latin. -- Dead letter. (a) A letter which, after lying for a certain fixed time uncalled for at the post office to which it was directed, is then sent to the general post office to be opened. (b) That which has lost its force or authority; as, the law has become a dead letter. -- Dead-letter office, a department of the general post office where dead letters are examined and disposed of. -- Dead level, a term applied to a flat country. -- Dead lift, a direct lift, without assistance from mechanical advantage, as from levers, pulleys, etc.; hence, an extreme emergency. \"(As we say) at a dead lift.\" Robynson (More's Utopia). -- Dead line (Mil.), a line drawn within or around a military prison, to cross which involves for a prisoner the penalty of being instantly shot. -- Dead load (Civil Engin.), a constant, motionless load, as the weight of a structure, in distinction from a moving load, as a train of cars, or a variable pressure, as of wind. -- Dead march (Mus.), a piece of solemn music intended to be played as an accompaniment to a funeral procession. -- Dead nettle (Bot.), a harmless plant with leaves like a nettle (Lamium album). -- Dead oil (Chem.), the heavy oil obtained in the distillation of coal tar, and containing phenol, naphthalus, etc. -- Dead plate (Mach.), a solid covering over a part of a fire grate, to prevent the entrance of air through that part. -- Dead pledge, a mortgage. See Mortgage. -- Dead point. (Mach.) See Dead center. -- Dead reckoning (Naut.), the method of determining the place of a ship from a record kept of the courses sailed as given by compass, and the distance made on each course as found by log, with allowance for leeway, etc., without the aid of celestial observations. -- Dead rise, the transverse upward curvature of a vessel's floor. -- Dead rising, an elliptical line drawn on the sheer plan to determine the sweep of the floorheads throughout the ship's length. -- Dead-Sea apple. See under Apple. -- Dead set. See under Set. -- Dead shot. (a) An unerring marksman. (b) A shot certain to be made. -- Dead smooth, the finest cut made; -- said of files. -- Dead wall (Arch.), a blank wall unbroken by windows or other openings. -- Dead water (Naut.), the eddy water closing in under a ship's stern when sailing. -- Dead weight. (a) A heavy or oppressive burden. Dryden. (b) (Shipping) A ship's lading, when it consists of heavy goods; or, the heaviest part of a ship's cargo. (c) (Railroad) The weight of rolling stock, the live weight being the load. Knight. -- Dead wind (Naut.), a wind directly ahead, or opposed to the ship's course. -- To be dead, to die. [Obs.] I deme thee, thou must algate be dead. Chaucer. Syn. -- Inanimate; deceased; extinct. See Lifeless.\n\nTo a degree resembling death; to the last degree; completely; wholly. [Colloq.] I was tired of reading, and dead sleepy. Dickens. Dead drunk, so drunk as to be unconscious.\n\n1. The most quiet or deathlike time; the period of profoundest repose, inertness, or gloom; as, the dead of winter. When the drum beat at dead of night. Campbell. 2. One who is dead; -- commonly used collectively. And Abraham stood up from before his dead. Gen. xxiii. 3.\n\nTo make dead; to deaden; to deprive of life, force, or vigor. [Obs.] Heaven's stern decree, With many an ill, hath numbed and deaded me. Chapman.\n\nTo die; to lose life or force. [Obs.] So iron, as soon as it is out of the fire, deadeth straightway. Bacon."}