{"word":"death","definition":"1. The cessation of all vital phenomena without capability of resuscitation, either in animals or plants. Note: Local death is going on at times and in all parts of the living body, in which individual cells and elements are being cast off and replaced by new; a process essential to life. General death is of two kinds; death of the body as a whole (somatic or systemic death), and death of the tissues. By the former is implied the absolute cessation of the functions of the brain, the circulatory and the respiratory organs; by the latter the entire disappearance of the vital actions of the ultimate structural constituents of the body. When death takes place, the body as a whole dies first, the death of the tissues sometimes not occurring until after a considerable interval. Huxley. 2. Total privation or loss; extinction; cessation; as, the death of memory. The death of a language can not be exactly compared with the death of a plant. J. Peile. 3. Manner of dying; act or state of passing from life. A death that I abhor. Shak. Let me die the death of the righteous. Num. xxiii. 10. 4. Cause of loss of life. Swiftly flies the feathered death. Dryden. He caught his death the last county sessions. Addison. 5. Personified: The destroyer of life, -- conventionally represented as a skeleton with a scythe. Death! great proprietor of all. Young. And I looked, and behold a pale horse; and his name that at on him was Death. Rev. vi. 8. 6. Danger of death. \"In deaths oft.\" 2 Cor. xi. 23. 7. Murder; murderous character. Not to suffer a man of death to live. Bacon. 8. (Theol.)  Loss of spiritual life. To be death. Rom. viii. 6. 9. Anything so dreadful as to be like death. It was death to them to think of entertaining such doctrines. Atterbury. And urged him, so that his soul was vexed unto death. Judg. xvi. 16. Note: Death is much used adjectively and as the first part of a compound, meaning, in general, of or pertaining to death, causing or presaging death; as, deathbed or death bed; deathblow or death blow, etc. Black death. See Black death, in the Vocabulary. -- Civil death, the separation of a man from civil society, or the debarring him from the enjoyment of civil rights, as by banishment, attainder, abjuration of the realm, entering a monastery, etc. Blackstone. -- Death adder. (Zoöl.) (a) A kind of viper found in South Africa (Acanthophis tortor); -- so called from the virulence of its venom. (b) A venomous Australian snake of the family Elapidæ, of several species, as the Hoplocephalus superbus and Acanthopis antarctica. -- Death bell, a bell that announces a death. The death bell thrice was heard to ring. Mickle. -- Death candle, a light like that of a candle, viewed by the superstitious as presaging death. -- Death damp, a cold sweat at the coming on of death. -- Death fire, a kind of ignis fatuus supposed to forebode death. And round about in reel and rout, The death fires danced at night. Coleridge. -- Death grapple, a grapple or struggle for life. -- Death in life, a condition but little removed from death; a living death. [Poetic] \"Lay lingering out a five years' death in life.\" Tennyson. -- Death knell, a stroke or tolling of a bell, announcing a death. -- Death rate, the relation or ratio of the number of deaths to the population. At all ages the death rate is higher in towns than in rural districts. Darwin. -- Death rattle, a rattling or gurgling in the throat of a dying person. -- Death's door, the boundary of life; the partition dividing life from death. -- Death stroke, a stroke causing death. -- Death throe, the spasm of death. -- Death token, the signal of approaching death. -- Death warrant. (a) (Law) An order from the proper authority for the execution of a criminal. (b) That which puts an end to expectation, hope, or joy. -- Death wound. (a) A fatal wound or injury. (b) (Naut.) The springing of a fatal leak. -- Spiritual death (Scripture), the corruption and perversion of the soul by sin, with the loss of the favor of God. -- The gates of death, the grave. Have the gates of death been opened unto thee Job xxxviii. 17. -- The second death, condemnation to eternal separation from God. Rev. ii. 11. -- To be the death of, to be the cause of death to; to make die. \"It was one who should be the death of both his parents.\" Milton. Syn. -- Death, Decrase, Departure, Release. Death applies to the termination of every form of existence, both animal and vegetable; the other words only to the human race. Decease is the term used in law for the removal of a human being out of life in the ordinary course of nature. Demise was formerly confined to decease of princes, but is now sometimes used of distinguished men in general; as, the demise of Mr. Pitt. Departure and release are peculiarly terms of Christian affection and hope. A violent death is not usually called a decease. Departure implies a friendly taking leave of life. Release implies a deliverance from a life of suffering or sorrow."}