{"word":"deep","definition":"1. Extending far below the surface; of great perpendicular dimension (measured from the surface downward, and distinguished from high, which is measured upward); far to the bottom; having a certain depth; as, a deep sea. The water where the brook is deep. Shak. 2. Extending far back from the front or outer part; of great horizontal dimension (measured backward from the front or nearer part, mouth, etc.); as, a deep cave or recess or wound; a gallery ten seats deep; a company of soldiers six files deep. Shadowing squadrons deep. Milton. Safely in harbor Is the king's ship in the deep nook. Shak. 3. Low in situation; lying far below the general surface; as, a deep valley. 4. Hard to penetrate or comprehend; profound; -- opposed to shallow or superficial; intricate; mysterious; not obvious; obscure; as, a deep subject or plot. Speculations high or deep. Milton. A question deep almost as the mystery of life. De Quincey. O Lord, . . . thy thought are very deep. Ps. xcii. 5. 5. Of penetrating or far-reaching intellect; not superficial; thoroughly skilled; sagacious; cunning. Deep clerks she dumbs. Shak. 6. Profound; thorough; complete; unmixed; intense; heavy; heartfelt; as, deep distress; deep melancholy; deep horror. \"Deep despair.\" Milton. \"Deep silence.\" Milton. \"Deep sleep.\" Gen. ii. 21. \"Deeper darkness.\" Hoole. \"Their deep poverty.\" 2 Cor. viii. 2. An attitude of deep respect. Motley. 7. Strongly colored; dark; intense; not light or thin; as, deep blue or crimson. 8. Of low tone; full-toned; not high or sharp; grave; heavy. \"The deep thunder.\" Byron. The bass of heaven's deep organ. Milton. 9. Muddy; boggy; sandy; -- said of roads. Chaucer. The ways in that vale were very deep. Clarendon. A deep line of operations (Military), a long line. -- Deep mourning (Costume), mourning complete and strongly marked, the garments being not only all black, but also composed of lusterless materials and of such fashion as is identified with mourning garments.\n\nTo a great depth; with depth; far down; profoundly; deeply. Deep-versed in books, and shallow in himself. Milton. Drink deep, or taste not the Pierian spring. Pope. Note: Deep, in its usual adverbial senses, is often prefixed to an adjective; as, deep-chested, deep-cut, deep-seated, deep-toned, deep- voiced, \"deep-uddered kine.\"\n\n1. That which is deep, especially deep water, as the sea or ocean; an abyss; a great depth. Courage from the deeps of knowledge springs. Cowley. The hollow deep of hell resounded. Milton. Blue Neptune storms, the bellowing deeps resound. Pope. 2. That which is profound, not easily fathomed, or incomprehensible; a moral or spiritual depth or abyss. Thy judgments are a great. Ps. xxxvi. 6. Deep of night, the most quiet or profound part of night; dead of night. The deep of night is crept upon our talk. Shak."}