{"word":"deliver","definition":"1. To set free from restraint; to set at liberty; to release; to liberate, as from control; to give up; to free; to save; to rescue from evil actual or feared; -- often with from or out of; as, to deliver one from captivity, or from fear of death. He that taketh warning shall deliver his soul. Ezek. xxxiii. 5. Promise was that I Should Israel from Philistian yoke deliver. Milton. 2. To give or transfer; to yield possession or control of; to part with (to); to make over; to commit; to surrender; to resign; -- often with up or over, to or into. Thou shalt deliver Pharaoh's cup into his hand. Gen. xl. 13. The constables have delivered her over. Shak. The exalted mind All sense of woe delivers to the wind. Pope. 3. To make over to the knowledge of another; to communicate; to utter; to speak; to impart. Till he these words to him deliver might. Spenser. Whereof the former delivers the precepts of the art, and the latter the perfection. Bacon. 4. To give forth in action or exercise; to discharge; as, to deliver a blow; to deliver a broadside, or a ball. Shaking his head and delivering some show of tears. Sidney. An uninstructed bowler . . . thinks to attain the jack by delivering his bowl straightforward. Sir W. Scott. 5. To free from, or disburden of, young; to relieve of a child in childbirth; to bring forth; -- often with of. She was delivered safe and soon. Gower. Tully was long ere he could be delivered of a few verses, and those poor ones. Peacham. 6. To discover; to show. [Poetic] I 'll deliver Myself your loyal servant. Shak. 7. To deliberate. [Obs.] Chaucer. 8. To admit; to allow to pass. [Obs.] Bacon. Syn. -- To Deliver, Give Forth, Discharge, Liberate, Pronounce, Utter. Deliver denotes, literally, to set free. Hence the term is extensively applied to cases where a thing is made to pass from a confined state to one of greater freedom or openness. Hence it may, in certain connections, be used as synonymous with any or all of the above-mentioned words, as will be seen from the following examples: One who delivers a package gives it forth; one who delivers a cargo discharges it; one who delivers a captive liberates him; one who delivers a message or a discourse utters or pronounces it; when soldiers deliver their fire, they set it free or give it forth.\n\nFree; nimble; sprightly; active. [Obs.] Wonderly deliver and great of strength. Chaucer."}