{"word":"design","definition":"1. To draw preliminary outline or main features of; to sketch for a pattern or model; to delineate; to trace out; to draw. Dryden. 2. To mark out and exhibit; to designate; to indicate; to show; to point out; to appoint. We shall see Justice design the victor's chivalry. Shak. Meet me to-morrow where the master And this fraternity shall design. Beau. & Fl. 3. To create or produce, as a work of art; to form a plan or scheme of; to form in idea; to invent; to project; to lay out in the mind; as, a man designs an essay, a poem, a statue, or a cathedral. 4. To intend or purpose; -- usually with for before the remote object, but sometimes with to. Ask of politicians the end for which laws were originally designed. Burke. He was designed to the study of the law. Dryden. Syn. -- To sketch; plan; purpose; intend; propose; project; mean.\n\nTo form a design or designs; to plan. Design for, to intend to go to. [Obs.] \"From this city she designed for Collin [Cologne].\" Evelyn.\n\n1. A preliminary sketch; an outline or pattern of the main features of something to be executed, as of a picture, a building, or a decoration; a delineation; a plan. 2. A plan or scheme formed in the mind of something to be done; preliminary conception; idea intended to be expressed in a visible form or carried into action; intention; purpose; -- often used in a bad sense for evil intention or purpose; scheme; plot. The vast design and purposTennyson. The leaders of that assembly who withstood the designs of a besotted woman. Hallam. A . . . settled design upon another man's life. Locke. How little he could guess the secret designs of the court! Macaulay. 3. Specifically, intention or purpose as revealed or inferred from the adaptation of means to an end; as, the argument from design. 4. The realization of an inventive or decorative plan; esp., a work of decorative art considered as a new creation; conception or plan shown in completed work; as, this carved panel is a fine design, or of a fine design. 5. (Mus.)  The invention and conduct of the subject; the disposition of every part, and the general order of the whole. Arts of design, those into which the designing of artistic forms and figures enters as a principal part, as architecture, painting, engraving, sculpture. -- School of design, one in which are taught the invention and delineation of artistic or decorative figures, patterns, and the like. Syn. -- Intention; purpose; scheme; project; plan; idea. -- Design, Intention, Purpose. Design has reference to something definitely aimed at. Intention points to the feelings or desires with which a thing is sought. Purpose has reference to a settled choice or determination for its attainment. \"I had no design to injure you,\" means it was no part of my aim or object. \"I had no intention to injure you,\" means, I had no wish or desire of that kind. \"My purpose was directly the reverse,\" makes the case still stronger. Is he a prudent man . . . that lays designs only for a day, without any prospect to the remaining part of his life Tillotson. I wish others the same intention, and greater successes. Sir W. Temple. It is the purpose that makes strong the vow. Shak."}