{"word":"devil","definition":"1. The Evil One; Satan, represented as the tempter and spiritual of mankind. [Jesus] being forty days tempted of the devil. Luke iv. 2. That old serpent, called the Devil, and Satan, which deceiveth the whole world. Rev. xii. 9. 2. An evil spirit; a demon. A dumb man possessed with a devil. Matt. ix. 32. 3. A very wicked person; hence, any great evil. \"That devil Glendower.\" \"The devil drunkenness.\" Shak. Have not I chosen you twelve, and one of you is a devil John vi. 70. 4. An expletive of surprise, vexation, or emphasis, or, ironically, of negation. [Low] The devil a puritan that he is, . . . but a timepleaser. Shak. The things, we know, are neither rich nor rare, But wonder how the devil they got there. Pope. 5. (Cookery)  A dish, as a bone with the meat, broiled and excessively peppered; a grill with Cayenne pepper. Men and women busy in baking, broiling, roasting oysters, and preparing devils on the gridiron. Sir W. Scott. 6. (Manuf.)  A machine for tearing or cutting rags, cotton, etc. Blue devils. See under Blue. -- Cartesian devil. See under Cartesian. -- Devil bird (Zoöl.), one of two or more South African drongo shrikes (Edolius retifer, and E. remifer), believed by the natives to be connected with sorcery. -- Devil may care, reckless, defiant of authority; -- used adjectively. Longfellow. -- Devil's apron (Bot.), the large kelp (Laminaria saccharina, and L. longicruris) of the Atlantic ocean, having a blackish, leathery expansion, shaped somewhat like an apron. -- Devil's coachhorse. (Zoöl.) (a) The black rove beetle (Ocypus olens). [Eng.] (b) A large, predacious, hemipterous insect (Prionotus cristatus); the wheel bug. [U.S.] -- Devil's darning-needle. (Zoöl.) See under Darn, v. t. -- Devil's fingers, Devil's hand (Zoöl.), the common British starfish (Asterias rubens); -- also applied to a sponge with stout branches. [Prov. Eng., Irish & Scot.] -- Devil's riding-horse (Zoöl.), the American mantis (Mantis Carolina). -- The Devil's tattoo, a drumming with the fingers or feet. \"Jack played the Devil's tattoo on the door with his boot heels.\" F. Hardman (Blackw. Mag.). -- Devil worship, worship of the power of evil; -- still practiced by barbarians who believe that the good and evil forces of nature are of equal power. -- Printer's devil, the youngest apprentice in a printing office, who runs on errands, does dirty work (as washing the ink rollers and sweeping), etc. \"Without fearing the printer's devil or the sheriff's officer.\" Macaulay. -- Tasmanian devil (Zoöl.), a very savage carnivorous marsupial of Tasmania (Dasyurus, or Diabolus, ursinus). -- To play devil with, to molest extremely; to ruin. [Low]\n\n1. To make like a devil; to invest with the character of a devil. 2. To grill with Cayenne pepper; to season highly in cooking, as with pepper. A deviled leg of turkey. W. Irving. deviled egg a hard-boiled egg, sliced into halves and with the yolk removed and replaced with a paste, usually made from the yolk and mayonnaise, seasoned with salt and/or spices such as paprika."}