{"word":"die","definition":"1. To pass from an animate to a lifeless state; to cease to live; to suffer a total and irreparable loss of action of the vital functions; to become dead; to expire; to perish; -- said of animals and vegetables; often with of, by, with, from, and rarely for, before the cause or occasion of death; as, to die of disease or hardships; to die by fire or the sword; to die with horror at the thought. To die by the roadside of grief and hunger. Macaulay. She will die from want of care. Tennyson. 2. To suffer death; to lose life. In due time Christ died for the ungodly. Rom. v. 6. 3. To perish in any manner; to cease; to become lost or extinct; to be extinguished. Letting the secret die within his own breast. Spectator. Great deeds can not die. Tennyson. 4. To sink; to faint; to pine; to languish, with weakness, discouragement, love, etc. His heart died within, and he became as a stone. 1 Sam. xxv. 37. The young men acknowledged, in love letters, that they died for Rebecca. Tatler. 5. To become indifferent; to cease to be subject; as, to die to pleasure or to sin. 6. To recede and grow fainter; to become imperceptible; to vanish; -- often with out or away. Blemishes may die away and disappear amidst the brightness. Spectator. 7. (Arch.)  To disappear gradually in another surface, as where moldings are lost in a sloped or curved face. 8. To become vapid, flat, or spiritless, as liquor. To die in the last ditch, to fight till death; to die rather than surrender. \"There is one certain way,\" replied the Prince [William of Orange] \" by which I can be sure never to see my country's ruin, -- I will die in the last ditch.\" Hume (Hist. of Eng. ). -- To die out, to cease gradually; as, the prejudice has died out. Syn. -- To expire; decease; perish; depart; vanish.\n\n1. A small cube, marked on its faces with spots from one to six, and used in playing games by being shaken in a box and thrown from it. See Dice. 2. Any small cubical or square body. Words . . . pasted upon little flat tablets or dies. Watts. 3. That which is, or might be, determined, by a throw of the die; hazard; chance. Such is the die of war. Spenser. 4. (Arch.)  That part of a pedestal included between base and cornice; the dado. 5. (Mach.) (a) A metal or plate (often one of a pair) so cut or shaped as to give a certain desired form to, or impress any desired device on, an object or surface, by pressure or by a blow; used in forging metals, coining, striking up sheet metal, etc. (b) A perforated block, commonly of hardened steel used in connection with a punch, for punching holes, as through plates, or blanks from plates, or for forming cups or capsules, as from sheet metal, by drawing. (c) A hollow internally threaded screw-cutting tool, made in one piece or composed of several parts, for forming screw threads on bolts, etc.; one of the separate parts which make up such a tool. Cutting die (Mech.), a thin, deep steel frame, sharpened to a cutting edge, for cutting out articles from leather, cloth, paper, etc. -- The die is cast, the hazard must be run; the step is taken, and it is too late to draw back; the last chance is taken."}