{"word":"differential","definition":"1. Relating to or indicating a difference; creating a difference; discriminating; special; as, differential characteristics; differential duties; a differential rate. For whom he produced differential favors. Motley. 2. (Math.)  Of or pertaining to a differential, or to differentials. 3. (Mech.)  Relating to differences of motion or leverage; producing effects by such differences; said of mechanism. Differential calculus. (Math.) See under Calculus. -- Differential coefficient, the limit of the ratio of the increment of a function of a variable to the increment of the variable itself, when these increments are made indefinitely small. -- Differential coupling, a form of slip coupling used in light machinery to regulate at pleasure the velocity of the connected shaft. -- Differential duties (Polit. Econ.), duties which are not imposed equally upon the same products imported from different countries. -- Differential galvanometer (Elec.), a galvanometer having two coils or circuits, usually equal, through which currents passing in opposite directions are measured by the difference of their effect upon the needle. -- Differential gearing, a train of toothed wheels, usually an epicyclic train, so arranged as to constitute a differential motion. -- Differential motion, a mechanism in which a simple differential combination produces such a change of motion or force as would, with ordinary compound arrangements, require a considerable train of parts. It is used for overcoming great resistance or producing very slow or very rapid motion. -- Differential pulley. (Mach.) (a) A portable hoisting apparatus, the same in principle as the differential windlass. (b) A hoisting pulley to which power is applied through a differential gearing. -- Differential screw, a compound screw by which a motion is produced equal to the difference of the motions of the component screws. -- Differential thermometer, a thermometer usually with a U-shaped tube terminating in two air bulbs, and containing a colored liquid, used for indicating the difference between the temperatures to which the two bulbs are exposed, by the change of position of the colored fluid, in consequence of the different expansions of the air in the bulbs. A graduated scale is attached to one leg of the tube. -- Differential windlass, or Chinese windlass, a windlass whose barrel has two parts of different diameters. The hoisting rope winds upon one part as it unwinds from the other, and a pulley sustaining the weight to be lifted hangs in the bight of the rope. It is an ancient example of a differential motion.\n\n1. (Math.)  An increment, usually an indefinitely small one, which is given to a variable quantity. Note: According to the more modern writers upon the differential and integral calculus, if two or more quantities are dependent on each other, and subject to increments of value, their differentials need not be small, but are any quantities whose ratios to each other are the limits to which the ratios of the increments approximate, as these increments are reduced nearer and nearer to zero. 2. A small difference in rates which competing railroad lines, in establishing a common tariff, allow one of their number to make, in order to get a fair share of the business. The lower rate is called a differential rate. Differentials are also sometimes granted to cities. 3. (Elec.) (a) One of two coils of conducting wire so related to one another or to a magnet or armature common to both, that one coil produces polar action contrary to that of the other. (b) A form of conductor used for dividing and distributing the current to a series of electric lamps so as to maintain equal action in all. Knight. Partial differential (Math.), the differential of a function of two or more variables, when only one of the variables receives an increment. -- Total differential (Math.), the differential of a function of two or more variables, when each of the variables receives an increment. The total differential of the function is the sum of all the partial differentials."}