{"word":"difference","definition":"1. The act of differing; the state or measure of being different or unlike; distinction; dissimilarity; unlikeness; variation; as, a difference of quality in paper; a difference in degrees of heat, or of light; what is the difference between the innocent and the guilty Differencies of administration, but the same Lord. 1 Cor. xii. 5. 2. Disagreement in opinion; dissension; controversy; quarrel; hence, cause of dissension; matter in controversy. What was the difference It was a contention in public. Shak. Away therefore went I with the constable, leaving the old warden and the young constable to compose their difference as they could. T. Ellwood. 3. That by which one thing differs from another; that which distinguishes or causes to differ;; mark of distinction; characteristic quality; specific attribute. The marks and differences of sovereignty. Davies. 4. Choice; preference. [Obs.] That now be chooseth with vile difference To be a beast, and lack intelligence. Spenser. 5. (Her.)  An addition to a coat of arms to distinguish the bearings of two persons, which would otherwise be the same. See Augmentation, and Marks of cadency, under Cadency. 6. (Logic)  The quality or attribute which is added to those of the genus to constitute a species; a differentia. 7. (Math.)  The quantity by which one quantity differs from another, or the remainder left after subtracting the one from the other. Ascensional difference. See under Ascensional. Syn. -- Distinction; dissimilarity; dissimilitude; variation; diversity; variety; contrariety; disagreement; variance; contest; contention; dispute; controversy; debate; quarrel; wrangle; strife.\n\nTo cause to differ; to make different; to mark as different; to distinguish. Thou mayest difference gods from men. Chapman. Kings, in receiving justice and undergoing trial, are not differenced from the meanest subject. Milton. So completely differenced by their separate and individual characters that we at once acknowledge them as distinct persons. Sir W. Scott."}