{"word":"digest","definition":"1. To distribute or arrange methodically; to work over and classify; to reduce to portions for ready use or application; as, to digest the laws, etc. Joining them together and digesting them into order. Blair. We have cause to be glad that matters are so well digested. Shak. 2. (Physiol.)  To separate (the food) in its passage through the alimentary canal into the nutritive and nonnutritive elements; to prepare, by the action of the digestive juices, for conversion into blood; to convert into chyme. 3. To think over and arrange methodically in the mind; to reduce to a plan or method; to receive in the mind and consider carefully; to get an understanding of; to comprehend. Feelingly digest the words you speak in prayer. Sir H. Sidney. How shall this bosom multiplied digest The senate's courtesy Shak. 4. To appropriate for strengthening and comfort. Grant that we may in such wise hear them [the Scriptures], read, mark, learn, and inwardly digest them. Book of Common Prayer. 5. Hence: To bear comfortably or patiently; to be reconciled to; to brook. I never can digest the loss of most of Origin's works. Coleridge. 6. (Chem.)  To soften by heat and moisture; to expose to a gentle heat in a boiler or matrass, as a preparation for chemical operations. 7. (Med.)  To dispose to suppurate, or generate healthy pus, as an ulcer or wound. 8. To ripen; to mature. [Obs.] Well-digested fruits. Jer. Taylor. 9. To quiet or abate, as anger or grief.\n\n1. To undergo digestion; as, food digests well or ill. 2. (Med.)  To suppurate; to generate pus, as an ulcer.\n\nThat which is digested; especially, that which is worked over, classified, and arranged under proper heads or titles; esp. (Law),  a compilation of statutes or decisions analytically arranged. The term is applied in a general sense to the Pandects of Justinian (see Pandect), but is also specially given by authors to compilations of laws on particular topics; a summary of laws; as, Comyn's Digest; the United States Digest. A complete digest of Hindu and Mahommedan laws after the model of Justinian's celebrated Pandects. Sir W. Jones. They made a sort of institute and digest of anarchy, called the Rights of Man. Burke."}