{"word":"dimension","definition":"1. Measure in a single line, as length, breadth, height, thickness, or circumference; extension; measurement; -- usually, in the plural, measure in length and breadth, or in length, breadth, and thickness; extent; size; as, the dimensions of a room, or of a ship; the dimensions of a farm, of a kingdom. Gentlemen of more than ordinary dimensions. W. Irving. Space of dimension, extension that has length but no breadth or thickness; a straight or curved line. -- Space of two dimensions, extension which has length and breadth, but no thickness; a plane or curved surface. -- Space of three dimensions, extension which has length, breadth, and thickness; a solid. -- Space of four dimensions, as imaginary kind of extension, which is assumed to have length, breadth, thickness, and also a fourth imaginary dimension. Space of five or six, or more dimensions is also sometimes assumed in mathematics. 2. Extent; reach; scope; importance; as, a project of large dimensions. 3. (Math.)  The degree of manifoldness of a quantity; as, time is quantity having one dimension; volume has three dimensions, relative to extension. 4. (Alg.)  A literal factor, as numbered in characterizing a term. The term dimensions forms with the cardinal numbers a phrase equivalent to degree with the ordinal; thus, a2b2c is a term of five dimensions, or of the fifth degree. 5. pl. (Phys.)  The manifoldness with which the fundamental units of time, length, and mass are involved in determining the units of other physical quantities. Thus, since the unit of velocity varies directly as the unit of length and inversely as the unit of time, the dimensions of velocity are said to be length รท time; the dimensions of work are mass ร (length)2 รท (time)2; the dimensions of density are mass รท (length)3. Dimension lumber, Dimension scantling, or Dimension stock (Carp.), lumber for building, etc., cut to the sizes usually in demand, or to special sizes as ordered. -- Dimension stone, stone delivered from the quarry rough, but brought to such sizes as are requisite for cutting to dimensions given."}