{"word":"dip","definition":"1. To plunge or immerse; especially, to put for a moment into a liquid; to insert into a fluid and withdraw again. The priest shall dip his finger in the blood. Lev. iv. 6. [Wat'ry fowl] now dip their pinions in the briny deep. Pope. While the prime swallow dips his wing. Tennyson. 2. To immerse for baptism; to baptize by immersion. Book of Common Prayer. Fuller. 3. To wet, as if by immersing; to moisten. [Poetic] A cold shuddering dew Dips me all o'er. Milton. 4. To plunge or engage thoroughly in any affair. He was . . . dipt in the rebellion of the Commons. Dryden. 5. To take out, by dipping a dipper, ladle, or other receptacle, into a fluid and removing a part; -- often with out; as, to dip water from a boiler; to dip out water. 6. To engage as a pledge; to mortgage. [Obs.] Live on the use and never dip thy lands. Dryden. Dipped candle, a candle made by repeatedly dipping a wick in melted tallow. -- To dip snuff, to take snuff by rubbing it on the gums and teeth. [Southern U. S.] -- To dip the colors (Naut.), to lower the colors and return them to place; -- a form of naval salute.\n\n1. To immerse one's self; to become plunged in a liquid; to sink. The sun's rim dips; the stars rush out. Coleridge. 2. To perform the action of plunging some receptacle, as a dipper, ladle. etc.; into a liquid or a soft substance and removing a part. Whoever dips too deep will find death in the pot. L'Estrange. 3. To pierce; to penetrate; -- followed by in or into. When I dipt into the future. Tennyson. 4. To enter slightly or cursorily; to engage one's self desultorily or by the way; to partake limitedly; -- followed by in or into. \"Dipped into a multitude of books.\" Macaulay. 5. To incline downward from the plane of the horizon; as, strata of rock dip. 6. To dip snuff. [Southern U.S.]\n\n1. The action of dipping or plunging for a moment into a liquid. \"The dip of oars in unison.\" Glover. 2. Inclination downward; direction below a horizontal line; slope; pitch. 3. A liquid, as a sauce or gravy, served at table with a ladle or spoon. [Local, U.S.] Bartlett. 4. A dipped candle. [Colloq.] Marryat. Dip of the horizon (Astron.), the angular depression of the seen or visible horizon below the true or natural horizon; the angle at the eye of an observer between a horizontal line and a tangent drawn from the eye to the surface of the ocean. -- Dip of the needle, or Magnetic dip, the angle formed, in a vertical plane, by a freely suspended magnetic needle, or the line of magnetic force, with a horizontal line; -- called also inclination. -- Dip of a stratum (Geol.), its greatest angle of inclination to the horizon, or that of a line perpendicular to its direction or strike; -- called also the pitch."}