{"word":"discipline","definition":"1. The treatment suited to a disciple or learner; education; development of the faculties by instruction and exercise; training, whether physical, mental, or moral. Wife and children are a kind of discipline of humanity. Bacon. Discipline aims at the removal of bad habits and the substitution of good ones, especially those of order, regularity, and obedience. C. J. Smith. 2. Training to act in accordance with established rules; accustoming to systematic and regular action; drill. Their wildness lose, and, quitting nature's part, Obey the rules and discipline of art. Dryden. 3. Subjection to rule; submissiveness to order and control; habit of obedience. The most perfect, who have their passions in the best discipline, are yet obliged to be constantly on their guard. Rogers. 4. Severe training, corrective of faults; instruction by means of misfortune, suffering, punishment, etc. A sharp discipline of half a century had sufficed to educate Macaulay. 5. Correction; chastisement; punishment inflicted by way of correction and training. Giving her the discipline of the strap. Addison. 6. The subject matter of instruction; a branch of knowledge. Bp. Wilkins. 7. (Eccl.)  The enforcement of methods of correction against one guilty of ecclesiastical offenses; reformatory or penal action toward a church member. 8. (R. C. Ch.)  Self- inflicted and voluntary corporal punishment, as penance, or otherwise; specifically, a penitential scourge. 9. (Eccl.)  A system of essential rules and duties; as, the Romish or Anglican discipline. Syn. -- Education; instruction; training; culture; correction; chastisement; punishment.\n\n1. To educate; to develop by instruction and exercise; to train. 2. To accustom to regular and systematic action; to bring under control so as to act systematically; to train to act together under orders; to teach subordination to; to form a habit of obedience in; to drill. Ill armed, and worse disciplined. Clarendon. His mind . . . imperfectly disciplined by nature. Macaulay. 3. To improve by corrective and penal methods; to chastise; to correct. Has he disciplined Aufidius soundly Shak. 4. To inflict ecclesiastical censures and penalties upon. Syn. -- To train; form; teach; instruct; bring up; regulate; correct; chasten; chastise; punish."}