{"word":"dislike","definition":"1. To regard with dislike or aversion; to disapprove; to disrelish. Every nation dislikes an impost. Johnson. 2. To awaken dislike in; to displease. \"Disliking countenance.\" Marston. \"It dislikes me.\" Shak.\n\n1. A feeling of positive and usually permanent aversion to something unpleasant, uncongenial, or offensive; disapprobation; repugnance; displeasure; disfavor; -- the opposite of liking or fondness. God's grace . . . gives him continual dislike to sin. Hammond. The hint malevolent, the look oblique, The obvious satire, or implied dislike. Hannah More. We have spoken of the dislike of these excellent women for Sheridan and Fox. J. Morley. His dislike of a particular kind of sensational stories. A. W. Ward. 2. Discord; dissension. [Obs.] Fairfax. Syn. -- Distaste; disinclination; disapprobation; disfavor; disaffection; displeasure; disrelish; aversion; reluctance; repugnance; disgust; antipathy. -- Dislike, Aversion, Reluctance, Repugnance, Disgust, Antipathy. Dislike is the more general term, applicable to both persons and things and arising either from feeling or judgment. It may mean little more than want of positive liking; but antipathy, repugnance, disgust, and aversion are more intense phases of dislike. Aversion denotes a fixed and habitual dislike; as, an aversion to or for business. Reluctance and repugnance denote a mental strife or hostility something proposed (repugnance being the stronger); as, a reluctance to make the necessary sacrifices, and a repugnance to the submission required. Disgust is repugnance either of taste or moral feeling; as, a disgust at gross exhibitions of selfishness. Antipathy is primarily an instinctive feeling of dislike of a thing, such as most persons feel for a snake. When used figuratively, it denotes a correspondent dislike for certain persons, modes of acting, etc. Men have an aversion to what breaks in upon their habits; a reluctance and repugnance to what crosses their will; a disgust at what offends their sensibilities; and are often governed by antipathies for which they can give no good reason."}