{"word":"dispose","definition":"1. To distribute and put in place; to arrange; to set in order; as, to dispose the ships in the form of a crescent. Who hath disposed the whole world Job xxxiv. 13. All ranged in order and disposed with grace. Pope. The rest themselves in troops did else dispose. Spenser. 2. To regulate; to adjust; to settle; to determine. The knightly forms of combat to dispose. Dryden. 3. To deal out; to assign to a use; to bestow for an object or purpose; to apply; to employ; to dispose of. Importuned him that what he designed to bestow on her funeral, he would rather dispose among the poor. Evelyn. 4. To give a tendency or inclination to; to adapt; to cause to turn; especially, to incline the mind of; to give a bent or propension to; to incline; to make inclined; -- usually followed by to, sometimes by for before the indirect object. Endure and conquer; Jove will soon dispose To future good our past and present woes. Dryden. Suspicions dispose kings to tyranny, husbands to jealousy, and wise men to irresolution and melancholy. Bacon. To dispose of. (a) To determine the fate of; to exercise the power of control over; to fix the condition, application, employment, etc. of; to direct or assign for a use. Freedom to order their actions and dispose of their possessions and persons. Locke. (b) To exercise finally one's power of control over; to pass over into the control of some one else, as by selling; to alienate; to part with; to relinquish; to get rid of; as, to dispose of a house; to dispose of one's time. More water . . . than can be disposed of. T. Burnet. I have disposed of her to a man of business. Tatler. A rural judge disposed of beauty's prize. Waller. Syn. -- To set; arrange; order; distribute; adjust; regulate; adapt; fit; incline; bestow; give.\n\nTo bargain; to make terms. [Obs.] She had disposed with Cæsar. Shak.\n\n1. Disposal; ordering; management; power or right of control. [Obs.] But such is the dispose of the sole Disposer of empires. Speed. 2. Cast of mind; disposition; inclination; behavior; demeanor. [Obs.] He hath a person, and a smooth dispose To be suspected. Shak."}