{"word":"distance","definition":"1. The space between two objects; the length of a line, especially the shortest line joining two points or things that are separate; measure of separation in place. Every particle attracts every other with a force . . . inversely proportioned to the square of the distance. Sir I. Newton. 2. Remoteness of place; a remote place. Easily managed from a distance. W. Irving. 'T is distance lends enchantment to the view. T. Campbell. [He] waits at distance till he hears from Cato. Addison. 3. (Racing)  A space marked out in the last part of a race course. The horse that ran the whole field out of distance. L'Estrange. Note: In trotting matches under the rules of the American Association, the distance varies with the conditions of the race, being 80 yards in races of mile heaths, best two in three, and 150 yards in races of two-mile heats. At that distance from the winning post in placed the distance post. If any horse has not reached this distance post before the first horse in that heat has reached the winning post, such horse is distanced, and disqualified for cunning again during that race. 4. (Mil.)  Relative space, between troops in ranks, measured from front to rear; -- contrasted with interval, which is measured from right to left. \"Distance between companies in close column is twelve yards.\" Farrow. 5. Space between two antagonists in fencing. Shak. 6. (Painting)  The part of a picture which contains the representation of those objects which are the farthest away, esp. in a landscape. Note: In a picture, the Middle distance is the central portion between the foreground and the distance or the extreme distance. In a perspective drawing, the Point of distance is the point where the visual rays meet. 7. Ideal disjunction; discrepancy; contrariety. Locke. 8. Length or interval of time; period, past or future, between two eras or events. Ten years' distance between one and the other. Prior. The writings of Euclid at the distance of two thousand years. Playfair. 9. The remoteness or reserve which respect requires; hence, respect; ceremoniousness. I hope your modesty Will know what distance to the crown is due. Dryden. 'T is by respect and distance that authority is upheld. Atterbury. 10. A withholding of intimacy; alienation; coldness; disagreement; variance; restraint; reserve. Setting them [factions] at distance, or at least distrust amongst themselves. Bacon. On the part of Heaven, Now alienated, distance and distaste. Milton. 11. Remoteness in succession or relation; as, the distance between a descendant and his ancestor. 12. (Mus.)  The interval between two notes; as, the distance of a fourth or seventh. Angular distance, the distance made at the eye by lines drawn from the eye to two objects. -- Lunar distance. See under Lunar. -- North polar distance (Astron.), the distance on the heavens of a heavenly body from the north pole. It is the complement of the declination. -- Zenith distance (Astron.), the arc on the heavens from a heavenly body to the zenith of the observer. It is the complement of the altitude. -- To keep one's distance, to stand aloof; to refrain from familiarity. If a man makes keep my distance, the comfort is he keeps his at the same time. Swift.\n\n1. To place at a distance or remotely. I heard nothing thereof at Oxford, being then miles distanced thence. Fuller. 2. To cause to appear as if at a distance; to make seem remote. His peculiar art of distancing an object to aggrandize his space. H. Miller. 3. To outstrip by as much as a distance (see Distance, n., 3); to leave far behind; to surpass greatly. He distanced the most skillful of his contemporaries. Milner."}