{"word":"distemper","definition":"1. To temper or mix unduly; to make disproportionate; to change the due proportions of. [Obs.] When . . . the humors in his body ben distempered. Chaucer. 2. To derange the functions of, whether bodily, mental, or spiritual; to disorder; to disease. Shak. The imagination, when completely distempered, is the most incurable of all disordered faculties. Buckminster. 3. To deprive of temper or moderation; to disturb; to ruffle; to make disaffected, ill-humored, or malignant. \"Distempered spirits.\" Coleridge. 4. To intoxicate. [R.] The courtiers reeling, And the duke himself, I dare not say distempered, But kind, and in his tottering chair carousing. Massinger. 5. (Paint.)  To mix (colors) in the way of distemper; as, to distemper colors with size. [R.]\n\n1. An undue or unnatural temper, or disproportionate mixture of parts. Bacon. Note: This meaning and most of the following are to be referred to the Galenical doctrine of the four \"humors\" in man. See Humor. According to the old physicians, these humors, when unduly tempered, produce a disordered state of body and mind. 2. Severity of climate; extreme weather, whether hot or cold. [Obs.] Those countries . . . under the tropic, were of a distemper uninhabitable. Sir W. Raleigh. 3. A morbid state of the animal system; indisposition; malady; disorder; -- at present chiefly applied to diseases of brutes; as, a distemper in dogs; the horse distemper; the horn distemper in cattle. They heighten distempers to diseases. Suckling. 4. Morbid temper of the mind; undue predominance of a passion or appetite; mental derangement; bad temper; ill humor. [Obs.] Little faults proceeding on distemper. Shak. Some frenzy distemper had got into his head. Bunyan. 5. Political disorder; tumult. Waller. 6. (Paint.) (a) A preparation of opaque or body colors, in which the pigments are tempered or diluted with weak glue or size (cf. Tempera) instead of oil, usually for scene painting, or for walls and ceilings of rooms. (b) A painting done with this preparation. Syn. -- Disease; disorder; sickness; illness; malady; indisposition; ailment. See Disease."}