{"word":"divide","definition":"1. To part asunder (a whole); to sever into two or more parts or pieces; to sunder; to separate into parts. Divide the living child in two. 1 Kings iii. 25. 2. To cause to be separate; to keep apart by a partition, or by an imaginary line or limit; as, a wall divides two houses; a stream divides the towns. Let it divide the waters from the waters. Gen. i. 6. 3. To make partition of among a number; to apportion, as profits of stock among proprietors; to give in shares; to distribute; to mete out; to share. True justice unto people to divide. Spenser. Ye shall divide the land by lot. Num. xxxiii. 54. 4. To disunite in opinion or interest; to make discordant or hostile; to set at variance. If a kingdom be divided against itself, that kingdom can not stand. Mark iii. 24. Every family became now divided within itself. Prescott. 5. To separate into two parts, in order to ascertain the votes for and against a measure; as, to divide a legislative house upon a question. 6. (Math.)  To subject to arithmetical division. 7. (Logic)  To separate into species; -- said of a genus or generic term. 8. (Mech.)  To mark divisions on; to graduate; as, to divide a sextant. 9. (Music)  To play or sing in a florid style, or with variations. [Obs.] Spenser. Syn. -- To sever; dissever; sunder; cleave; disjoin; disunite; detach; disconnect; part; distribute; share.\n\n1. To be separated; to part; to open; to go asunder. Milton. The Indo-Germanic family divides into three groups. J. Peile. 2. To cause separation; to disunite. A gulf, a strait, the sea intervening between islands, divide less than the matted forest. Bancroft. 3. To break friendship; to fall out. Shak. 4. To have a share; to partake. Shak. 5. To vote, as in the British Parliament, by the members separating themselves into two parties (as on opposite sides of the hall or in opposite lobbies), that is, the ayes dividing from the noes. The emperors sat, voted, and divided with their equals. Gibbon.\n\nA dividing ridge of land between the tributaries of two streams; a watershed."}