{"word":"do","definition":"A syllable attached to the first tone of the major diatonic scale for the purpose of solmization, or solfeggio. It is the first of the seven syllables used by the Italians as manes of musical tones, and replaced, for the sake of euphony, the syllable Ut, applied to the note C. In England and America the same syllables are used by mane as a scale pattern, while the tones in respect to absolute pitch are named from the first seven letters of the alphabet.\n\n1. To place; to put. [Obs.] Tale of a Usurer (about 1330). 2. To cause; to make; -- with an infinitive. [Obs.] My lord Abbot of Westminster did do shewe to me late certain evidences. W. Caxton. I shall . . . your cloister do make. Piers Plowman. A fatal plague which many did to die. Spenser. We do you to wit [i. e., We make you to know] of the grace of God bestowed on the churches of Macedonia. 2 Cor. viii. 1. Note: We have lost the idiom shown by the citations (do used like the French faire or laisser), in which the verb in the infinitive apparently, but not really, has a passive signification, i. e., cause . . . to be made. 3. To bring about; to produce, as an effect or result; to effect; to achieve. The neglecting it may do much danger. Shak. He waved indifferently' twixt doing them neither good not harm. Shak. 4. To perform, as an action; to execute; to transact to carry out in action; as, to do a good or a bad act; do our duty; to do what I can. Six days shalt thou labor and do all thy work. Ex. xx. 9. We did not do these things. Ld. Lytton. You can not do wrong without suffering wrong. Emerson. Hence: To do homage, honor, favor, justice, etc., to render homage, honor, etc. 5. To bring to an end by action; to perform completely; to finish; to accomplish; -- a sense conveyed by the construction, which is that of the past participle done. \"Ere summer half be done.\" \"I have done weeping.\" Shak. 6. To make ready for an object, purpose, or use, as food by cooking; to cook completely or sufficiently; as, the meat is done on one side only. 7. To put or bring into a form, state, or condition, especially in the phrases, to do death, to put to death; to slay; to do away (often do away with), to put away; to remove; to do on, to put on; to don; to do off, to take off, as dress; to doff; to do into, to put into the form of; to translate or transform into, as a text. Done to death by slanderous tongues. Shak. The ground of the difficulty is done away. Paley. Suspicions regarding his loyalty were entirely done away. Thackeray. To do on our own harness, that we may not; but we must do on the armor of God. Latimer. Then Jason rose and did on him a fair Blue woolen tunic. W. Morris (Jason). Though the former legal pollution be now done off, yet there is a spiritual contagion in idolatry as much to be shunned. Milton. It [\"Pilgrim's Progress\"] has been done into verse: it has been done into modern English. Macaulay. 8. To cheat; to gull; to overreach. [Colloq.] He was not be done, at his time of life, by frivolous offers of a compromise that might have secured him seventy-five per cent. De Quincey. 9. To see or inspect; to explore; as, to do all the points of interest. [Colloq.] 10. (Stock Exchange)  To cash or to advance money for, as a bill or note. Note: (a) Do and did are much employed as auxiliaries, the verb to which they are joined being an infinitive. As an auxiliary the verb do has no participle. \"I do set my bow in the cloud.\" Gen. ix. 13. [Now archaic or rare except for emphatic assertion.] Rarely . . . did the wrongs of individuals to the knowledge of the public. Macaulay. (b) They are often used in emphatic construction. \"You don't say so, Mr. Jobson. -- but I do say so.\" Sir W. Scott. \"I did love him, but scorn him now.\" Latham. (c) In negative and interrogative constructions, do and did are in common use. I do not wish to see them; what do you think Did Cæsar cross the Tiber He did not. \"Do you love me\" Shak. (d) Do, as an auxiliary, is supposed to have been first used before imperatives. It expresses entreaty or earnest request; as, do help me. In the imperative mood, but not in the indicative, it may be used with the verb to be; as, do be quiet. Do, did, and done often stand as a general substitute or representative verb, and thus save the repetition of the principal verb. \"To live and die is all we have to do.\" Denham. In the case of do and did as auxiliaries, the sense may be completed by the infinitive (without to) of the verb represented. \"When beauty lived and died as flowers do now.\" Shak. \"I . . . chose my wife as she did her wedding gown.\" Goldsmith. My brightest hopes giving dark fears a being. As the light does the shadow. Longfellow. In unemphatic affirmative sentences do is, for the most part, archaic or poetical; as, \"This just reproach their virtue does excite.\" Dryden. To do one's best, To do one's diligence (and the like), to exert one's self; to put forth one's best or most or most diligent efforts. \"We will . . . do our best to gain their assent.\" Jowett (Thucyd.). -- To do one's business, to ruin one. [Colloq.] Wycherley. -- To do one shame, to cause one shame. [Obs.] -- To do over. (a) To make over; to perform a second time. (b) To cover; to spread; to smear. \"Boats . . . sewed together and done over with a kind of slimy stuff like rosin.\" De Foe. -- To do to death, to put to death. (See 7.) [Obs.] -- To do up. (a) To put up; to raise. [Obs.] Chaucer. (b) To pack together and envelop; to pack up. (c) To accomplish thoroughly. [Colloq.] (d) To starch and iron. \"A rich gown of velvet, and a ruff done up with the famous yellow starch.\" Hawthorne. -- To do way, to put away; to lay aside. [Obs.] Chaucer. -- To do with, to dispose of; to make use of; to employ; -- usually preceded by what. \"Men are many times brought to that extremity, that were it not for God they would not know what to do with themselves.\" Tillotson. -- To have to do with, to have concern, business or intercourse with; to deal with. When preceded by what, the notion is usually implied that the affair does not concern the person denoted by the subject of have. \"Philology has to do with language in its fullest sense.\" Earle. \"What have I to do with you, ye sons of Zeruiah 2 Sam. xvi. 10.\n\n1. To act or behave in any manner; to conduct one's self. They fear not the Lord, neither do they after . . . the law and commandment. 2 Kings xvii. 34. 2. To fare; to be, as regards health; as, they asked him how he did; how do you do to-day 3. Etym: [Perh. a different word. OE. dugen, dowen, to avail, be of use, AS. dugan. See Doughty.]  To succeed; to avail; to answer the purpose; to serve; as, if no better plan can be found, he will make this do. You would do well to prefer a bill against all kings and parliaments since the Conquest; and if that won't do; challenge the crown. Collier. To do by. See under By. -- To do for. (a) To answer for; to serve as; to suit. (b) To put an end to; to ruin; to baffle completely; as, a goblet is done for when it is broken. [Colloq.] Some folks are happy and easy in mind when their victim is stabbed and done for. Thackeray. -- To do withal, to help or prevent it. [Obs.] \"I could not do withal.\" Shak. -- To do without, to get along without; to dispense with. -- To have done, to have made an end or conclusion; to have finished; to be quit; to desist. -- To have done with, to have completed; to be through with; to have no further concern with. -- Well to do, in easy circumstances.\n\n1. Deed; act; fear. [Obs.] Sir W. Scott. 2. Ado; bustle; stir; to do. [R.] A great deal of do, and a great deal of trouble. Selden. 3. A cheat; a swindle. [Slang, Eng.]"}