{"word":"dock","definition":"A genus of plants (Rumex), some species of which are well-known weeds which have a long taproot and are difficult of extermination. Note: Yellow dock is Rumex crispus, with smooth curly leaves and yellow root, which that of other species is used medicinally as an astringent and tonic.\n\n1. The solid part of an animal's tail, as distinguished from the hair; the stump of a tail; the part of a tail left after clipping or cutting. Grew. 2. A case of leather to cover the clipped or cut tail of a horse.\n\n1. to cut off, as the end of a thing; to curtail; to cut short; to clip; as, to dock the tail of a horse. His top was docked like a priest biforn. Chaucer. 2. To cut off a part from; to shorten; to deduct from; to subject to a deduction; as, to dock one's wages. 3. To cut off, bar, or destroy; as, to dock an entail.\n\n1. An artificial basin or an inclosure in connection with a harbor or river, -- used for the reception of vessels, and provided with gates for keeping in or shutting out the tide. 2. The slip or water way extending between two piers or projecting wharves, for the reception of ships; -- sometimes including the piers themselves; as, to be down on the dock. 3. The place in court where a criminal or accused person stands. Balance dock, a kind of floating dock which is kept level by pumping water out of, or letting it into, the compartments of side chambers. -- Dry dock, a dock from which the water may be shut or pumped out, especially, one in the form of a chamber having walls and floor, often of masonry and communicating with deep water, but having appliances for excluding it; -- used in constructing or repairing ships. The name includes structures used for the examination, repairing, or building of vessels, as graving docks, floating docks, hydraulic docks, etc. -- Floating dock, a dock which is made to become buoyant, and, by floating, to lift a vessel out of water. -- Graving dock, a dock for holding a ship for graving or cleaning the bottom, etc. -- Hydraulic dock, a dock in which a vessel is raised clear of the water by hydraulic presses. -- Naval dock, a dock connected with which are naval stores, materials, and all conveniences for the construction and repair of ships. -- Sectional dock, a form of floating dock made in separate sections or caissons. -- Slip dock, a dock having a sloping floor that extends from deep water to above high-water mark, and upon which is a railway on which runs a cradle carrying the ship. -- Wet dock, a dock where the water is shut in, and kept at a given level, to facilitate the loading and unloading of ships; -- also sometimes used as a place of safety; a basin.\n\nTo draw, law, or place (a ship) in a dock, for repairing, cleaning the bottom, etc."}