{"word":"dog","definition":"1. (Zoöl.)  A quadruped of the genus Canis, esp. the domestic dog (C. familiaris). Note: The dog is distinguished above all others of the inferior animals for intelligence, docility, and attachment to man. There are numerous carefully bred varieties, as the beagle, bloodhound, bulldog, coachdog, collie, Danish dog, foxhound, greyhound, mastiff, pointer, poodle, St. Bernard, setter, spaniel, spitz dog, terrier, etc. There are also many mixed breeds, and partially domesticated varieties, as well as wild dogs, like the dingo and dhole. (See these names in the Vocabulary.) 2. A mean, worthless fellow; a wretch. What is thy servant, which is but a dog, that he should do this great thing 2 Kings viii. 13 (Rev. Ver. ) 3. A fellow; -- used humorously or contemptuously; as, a sly dog; a lazy dog. [Colloq.] 4. (Astron.)  One of the two constellations, Canis Major and Canis Minor, or the Greater Dog and the Lesser Dog. Canis Major contains the Dog Star (Sirius). 5. An iron for holding wood in a fireplace; a firedog; an andiron. 6. (Mech.) (a) A grappling iron, with a claw or claws, for fastening into wood or other heavy articles, for the purpose of raising or moving them. (b) An iron with fangs fastening a log in a saw pit, or on the carriage of a sawmill. (c) A piece in machinery acting as a catch or clutch; especially, the carrier of a lathe, also, an adjustable stop to change motion, as in a machine tool. Note: Dog is used adjectively or in composition, commonly in the sense of relating to, or characteristic of, a dog. It is also used to denote a male; as, dog fox or g-fox, a male fox; dog otter or dog- otter, dog wolf, etc.; -- also to denote a thing of cheap or mean quality; as, dog Latin. A dead dog, a thing of no use or value. 1 Sam. xxiv. 14. -- A dog in the manger, an ugly-natured person who prevents others from enjoying what would be an advantage to them but is none to him. -- Dog ape (Zoöl.), a male ape. -- Dog cabbage, or Dog's cabbage (Bot.), a succulent herb, native to the Mediterranean region (Thelygonum Cynocrambe). -- Dog cheap, very cheap. See under Cheap. -- Dog ear (Arch.), an acroterium. [Colloq.] -- Dog flea (Zoöl.), a species of flea (Pulex canis) which infests dogs and cats, and is often troublesome to man. In America it is the common flea. See Flea, and Aphaniptera. -- Dog grass (Bot.), a grass (Triticum caninum) of the same genus as wheat. -- Dog Latin, barbarous Latin; as, the dog Latin of pharmacy. -- Dog lichen (Bot.), a kind of lichen (Peltigera canina) growing on earth, rocks, and tree trunks, -- a lobed expansion, dingy green above and whitish with fuscous veins beneath. -- Dog louse (Zoöl.), a louse that infests the dog, esp. Hæmatopinus piliferus; another species is Trichodectes latus. -- Dog power, a machine operated by the weight of a dog traveling in a drum, or on an endless track, as for churning. -- Dog salmon (Zoöl.), a salmon of northwest America and northern Asia; -- the gorbuscha; -- called also holia, and hone. -- Dog shark. (Zoöl.) See Dogfish. -- Dog's meat, meat fit only for dogs; refuse; offal. -- Dog Star. See in the Vocabulary. -- Dog wheat (Bot.), Dog grass. -- Dog whelk (Zoöl.), any species of univalve shells of the family Nassidæ, esp. the Nassa reticulata of England. -- To give, or throw, to the dogs, to throw away as useless. \"Throw physic to the dogs; I'll none of it.\" Shak. -- To go to the dogs, to go to ruin; to be ruined.\n\nTo hunt or track like a hound; to follow insidiously or indefatigably; to chase with a dog or dogs; to worry, as if by dogs; to hound with importunity. I have been pursued, dogged, and waylaid. Pope. Your sins will dog you, pursue you. Burroughs. Eager ill-bred petitioners, who do not so properly supplicate as hunt the person whom they address to, dogging him from place to place, till they even extort an answer to their rude requests. South."}