{"word":"double","definition":"1. Twofold; multiplied by two; increased by its equivalent; made twice as large or as much, etc. Let a double portion of thy spirit be upon me. 2 Kings ii. 9. Darkness and tempest make a double night. Dryden. 2. Being in pairs; presenting two of a kind, or two in a set together; coupled. [Let] The swan, on still St. Mary's lake, Float double, swan and shadow. Wordsworth. 3. Divided into two; acting two parts, one openly and the other secretly; equivocal; deceitful; insincere. With a double heart do they speak. Ps. xii. 2. 4. (Bot.)  Having the petals in a flower considerably increased beyond the natural number, usually as the result of cultivation and the expense of the stamens, or stamens and pistils. The white water lily and some other plants have their blossoms naturally double. Note: Double is often used as the first part of a compound word, generally denoting two ways, or twice the number, quantity, force, etc., twofold, or having two. Double base, or Double bass (Mus.), the largest and lowest-toned instrument in the violin form; the contrabasso or violone. -- Double convex. See under Convex. -- Double counterpoint (Mus.), that species of counterpoint or composition, in which two of the parts may be inverted, by setting one of them an octave higher or lower. -- Double court (Lawn Tennis), a court laid out for four players, two on each side. -- Double dagger (Print.), a reference mark (||) next to the dagger (|) in order; a diesis. -- Double drum (Mus.), a large drum that is beaten at both ends. -- Double eagle, a gold coin of the United States having the value of 20 dollars. -- Double entry. See under Bookkeeping. -- Double floor (Arch.), a floor in which binding joists support flooring joists above and ceiling joists below. See Illust. of Double-framed floor. -- Double flower. See Double, a., 4. -- Double-framed floor (Arch.), a double floor having girders into which the binding joists are framed. -- Double fugue (Mus.), a fugue on two subjects. -- Double letter. (a) (Print.) Two letters on one shank; a ligature. (b) A mail requiring double postage. -- Double note (Mus.), a note of double the length of the semibreve; a breve. See Breve. -- Double octave (Mus.), an interval composed of two octaves, or fifteen notes, in diatonic progression; a fifteenth. -- Double pica. See under Pica. -- Double play (Baseball), a play by which two players are put out at the same time. -- Double plea (Law), a plea alleging several matters in answer to the declaration, where either of such matters alone would be a sufficient bar to the action. Stephen. -- Double point (Geom.), a point of a curve at which two branches cross each other. Conjugate or isolated points of a curve are called double points, since they possess most of the properties of double points (see Conjugate). They are also called acnodes, and those points where the branches of the curve really cross are called crunodes. The extremity of a cusp is also a double point. -- Double quarrel. (Eccl. Law) See Duplex querela, under Duplex. -- Double refraction. (Opt.) See Refraction. -- Double salt. (Chem.) (a) A mixed salt of any polybasic acid which has been saturated by different bases or basic radicals, as the double carbonate of sodium and potassium, NaKCO3.6H2O. (b) A molecular combination of two distinct salts, as common alum, which consists of the sulphate of aluminium, and the sulphate of potassium or ammonium. -- Double shuffle, a low, noisy dance. -- Double standard (Polit. Econ.), a double standard of monetary values; i. e., a gold standard and a silver standard, both of which are made legal tender. -- Double star (Astron.), two stars so near to each other as to be seen separate only by means of a telescope. Such stars may be only optically near to each other, or may be physically connected so that they revolve round their common center of gravity, and in the latter case are called also binary stars. -- Double time (Mil.). Same as Double-quick. -- Double window, a window having two sets of glazed sashes with an air space between them.\n\nTwice; doubly. I was double their age. Swift.\n\n1. To increase by adding an equal number, quantity, length, value, or the like; multiply by two; to double a sum of money; to double a number, or length. Double six thousand, and then treble that. Shak. 2. To make of two thicknesses or folds by turning or bending together in the middle; to fold one part upon another part of; as, to double the leaf of a book, and the like; to clinch, as the fist; -- often followed by up; as, to double up a sheet of paper or cloth. Prior. Then the old man Was wroth, and doubled up his hands. Tennyson. 3. To be the double of; to exceed by twofold; to contain or be worth twice as much as. Thus reënforced, against the adverse fleet, Still doubling ours, brave Rupert leads the way. Dryden. 4. To pass around or by; to march or sail round, so as to reverse the direction of motion. Sailing along the coast, the doubled the promontory of Carthage. Knolles. 5. (Mil.)  To unite, as ranks or files, so as to form one from each two.\n\n1. To be increased to twice the sum, number, quantity, length, or value; to increase or grow to twice as much. 'T is observed in particular nations, that within the space of three hundred years, notwithstanding all casualties, the number of men doubles. T. Burnet. 2. To return upon one's track; to turn and go back over the same ground, or in an opposite direction. Doubling and turning like a hunted hare. Dryden. Doubling and doubling with laborious walk. Wordsworth. 3. To play tricks; to use sleights; to play false. What penalty and danger you accrue, If you be found to double. J. Webster. 4. (Print.)  To set up a word or words a second time by mistake; to make a doublet. To double upon (Mil.), to inclose between two fires.\n\n1. Twice as much; twice the number, sum, quantity, length, value, and the like. If the thief be found, let him pay double. Ex. xxii. 7. 2. Among compositors, a doublet (see Doublet, 2.); among pressmen, a sheet that is twice pulled, and blurred. 3. That which is doubled over or together; a doubling; a plait; a fold. Rolled up in sevenfold double Of plagues. Marston. 4. A turn or circuit in running to escape pursues; hence, a trick; a shift; an artifice. These men are too well acquainted with the chase to be flung off by any false steps or doubles. Addison. 5. Something precisely equal or counterpart to another; a counterpart. Hence, a wraith. My charming friend . . . has, I am almost sure, a double, who preaches his afternoon sermons for him. Atlantic Monthly. 6. A player or singer who prepares to take the part of another player in his absence; a substitute. 7. Double beer; strong beer. 8. (Eccl.)  A feast in which the antiphon is doubled, hat is, said twice, before and after the Psalms, instead of only half being said, as in simple feasts. Shipley. 9. (Lawn Tennis)  A game between two pairs of players; as, a first prize for doubles. 10. (Mus.)  An old term for a variation, as in Bach's Suites."}