{"word":"doubt","definition":"1. To waver in opinion or judgment; to be in uncertainty as to belief respecting anything; to hesitate in belief; to be undecided as to the truth of the negative or the affirmative proposition; to b e undetermined. Even in matters divine, concerning some things, we may lawfully doubt, and suspend our judgment. Hooker. To try your love and make you doubt of mine. Dryden. 2. To suspect; to fear; to be apprehensive. [Obs.] Syn. -- To waver; vacillate; fluctuate; hesitate; demur; scruple; question.\n\n1. To question or hold questionable; to withhold assent to; to hesitate to believe, or to be inclined not to believe; to withhold confidence from; to distrust; as, I have heard the story, but I doubt the truth of it. To admire superior sense, and doubt their own! Pope. I doubt not that however changed, you keep So much of what is graceful. Tennyson. To doubt not but. I do not doubt but I have been to blame. Dryden. We doubt not now But every rub is smoothed on our way. Shak. Note: That is, we have no doubt to prevent us from believing, etc. (or notwithstanding all that may be said to the contrary) -- but having a preventive sense, after verbs of \"doubting\" and \"denying\" that convey a notion of hindrance. E. A. Abbott. 2. To suspect; to fear; to be apprehensive of. [Obs.] Edmond [was a] good man and doubted God. R. of Gloucester. I doubt some foul play. Shak. That I of doubted danger had no fear. Spenser. 3. To fill with fear; to affright. [Obs.] The virtues of the valiant Caratach More doubt me than all Britain. Beau. & Fl.\n\n1. A fluctuation of mind arising from defect of knowledge or evidence; uncertainty of judgment or mind; unsettled state of opinion concerning the reality of an event, or the truth of an assertion, etc.; hesitation. Doubt is the beginning and the end of our efforts to know. Sir W. Hamilton. Doubt, in order to be operative in requiring an acquittal, is not the want of perfect certainty (which can never exist in any question of fact) but a defect of proof preventing a reasonable assurance of quilt. Wharton. 2. Uncertainty of condition. Thy life shall hang in doubt before thee. Deut. xxviii. 66. 3. Suspicion; fear; apprehension; dread. [Obs.] I stand in doubt of you. Gal. iv. 20. Nor slack her threatful hand for danger's doubt. Spenser. 4. Difficulty expressed or urged for solution; point unsettled; objection. To every doubt your answer is the same. Blackmore. No doubt, undoubtedly; without doubt. -- Out of doubt, beyond doubt. [Obs.] Spenser. Syn. -- Uncertainty; hesitation; suspense; indecision; irresolution; distrust; suspicion; scruple; perplexity; ambiguity; skepticism."}