{"word":"drag","definition":"A confection; a comfit; a drug. [Obs.] Chaucer.\n\n1. To draw slowly or heavily onward; to pull along the ground by main force; to haul; to trail; -- applied to drawing heavy or resisting bodies or those inapt for drawing, with labor, along the ground or other surface; as, to drag stone or timber; to drag a net in fishing. Dragged by the cords which through his feet were thrust. Denham. The grossness of his nature will have weight to drag thee down. Tennyson. A needless Alexandrine ends the song That, like a wounded snake, drags its slow length along. Pope. 2. To break, as land, by drawing a drag or harrow over it; to harrow; to draw a drag along the bottom of, as a stream or other water; hence, to search, as by means of a drag. Then while I dragged my brains for such a song. Tennyson. 3. To draw along, as something burdensome; hence, to pass in pain or with difficulty. Have dragged a lingering life. Dryden. To drag an anchor (Naut.), to trail it along the bottom when the anchor will not hold the ship. Syn. -- See Draw.\n\n1. To be drawn along, as a rope or dress, on the ground; to trail; to be moved onward along the ground, or along the bottom of the sea, as an anchor that does not hold. 2. To move onward heavily, laboriously, or slowly; to advance with weary effort; to go on lingeringly. The day drags through, though storms keep out the sun. Byron. Long, open panegyric drags at best. Gay. 3. To serve as a clog or hindrance; to hold back. A propeller is said to drag when the sails urge the vessel faster than the revolutions of the screw can propel her. Russell. 4. To fish with a dragnet.\n\n1. The act of dragging; anything which is dragged. 2. A net, or an apparatus, to be drawn along the bottom under water, as in fishing, searching for drowned persons, etc. 3. A kind of sledge for conveying heavy bodies; also, a kind of low car or handcart; as, a stone drag. 4. A heavy coach with seats on top; also, a heavy carriage. [Collog.] Thackeray. 5. A heavy harrow, for breaking up ground. 6. (a) Anything towed in the water to retard a ship's progress, or to keep her head up to the wind; esp., a canvas bag with a hooped mouth, so used. See Drag sail (below). (b) Also, a skid or shoe, for retarding the motion of a carriage wheel. (c) Hence, anything that retards; a clog; an obstacle to progress or enjoyment. My lectures were only a pleasure to me, and no drag. J. D. Forbes. 7. Motion affected with slowness and difficulty, as if clogged. \"Had a drag in his walk.\" Hazlitt. 8. (Founding)  The bottom part of a flask or mold, the upper part being the cope. 9. (Masonry)  A steel instrument for completing the dressing of soft stone. 10. (Marine Engin.)  The difference between the speed of a screw steamer under sail and that of the screw when the ship outruns the screw; or between the propulsive effects of the different floats of a paddle wheel. See Citation under Drag, v. i., 3. Drag sail (Naut.), a sail or canvas rigged on a stout frame, to be dragged by a vessel through the water in order to keep her head to the wind or to prevent drifting; -- called also drift sail, drag sheet, drag anchor, sea anchor, floating anchor, etc. -- Drag twist (Mining), a spiral hook at the end of a rod for cleaning drilled holes."}