{"word":"dragon","definition":"1. (Myth.)  A fabulous animal, generally represented as a monstrous winged serpent or lizard, with a crested head and enormous claws, and regarded as very powerful and ferocious. The dragons which appear in early paintings and sculptures are invariably representations of a winged crocodile. Fairholt. Note: In Scripture the term dragon refers to any great monster, whether of the land or sea, usually to some kind of serpent or reptile, sometimes to land serpents of a powerful and deadly kind. It is also applied metaphorically to Satan. Thou breakest the heads of the dragons in the waters. Ps. lxxiv. 13. Thou shalt tread upon the lion and adder; the young lion and the dragon shalt thou trample under feet. Ps. xci. 13. He laid hold on the dragon, that old serpent, which is the Devil and Satan, and bound him a thousand years. Rev. xx. 2. 2. A fierce, violent person, esp. a woman. Johnson. 3. (Astron.)  A constellation of the northern hemisphere figured as a dragon; Draco. 4. A luminous exhalation from marshy grounds, seeming to move through the air as a winged serpent. 5. (Mil. Antiq.)  A short musket hooked to a swivel attached to a soldier's belt; -- so called from a representation of a dragon's head at the muzzle. Fairholt. 6. (Zoöl.)  A small arboreal lizard of the genus Draco, of several species, found in the East Indies and Southern Asia. Five or six of the hind ribs, on each side, are prolonged and covered with weblike skin, forming a sort of wing. These prolongations aid them in making long leaps from tree to tree. Called also flying lizard. 7. (Zoöl.)  A variety of carrier pigeon. 8. (Her.)  A fabulous winged creature, sometimes borne as a charge in a coat of arms. Note: Dragon is often used adjectively, or in combination, in the sense of relating to, resembling, or characteristic of, a dragon. Dragon arum (Bot.), the name of several species of Arisæma, a genus of plants having a spathe and spadix. See Dragon root(below). -- Dragon fish (Zoöl.), the dragonet. -- Dragon fly (Zoöl.), any insect of the family Libellulidæ. They have finely formed, large and strongly reticulated wings, a large head with enormous eyes, and a long body; -- called also mosquito hawks. Their larvæ are aquatic and insectivorous. -- Dragon root (Bot.), an American aroid plant (Arisæma Dracontium); green dragon. -- Dragon's blood, a resinous substance obtained from the fruit of several species of Calamus, esp. from C. Rotang and C. Draco, growing in the East Indies. A substance known as dragon's blood is obtained by exudation from Dracæna Draco; also from Pterocarpus Draco, a tree of the West Indies and South America. The color is red, or a dark brownish red, and it is used chiefly for coloring varnishes, marbles, etc. Called also Cinnabar Græcorum. -- Dragon's head. (a) (Bot.) A plant of several species of the genus Dracocephalum. They are perennial herbs closely allied to the common catnip. (b) (Astron.) The ascending node of a planet, indicated, chiefly in almanacs, by the symbol Encyc. Brit. -- Dragon shell (Zoöl.), a species of limpet. -- Dragon's skin, fossil stems whose leaf scars somewhat resemble the scales of reptiles; -- a name used by miners and quarrymen. Stormonth. -- Dragon's tail (Astron.), the descending node of a planet, indicated by the symbol Dragon's head (above). -- Dragon's wort (Bot.), a plant of the genus Artemisia (A. dracunculus). -- Dragon tree (Bot.), a West African liliaceous tree (Dracæna Draco), yielding one of the resins called dragon's blood. See Dracæna. -- Dragon water, a medicinal remedy very popular in the earlier half of the 17th century. \"Dragon water may do good upon him.\" Randolph (1640). -- Flying dragon, a large meteoric fireball; a bolide."}