{"word":"dress","definition":"1. To direct; to put right or straight; to regulate; to order. [Obs.] At all times thou shalt bless God and pray Him to dress thy ways. Chaucer. Note: Dress is used reflexively in Old English, in sense of \"to direct one's step; to addresss one's self.\" To Grisild again will I me dresse. Chaucer. 2. (Mil.)  To arrange in exact continuity of line, as soldiers; commonly to adjust to a straight line and at proper distance; to align; as, to dress the ranks. 3. (Med.)  To treat methodically with remedies, bandages, or curative appliances, as a sore, an ulcer, a wound, or a wounded or diseased part. 4. To adjust; to put in good order; to arrange; specifically: (a) To prepare for use; to fit for any use; to render suitable for an intended purpose; to get ready; as, to dress a slain animal; to dress meat; to dress leather or cloth; to dress or trim a lamp; to dress a garden; to dress a horse, by currying and rubbing; to dress grain, by cleansing it; in mining and metallurgy, to dress ores, by sorting and separating them. And the Lord God took the man, and put him into the garden of Eden to dress it. Gen. ii. 15. When he dresseth the lamps he shall burn incense. Ex. xxx. 7. Three hundred horses . . . smoothly dressed. Dryden. Dressing their hair with the white sea flower. Tennyson . If he felt obliged to expostulate, he might have dressed his censures in a kinder form. Carlyle. (b) To cut to proper dimensions, or give proper shape to, as to a tool by hammering; also, to smooth or finish. (c) To put in proper condition by appareling, as the body; to put clothes upon; to apparel; to invest with garments or rich decorations; to clothe; to deck. Dressed myself in such humility. Shak. Prove that ever Idress myself handsome till thy return. Shak. (d) To break and train for use, as a horse or other animal. To dress up or out, to dress elaborately, artificially, or pompously. \"You see very often a king of England or France dressed up like a Julius Cæsar.\" Addison. -- To dress a ship (Naut.), to ornament her by hoisting the national colors at the peak and mastheads, and setting the jack forward; when dressed full, the signal flags and pennants are added. Ham. Nav. Encyc. Syn. -- To attire; apparel; clothe; accouter; array; robe; rig; trim; deck; adorn; embellish.\n\n1. (Mil.)  To arrange one's self in due position in a line of soldiers; -- the word of command to form alignment in ranks; as, Right, dress! 2. To clothe or apparel one's self; to put on one's garments; to pay particular regard to dress; as, to dress quickly. \"To dress for a ball.\" Latham. To flaunt, to dress, to dance, to thrum. Tennyson . To dress to the right, To dress to the left, To dress on the center (Mil.), to form alignment with reference to the soldier on the extreme right, or in the center, of the rank, who serves as a guide.\n\n1. That which is used as the covering or ornament of the body; clothes; garments; habit; apparel. \"In your soldier's dress.\" Shak. 2. A lady's gown; as, silk or a velvet dress. 3. Attention to apparel, or skill in adjusting it. Men of pleasure, dress, and gallantry. Pope. 4. (Milling)  The system of furrows on the face of a millstone. Knight. Dress circle. See under Circle. -- Dress parade (Mil.), a parade in full uniform for review."}