{"word":"drift","definition":"1. A driving; a violent movement. The dragon drew him [self] away with drift of his wings. King Alisaunder (1332). 2. The act or motion of drifting; the force which impels or drives; an overpowering influence or impulse. A bad man, being under the drift of any passion, will follow the impulse of it till something interpose. South. 3. Course or direction along which anything is driven; setting. \"Our drift was south.\" Hakluyt. 4. The tendency of an act, argument, course of conduct, or the like; object aimed at or intended; intention; hence, also, import or meaning of a sentence or discourse; aim. He has made the drift of the whole poem a compliment on his country in general. Addison. Now thou knowest my drift. Sir W. Scott. 5. That which is driven, forced, or urged along; as: (a) Anything driven at random. \"Some log . . . a useless drift.\" Dryden. (b) A mass of matter which has been driven or forced onward together in a body, or thrown together in a heap, etc., esp. by wind or water; as, a drift of snow, of ice, of sand, and the like. Drifts of rising dust involve the sky. Pope. We got the brig a good bed in the rushing drift [of ice]. Kane. (c) A drove or flock, as of cattle, sheep, birds. [Obs.] Cattle coming over the bridge (with their great drift doing much damage to the high ways). Fuller. 6. (Arch.)  The horizontal thrust or pressure of an arch or vault upon the abutments. [R.] Knight. 7. (Geol.)  A collection of loose earth and rocks, or boulders, which have been distributed over large portions of the earth's surface, especially in latitudes north of forty degrees, by the agency of ice. 8. In South Africa, a ford in a river. 9. (Mech.)  A slightly tapered tool of steel for enlarging or shaping a hole in metal, by being forced or driven into or through it; a broach. 10. (Mil.) (a) A tool used in driving down compactly the composition contained in a rocket, or like firework. (b) A deviation from the line of fire, peculiar to oblong projectiles. 11. (Mining)  A passage driven or cut between shaft and shaft; a driftway; a small subterranean gallery; an adit or tunnel. 12. (Naut.) (a) The distance through which a current flows in a given time. (b) The angle which the line of a ship's motion makes with the meridian, in drifting. (c) The distance to which a vessel is carried off from her desired course by the wind, currents, or other causes. (d) The place in a deep-waisted vessel where the sheer is raised and the rail is cut off, and usually terminated with a scroll, or driftpiece. (e) The distance between the two blocks of a tackle. 13. The difference between the size of a bolt and the hole into which it is driven, or between the circumference of a hoop and that of the mast on which it is to be driven. Note: Drift is used also either adjectively or as the first part of a compound. See Drift, a. Drift of the forest (O. Eng. Law), an examination or view of the cattle in a forest, in order to see whose they are, whether they are commonable, and to determine whether or not the forest is surcharged. Burrill.\n\n1. To float or be driven along by, or as by, a current of water or air; as, the ship drifted astern; a raft drifted ashore; the balloon drifts slowly east. We drifted o'er the harbor bar. Coleridge. 2. To accumulate in heaps by the force of wind; to be driven into heaps; as, snow or sand drifts. 3. (mining)  to make a drift; to examine a vein or ledge for the purpose of ascertaining the presence of metals or ores; to follow a vein; to prospect. [U.S.]\n\n1. To drive or carry, as currents do a floating body. J. H. Newman. 2. To drive into heaps; as, a current of wind drifts snow or sand. 3. (Mach.)  To enlarge or shape, as a hole, with a drift.\n\nThat causes drifting or that is drifted; movable by wind or currents; as, drift currents; drift ice; drift mud. Kane. Drift anchor. See Sea anchor, and also Drag sail, under Drag, n. -- Drift epoch (Geol.), the glacial epoch. -- Drift net, a kind of fishing net. -- Drift sail. Same as Drag sail. See under Drag, n."}