{"word":"drum","definition":"1. (Mus.)  An instrument of percussion, consisting either of a hollow cylinder, over each end of which is stretched a piece of skin or vellum, to be beaten with a stick; or of a metallic hemisphere (kettledrum) with a single piece of skin to be so beaten; the common instrument for marking time in martial music; one of the pair of tympani in an orchestra, or cavalry band. The drums cry bud-a-dub. Gascoigne. 2. Anything resembling a drum in form; as: (a) A sheet iron radiator, often in the shape of a drum, for warming an apartment by means of heat received from a stovepipe, or a cylindrical receiver for steam, etc. (b) A small cylindrical box in which figs, etc., are packed. (c) (Anat.) The tympanum of the ear; -- often, but incorrectly, applied to the tympanic membrane. (d) (Arch.)  One of the cylindrical, or nearly cylindrical, blocks, of which the shaft of a column is composed; also, a vertical wall, whether circular or polygonal in plan, carrying a cupola or dome. (e) (Mach.)  A cylinder on a revolving shaft, generally for the purpose of driving several pulleys, by means of belts or straps passing around its periphery; also, the barrel of a hoisting machine, on which the rope or chain is wound. 3. (Zoöl.)  See Drumfish. 4. A noisy, tumultuous assembly of fashionable people at a private house; a rout. [Archaic] Not unaptly styled a drum, from the noise and emptiness of the entertainment. Smollett. Note: There were also drum major, rout, tempest, and hurricane, differing only in degrees of multitude and uproar, as the significant name of each declares. 5. A tea party; a kettledrum. G. Eliot. Bass drum. See in the Vocabulary. -- Double drum. See under Double.\n\n1. To beat a drum with sticks; to beat or play a tune on a drum. 2. To beat with the fingers, as with drumsticks; to beat with a rapid succession of strokes; to make a noise like that of a beaten drum; as, the ruffed grouse drums with his wings. Drumming with his fingers on the arm of his chair. W. Irving. 3. To throb, as the heart. [R.] Dryden. 4. To go about, as a drummer does, to gather recruits, to draw or secure partisans, customers, etc,; -- with for.\n\n1. To execute on a drum, as a tune. 2. (With out) To expel ignominiously, with beat of drum; as, to drum out a deserter or rogue from a camp, etc. 3. (With up) To assemble by, or as by, beat of drum; to collect; to gather or draw by solicitation; as, to drum up recruits; to drum up customers."}