{"word":"duck","definition":"A pet; a darling. Shak.\n\n1. A linen (or sometimes cotton) fabric, finer and lighter than canvas, -- used for the lighter sails of vessels, the sacking of beds, and sometimes for men's clothing. 2. (Naut.) pl.  The light clothes worn by sailors in hot climates. [Colloq.]\n\n1. To thrust or plunge under water or other liquid and suddenly withdraw. Adams, after ducking the squire twice or thrice, leaped out of the tub. Fielding. 2. To plunge the head of under water, immediately withdrawing it; as, duck the boy. 3. To bow; to bob down; to move quickly with a downward motion. \" Will duck his head aside. Swift.\n\n1. To go under the surface of water and immediately reappear; to dive; to plunge the head in water or other liquid; to dip. In Tiber ducking thrice by break of day. Dryden. 2. To drop the head or person suddenly; to bow. The learned pate Ducks to the golden fool. Shak.\n\n1. (Zool.)  Any bird of the subfamily Anatinæ, family Anatidæ. Note: The genera and species are numerous. They are divided into river ducks and sea ducks. Among the former are the common domestic duck (Anas boschas); the wood duck (Aix sponsa); the beautiful mandarin duck of China (Dendronessa galeriliculata); the Muscovy duck, originally of South America (Cairina moschata). Among the sea ducks are the eider, canvasback, scoter, etc. 2. A sudden inclination of the bead or dropping of the person, resembling the motion of a duck in water. Here be, without duck or nod, Other trippings to be trod. Milton. Bombay duck (Zoöl.), a fish. See Bummalo. -- Buffel duck, or Spirit duck. See Buffel duck. -- Duck ant (Zoöl.), a species of white ant in Jamaica which builds large nests in trees. -- Duck barnacle. (Zoöl.) See Goose barnacle. -- Duck hawk. (Zoöl.) (a) In the United States: The peregrine falcon. (b) In England: The marsh harrier or moor buzzard. -- Duck mole (Zoöl.), a small aquatic mammal of Australia, having webbed feet and a bill resembling that of a duck (Ornithorhynchus anatinus). It belongs the subclass Monotremata and is remarkable for laying eggs like a bird or reptile; -- called also duckbill, platypus, mallangong, mullingong, tambreet, and water mole. -- To make ducks and drakes, to throw a flat stone obliquely, so as to make it rebound repeatedly from the surface of the water, raising a succession of jets; hence: To play at ducks and drakes, with property, to throw it away heedlessly or squander it foolishly and unprofitably. -- Lame duck. See under Lame."}