{"word":"dutch","definition":"Pertaining to Holland, or to its inhabitants. Dutch auction. See under Auction. -- Dutch cheese, a small, pound, hard cheese, made from skim milk. -- Dutch clinker, a kind of brick made in Holland. It is yellowish, very hard, and long and narrow in shape. -- Dutch clover (Bot.), common white clover (Trifolium repens), the seed of which was largely imported into England from Holland. -- Dutch concert, a so-called concert in which all the singers sing at the same time different songs. [Slang] -- Dutch courage, the courage of partial intoxication. [Slang] Marryat. -- Dutch door, a door divided into two parts, horizontally, so arranged that the lower part can be shut and fastened, while the upper part remains open. -- Dutch foil, Dutch leaf, or Dutch gold, a kind of brass rich in copper, rolled or beaten into thin sheets, used in Holland to ornament toys and paper; -- called also Dutch mineral, Dutch metal, brass foil, and bronze leaf. -- Dutch liquid (Chem.), a thin, colorless, volatile liquid, C2H4Cl2, of a sweetish taste and a pleasant ethereal odor, produced by the union of chlorine and ethylene or olefiant gas; -- called also Dutch oil. It is so called because discovered (in 1795) by an association of four Hollandish chemists. See Ethylene, and Olefiant. -- Dutch oven, a tin screen for baking before an open fire or kitchen range; also, in the United States, a shallow iron kettle for baking, with a cover to hold burning coals. -- Dutch pink, chalk, or whiting dyed yellow, and used in distemper, and for paper staining. etc. Weale. -- Dutch rush (Bot.), a species of horsetail rush or Equisetum (E. hyemale) having a rough, siliceous surface, and used for scouring and polishing; -- called also scouring rush, and shave grass. See Equisetum. -- Dutch tile, a glazed and painted ornamental tile, formerly much exported, and used in the jambs of chimneys and the like. Note: Dutch was formerly used for German. Germany is slandered to have sent none to this war [the Crusades] at this first voyage; and that other pilgrims, passing through that country, were mocked by the Dutch, and called fools for their pains. Fuller.\n\n1. pl.  The people of Holland; Dutchmen. 2. The language spoken in Holland."}