{"word":"ear","definition":"1. The organ of hearing; the external ear. Note: In man and the higher vertebrates, the organ of hearing is very complicated, and is divisible into three parts: the external ear, which includes the pinna or auricle and meatus or external opening; the middle ear, drum, or tympanum; and the internal ear, or labyrinth. The middle ear is a cavity connected by the Eustachian tube with the pharynx, separated from the opening of the external ear by the tympanic membrane, and containing a chain of three small bones, or ossicles, named malleus, incus, and stapes, which connect this membrane with the internal ear. The essential part of the internal ear where the fibers of the auditory nerve terminate, is the membranous labyrinth, a complicated system of sacs and tubes filled with a fluid (the endolymph), and lodged in a cavity, called the bony labyrinth, in the periotic bone. The membranous labyrinth does not completely fill the bony labyrinth, but is partially suspended in it in a fluid (the perilymph). The bony labyrinth consists of a central cavity, the vestibule, into which three semicircular canals and the canal of the cochlea (spirally coiled in mammals) open. The vestibular portion of the membranous labyrinth consists of two sacs, the utriculus and sacculus, connected by a narrow tube, into the former of which three membranous semicircular canals open, while the latter is connected with a membranous tube in the cochlea containing the organ of Corti. By the help of the external ear the sonorous vibrations of the air are concentrated upon the tympanic membrane and set it vibrating, the chain of bones in the middle ear transmits these vibrations to the internal ear, where they cause certain delicate structures in the organ of Corti, and other parts of the membranous labyrinth, to stimulate the fibers of the auditory nerve to transmit sonorous impulses to the brain. 2. The sense of hearing; the perception of sounds; the power of discriminating between different tones; as, a nice ear for music; -- in the singular only. Songs . . . not all ungrateful to thine ear. Tennyson. 3. That which resembles in shape or position the ear of an animal; any prominence or projection on an object, -- usually one for support or attachment; a lug; a handle; as, the ears of a tub, a skillet, or dish. The ears of a boat are outside kneepieces near the bow. See Illust. of Bell. 4. (Arch.) (a) Same as Acroterium (a). (b) Same as Crossette. 5. Privilege of being kindly heard; favor; attention. Dionysius . . . would give no ear to his suit. Bacon. Friends, Romans, countrymen, lend me your ears. Shak. About the ears, in close proximity to; near at hand. -- By the ears, in close contest; as, to set by the ears; to fall together by the ears; to be by the ears. -- Button ear (in dogs), an ear which falls forward and completely hides the inside. -- Ear finger, the little finger. -- Ear of Dionysius, a kind of ear trumpet with a flexible tube; -- named from the Sicilian tyrant, who constructed a device to overhear the prisoners in his dungeons. -- Ear sand (Anat.), otoliths. See Otolith. -- Ear snail (Zoöl.), any snail of the genus Auricula and allied genera. -- Ear stones (Anat.), otoliths. See Otolith. -- Ear trumpet, an instrument to aid in hearing. It consists of a tube broad at the outer end, and narrowing to a slender extremity which enters the ear, thus collecting and intensifying sounds so as to assist the hearing of a partially deaf person. -- Ear vesicle (Zoöl.), a simple auditory organ, occurring in many worms, mollusks, etc. It consists of a small sac containing a fluid and one or more solid concretions or otocysts. -- Rose ear (in dogs), an ear which folds backward and shows part of the inside. -- To give ear to, to listen to; to heed, as advice or one advising. \"Give ear unto my song.\" Goldsmith. -- To have one's ear, to be listened to with favor. -- Up to the ears, deeply submerged; almost overwhelmed; as, to be in trouble up to one's ears. [Colloq.]\n\nTo take in with the ears; to hear. [Sportive] \"I eared her language.\" Two Noble Kinsmen.\n\nThe spike or head of any cereal (as, wheat, rye, barley, Indian corn, etc.), containing the kernels. First the blade, then the ear, after that the full corn in the ear. Mark iv. 28.\n\nTo put forth ears in growing; to form ears, as grain; as, this corn ears well.\n\nTo plow or till; to cultivate. \"To ear the land.\" Shak."}