{"word":"eccentric","definition":"1. Deviating or departing from the center, or from the line of a circle; as, an eccentric or elliptical orbit; pertaining to deviation from the center or from true circular motion. 2. Not having the same center; -- said of circles, ellipses, spheres, etc., which, though coinciding, either in whole or in part, as to area or volume, have not the same center; -- opposed to concentric. 3. (Mach.)  Pertaining to an eccentric; as, the eccentric rod in a steam engine. 4. Not coincident as to motive or end. His own ends, which must needs be often eccentric to those of his master. Bacon. 5. Deviating from stated methods, usual practice, or established forms or laws; deviating from an appointed sphere or way; departing from the usual course; irregular; anomalous; odd; as, eccentric conduct. \"This brave and eccentric young man.\" Macaulay. He shines eccentric, like a comet's blaze. Savage. Eccentric anomaly. (Astron.) See Anomaly. -- Eccentric chuck (Mach.), a lathe chuck so constructed that the work held by it may be altered as to its center of motion, so as to produce combinations of eccentric combinations of eccentric circles. -- Eccentric gear. (Mach.) (a) The whole apparatus, strap, and other parts, by which the motion of an eccentric is transmitted, as in the steam engine. (b) A cogwheel set to turn about an eccentric axis used to give variable rotation. -- Eccentric hook or gab, a hook-shaped journal box on the end of an eccentric rod, opposite the strap. -- Eccentric rod, the rod that connects as eccentric strap with any part to be acted upon by the eccentric. -- Eccentric sheave, or Eccentric pulley, an eccentric. -- Eccentric strap, the ring, operating as a journal box, that encircles and receives motion from an eccentric; -- called also eccentric hoop. Syn. -- Irregular; anomalous; singular; odd; peculiar; erratic; idiosyncratic; strange; whimsical.\n\n1. A circle not having the same center as another contained in some measure within the first. 2. One who, or that which, deviates from regularity; an anomalous or irregular person or thing. 3. (Astron.) (a) In the Ptolemaic system, the supposed circular orbit of a planet about the earth, but with the earth not in its center. (b) A circle described about the center of an elliptical orbit, with half the major axis for radius. Hutton. 4. (Mach.)  A disk or wheel so arranged upon a shaft that the center of the wheel and that of the shaft do not coincide. It is used for operating valves in steam engines, and for other purposes. The motion derived is precisely that of a crank having the same throw. Back eccentric, the eccentric that reverses or backs the valve gear and the engine. -- Fore eccentric, the eccentric that imparts a forward motion to the valve gear and the engine."}