{"word":"elder","definition":"1. Older; more aged, or existing longer. Let the elder men among us emulate their own earlier deeds. Jowett (Thucyd. ) 2. Born before another; prior in years; senior; earlier; older; as, his elder brother died in infancy; -- opposed to Ant: younger, and now commonly applied to a son, daughter, child, brother, etc. The elder shall serve the younger. Gen. xxv. 23. But ask of elder days, earth's vernal hour. Keble. Elder hand (Card Playing), the hand playing, or having the right to play, first. Hoyle.\n\n1. One who is older; a superior in age; a senior. 1 Tim. v. 1. 2. An aged person; one who lived at an earlier period; a predecessor. Carry your head as your elders have done. L'Estrange. 3. A person who, on account of his age, occupies the office of ruler or judge; hence, a person occupying any office appropriate to such as have the experience and dignity which age confers; as, the elders of Israel; the elders of the synagogue; the elders in the apostolic church. Note: In the modern Presbyterian churches, elders are lay officers who, with the minister, compose the church session, with authority to inspect and regulate matters of religion and discipline. In some churches, pastors or clergymen are called elders, or presbyters. 4. (M. E. Ch.)  A clergyman authorized to administer all the sacraments; as, a traveling elder. Presiding elder (Meth. Ch.), an elder commissioned by a bishop to have the oversight of the churches and preachers in a certain district. -- Ruling elder, a lay presbyter or member of a Presbyterian church session. Schaff.\n\nA genus of shrubs (Sambucus) having broad umbels of white flowers, and small black or red berries. Note: The common North American species is Sambucus Canadensis; the common European species (S. nigra) forms a small tree. The red- berried elder is S. pubens. The berries are diaphoretic and aperient. Box elder. See under 1st Box. -- Dwarf elder. See Danewort. -- Elder tree. (Bot.) Same as Elder. Shak. -- Marsh elder, the cranberry tree Viburnum Opulus)."}