{"word":"electric","definition":"1. Pertaining to electricity; consisting of, containing, derived from, or produced by, electricity; as, electric power or virtue; an electric jar; electric effects; an electric spark. 2. Capable of occasioning the phenomena of electricity; as, an electric or electrical machine or substance. 3. Electrifying; thrilling; magnetic. \"Electric Pindar.\" Mrs. Browning. Electric atmosphere, or Electric aura. See under Aura. -- Electrical battery. See Battery. -- Electrical brush. See under Brush. -- Electric cable. See Telegraph cable, under Telegraph. -- Electric candle. See under Candle. -- Electric cat (Zoöl.), one of three or more large species of African catfish of the genus Malapterurus (esp. M. electricus of the Nile). They have a large electrical organ and are able to give powerful shocks; -- called also sheathfish. -- Electric clock. See under Clock, and see Electro-chronograph. -- Electric current, a current or stream of electricity traversing a closed circuit formed of conducting substances, or passing by means of conductors from one body to another which is in a different electrical state. -- Electric, or Electrical, eel (Zoöl.), a South American eel-like fresh-water fish of the genus Gymnotus (G. electricus), from two to five feet in length, capable of giving a violent electric shock. See Gymnotus. -- Electrical fish (Zoöl.), any fish which has an electrical organ by means of which it can give an electrical shock. The best known kinds are the torpedo, the gymnotus, or electrical eel, and the electric cat. See Torpedo, and Gymnotus. -- Electric fluid, the supposed matter of electricity; lightning. -- Electrical image (Elec.), a collection of electrical points regarded as forming, by an analogy with optical phenomena, an image of certain other electrical points, and used in the solution of electrical problems. Sir W. Thomson. -- Electrical light, the light produced by a current of electricity which in passing through a resisting medium heats it to incandescence or burns it. See under Carbon. -- Electric, or Electrical, machine, an apparatus for generating, collecting, or exciting, electricity, as by friction. -- Electric motor. See Electro-motor, 2. -- Electric osmose. (Physics) See under Osmose. -- Electric pen, a hand pen for making perforated stencils for multiplying writings. It has a puncturing needle driven at great speed by a very small magneto-electric engine on the penhandle. -- Electric railway, a railway in which the machinery for moving the cars is driven by an electric current. -- Electric ray (Zoöl.), the torpedo. -- Electric telegraph. See Telegraph.\n\nA nonconductor of electricity, as amber, glass, resin, etc., employed to excite or accumulate electricity."}