{"word":"element","definition":"1. One of the simplest or essential parts or principles of which anything consists, or upon which the constitution or fundamental powers of anything are based. 2. One of the ultimate, undecomposable constituents of any kind of matter. Specifically: (Chem.) A substance which cannot be decomposed into different kinds of matter by any means at present employed; as, the elements of water are oxygen and hydrogen. Note: The elements are naturally classified in several families or groups, as the group of the alkaline elements, the halogen group, and the like. They are roughly divided into two great classes, the metals, as sodium, calcium, etc., which form basic compounds, and the nonmetals or metalloids, as oxygen, sulphur, chlorine, which form acid compounds; but the distinction is only relative, and some, as arsenic, tin, aluminium, etc., form both acid and basic compounds. The essential fact regarding every element is its relative atomic weight or equivalent. When the elements are tabulated in the order of their ascending atomic weights, the arrangement constitutes the series of the Periodic law of Mendelejeff. See Periodic law, under Periodic. This Periodic law enables us to predict the qualities of unknown elements. The number of elements known is about seventy-five, but the gaps in the Periodic law indicate the possibility of many more. Many of the elements with which we are familiar, as hydrogen, carbon, iron, gold, etc., have been recognized, by means of spectrum analysis, in the sun and the fixed stars. From certain evidence (as that afforded by the Periodic law, spectrum analysis, etc.) it appears that the chemical elements probably may not be simple bodies, but only very stable compounds of some simpler body or bodies. In formulas, the elements are designated by abbreviations of their names in Latin or New Latin. The Elements -------------------------------------------------------- ----Name |Sym-|Atomic Weight| |bol | O=16 | H=1 | ------------------- -----------------------------------------Aluminum | Al | 27.1 | 26.9| Antimony(Stibium) Argon Arsenic Barium Beryllium (see Glucinum) Bismuth Boron Bromine Cadmium Caesium Calcium Carbon Cerium Chlorine Chromium Cobalt Columbium Copper (Cuprum) Erbium Fluorine Gadolinium Gallium Germanium Glucinum Gold Helium Hydrogen Indium Iodine Iridium Iron (Ferrum) Krypton Lanthanum Lead (Plumbum) Lithium Magnesium Manganese Mercury (Hydrargyrum) Molybdenum Neodymium Neon Nickel Niobium (see Columbium) Nirogen Osmium Oxygen Palladium Phosphorus Platinum Potassium (Kalium) Praseodymium Rhodium Rubidium Ruthenium -----------------------------------------------------------The Elements -- continued ----------------------------------------------- -------------Name Samarium Scandium Selenium Silicon Silver (Argentum) Sodium (Natrium) Strontium Sulphur Tantalum Tellurium Thallium Thorium Thulium Tin (Stannum) Titanium Tungsten (Wolframium) Uranium Vanadium Wolfranium (see Tungsten) Xenon Ytterbium Yttrium Zinc Zirconium ------------------------------------------------------\n\n1. To compound of elements or first principles. [Obs.] \"[Love] being elemented too.\" Donne. 2. To constitute; to make up with elements. His very soul was elemented of nothing but sadness. Walton."}