{"word":"envy","definition":"1. Malice; ill will; spite. [Obs.] If he evade us there, Enforce him with his envy to the people. Shak. 2. Chagrin, mortification, discontent, or uneasiness at the sight of another's excellence or good fortune, accompanied with some degree of hatred and a desire to possess equal advantages; malicious grudging; -- usually followed by of; as, they did this in envy of Cæsar. Envy is a repining at the prosperity or good of another, or anger and displeasure at any good of another which we want, or any advantage another hath above us. Ray. No bliss Enjoyed by us excites his envy more. Milton. Envy, to which the ignoble mind's a slave, Is emulation in the learned or brave. Pope. 3. Emulation; rivalry. [Obs.] Such as cleanliness and decency Prompt to a virtuous envy. Ford. 4. Public odium; ill repute. [Obs.] To lay the envy of the war upon Cicero. B. Jonson. 5. An object of envious notice or feeling. This constitution in former days used to be the envy of the world. Macaulay.\n\n1. To feel envy at or towards; to be envious of; to have a feeling of uneasiness or mortification in regard to (any one), arising from the sight of another's excellence or good fortune and a longing to possess it. A woman does not envy a man for his fighting courage, nor a man a woman for her beauty. Collier. Whoever envies another confesses his superiority. Rambler. 2. To feel envy on account of; to have a feeling of grief or repining, with a longing to possess (some excellence or good fortune of another, or an equal good fortune, etc.); to look with grudging upon; to begrudge. I have seen thee fight, When I have envied thy behavior. Shak. Jeffrey . . . had actually envied his friends their cool mountain breezes. Froude. 3. To long after; to desire strongly; to covet. Or climb his knee the envied kiss to share. T. Gray. 4. To do harm to; to injure; to disparage. [Obs.] If I make a lie To gain your love and envy my best mistress, Put me against a wall. J. Fletcher. 5. To hate. [Obs.] Marlowe. 6. To emulate. [Obs.] Spenser.\n\n1. To be filled with envious feelings; to regard anything with grudging and longing eyes; -- used especially with at. Who would envy at the prosperity of the wicked Jer. Taylor. 2. To show malice or ill will; to rail. [Obs.] \"He has . . . envied against the people.\" Shak."}