{"word":"epoch","definition":"1. A fixed point of time, established in history by the occurrence of some grand or remarkable event; a point of time marked by an event of great subsequent influence; as, the epoch of the creation; the birth of Christ was the epoch which gave rise to the Christian era. In divers ages, . . . divers epochs of time were used. Usher. Great epochs and crises in the kingdom of God. Trench. The acquittal of the bishops was not the only event which makes the 30th of June, 1688, a great epoch in history. Macaulay. Note: Epochs mark the beginning of new historical periods, and dates are often numbered from them. 2. A period of time, longer or shorter, remarkable for events of great subsequent influence; a memorable period; as, the epoch of maritime discovery, or of the Reformation. \"So vast an epoch of time.\" F. Harrison. The influence of Chaucer continued to live even during the dreary interval which separates from one another two important epochs of our literary history. A. W. Ward. 3. (Geol.)  A division of time characterized by the prevalence of similar conditions of the earth; commonly a minor division or part of a period. The long geological epoch which stored up the vast coal measures. J. C. Shairp. 4. (Astron.) (a) The date at which a planet or comet has a longitude or position. (b) An arbitrary fixed date, for which the elements used in computing the place of a planet, or other heavenly body, at any other date, are given; as, the epoch of Mars; lunar elements for the epoch March 1st, 1860. Syn. -- Era; time; date; period; age. -- Epoch, Era. We speak of the era of the Reformation, when we think of it as a period, during which a new order of things prevailed; so also, the era of good feeling, etc. Had we been thinking of the time as marked by certain great events, or as a period in which great results were effected, we should have called the times when these events happened epochs, and the whole period an epoch. The capture of Constantinople is an epoch in the history of Mahometanism; but the flight of Mahomet is its era. C. J. Smith."}