{"word":"equation","definition":"1. A making equal; equal division; equality; equilibrium. Again the golden day resumed its right, And ruled in just equation with the night. Rowe. 2. (Math.)  An expression of the condition of equality between two algebraic quantities or sets of quantities, the sign = being placed between them; as, a binomial equation; a quadratic equation; an algebraic equation; a transcendental equation; an exponential equation; a logarithmic equation; a differential equation, etc. 3. (Astron.)  A quantity to be applied in computing the mean place or other element of a celestial body; that is, any one of the several quantities to be added to, or taken from, its position as calculated on the hypothesis of a mean uniform motion, in order to find its true position as resulting from its actual and unequal motion. Absolute equation. See under Absolute. -- Equation box, or Equational box, a system of differential gearing used in spinning machines for regulating the twist of the yarn. It resembles gearing used in equation clocks for showing apparent time. -- Equation of the center (Astron.), the difference between the place of a planet as supposed to move uniformly in a circle, and its place as moving in an ellipse. -- Equations of condition (Math.), equations formed for deducing the true values of certain quantities from others on which they depend, when different sets of the latter, as given by observation, would yield different values of the quantities sought, and the number of equations that may be found is greater than the number of unknown quantities. -- Equation of a curve (Math.), an equation which expresses the relation between the coördinates of every point in the curve. -- Equation of equinoxes (Astron.), the difference between the mean and apparent places of the equinox. -- Equation of payments (Arith.), the process of finding the mean time of payment of several sums due at different times. -- Equation of time (Astron.), the difference between mean and apparent time, or between the time of day indicated by the sun, and that by a perfect clock going uniformly all the year round. -- Equation clock or watch, a timepiece made to exhibit the differences between mean solar and apparent solar time. Knight. -- Normal equation. See under Normal. -- Personal equation (Astron.), the difference between an observed result and the true qualities or peculiarities in the observer; particularly the difference, in an average of a large number of observation, between the instant when an observer notes a phenomenon, as the transit of a star, and the assumed instant of its actual occurrence; or, relatively, the difference between these instants as noted by two observers. It is usually only a fraction of a second; -- sometimes applied loosely to differences of judgment or method occasioned by temperamental qualities of individuals. -- Theory of equations (Math.), the branch of algebra that treats of the properties of a single algebraic equation of any degree containing one unknown quantity."}