{"word":"excuse","definition":"1. To free from accusation, or the imputation of fault or blame; to clear from guilt; to release from a charge; to justify by extenuating a fault; to exculpate; to absolve; to acquit. A man's persuasion that a thing is duty, will not excuse him from guilt in practicing it, if really and indeed it be against Gog's law. Abp. Sharp. 2. To pardon, as a fault; to forgive entirely, or to admit to be little censurable, and to overlook; as, we excuse irregular conduct, when extraordinary circumstances appear to justify it. I must excuse what can not be amended. Shak. 3. To regard with indulgence; to view leniently or to overlook; to pardon. And in our own (excuse some courtly stains.) No whiter page than Addison remains. Pope. 4. To free from an impending obligation or duty; hence, to disengage; to dispense with; to release by favor; also, to remit by favor; not to exact; as, to excuse a forfeiture. I pray thee have me excused. xiv. 19. 5. To relieve of an imputation by apology or defense; to make apology for as not seriously evil; to ask pardon or indulgence for. Think ye that we excuse ourselves to you 2 Cor. xii. 19. Syn. -- To vindicate; exculpate; absolve; acquit. - To Pardon, Excuse, Forgive. A superior pardons as an act of mercy or generosity; either a superior or an equal excuses. A crime, great fault, or a grave offence, as one against law or morals, may be pardoned; a small fault, such as a failure in social or conventional obligations, slight omissions or neglects may be excused. Forgive relates to offenses against one's self, and punishment foregone; as, to forgive injuries or one who has injured us; to pardon grave offenses, crimes, and criminals; to excuse an act of forgetfulness, an unintentional offense. Pardon is also a word of courtesy employed in the sense of excuse.\n\n1. The act of excusing, apologizing, exculpating, pardoning, releasing, and the like; acquittal; release; absolution; justification; extenuation. Pleading so wisely in excuse of it. Shak. 2. That which is offered as a reason for being excused; a plea offered in extenuation of a fault or irregular deportment; apology; as, an excuse for neglect of duty; excuses for delay of payment. Hence with denial vain and coy excuse. Milton. 3. That which excuses; that which extenuates or justifies a fault. \"It hath the excuse of youth.\" Shak. If eyes were made for seeing. Then beauty is its own excuse for being. Emerson. Syn. -- See Apology."}