{"word":"exercise","definition":"1. The act of exercising; a setting in action or practicing; employment in the proper mode of activity; exertion; application; use; habitual activity; occupation, in general; practice. exercise of the important function confided by the constitution to the legislature. Jefferson. O we will walk this world, Yoked in all exercise of noble end. Tennyson. 2. Exertion for the sake of training or improvement whether physical, intellectual, or moral; practice to acquire skill, knowledge, virtue, perfectness, grace, etc. \"Desire of knightly exercise.\" Spenser. An exercise of the eyes and memory. Locke. 3. Bodily exertion for the sake of keeping the organs and functions in a healthy state; hygienic activity; as, to take exercise ob horseback. The wise for cure on exercise depend. Dryden. 4. The performance of an office, a ceremony, or a religious duty. Lewis refused even those of the church of England . . . the public exercise of their religion. Addison. To draw him from his holy exercise. Shak. 5. That which is done for the sake of exercising, practicing, training, or promoting skill, health, mental, improvement, moral discipline, etc.; that which is assigned or prescribed for such ebbs; hence, a disquisition; a lesson; a task; as, military or naval exercises; musical exercises; an exercise in composition. The clumsy exercises of the European tourney. Prescott. He seems to have taken a degree, and preformed public exercises in Cambridge, in 1565. Brydges. 6. That which gives practice; a trial; a test. Patience is more oft the exercise Of saints, the trial of their fortitude. Milton. Exercise bone (Med.), a deposit of bony matter in the soft tissues, produced by pressure or exertion.\n\n1. To set in action; to cause to act, move, or make exertion; to give employment to; to put in action habitually or constantly; to school or train; to exert repeatedly; to busy. Herein do I Exercise myself, to have always a conscience void of offence. Acts xxiv. 16. 2. To exert for the sake of training or improvement; to practice in order to develop; hence, also, to improve by practice; to discipline, and to use or to for the purpose of training; as, to exercise arms; to exercise one's self in music; to exercise troops. About him exercised heroic games The unarmed youth. Milton. 3. To occupy the attention and effort of; to task; to tax, especially in a painful or vexatious manner; harass; to vex; to worry or make anxious; to affect; to discipline; as, exercised with pain. Where pain of unextinguishable fire Must exercise us without hope of end. Milton. 4. To put in practice; to carry out in action; to perform the duties of; to use; to employ; to practice; as, to exercise authority; to exercise an office. I am the Lord which exercise loving-kindness, judgment, and righteousness in the earth. Jer. ix. 24. The people of the land have used oppression and exercised robbery. Ezek. xxii. 29.\n\nTo exercise one's self, as under military training; to drill; to take exercise; to use action or exertion; to practice gymnastics; as, to exercise for health or amusement. I wear my trusty sword, When I do exercise. Cowper."}