{"word":"expansion","definition":"1. The act of expanding or spreading out; the condition of being expanded; dilation; enlargement. 2. That which is expanded; expanse; extend surface; as the expansion of a sheet or of a lake; the expansion was formed of metal. The starred expansion of the skies. Beattie. 3. Space thought which anything is expanded; also, pure space. Lost in expansion, void and infinite. Blackmore. 4. (Com.)  Enlargement or extension of business transaction; esp., increase of the circulation of bank notes. 5. (Math.)  The developed result of an indicated operation; as, the expansion of (a + b)2 is a2 + 2ab + b2. 6. (Steam Ebgine)  The operation of steam in a cylinder after its communication with the boiler has been cut off, by which it continues to exert pressure upon the moving piston. 7. (Nav. Arch.)  The enlargement of the ship mathematically from a model or drawing to the full or building size, in the process of construction. Ham. Nav. Encyc. Note: Expansion is also used adjectively, as in expansion joint, expansion gear, etc. Expansion curve, a curve the coördinates of which show the relation between the pressure and volume of expanding gas or vapor; esp. (Steam engine), that part of an indicator diagram which shows the declining pressure of the steam as it expands in the cylinder. -- Expansion gear (Stream Engine). a cut-off gear. See Illust. of Link motion. -- Automatic expansion gear or cut-off, one that is regulated by the governor, and varies the supply of steam to the engine with the demand for power. -- Fixed expansion gear, or Fixed cut-off, one that always operates at the same fixed point of the stroke. -- Expansion joint, or Expansion coupling (Mech. & Engin.), a yielding joint or coupling for so uniting parts of a machine or structure that expansion, as by heat, is prevented from causing injurious strains; as by heat, is prevented from causing injurious strains; as: (a) A side or set of rollers, at the end of bridge truss, to support it but allow end play. (b) A telescopic joint in a steam pipe, to permit one part of the pipe to slide within the other. (c) A clamp for holding a locomotive frame to the boiler while allowing lengthwise motion. -- Expansion valve (Steam Engine), a cut-off valve, to shut off steam from the cylinder before the end of each stroke."}