{"word":"experience","definition":"1. Trial, as a test or experiment. [Obs.] She caused him to make experience Upon wild beasts. Spenser. 2. The effect upon the judgment or feelings produced by any event, whether witnessed or participated in; personal and direct impressions as contrasted with description or fancies; personal acquaintance; actual enjoyment or suffering. \"Guided by other's experiences.\" Shak. I have but one lamp by which my feet are guided, and that is the lamp of experience. P. Henry To most men experience is like the stern lights of a ship, which illumine only the track it has passed. Coleridge. When the consuls . . . came in . . . they knew soon by experience how slenderly guarded against danger the majesty of rulers is where force is wanting. Holland. Those that undertook the religion of our Savior upon his preaching, had no experience of it. Sharp. 3. An act of knowledge, one or more, by which single facts or general truths are ascertained; experimental or inductive knowledge; hence, implying skill, facility, or practical wisdom gained by personal knowledge, feeling or action; as, a king without experience of war. Whence hath the mind all the materials of reason and knowledge To this I answer in one word, from experience. Locke. Experience may be acquired in two ways; either, first by noticing facts without any attempt to influence the frequency of their occurrence or to vary the circumstances under which they occur; this is observation; or, secondly, by putting in action causes or agents over which we have control, and purposely varying their combinations, and noticing what effects take place; this is experiment. Sir J. Herschel.\n\n1. To make practical acquaintance with; to try personally; to prove by use or trial; to have trial of; to have the lot or fortune of; to have befall one; to be affected by; to feel; as, to experience pain or pleasure; to experience poverty; to experience a change of views. The partial failure and disappointment which he had experienced in India. Thirwall. 2. To exercise; to train by practice. The youthful sailors thus with early care Their arms experience, and for sea prepare. Harte. To experience religion (Theol.), to become a convert to the diatribes of Christianity; to yield to the power of religions truth."}