{"word":"express","definition":"1. Exactly representing; exact. Their human countenance The express resemblance of the gods. Milton. 2. Directly and distinctly stated; declared in terms; not implied or left to inference; made unambiguous by intention and care; clear; not dubious; as, express consent; an express statement. I have express commandment. Shak. 3. Intended for a particular purpose; relating to an express; sent on a particular errand; dispatched with special speed; as, an express messenger or train. Also used adverbially. A messenger sent express from the other world. Atterbury. Express color. (Law) See the Note under Color, n., 8. Syn. -- Explicit; clear; unambiguous. See Explicit.\n\n1. A clear image or representation; an expression; a plain declaration. [Obs.] The only remanent express of Christ's sacrifice on earth. Jer. Taylor. 2. A messenger sent on a special errand; a courier; hence, a regular and fast conveyance; commonly, a company or system for the prompt and safe transportation of merchandise or parcels; also, a railway train for transporting passengers or goods with speed and punctuality. 3. An express office. She charged him . . . to ask at the express if anything came up from town. E. E. Hale. 4. That which is sent by an express messenger or message. [Obs.] Eikon Basilike. Express office, an office where packages for an express are received or delivered.\n\n1. To press or squeeze out; as, to express the juice of grapes, or of apples; hence, to extort; to elicit. All the fruits out of which drink is expressed. Bacon. And th'idle breath all utterly expressed. Spenser. Halters and racks can not express from thee More than by deeds. B. Jonson. 2. To make or offer a representation of; to show by a copy or likeness; to represent; to resemble. Each skillful artist shall express thy form. E. Smith. So kids and whelps their sires and dams express. Dryden. 3. To give a true impression of; to represent and make known; to manifest plainly; to show in general; to exhibit, as an opinion or feeling, by a look, gesture, and esp. by language; to declare; to utter; to tell. My words express my purpose. Shak. They expressed in their lives those excellent doctrines of morality. Addison. 4. To make known the opinions or feelings of; to declare what is in the mind of; to show (one's self); to cause to appear; -- used reflexively. Mr. Phillips did express with much indignation against me, one evening. Pope. 5. To denote; to designate. Moses and Aaron took these men, which are expressed by their names. Num. i. 17. 6. To send by express messenger; to forward by special opportunity, or through the medium of an express; as, to express a package. Syn. -- To declare; utter; signify; testify; intimate."}