{"word":"eye","definition":"A brood; as, an eye of pheasants.\n\n1. The organ of sight or vision. In man, and the vertebrates generally, it is properly the movable ball or globe in the orbit, but the term often includes the adjacent parts. In most invertebrates the years are immovable ocelli, or compound eyes made up of numerous ocelli. See Ocellus. Description of illustration: a b Conjunctiva; c Cornea; d Sclerotic; e Choroid; f Cillary Muscle; g Cillary Process; h Iris; i Suspensory Ligament; k Prosterior Aqueous Chamber between h and i; l Anterior Aqueous Chamber; m Crystalline Lens; n Vitreous Humor; o Retina; p Yellow spot; q Center of blind spot; r Artery of Retina in center of the Optic Nerve. Note: The essential parts of the eye are inclosed in a tough outer coat, the sclerotic, to which the muscles moving it are attached, and which in front changes into the transparent cornea. A little way back of cornea, the crystalline lens is suspended, dividing the eye into two unequal cavities, a smaller one in front filled with a watery fluid, the aqueous humor, and larger one behind filled with a clear jelly, the vitreous humor. The sclerotic is lined with a highly pigmented membrane, the choroid, and this is turn is lined in the back half of the eyeball with the nearly transparent retina, in which the fibers of the optic nerve ramify. The choroid in front is continuous with the iris, which has a contractile opening in the center, the pupil, admitting light to the lens which brings the rays to a focus and forms an image upon the retina, where the light, falling upon delicate structures called rods and cones, causes them to stimulate the fibres of the optic nerve to transmit visual impressions to the brain. 2. The faculty of seeing; power or range of vision; hence, judgment or taste in the use of the eye, and in judging of objects; as, to have the eye of sailor; an eye for the beautiful or picturesque. 3. The action of the organ of sight; sight, look; view; ocular knowledge; judgment; opinion. In my eye, she is the sweetest lady that I looked on. Shak. 4. The space commanded by the organ of sight; scope of vision; hence, face; front; the presence of an object which is directly opposed or confronted; immediate presence. We shell express our duty in his eye. Shak. Her shell your hear disproved to her eyes. Shak. 5. Observation; oversight; watch; inspection; notice; attention; regard. \"Keep eyes upon her.\" Shak. Booksellers . . . have an eye to their own advantage. Addison. 6. That which resembles the organ of sight, in form, position, or appearance; as: (a) (Zoöl.) The spots on a feather, as of peacock. (b) The scar to which the adductor muscle is attached in oysters and other bivalve shells; also, the adductor muscle itself, esp. when used as food, as in the scallop. (c) The bud or sprout of a plant or tuber; as the eye of a potato. (d) The center of a target; the bull's-eye. (e) A small loop to receive a hook; as hooks and eyes on a dress. (f) The hole through the head of a needle. (g) A loop forming part of anything, or a hole through anything, to receive a rope, hook, pin, shaft, etc.; as an eye at the end of a tie bar in a bridge truss; as an eye through a crank; an eye at the end of rope. (h) The hole through the upper millstone. 7. That which resembles the eye in relative importance or beauty. \"The very eye of that proverb.\" Shak. Athens, the eye of Greece, mother of arts. Milton. 8. Tinge; shade of color. [Obs.] Red with an eye of blue makes a purple. Boyle. By the eye, in abundance. [Obs.] Marlowe. -- Elliott eye (Naut.), a loop in a hemp cable made around a thimble and served. -- Eye agate, a kind of circle agate, the central part of which are of deeper tints than the rest of the mass. Brande & C. -- Eye animalcule (Zoöl), a flagellate infusorian belonging to Euglena and related genera; -- so called because it has a colored spot like an eye at one end. -- Eye doctor, an oculist. -- Eye of a volute (Arch.), the circle in the center of volute. -- Eye of day, Eye of the morning, Eye of heaven, the sun. \"So gently shuts the eye day.\" Mrs. Barbauld. -- Eye of a ship, the foremost part in the bows of a ship, where, formerly, eyes were painted; also, the hawser holes. Ham. Nav. Encyc. -- Half an eye, very imperfect sight; a careless glance; as, to see a thing with half an eye; often figuratively. \"Those who have but half an eye. \" B. Jonson. -- To catch one's eye, to attract one's notice. -- To find favor in the eyes (of), to be graciously received and treated. -- To have an eye to, to pay particular attention to; to watch. \"Have an eye to Cinna.\" Shak. -- To keep an eye on, to watch. -- To set the eyes on, to see; to have a sight of. -- In the eye of the wind (Naut.), in a direction opposed to the wind; as, a ship sails in the eye of the wind.\n\nTo fix the eye on; to look on; to view; to observe; particularly, to observe or watch narrowly, or with fixed attention; to hold in view. Eye me, blest Providence, and square my trial To my proportioned strength. Milton.\n\nTo appear; to look. [Obs.] My becomings kill me, when they do not Eye well to you. Shak."}