{"word":"face","definition":"1. The exterior form or appearance of anything; that part which presents itself to the view; especially, the front or upper part or surface; that which particularly offers itself to the view of a spectator. A mist . . . watered the whole face of the ground. Gen. ii. 6. Lake Leman wooes me with its crystal face. Byron. 2. That part of a body, having several sides, which may be seen from one point, or which is presented toward a certain direction; one of the bounding planes of a solid; as, a cube has six faces. 3. (Mach.) (a) The principal dressed surface of a plate, disk, or pulley; the principal flat surface of a part or object. (b) That part of the acting surface of a cog in a cog wheel, which projects beyond the pitch line. (c) The width of a pulley, or the length of a cog from end to end; as, a pulley or cog wheel of ten inches face. 4. (Print.) (a) The upper surface, or the character upon the surface, of a type, plate, etc. (b) The style or cut of a type or font of type. 5. Outside appearance; surface show; look; external aspect, whether natural, assumed, or acquired. To set a face upon their own malignant design. Milton. This would produce a new face of things in Europe. Addison. We wear a face of joy, because We have been glad of yore. Wordsworth. 6. That part of the head, esp. of man, in which the eyes, cheeks, nose, and mouth are situated; visage; countenance. In the sweat of thy face shalt thou eat bread. Gen. iii. 19. 7. Cast of features; expression of countenance; look; air; appearance. We set the best faceon it we could. Dryden. 8. (Astrol.)  Ten degrees in extent of a sign of the zodiac. Chaucer. 9. Maintenance of the countenance free from abashment or confusion; confidence; boldness; shamelessness; effrontery. This is the man that has the face to charge others with false citations. Tillotson. 10. Presence; sight; front; as in the phrases, before the face of, in the immediate presence of; in the face of, before, in, or against the front of; as, to fly in the face of danger; to the face of, directly to; from the face of, from the presenceof. 11. Mode of regard, whether favorable or unfavorable; favor or anger; mostly in Scriptural phrases. The Lord make his face to shine upon thee. Num. vi. 25. My face [favor] will I turn also from them. Ezek. vii. 22. 12. (Mining)  The end or wall of the tunnel, drift, or excavation, at which work is progressing or was last done. 13. (Com.)  The exact amount expressed on a bill, note, bond, or other mercantile paper, without any addition for interest or reduction for discount. McElrath. Note: Face is used either adjectively or as part of a compound; as, face guard or face-guard; face cloth; face plan or face-plan; face hammer. Face ague (Med.), a form of neuralgia, characterized by acute lancinating pains returning at intervals, and by twinges in certain parts of the face, producing convulsive twitches in the corresponding muscles; -- called also tic douloureux. -- Face card, one of a pack of playing cards on which a human face is represented; the king, queen, or jack. -- Face cloth, a cloth laid over the face of a corpse. -- Face guard, a mask with windows for the eyes, worn by workman exposed to great heat, or to flying particles of metal, stone, etc., as in glass works, foundries, etc. -- Face hammer, a hammer having a flat face. -- Face joint (Arch.), a joint in the face of a wall or other structure. -- Face mite (Zoöll.), a small, elongated mite (Demdex folliculorum), parasitic in the hair follicles of the face. -- Face mold, the templet or pattern by which carpenters, ect., outline the forms which are to be cut out from boards, sheet metal, ect. -- Face plate. (a) (Turning) A plate attached to the spindle of a lathe, to which the work to be turned may be attached. (b) A covering plate for an object, to receive wear or shock. (c) A true plane for testing a dressed surface. Knight. -- Face wheel. (Mach.) (a) A crown wheel. (b) A Wheel whose disk face is adapted for grinding and polishing; a lap. Cylinder face (Steam Engine), the flat part of a steam cylinder on which a slide valve moves. -- Face of an anvil, its flat upper surface. -- Face of a bastion (Fort.), the part between the salient and the shoulder angle. -- Face of coal (Mining), the principal cleavage plane, at right angles to the stratification. -- Face of a gun, the surface of metal at the muzzle. -- Face of a place (Fort.), the front comprehended between the flanked angles of two neighboring bastions. Wilhelm. -- Face of a square (Mil.), one of the sides of a battalion when formed in a square. -- Face of a watch, clock, compass, card etc., the dial or graduated surface on which a pointer indicates the time of day, point of the compass, etc. -- Face to face. (a) In the presence of each other; as, to bring the accuser and the accused face to face. (b) Without the interposition of any body or substance. \"Now we see through a glass darkly; but then face to face.\" 1 Cor. xiii. 12. (c) With the faces or finished surfaces turned inward or toward one another; vis à vis; -- opposed to back to back. -- To fly in the face of, to defy; to brave; to withstand. -- To make a face, to distort the countenance; to make a grimace. Shak.\n\n1. To meet in front; to oppose with firmness; to resist, or to meet for the purpose of stopping or opposing; to confront; to encounter; as, to face an enemy in the field of battale. I'll face This tempest, and deserve the name of king. Dryden. 2. To Confront impudently; to bully. I will neither be facednor braved. Shak. 3. To stand opposite to; to stand with the face or front toward; to front upon; as, the apartments of the general faced the park. He gained also with his forces that part of Britain which faces Ireland. Milton. 4. To cover in front, for ornament, protection, etc.; to put a facing upon; as, a building faced with marble. 5. To line near the edge, esp. with a different material; as, to face the front of a coat, or the bottom of a dress. 6. To cover with better, or better appearing, material than the mass consists of, for purpose of deception, as the surface of a box of tea, a barrel of sugar, etc. 7. (Mach.)  To make the surface of (anything) flat or smooth; to dress the face of (a stone, a casting, etc.); esp., in turning, to shape or smooth the flat surface of, as distinguished from the cylindrical surface. 8. To cause to turn or present a face or front, as in a particular direction. To face down, to put down by bold or impudent opposition. \"He faced men down.\" Prior. -- To face (a thing) out, to persist boldly or impudently in an assertion or in a line of conduct. \"That thinks with oaths to face the matter out.\" Shak\n\n1. To carry a false appearance; to play the hypocrite. \"To lie, to face, to forge.\" Spenser. 2. To turn the face; as, to face to the right or left. Face about, man; a soldier, and afraid! Dryden. 3. To present a face or front."}