{"word":"faculty","definition":"1. Ability to act or perform, whether inborn or cultivated; capacity for any natural function; especially, an original mental power or capacity for any of the well-known classes of mental activity; psychical or soul capacity; capacity for any of the leading kinds of soul activity, as knowledge, feeling, volition; intellectual endowment or gift; power; as, faculties of the mind or the soul. But know that in the soul Are many lesser faculties that serve Reason as chief. Milton. What a piece of work is a man ! how noble in reason ! how infinite in faculty ! Shak. 2. Special mental endowment; characteristic knack. He had a ready faculty, indeed, of escaping from any topic that agitated his too sensitive and nervous temperament. Hawthorne. 3. Power; prerogative or attribute of office. [R.] This Duncan Hath borne his faculties so meek. Shak. 4. Privilege or permission, granted by favor or indulgence, to do a particular thing; authority; license; dispensation. The pope . . . granted him a faculty to set him free from his promise. Fuller. It had not only faculty to inspect all bishops' dioceses, but to change what laws and statutes they should think fit to alter among the colleges. Evelyn. 5. A body of a men to whom any specific right or privilege is granted; formerly, the graduates in any of the four departments of a university or college (Philosophy, Law, Medicine, or Theology), to whom was granted the right of teaching (profitendi or docendi) in the department in which they had studied; at present, the members of a profession itself; as, the medical faculty; the legal faculty, ect. 6. (Amer. Colleges)  The body of person to whom are intrusted the government and instruction of a college or university, or of one of its departments; the president, professors, and tutors in a college. Dean of faculty. See under Dean. -- Faculty of advocates. (Scot.) See under Advocate. Syn. -- Talent; gift; endowment; dexterity; expertness; cleverness; readiness; ability; knack."}