{"word":"fail","definition":"1. To be wanting; to fall short; to be or become deficient in any measure or degree up to total absence; to cease to be furnished in the usual or expected manner, or to be altogether cut off from supply; to be lacking; as, streams fail; crops fail. As the waters fail from the sea. Job xiv. 11. Till Lionel's issue fails, his should not reign. Shak. 2. To be affected with want; to come short; to lack; to be deficient or unprovided; -- used with of. If ever they fail of beauty, this failure is not be attributed to their size. Berke. 3. To fall away; to become diminished; to decline; to decay; to sink. When earnestly they seek Such proof, conclude they then begin to fail. Milton. 4. To deteriorate in respect to vigor, activity, resources, etc.; to become weaker; as, a sick man fails. 5. To perish; to die; -- used of a person. [Obs.] Had the king in his last sickness failed. Shak. 6. To be found wanting with respect to an action or a duty to be performed, a result to be secured, etc.; to miss; not to fulfill expectation. Take heed now that ye fail not to do this. Ezra iv. 22. Either my eyesight fails, or thou look'st pale. Shak. 7. To come short of a result or object aimed at or desired ; to be baffled or frusrated. Our envious foe hath failed. Milton. 8. To err in judgment; to be mistaken. Which ofttimes may succeed, so as perhaps Shall grieve him, if I fail not. Milton. 9. To become unable to meet one's engagements; especially, to be unable to pay one's debts or discharge one's business obligation; to become bankrupt or insolvent.\n\n1. To be wanting to ; to be insufficient for; to disappoint; to desert. There shall not fail thee a man on the throne. 1 Kings ii. 4. 2. To miss of attaining; to lose. [R.] Though that seat of earthly bliss be failed. Milton.\n\n1. Miscarriage; failure; deficiency; fault; -- mostly superseded by failure or failing, except in the phrase without fail. \"His highness' fail of issue.\" Shak. 2. Death; decease. [Obs.] Shak."}