{"word":"fall","definition":"1. To Descend, either suddenly or gradually; particularly, to descend by the force of gravity; to drop; to sink; as, the apple falls; the tide falls; the mercury falls in the barometer. I beheld Satan as lightning fall from heaven. Luke x. 18. 2. To cease to be erect; to take suddenly a recumbent posture; to become prostrate; to drop; as, a child totters and falls; a tree falls; a worshiper falls on his knees. I fell at his feet to worship him. Rev. xix. 10. 3. To find a final outlet; to discharge its waters; to empty; -- with into; as, the river Rhone falls into the Mediterranean. 4. To become prostrate and dead; to die; especially, to die by violence, as in battle. A thousand shall fall at thy side. Ps. xci. 7. He rushed into the field, and, foremost fighting, fell. Byron. 5. To cease to be active or strong; to die away; to lose strength; to subside; to become less intense; as, the wind falls. 6. To issue forth into life; to be brought forth; -- said of the young of certain animals. Shak. 7. To decline in power, glory, wealth, or importance; to become insignificant; to lose rank or position; to decline in weight, value, price etc.; to become less; as, the falls; stocks fell two points. I am a poor falle man, unworthy now To be thy lord and master. Shak. The greatness of these Irish lords suddenly fell and vanished. Sir J. Davies. 8. To be overthrown or captured; to be destroyed. Heaven and earth will witness, If Rome must fall, that we are innocent. Addison. 9. To descend in character or reputation; to become degraded; to sink into vice, error, or sin; to depart from the faith; to apostatize; to sin. Let us labor therefore to enter into that rest, lest any man fall after the same example of unbelief. Heb. iv. 11. 10. To become insnared or embarrassed; to be entrapped; to be worse off than before; asm to fall into error; to fall into difficulties. 11. To assume a look of shame or disappointment; to become or appear dejected; -- said of the countenance. Cain was very wroth, and his countenance fell. Gen. iv. 5. I have observed of late thy looks are fallen. Addison. 12. To sink; to languish; to become feeble or faint; as, our spirits rise and fall with our fortunes. 13. To pass somewha suddenly, and passively, into a new state of body or mind; to become; as, to fall asleep; to fall into a passion; to fall in love; to fall into temptation. 14. To happen; to to come to pass; to light; to befall; to issue; to terminate. The Romans fell on this model by chance. Swift. Sit still, my daughter, until thou know how the matter will fall. Ruth. iii. 18. They do not make laws, they fall into customs. H. Spencer. 15. To come; to occur; to arrive. The vernal equinox, which at the Nicene Council fell on the 21st of March, falls now [1694] about ten days sooner. Holder. 16. To begin with haste, ardor, or vehemence; to rush or hurry; as, they fell to blows. They now no longer doubted, but fell to work heart and soul. Jowett (Thucyd. ). 17. To pass or be transferred by chance, lot, distribution, inheritance, or otherwise; as, the estate fell to his brother; the kingdom fell into the hands of his rivals. 18. To belong or appertain. If to her share some female errors fall, Look on her face, and you'll forget them all. Pope. 19. To be dropped or uttered carelessly; as, an unguarded expression fell from his lips; not a murmur fell from him. To fall abroad of (Naut.), to strike against; -- applied to one vessel coming into collision with another. -- To fall among, to come among accidentally or unexpectedly. -- To fall astern (Naut.), to move or be driven backward; to be left behind; as, a ship falls astern by the force of a current, or when outsailed by another. -- To fall away. (a) To lose flesh; to become lean or emaciated; to pine. (b) To renounce or desert allegiance; to revolt or rebel. (c) To renounce or desert the faith; to apostatize. \"These . . . for a while believe, and in time of temptation fall away.\" Luke viii. 13. (d) To perish; to vanish; to be lost. \"How . . . can the soul . . . fall away into nothing\" Addison. (e) To decline gradually; to fade; to languish, or become faint. \"One color falls away by just degrees, and another rises insensibly.\" Addison. -- To fall back. (a) To recede or retreat; to give way. (b) To fail of performing a promise or purpose; not to fulfill. -- To fall back upon. (a) (Mil.) To retreat for safety to (a stronger position in the rear, as to a fort or a supporting body of troops). (b) To have recourse to (a reserved fund, or some available expedient or support). -- To fall calm, to cease to blow; to become calm. -- To fall down. (a) To prostrate one's self in worship. \"All kings shall fall down before him.\" Ps. lxxii. 11. (b) To sink; to come to the ground. \"Down fell the beauteous youth.\" Dryden. (c) To bend or bow, as a suppliant. (d) (Naut.) To sail or drift toward the mouth of a river or other outlet. -- To fall flat, to produce no response or result; to fail of the intended effect; as, his speech fell flat. -- To fall foul of. (a) (Naut.) To have a collision with; to become entangled with (b) To attack; to make an assault upon. -- To fall from, to recede or depart from; not to adhere to; as, to fall from an agreement or engagement; to fall from allegiance or duty. -- To fall from grace (M. E. Ch.), to sin; to withdraw from the faith. -- To fall home (Ship Carp.), to curve inward; -- said of the timbers or upper parts of a ship's side which are much within a perpendicular. -- To fall in. (a) To sink inwards; as, the roof fell in. (b) (Mil.) To take one's proper or assigned place in line; as, to fall in on the right. (c) To come to an end; to terminate; to lapse; as, on the death of Mr. B., the annuuity, which he had so long received, fell in. (d) To become operative. \"The reversion, to which he had been nominated twenty years before, fell in.\" Macaulay. -- To fall into one's hands, to pass, often suddenly or unexpectedly, into one's ownership or control; as, to spike cannon when they are likely to fall into the hands of the enemy. -- To fall in with. (a) To meet with accidentally; as, to fall in with a friend. (b) (Naut.) To meet, as a ship; also, to discover or come near, as land. (c) To concur with; to agree with; as, the measure falls in with popular opinion. (d) To comply; to yield to. \"You will find it difficult to persuade learned men to fall in with your projects.\" Addison. -- To fall off. (a) To drop; as, fruits fall off when ripe. (b) To withdraw; to separate; to become detached; as, friends fall off in adversity. \"Love cools, friendship falls off, brothers divide.\" Shak. (c) To perish; to die away; as, words fall off by disuse. (d) To apostatize; to forsake; to withdraw from the faith, or from allegiance or duty. Those captive tribes . . . fell off From God to worship calves. Milton. (e) To forsake; to abandon; as, his customers fell off. (f) To depreciate; to change for the worse; to deteriorate; to become less valuable, abundant, or interesting; as, a falling off in the wheat crop; the magazine or the review falls off. \"O Hamlet, what a falling off was there!\" Shak. (g) (Naut.) To deviate or trend to the leeward of the point to which the head of the ship was before directed; to fall to leeward. -- To fall on. (a) To meet with; to light upon; as, we have fallen on evil days. (b) To begin suddenly and eagerly. \"Fall on, and try the appetite to eat.\" Dryden. (c) To begin an attack; to assault; to assail. \"Fall on, fall on, and hear him not.\" Dryden. (d) To drop on; to descend on. -- To fall out. (a) To quarrel; to begin to contend. A soul exasperated in ills falls out With everything, its friend, itself. Addison. (b) To happen; to befall; to chance. \"There fell out a bloody quarrel betwixt the frogs and the mice.\" L'Estrange. (c) (Mil.) To leave the ranks, as a soldier. -- To fall over. (a) To revolt; to desert from one side to another. (b) To fall beyond. Shak. -- To fall short, to be deficient; as, the corn falls short; they all fall short in duty. -- To fall through, to come to nothing; to fail; as, the engageent has fallen through. -- To fall to, to begin. \"Fall to, with eager joy, on homely food.\" Dryden. -- To fall under. (a) To come under, or within the limits of; to be subjected to; as, they fell under the jurisdiction of the emperor. (b) To come under; to become the subject of; as, this point did not fall under the cognizance or deliberations of the court; these things do not fall under human sight or observation. (c) To come within; to be ranged or reckoned with; to be subordinate to in the way of classification; as, these substances fall under a different class or order. -- To fall upon. (a) To attack. [See To fall on.] (b) To attempt; to have recourse to. \"I do not intend to fall upon nice disquisitions.\" Holder. (c) To rush against. Note: Fall primarily denotes descending motion, either in a perpendicular or inclined direction, and, in most of its applications, implies, literally or figuratively, velocity, haste, suddenness, or violence. Its use is so various, and so mush diversified by modifying words, that it is not easy to enumerate its senses in all its applications.\n\n1. To let fall; to drop. [Obs.] For every tear he falls, a Trojan bleeds. Shak. 2. To sink; to depress; as, to fall the voice. [Obs.] 3. To diminish; to lessen or lower. [Obs.] Upon lessening interest to four per cent, you fall the price of your native commodities. Locke. 4. To bring forth; as, to fall lambs. [R.] Shak. 5. To fell; to cut down; as, to fall a tree. [Prov. Eng. & Local, U.S.]\n\n1. The act of falling; a dropping or descending be the force of gravity; descent; as, a fall from a horse, or from the yard of ship. 2. The act of dropping or tumbling from an erect posture; as, he was walking on ice, and had a fall. 3. Death; destruction; overthrow; ruin. They thy fall conspire. Denham. Pride goeth before destruction, and a haughty spirit before a fall. Prov. xvi. 18. 4. Downfall; degradation; loss of greatness or office; termination of greatness, power, or dominion; ruin; overthrow; as, the fall of the Roman empire. Beholds thee glorious only in thy fall. Pope. 5. The surrender of a besieged fortress or town ; as, the fall of Sebastopol. 6. Diminution or decrease in price or value; depreciation; as, the fall of prices; the fall of rents. 7. A sinking of tone; cadence; as, the fall of the voice at the close of a sentence. 8. Declivity; the descent of land or a hill; a slope. 9. Descent of water; a cascade; a cataract; a rush of water down a precipice or steep; -- usually in the plural, sometimes in the singular; as, the falls of Niagara. 10. The discharge of a river or current of water into the ocean, or into a lake or pond; as, the fall of the Po into the Gulf of Venice. Addison. 11. Extent of descent; the distance which anything falls; as, the water of a stream has a fall of five feet. 12. The season when leaves fall from trees; autumn. What crowds of patients the town doctor kills, Or how, last fall, he raised the weekly bills. Dryden. 13. That which falls; a falling; as, a fall of rain; a heavy fall of snow. 14. The act of felling or cutting down. \"The fall of timber.\" Johnson. 15. Lapse or declinsion from innocence or goodness. Specifically: The first apostasy; the act of our first parents in eating the forbidden fruit; also, the apostasy of the rebellious angels. 16. Formerly, a kind of ruff or band for the neck; a falling band; a faule. B. Jonson. 17. That part (as one of the ropes) of a tackle to which the power is applied in hoisting. Fall herring (Zoöl.), a herring of the Atlantic (Clupea mediocris); -- also called tailor herring, and hickory shad. -- To try a fall, to try a bout at wrestling. Shak."}