{"word":"fan","definition":"1. An instrument used for producing artificial currents of air, by the wafting or revolving motion of a broad surface; as: (a) An instrument for cooling the person, made of feathers, paper, silk, etc., and often mounted on sticks all turning about the same pivot, so as when opened to radiate from the center and assume the figure of a section of a circle. (b) (Mach.) Any revolving vane or vanes used for producing currents of air, in winnowing grain, blowing a fire, ventilation, etc., or for checking rapid motion by the resistance of the air; a fan blower; a fan wheel. (c) An instrument for winnowing grain, by moving which the grain is tossed and agitated, and the chaff is separated and blown away. (d) Something in the form of a fan when spread, as a peacock's tail, a window, etc. (e) A small vane or sail, used to keep the large sails of a smock windmill always in the direction of the wind. Clean provender, which hath been winnowed with the shovel and with the fan. Is. xxx. 24. 2. That which produces effects analogous to those of a fan, as in exciting a flame, etc.; that which inflames, heightens, or strengthens; as, it served as a fan to the flame of his passion. 3. A quintain; -- from its form. [Obs.] Chaucer. Fan blower, a wheel with vanes fixed on a rotating shaft inclosed in a case or chamber, to create a blast of air (fan blast) for forge purposes, or a current for draft and ventilation; a fanner. -- Fan cricket (Zoöl.), a mole cricket. -- Fan light (Arch.), a window over a door; -- so called from the semicircular form and radiating sash bars of those windows which are set in the circular heads of arched doorways. -- Fan shell (Zoöl.), any shell of the family Pectinidæ. See Scallop, n., 1. -- Fan tracery (Arch.), the decorative tracery on the surface of fan vaulting. -- Fan vaulting (Arch.), an elaborate system of vaulting, in which the ribs diverge somewhat like the rays of a fan, as in Henry VII.'s chapel in Westminster Abbey. It is peculiar to English Gothic. -- Fan wheel, the wheel of a fan blower. -- Fan window. Same as Fan light (above).\n\n1. To move as with a fan. The air . . . fanned with unnumbered plumes. Milton. 2. To cool and refresh, by moving the air with a fan; to blow the air on the face of with a fan. 3. To ventilate; to blow on; to affect by air put in motion. Calm as the breath which fans our eastern groves. Dryden. 4. To winnow; to separate chaff from, and drive it away by a current of air; as, to fan wheat. Jer. li. 2. 5. To excite or stir up to activity, as a fan axcites a flame; to stimulate; as, this conduct fanned the excitement of the populace. Fanning machine, or Fanning mill, a machine for separating seed from chaff, etc., by a blast of air; a fanner."}