{"word":"far","definition":"A young pig, or a litter of pigs.\n\n1. Distant in any direction; not near; remote; mutually separated by a wide space or extent. They said, . . . We be come from a far country. Josh. ix. 6. The nations far and near contend in choice. Dryden. 2. Remote from purpose; contrary to design or wishes; as, far be it from me to justify cruelty. 3. Remote in affection or obedience; at a distance, morally or spiritually; t enmity with; alienated. They that are far from thee ahsll perish. Ps. lxxiii. 27. 4. Widely different in nature or quality; opposite in character. He was far from ill looking, though he thought himself still farther. F. Anstey. 5. The more distant of two; as, the far side (called also off side) of a horse, that is, the right side, or the one opposite to the rider when he mounts. Note: The distinction between the adjectival and adverbial use of far is sometimes not easily discriminated. By far, by much; by a great difference. -- Far between, with a long distance (of space or time) between; at long intervals. \"The examinations are few and far between.\" Farrar.\n\n1. To a great extent or distance of space; widely; as, we are separated far from each other. 2. To a great distance in time from any point; remotely; as, he pushed his researches far into antiquity. 3. In great part; as, the day is far spent. 4. In a great proportion; by many degrees; very much; deeply; greatly. Who can find a virtuous woman for her price is far above rubies. Prov. xxxi. 10. As far as, to the extent, or degree, that. See As far as, under As. -- Far off. (a) At a great distance, absolutely or relatively. (b) Distant in sympathy or affection; alienated. \"But now, in Christ Jesus, ye who some time were far off are made nigh by the blood of Christ.\" Eph. ii. 13. -- Far other, different by a great degree; not the same; quite unlike. Pope. -- Far and near, at a distance and close by; throughout a whole region. -- Far and wide, distantly and broadly; comprehensively. \"Far and wide his eye commands.\" Milton. -- From far, from a great distance; from a remote place. Note: Far often occurs in self-explaining compounds, such as far- extended, far-reaching, far-spread."}