{"word":"fast","definition":"1. To abstain from food; to omit to take nourishment in whole or in part; to go hungry. Fasting he went to sleep, and fasting waked. Milton. 2. To practice abstinence as a religious exercise or duty; to abstain from food voluntarily for a time, for the mortification of the body or appetites, or as a token of grief, or humiliation and penitence. Thou didst fast and weep for the child. 2 Sam. xii. 21. Fasting day, a fast day; a day of fasting.\n\n1. Abstinence from food; omission to take nounrishment. Surfeit is the father of much fast. Shak. 2. Voluntary abstinence from food, for a space of time, as a spiritual discipline, or as a token of religious humiliation. 3. A time of fasting, whether a day, week, or longer time; a period of abstinence from food or certain kinds of food; as, an annual fast. Fast day, a day appointed for fasting, humiliation, and religious offices as a means of invoking the favor of God. -- To break one's fast, to put an end to a period of abstinence by taking food; especially, to take one's morning meal; to breakfast. Shak.\n\n1. Firmly fixed; closely adhering; made firm; not loose, unstable, or easily moved; immovable; as, to make fast the door. There is an order that keeps things fast. Burke. 2. Firm against attack; fortified by nature or art; impregnable; strong. Outlaws . . . lurking in woods and fast places. Spenser. 3. Firm in adherence; steadfast; not easily separated or alienated; faithful; as, a fast friend. 4. Permanent; not liable to fade by exposure to air or by washing; durable; lasting; as, fast colors. 5. Tenacious; retentive. [Obs.] Roses, damask and red, are fast flowers of their smells. Bacon. 6. Not easily disturbed or broken; deep; sound. All this while in a most fast sleep. Shak. 7. Moving rapidly; quick in mition; rapid; swift; as, a fast horse. 8. Given to pleasure seeking; disregardful of restraint; reckless; wild; dissipated; dissolute; as, a fast man; a fast liver. Thackeray. Fast and loose, now cohering, now disjoined; inconstant, esp. in the phrases to play at fast and loose, to play fast and loose, to act with giddy or reckless inconstancy or in a tricky manner; to say one thing and do another \"Play fast and loose with faith.\" Shak. Fast and loose pulleys (Mach.), two pulleys placed side by side on a revolving shaft, which is driven from another shaft by a band, and arranged to disengage and reëngage the machinery driven thereby. When the machinery is to be stopped, the band is transferred from the pulley fixed to the shaft to the pulley which revolves freely upon it, and vice versa. -- Hard and fast (Naut.), so completely aground as to be immovable. -- To make fast (Naut.), to make secure; to fasten firmly, as a vessel, a rope, or a door.\n\n1. In a fast, fixed, or firmly established manner; fixedly; firmly; immovably. We will bind thee fast. Judg. xv. 13. 2. In a fast or rapid manner; quickly; swiftly; extravagantly; wildly; as, to run fast; to live fast. Fast by, or Fast beside, close or near to; near at hand. He, after Eve seduced, unminded slunk Into the wood fast by. Milton. Fast by the throne obsequious Fame resides. Pope.\n\nThat which fastens or holds; especially, (Naut.) a mooring rope, hawser, or chain; -- called, according to its position, a bow, head, quarter, breast, or stern fast; also, a post on a pier around which hawsers are passed in mooring."}