{"word":"fat","definition":"1. A large tub, cistern, or vessel; a vat. [Obs.] The fats shall overflow with wine and oil. Joel ii. 24. 2. A measure of quantity, differing for different commodities. [Obs.] Hebert.\n\n1. Abounding with fat; as: (a) Fleshy; characterized by fatness; plump; corpulent; not lean; as, a fat man; a fat ox. (b) Oily; greasy; unctuous; rich; -- said of food. 2. Exhibiting the qualities of a fat animal; coarse; heavy; gross; dull; stupid. Making our western wits fat and mean. Emerson. Make the heart of this people fat. Is. vi. 10. 3. Fertile; productive; as, a fat soil; a fat pasture. 4. Rich; producing a large income; desirable; as, a fat benefice; a fat office; a fat job. Now parson of Troston, a fat living in Suffolk. Carlyle. 5. Abounding in riches; affluent; fortunate. [Obs.] Persons grown fat and wealthy by long impostures. Swift. 6. (Typog.)  Of a character which enables the compositor to make large wages; -- said of matter containing blank, cuts, or many leads, etc.; as, a fat take; a fat page. Fat lute, a mixture of pipe clay and oil for filling joints.\n\n1. (Physiol. Chem.)  An oily liquid or greasy substance making up the main bulk of the adipose tissue of animals, and widely distributed in the seeds of plants. See Adipose tissue, under Adipose. Note: Animal fats are composed mainly of three distinct fats, tristearin, tripalmitin, and triolein, mixed in varying proportions. As olein is liquid at ordinary temperatures, while the other two fats are solid, it follows that the consistency or hardness of fats depends upon the relative proportion of the three individual fats. During the life of an animal, the fat is mainly in a liquid state in the fat cells, owing to the solubility of the two solid fats in the more liquid olein at the body temperature. Chemically, fats are composed of fatty acid, as stearic, palmitic, oleic, etc., united with glyceryl. In butter fat, olein and palmitin predominate, mixed with another fat characteristic of butter, butyrin. In the vegetable kingdom many other fats or glycerides are to be found, as myristin from nutmegs, a glyceride of lauric acid in the fat of the bay tree, etc. 2. The best or richest productions; the best part; as, to live on the fat of the land. 3. (Typog.)  Work. containing much blank, or its equivalent, and, therefore, profitable to the compositor. Fat acid. (Chem.) See Sebacic acid, under Sebacic. -- Fat series, Fatty series (Chem.), the series of the paraffine hydrocarbons and their derivatives; the marsh gas or methane series. -- Natural fats (Chem.), the group of oily substances of natural occurrence, as butter, lard, tallow, etc., as distinguished from certain fatlike substance of artificial production, as paraffin. Most natural fats are essentially mixtures of triglycerides of fatty acids.\n\nTo make fat; to fatten; to make plump and fleshy with abundant food; as, to fat fowls or sheep. We fat all creatures else to fat us. Shak.\n\nTo grow fat, plump, and fleshy. An old ox fats as well, and is as good, as a young one. Mortimer."}