{"word":"father","definition":"1. One who has begotten a child, whether son or daughter; a generator; a male parent. A wise son maketh a glad father. Prov. x. 1. 2. A male ancestor more remote than a parent; a progenitor; especially, a first ancestor; a founder of a race or family; -- in the plural, fathers, ancestors. David slept with his fathers. 1 Kings ii. 10. Abraham, who is the father of us all. Rom. iv. 16. 3. One who performs the offices of a parent by maintenance, affetionate care, counsel, or protection. I was a father to the poor. Job xxix. 16. He hath made me a father to Pharaoh, and lord of all his house. Gen. xiv. 8. 4. A respectful mode of address to an old man. And Joash the king og Israel came down unto him [Elisha], . . . and said, O my father, my father! 2 Kings xiii. 14. 5. A senator of ancient Rome. 6. A dignitary of the church, a superior of a convent, a confessor (called also father confessor), or a priest; also, the eldest member of a profession, or of a legislative assembly, etc. Bless you, good father friar ! Shak. 7. One of the chief esslesiastical authorities of the first centuries after Christ; -- often spoken of collectively as the Fathers; as, the Latin, Greek, or apostolic Fathers. 8. One who, or that which, gives origin; an originator; a producer, author, or contriver; the first to practice any art, profession, or occupation; a distinguished example or teacher. The father of all such as handle the harp and organ. Gen. iv. 21. Might be the father, Harry, to that thought. Shak. The father of good news. Shak. 9. The Supreme Being and Creator; God; in theology, the first person in the Trinity. Our Father, which art in heaven. Matt. vi. 9. Now had the almighty Father from above . . . Bent down his eye. Milton. Adoptive father, one who adopts the child of another, treating it as his own. -- Apostolic father, Conscript fathers, etc. See under Apostolic, Conscript, etc. -- Father in God, a title given to bishops. -- Father of lies, the Devil. -- Father of the bar, the oldest practitioner at the bar. -- Fathers of the city, the aldermen. -- Father of the Faithful. (a) Abraham. Rom. iv. Gal. iii. 6-9. (b) Mohammed, or one of the sultans, his successors. -- Father of the house, the member of a legislative body who has had the longest continuous service. -- Most Reverend Father in God, a title given to archbishops and metropolitans, as to the archbishops of Canterbury and York. -- Natural father, the father of an illegitimate child. -- Putative father, one who is presumed to be the father of an illegitimate child; the supposed father. -- Spiritual father. (a) A religious teacher or guide, esp. one instrumental in leading a soul to God. (b) (R. C. Ch.) A priest who hears confession in the sacrament of penance. -- The Holy Father (R. C. Ch.), the pope.\n\n1. To make one's self the father of; to beget. Cowards father cowards, and base things sire base. Shak. 2. To take as one's own child; to adopt; hence, to assume as one's own work; to acknowledge one's self author of or responsible for (a statement, policy, etc.). Men of wit Often fathered what he writ. Swift. 3. To provide with a father. [R.] Think you I am no stronger than my sex, Being so fathered and so husbanded Shak. To father on or upon, to ascribe to, or charge upon, as one's offspring or work; to put or lay upon as being responsible. \"Nothing can be so uncouth or extravagant, which may not be fathered on some fetch of wit, or some caprice of humor.\" Barrow."}