{"word":"feather","definition":"1. One of the peculiar dermal appendages, of several kinds, belonging to birds, as contour feathers, quills, and down. Note: An ordinary feather consists of the quill or hollow basal part of the stem; the shaft or rachis, forming the upper, solid part of the stem; the vanes or webs, implanted on the rachis and consisting of a series of slender laminæ or barbs, which usually bear barbicels and interlocking hooks by which they are fastened together. See Down, Quill, Plumage. 2. Kind; nature; species; -- from the proverbial phrase, \"Birds of a feather,\" that is, of the same species. [R.] I am not of that feather to shake off My friend when he must need me. Shak. 3. The fringe of long hair on the legs of the setter and some other dogs. 4. A tuft of peculiar, long, frizzly hair on a horse. 5. One of the fins or wings on the shaft of an arrow. 6. (Mach. & Carp.)  A longitudinal strip projecting as a fin from an object, to strengthen it, or to enter a channel in another object and thereby prevent displacement sidwise but permit motion lengthwise; a spline. 7. A thin wedge driven between the two semicylindrical parts of a divided plug in a hole bored in a stone, to rend the stone. Knight. 8. The angular adjustment of an oar or paddle-wheel float, with reference to a horizontal axis, as it leaves or enters the water. Note: Feather is used adjectively or in combination, meaning composed of, or resembling, a feather or feathers; as, feather fan, feather- heeled, feather duster. Feather alum (Min.), a hydrous sulphate of alumina, resulting from volcanic action, and from the decomposition of iron pyrites; -- called also halotrichite. Ure. -- Feather bed, a bed filled with feathers. -- Feather driver, one who prepares feathers by beating. -- Feather duster, a dusting brush of feathers. -- Feather flower, an artifical flower made of feathers, for ladies' headdresses, and other ornamental purposes. -- Feather grass (Bot.), a kind of grass (Stipa pennata) which has a long feathery awn rising from one of the chaffy scales which inclose the grain. -- Feather maker, one who makes plumes, etc., of feathers, real or artificial. -- Feather ore (Min.), a sulphide of antimony and lead, sometimes found in capillary forms and like a cobweb, but also massive. It is a variety of Jamesonite. -- Feather shot, or Feathered shot (Metal.), copper granulated by pouring into cold water. Raymond. -- Feather spray (Naut.), the spray thrown up, like pairs of feathers, by the cutwater of a fast-moving vessel. -- Feather star. (Zoöl.) See Comatula. -- Feather weight. (Racing) (a) Scrupulously exact weight, so that a feather would turn the scale, when a jockey is weighed or weighted. (b) The lightest weight that can be put on the back of a horse in racing. Youatt. (c) In wrestling, boxing, etc., a term applied to the lightest of the classes into which contestants are divided; -- in contradistinction to light weight, middle weight, and heavy weight. A feather in the cap an honour, trophy, or mark of distinction. [Colloq.] -- To be in full feather, to be in full dress or in one's best clothes. [Collog.] -- To be in high feather, to be in high spirits. [Collog.] -- To cut a feather. (a) (Naut.) To make the water foam in moving; in allusion to the ripple which a ship throws off from her bows. (b) To make one's self conspicuous.[Colloq.] -- To show the white feather, to betray cowardice, -- a white feather in the tail of a cock being considered an indication that he is not of the true game breed.\n\n1. To furnish with a feather or feathers, as an arrow or a cap. An eagle had the ill hap to be struck with an arrow feathered from her own wing. L'Estrange. 2. To adorn, as with feathers; to fringe. A few birches and oaks still feathered the narrow ravines. Sir W. Scott. 3. To render light as a feather; to give wings to.[R.] The Polonian story perhaps may feather some tedions hours. Loveday. 4. To enrich; to exalt; to benefit. They stuck not to say that the king cared not to plume his nobility and people to feather himself. Bacon. Dryden. 5. To tread, as a cock. Dryden. To feather one's nest, to provide for one's self especially from property belonging to another, confided to one's care; -- an expression taken from the practice of birds which collect feathers for the lining of their nests. -- To feather an oar (Naut), to turn it when it leaves the water so that the blade will be horizontal and offer the least resistance to air while reaching for another stroke. -- To tar and feather a person, to smear him with tar and cover him with feathers, as a punishment or an indignity.\n\n1. To grow or form feathers; to become feathered; -- often with out; as, the birds are feathering out. 2. To curdle when poured into another liquid, and float about in little flakes or \"feathers;\" as, the cream feathers [Colloq.] 3. To turn to a horizontal plane; -- said of oars. The feathering oar returns the gleam. Tickell. Stopping his sculls in the air to feather accurately. Macmillan's Mag. 4. To have the appearance of a feather or of feathers; to be or to appear in feathery form. A clump of ancient cedars feathering in evergreen beauty down to the ground. Warren. The ripple feathering from her bows. Tennyson."}