{"word":"fee","definition":"1. property; possession; tenure. \"Laden with rich fee.\" Spenser. Once did she hold the gorgeous East in fee. Wordsworth. 2. Reward or compensation for services rendered or to be rendered; especially, payment for professional services, of optional amount, or fixed by custom or laws; charge; pay; perquisite; as, the fees of lawyers and physicians; the fees of office; clerk's fees; sheriff's fees; marriage fees, etc. To plead for love deserves more fee than hate. Shak. 3. (Feud. Law)  A right to the use of a superior's land, as a stipend for services to be performed; also, the land so held; a fief. 4. (Eng. Law)  An estate of inheritance supposed to be held either mediately or immediately from the sovereign, and absolutely vested in the owner. Note: All the land in England, except the crown land, is of this kind. An absolute fee, or fee simple, is land which a man holds to himself and his heirs forever, who are called tenants in fee simple. In modern writers, by fee is usually meant fee simple. A limited fee may be a qualitified or base fee, which ceases with the existence of certain conditions; or a conditional fee, or fee tail, which is limited to particular heirs. Blackstone. 5. (Amer. Law)  An estate of inheritance belonging to the owner, and transmissible to his heirs, absolutely and simply, without condition attached to the tenure. Fee estate (Eng. Law), land or tenements held in fee in consideration or some acknowledgment or service rendered to the lord. -- Fee farm (Law), land held of another in fee, in consideration of an annual rent, without homage, fealty, or any other service than that mentioned in the feoffment; an estate in fee simple, subject to a perpetual rent. Blackstone. -- Fee farm rent (Eng. Law), a perpetual rent reserved upon a conveyance in fee simple. -- Fee fund (Scot. Law), certain court dues out of which the clerks and other court officers are paid. -- Fee simple (Law), an absolute fee; a fee without conditions or limits. Buy the fee simple of my life for an hour and a quarter. Shak. -- Fee tail (Law), an estate of inheritance, limited and restrained to some particular heirs. Burill.\n\nTo reward for services performed, or to be performed; to recompense; to hire or keep in hire; hence, to bribe. The patient . . . fees the doctor. Dryden. There's not a one of them but in his house I keep a servant feed. Shak."}