{"word":"feel","definition":"1. To perceive by the touch; to take cognizance of by means of the nerves of sensation distributed all over the body, especially by those of the skin; to have sensation excited by contact of (a thing) with the body or limbs. Who feel Those rods of scorpions and those whips of steel. Creecn. 2. To touch; to handle; to examine by touching; as, feel this piece of silk; hence, to make trial of; to test; often with out. Come near, . . . that I may feel thee, my son. Gen. xxvii. 21. He hath this to feel my affection to your honor. Shak. 3. To perceive by the mind; to have a sense of; to experience; to be affected by; to be sensible of, or sensetive to; as, to feel pleasure; to feel pain. Teach me to feel another's woe. Pope. Whoso keepeth the commandment shall feel no evil thing. Eccl. viii. 5. He best can paint them who shall feel them most. Pope. Mankind have felt their strength and made it felt. Byron. 4. To take internal cognizance of; to be conscious of; to have an inward persuasion of. For then, and not till then, he felt himself. Shak. 5. To perceive; to observe. [Obs.] Chaucer. To feel the helm (Naut.), to obey it.\n\n1. To have perception by the touch, or by contact of anything with the nerves of sensation, especially those upon the surface of the body. 2. To have the sensibilities moved or affected. [She] feels with the dignity of a Roman matron. Burke. And mine as man, who feel for all mankind. Pope. 3. To be conscious of an inward impression, state of mind, persuasion, physical condition, etc.; to perceive one's self to be; - - followed by an adjective describing the state, etc.; as, to feel assured, grieved, persuaded. I then did feel full sick. Shak. 4. To know with feeling; to be conscious; hence, to know certainly or without misgiving. Garlands . . . which I feel I am not worthy yet to wear. Shak. 5. To appear to the touch; to give a perception; to produce an impression by the nerves of sensation; -- followed by an adjective describing the kind of sensation. Blind men say black feels rough, and white feels smooth. Dryden. To feel after, to search for; to seek to find; to seek as a person groping in the dark. \"If haply they might feel after him, and find him.\" Acts xvii. 27. - To feel of, to examine by touching.\n\n1. Feeling; perception. [R.] To intercept and have a more kindly feel of its genial warmth. Hazlitt. 2. A sensation communicated by touching; impression made upon one who touches or handles; as, this leather has a greasy feel. The difference between these two tumors will be distinguished by the feel. S. Sharp."}