{"word":"fetch","definition":"1. To bear toward the person speaking, or the person or thing from whose point of view the action is contemplated; to go and bring; to get. Time will run back and fetch the age of gold. Milton. He called to her, and said, Fetch me, I pray thee, a little water in a vessel, that I may drink. And as she was going to fetch it he called to her, and said, Bring me, I pray thee, a morsel of bred in thine hand. 1 Kings xvii. 11, 12. 2. To obtain as price or equivalent; to sell for. Our native horses were held in small esteem, and fetched low prices. Macaulay. 3. To recall from a swoon; to revive; -- sometimes with to; as, to fetch a man to. Fetching men again when they swoon. Bacon. 4. To reduce; to throw. The sudden trip in wrestling that fetches a man to the ground. South. 5. To bring to accomplishment; to achieve; to make; to perform, with certain objects; as, to fetch a compass; to fetch a leap; to fetch a sigh. I'll fetch a turn about the garden. Shak. He fetches his blow quick and sure. South. 6. To bring or get within reach by going; to reach; to arrive at; to attain; to reach by sailing. Meantine flew our ships, and straight we fetched The siren's isle. Chapman. 7. To cause to come; to bring to a particular state. They could n't fetch the butter in the churn. W. Barnes. To fetch a compass (Naut.), to make a sircuit; to take a circuitious route going to a place. -- To fetch a pump, to make it draw water by pouring water into the top and working the handle. -- To fetch headway or sternway (Naut.), to move ahead or astern. -- To fetch out, to develop. \"The skill of the polisher fetches out the colors [of marble]\" Addison. -- To fetch up. (a) To overtake. [Obs.] \"Says [the hare], I can fetch up the tortoise when I please.\" L'Estrange. (b) To stop suddenly.\n\nTo bring one's self; to make headway; to veer; as, to fetch about; to fetch to windward. Totten. To fetch away (Naut.), to break loose; to roll slide to leeward. -- To fetch and carry, to serve obsequiously, like a trained spaniel.\n\n1. A stratagem by which a thing is indirectly brought to pass, or by which one thing seems intended and another is done; a trick; an artifice. Every little fetch of wit and criticism. South. 2. The apparation of a living person; a wraith. The very fetch and ghost of Mrs. Gamp. Dickens. Fetch candle, a light seen at night, superstitiously believed to portend a person's death."}