{"word":"field","definition":"1. Cleared land; land suitable for tillage or pasture; cultivated ground; the open country. 2. A piece of land of considerable size; esp., a piece inclosed for tillage or pasture. Fields which promise corn and wine. Byron. 3. A place where a battle is fought; also, the battle itself. In this glorious and well-foughten field. Shak. What though the field be lost Milton. 4. An open space; an extent; an expanse. Esp.: (a) Any blank space or ground on which figures are drawn or projected. (b) The space covered by an optical instrument at one view. Without covering, save yon field of stars. Shak. Ask of yonder argent fields above. Pope. 5. (Her.)  The whole surface of an escutcheon; also, so much of it is shown unconcealed by the different bearings upon it. See Illust. of Fess, where the field is represented as gules (red), while the fess is argent (silver). 6. An unresticted or favorable opportunity for action, operation, or achievement; province; room. Afforded a clear field for moral experiments. Macaulay. 7. A collective term for all the competitors in any outdoor contest or trial, or for all except the favorites in the betting. 8. (Baseball)  That part of the grounds reserved for the players which is outside of the diamond; -- called also outfield. Note: Field is often used adjectively in the sense of belonging to, or used in, the fields; especially with reference to the operations and equipments of an army during a campaign away from permanent camps and fortifications. In most cases such use of the word is sufficiently clear; as, field battery; field fortification; field gun; field hospital, etc. A field geologist, naturalist, etc., is one who makes investigations or collections out of doors. A survey uses a field book for recording field notes, i.e., measurment, observations, etc., made in field work (outdoor operations). A farmer or planter employs field hands, and may use a field roller or a field derrick. Field sports are hunting, fishing, athletic games, etc. Coal field (Geol.) See under Coal. -- Field artillery, light ordnance mounted on wheels, for the use of a marching army. -- Field basil (Bot.), a plant of the Mint family (Calamintha Acinos); -- called also basil thyme. -- Field colors (Mil.), small flags for marking out the positions for squadrons and battalions; camp colors. -- Field cricket (Zoöl.), a large European cricket (Gryllus campestric), remarkable for its loud notes. -- Field day. (a) A day in the fields. (b) (Mil.) A day when troops are taken into the field for instruction in evolutions. Farrow. (c) A day of unusual exertion or display; a gala day. -- Field driver, in New England, an officer charged with the driving of stray cattle to the pound. -- Field duck (Zoöl.), the little bustard (Otis tetrax), found in Southern Europe. -- Field glass. (Optics) (a) A binocular telescope of compact form; a lorgnette; a race glass. (b) A small achromatic telescope, from 20 to 24 inches long, and having 3 to 6 draws. (c) See Field lens. -- Field lark. (Zoöl.) (a) The skylark. (b) The tree pipit. -- Field lens (Optics), that one of the two lenses forming the eyepiece of an astronomical telescope or compound microscope which is nearer the object glass; -- called also field glass. -- Field madder (Bot.), a plant (Sherardia arvensis) used in dyeing. -- Field marshal (Mil.), the highest military rank conferred in the British and other European armies. -- Field mouse (Zoöl.), a mouse inhabiting fields, as the campagnol and the deer mouse. See Campagnol, and Deer mouse. -- Field officer (Mil.), an officer above the rank of captain and below that of general. -- Field officer's court (U.S.Army), a court-martial consisting of one field officer empowered to try all cases, in time of war, subject to jurisdiction of garrison and regimental courts. Farrow. -- Field plover (Zoöl.), the black-bellied plover (Charadrius squatarola); also sometimes applied to the Bartramian sandpiper (Bartramia longicauda). -- Field spaniel (Zoöl.), a small spaniel used in hunting small game. -- Field sparrow. (Zoöl.) (a) A small American sparrow (Spizella pusilla). (b) The hedge sparrow. [Eng.] -- Field staff (Mil.), a staff formerly used by gunners to hold a lighted match for discharging a gun. -- Field vole (Zoöl.), the European meadow mouse. -- Field of ice, a large body of floating ice; a pack. -- Field, or Field of view, in a telescope or microscope, the entire space within which objects are seen. -- Field magnet. see under Magnet. -- Magnetic field. See Magnetic. -- To back the field, or To bet on the field. See under Back, v. t. -- To keep the field. (a) (Mil.) To continue a campaign. (b) To maintain one's ground against all comers. -- To lay, or back, against the field, to bet on (a horse, etc.) against all comers. -- To take the field (Mil.), to enter upon a campaign.\n\n1. To take the field. [Obs.] Spenser. 2. (Ball Playing)  To stand out in the field, ready to catch, stop, or throw the ball.\n\nTo catch, stop, throw, etc. (the ball), as a fielder."}