{"word":"figure","definition":"1. The form of anything; shape; outline; appearance. Flowers have all exquisite figures. Bacon. 2. The representation of any form, as by drawing, painting, modeling, carving, embroidering, etc.; especially, a representation of the human body; as, a figure in bronze; a figure cut in marble. A coin that bears the figure of an angel. Shak. 3. A pattern in cloth, paper, or other manufactured article; a design wrought out in a fabric; as, the muslin was of a pretty figure. 4. (Geom.)  A diagram or drawing; made to represent a magnitude or the relation of two or more magnitudes; a surface or space inclosed on all sides; -- called superficial when inclosed by lines, and solid when inclosed by surface; any arrangement made up of points, lines, angles, surfaces, etc. 5. The appearance or impression made by the conduct or carrer of a person; as, a sorry figure. I made some figure there. Dryden. Gentlemen of the best figure in the county. Blackstone. 6. Distinguished appearance; magnificence; conspicuous representation; splendor; show. That he may live in figure and indulgence. Law. 7. A character or symbol representing a number; a numeral; a digit; as, 1, 2,3, etc. 8. Value, as expressed in numbers; price; as, the goods are estimated or sold at a low figure. [Colloq.] With nineteen thousand a year at the very lowest figure. Thackeray. 9. A person, thing, or action, conceived of as analogous to another person, thing, or action, of which it thus becomes a type or representative. Who is the figure of Him that was to come. Rom. v. 14. 10. (Rhet.)  A mode of expressing abstract or immaterial ideas by words which suggest pictures or images from the physical world; pictorial language; a trope; hence, any deviation from the plainest form of statement. To represent the imagination under the figure of a wing. Macaulay. 11. (Logic)  The form of a syllogism with respect to the relative position of the middle term. 12. (Dancing)  Any one of the several regular steps or movements made by a dancer. 13. (Astrol.)  A horoscope; the diagram of the aspects of the astrological houses. Johnson. 14. (Music) (a) Any short succession of notes, either as melody or as a group of chords, which produce a single complete and distinct impression. Grove. (b) A form of melody or accompaniment kept up through a strain or passage; a musical or motive; a florid embellishment. Note: Figures are often written upon the staff in music to denote the kind of measure. They are usually in the form of a fraction, the upper figure showing how many notes of the kind indicated by the lower are contained in one measure or bar. Thus, 2/4 signifies that the measure contains two quarter notes. The following are the principal figures used for this purpose: --2/22/42/8 4/22/44/8 3/23/43/8 6/46/46/8 Academy figure, Canceled figures, Lay figure, etc. See under Academy, Cancel, Lay, etc. -- Figure caster, or Figure flinger, an astrologer. This figure caster.\" Milton. -- Figure flinging, the practice of astrology. -- Figure-of-eight knot, a knot shaped like the figure 8. See Illust. under Knot. -- Figure painting, a picture of the human figure, or the act or art of depicting the human figure. -- Figure stone (Min.), agalmatolite. -- Figure weaving, the art or process of weaving figured fabrics. -- To cut a figure, to make a display. [Colloq.] Sir W. Scott.\n\n1. To represent by a figure, as to form or mold; to make an image of, either palpable or ideal; also, to fashion into a determinate form; to shape. If love, alas! be pain I bear, No thought can figure, and no tongue declare.Prior. 2. To embellish with design; to adorn with figures. The vaulty top of heaven Figured quite o'er with burning meteors. Shak. 3. To indicate by numerals; also, to compute. As through a crystal glass the figured hours are seen. Dryden. 4. To represent by a metaphor; to signify or symbolize. Whose white vestments figure innocence. Shak. 5. To prefigure; to foreshow. In this the heaven figures some event. Shak. 6. (Mus.) (a) To write over or under the bass, as figures or other characters, in order to indicate the accompanying chords. (b) To embellish. To figure out, to solve; to compute or find the result of. -- To figure up, to add; to reckon; to compute the amount of.\n\n1. To make a figure; to be distinguished or conspicious; as, the envoy figured at court. Sociable, hospitable, eloquent, admired, figuring away brilliantly. M. Arnold. 2. To calculate; to contrive; to scheme; as, he is figuring to secure the nomination. [Colloq.]"}