{"word":"finger","definition":"1. One of the five terminating members of the hand; a digit; esp., one of the four extermities of the hand, other than the thumb. 2. Anything that does work of a finger; as, the pointer of a clock, watch, or other registering machine; especially (Mech.) a small projecting rod, wire, or piece, which is brought into contact with an object to effect, direct, or restrain a motion. 3. The breadth of a finger, or the fourth part of the hand; a measure of nearly an inch; also, the length of finger, a measure in domestic use in the United States, of about four and a half inches or one eighth of a yard. A piece of steel three fingers thick. Bp. Wilkins. 4. Skill in the use of the fingers, as in playing upon a musical instrument. [R.] She has a good finger. Busby. Ear finger, the little finger. -- Finger alphabet. See Dactylology. -- Finger bar, the horizontal bar, carrying slotted spikes, or fingers, through which the vibratory knives of mowing and reaping machines play. -- Finger board (Mus.), the part of a stringed instrument against which the fingers press the strings to vary the tone; the keyboard of a piano, organ, etc.; manual. -- Finger bowl or glass, a bowl or glass to hold water for rinsing the fingers at table. -- Finger flower (Bot.), the foxglove. -- Finger grass (Bot.), a kind of grass (Panicum sanguinale) with slender radiating spikes; common crab grass. See Crab grass, under Crab. -- Finger nut, a fly nut or thumb nut. -- Finger plate, a strip of metal, glass, etc., to protect a painted or polished door from finger marks. -- Finger post, a guide post bearing an index finger. -- Finger reading, reading printed in relief so as to be sensible to the touch; -- so made for the blind. -- Finger shell (Zoöl.), a marine shell (Pholas dactylus) resembling a finger in form. -- Finger sponge (Zoöl.), a sponge having finger-shaped lobes, or branches. -- Finger stall, a cover or shield for a finger. -- Finger steel, a steel instrument for whetting a currier's knife. To burn one's fingers. See under Burn. -- To have a finger in, to be concerned in. [Colloq.] -- To have at one's fingers' ends, to be thoroughly familiar with. [Colloq.]\n\n1. To touch with the fingers; to handle; to meddle with. Let the papers lie; You would be fingering them to anger me. Shak. 2. To touch lightly; to toy with. 3. (Mus.) (a) To perform on an instrument of music. (b) To mark the notes of (a piece of music) so as to guide the fingers in playing. 4. To take thievishly; to pilfer; to purloin. Shak. 5. To execute, as any delicate work.\n\nTo use the fingers in playing on an instrument. Busby."}