{"word":"fire","definition":"1. The evolution of light and heat in the combustion of bodies; combustion; state of ignition. Note: The form of fire exhibited in the combustion of gases in an ascending stream or current is called flame. Anciently, fire, air, earth, and water were regarded as the four elements of which all things are composed. 2. Fuel in a state of combustion, as on a hearth, or in 3. The burning of a house or town; a conflagration. 4. Anything which destroys or affects like fire. 5. Ardor of passion, whether love or hate; excessive warmth; consumingviolence of temper. he had fire in his temper.Atterbury. 6. Liveliness of imagination or fancy; intellectual and moral enthusiasm; capacity for ardor and zeal. And bless their critic with a poet's fire.Pope. 7. Splendor; brilliancy; luster; hence, a star. Stars, hide your fires.Shak. As in a zodiac representing the heavenly fires.Milton. 8. Torture by burning; severe trial or affliction. 9. The discharge of firearms; firing; as, the troops were exposed to a heavy fire. Blue fire, Red fire, Green fire (Pyrotech.), compositions of various combustible substances, as sulphur, niter, lampblack, etc., the flames of which are colored by various metallic salts, as those of antimony, strontium, barium, etc. -- Fire alarm (a) A signal given on the breaking out of a fire. (b) An apparatus for giving such an alarm. -- Fire annihilator, a machine, device, or preparation to be kept at hand for extinguishing fire by smothering it with some incombustible vapor or gas, as carbonic acid. -- Fire balloon. (a) A balloon raised in the air by the buoyancy of air heated by a fire placed in the lower part. (b) A balloon sent up at night with fireworks which ignite at a regulated height. Simmonds. -- Fire bar, a grate bar. -- Fire basket, a portable grate; a cresset. Knight. -- Fire beetle. (Zoöl.) See in the Vocabulary. -- Fire blast, a disease of plants which causes them to appear as if burnt by fire. -- Fire box, the chamber of a furnace, steam boiler, etc., for the fire. -- Fire brick, a refractory brick, capable of sustaining intense heat without fusion, usually made of fire clay or of siliceous material, with some cementing substance, and used for lining fire boxes, etc. -- Fire brigade, an organized body of men for extinguished fires. -- Fire bucket. See under Bucket. -- Fire bug, an incendiary; one who, from malice or through mania, persistently sets fire to property; a pyromaniac. [U.S.] -- Fire clay. See under Clay. -- Fire company, a company of men managing an engine in extinguishing fires. -- Fire cross. See Fiery cross. [Obs.] Milton. -- Fire damp. See under Damp. -- Fire dog. See Firedog, in the Vocabulary. -- Fire drill. (a) A series of evolutions performed by fireman for practice. (b) An apparatus for producing fire by friction, by rapidly twirling a wooden pin in a wooden socket; -- used by the Hindoos during all historic time, and by many savage peoples. -- Fire eater. (a) A juggler who pretends to eat fire. (b) A quarrelsome person who seeks affrays; a hotspur. [Colloq.] -- Fire engine, a portable forcing pump, usually on wheels, for throwing water to extinguish fire. -- Fire escape, a contrivance for facilitating escape from burning buildings. -- Fire gilding (Fine Arts), a mode of gilding with an amalgam of gold and quicksilver, the latter metal being driven off afterward by heat. -- Fire gilt (Fine Arts), gold laid on by the process of fire gilding. -- Fire insurance, the act or system of insuring against fire; also, a contract by which an insurance company undertakes, in consideration of the payment of a premium or small percentage -- usually made periodically -- to indemnify an owner of property from loss by fire during a specified period. -- Fire irons, utensils for a fireplace or grate, as tongs, poker, and shovel. -- Fire main, a pipe for water, to be used in putting out fire. -- Fire master (Mil), an artillery officer who formerly supervised the composition of fireworks. -- Fire office, an office at which to effect insurance against fire. -- Fire opal, a variety of opal giving firelike reflections. -- Fire ordeal, an ancient mode of trial, in which the test was the ability of the accused to handle or tread upon red-hot irons. Abbot. -- Fire pan, a pan for holding or conveying fire, especially the receptacle for the priming of a gun. -- Fire plug, a plug or hydrant for drawing water from the main pipes in a street, building, etc., for extinguishing fires. -- Fire policy, the writing or instrument expressing the contract of insurance against loss by fire. -- Fire pot. (a) (Mil.) A small earthen pot filled with combustibles, formerly used as a missile in war. (b) The cast iron vessel which holds the fuel or fire in a furnace. (c) A crucible. (d) A solderer's furnace. -- Fire raft, a raft laden with combustibles, used for setting fire to an enemy's ships. -- Fire roll, a peculiar beat of the drum to summon men to their quarters in case of fire. -- Fire setting (Mining), the process of softening or cracking the working face of a lode, to facilitate excavation, by exposing it to the action of fire; -- now generally superseded by the use of explosives. Raymond. -- Fire ship, a vessel filled with combustibles, for setting fire to an enemy's ships. -- Fire shovel, a shovel for taking up coals of fire. -- Fire stink, the stench from decomposing iron pyrites, caused by the formation of sulphureted hydrogen. Raymond. -- Fire surface, the surfaces of a steam boiler which are exposed to the direct heat of the fuel and the products of combustion; heating surface. -- Fire swab, a swab saturated with water, for cooling a gun in action and clearing away particles of powder, etc. Farrow. -- Fire teaser, in England, the fireman of a steam emgine. -- Fire water, ardent spirits; -- so called by the American Indians. -- Fire worship, the worship of fire, which prevails chiefly in Persia, among the followers of Zoroaster, called Chebers, or Guebers, and among the Parsees of India. -- Greek fire. See under Greek. -- On fire, burning; hence, ardent; passionate; eager; zealous. -- Running fire, the rapid discharge of firearms in succession by a line of troops. -- St. Anthony's fire, erysipelas; -- an eruptive fever which St. Anthony was supposed to cure miraculously. Hoblyn. -- St. Elmo's fire. See under Saint Elmo. -- To set on fire, to inflame; to kindle. -- To take fire, to begin to burn; to fly into a passion.\n\n1. To set on fire; to kindle; as, to fire a house or chimney; to fire a pile. 2. To subject to intense heat; to bake; to burn in a kiln; as, to fire pottery. 3. To inflame; to irritate, as the passions; as, to fire the soul with anger, pride, or revenge. Love had fired my mind. Dryden. 4. To animate; to give life or spirit to; as, to fire the genius of a young man. 5. To feed or serve the fire of; as, to fire a boiler. 6. To light up as if by fire; to illuminate. [The sun] fires the proud tops of the eastern pines. Shak. 7. To cause to explode; as, to fire a torpedo; to disharge; as, to fire a musket or cannon; to fire cannon balls, rockets, etc. 8. To drive by fire. [Obs.] Till my bad angel fire my good one out. Shak. 9. (Far.)  To cauterize. To fire up, to light up the fires of, as of an engine.\n\n1. To take fire; to be kindled; to kindle. 2. To be irritated or inflamed with passion. 3. To discharge artillery or firearms; as, they fired on the town. To fire up, to grow irritated or angry. \"He . . . fired up, and stood vigorously on his defense.\" Macaulay."}