{"word":"first","definition":"1. Preceding all others of a series or kind; the ordinal of one; earliest; as, the first day of a month; the first year of a reign. 2. Foremost; in front of, or in advance of, all others. 3. Most eminent or exalted; most excellent; chief; highest; as, Demosthenes was the first orator of Greece. At first blush. See under Blush. -- At first hand, from the first or original source; without the intervention of any agent. It is the intention of the person to reveal it at first hand, by way of mouth, to yourself. Dickens. -- First coat (Plastering), the solid foundation of coarse stuff, on which the rest is placed; it is thick, and crossed with lines, so as to give a bond for the next coat. -- First day, Sunday; -- so called by the Friends. -- First floor. (a) The ground floor. [U.S.] (b) The floor next above the ground floor. [Eng.] -- First fruit or fruits. (a) The fruits of the season earliest gathered. (b) (Feudal Law) One year's profits of lands belonging to the king on the death of a tenant who held directly from him. (c) (Eng. Eccl. Law) The first year's whole profits of a benefice or spiritual living. (d) The earliest effects or results. See, Father, what first fruits on earth are sprung From thy implanted grace in man! Milton. -- First mate, an officer in a merchant vessel next in rank to the captain. -- First name, same as Christian name. See under Name, n. -- First officer (Naut.), in the merchant service, same as First mate (above). -- First sergeant (Mil.), the ranking non-commissioned officer in a company; the orderly sergeant. Farrow. -- First watch (Naut.), the watch from eight to twelve at midnight; also, the men on duty during that time. -- First water, the highest quality or purest luster; -- said of gems, especially of diamond and pearls. Syn. -- Primary; primordial; primitive; primeval; pristine; highest; chief; principal; foremost.\n\nBefore any other person or thing in time, space, rank, etc.; -- much used in composition with adjectives and participles. Adam was first formed, then Eve. 1 Tim. ii. 13. At first, At the first, at the beginning or origin. -- First or last, at one time or another; at the beginning or end. And all are fools and lovers first or last. Dryden.\n\nThe upper part of a duet, trio, etc., either vocal or instrumental; -- so called because it generally expresses the air, and has a preëminence in the combined effect."}