{"word":"fit","definition":"imp. & p. p. of Fight. [Obs. or Colloq.]\n\nIn Old English, a song; a strain; a canto or portion of a ballad; a passus. [Written also fitte, fytte, etc.] To play some pleasant fit. Spenser.\n\n1. Adapted to an end, object, or design; suitable by nature or by art; suited by character, qualitties, circumstances, education, etc.; qualified; competent; worthy. That which ordinary men are fit for, I am qualified in. Shak. Fit audience find, though few. Milton. 2. Prepared; ready. [Obs.] So fit to shoot, she singled forth among her foes who first her quarry's strength should feel. Fairfax. 3. Conformed to a standart of duty, properiety, or taste; convenient; meet; becoming; proper. Is it fit to say a king, Thou art wicked Job xxxiv. 18. Syn. -- Suitable; proper; appropriate; meet; becoming; expedient; congruous; correspondent; apposite; apt; adapted; prepared; qualified; competent; adequate.\n\n1. To make fit or suitable; to adapt to the purpose intended; to qualify; to put into a condition of readiness or preparation. The time is fitted for the duty. Burke. The very situation for which he was peculiarly fitted by nature. Macaulay. 2. To bring to a required form and size; to shape aright; to adapt to a model; to adjust; -- said especially of the work of a carpenter, machinist, tailor, etc. The carpenter . . . marketh it out with a line; he fitteth it with planes. Is. xliv. 13. 3. To supply with something that is suitable or fit, or that is shaped and adjusted to the use required. No milliner can so fit his customers with gloves. Shak. 4. To be suitable to; to answer the requirements of; to be correctly shaped and adjusted to; as, if the coat fits you, put it on. That's a bountiful answer that fits all questions. Shak. That time best fits the work. Shak. To fit out, to supply with necessaries or means; to furnish; to equip; as, to fit out a privateer. -- To fit up, to firnish with things suitable; to make proper for the reception or use of any person; to prepare; as, to fit up a room for a guest.\n\n1. To be proper or becoming. Nor fits it to prolong the feast. Pope. 2. To be adjusted to a particular shape or size; to suit; to be adapted; as, his coat fits very well.\n\n1. The quality of being fit; adjustment; adaptedness; as of dress to the person of the wearer. 2. (Mach.) (a) The coincidence of parts that come in contact. (b) The part of an object upon which anything fits tightly. Fit rod (Shipbuilding), a gauge rod used to try the depth of a bolt hole in order to determine the length of the bolt required. Knight.\n\n1. A stroke or blow. [Obs. or R.] Curse on that cross, quoth then the Sarazin, That keeps thy body from the bitter fit. Spenser. 2. A sudden and violent attack of a disorder; a stroke of disease, as of epilepsy or apoplexy, which produces convulsions or unconsciousness; a convulsion; a paroxysm; hence, a period of exacerbation of a disease; in general, an attack of disease; as, a fit of sickness. And when the fit was on him, I did mark How he did shake. Shak. 3. A mood of any kind which masters or possesses one for a time; a temporary, absorbing affection; a paroxysm; as, a fit melancholy, of passion, or of laughter. All fits of pleasure we balanced by an equal degree of pain. Swift. The English, however, were on this subject prone to fits of jealously. Macaulay. 4. A passing humor; a caprice; a sudden and unusual effort, activity, or motion, followed by relaxation or insction; an impulse and irregular action. The fits of the season. Shak. 5. A darting point; a sudden emission. [R.] A tongue of light, a fit of flame. Coleridge. By fits, By fits and starts, by intervals of action and re"}