{"word":"flank","definition":"1. The fleshy or muscular part of the side of an animal, between the rids and the hip. See Illust. of Beef. 2. (Mil.) (a) The side of an army, or of any division of an army, as of a brigade, regiment, or battalion; the extreme right or left; as, to attack an enemy in flank is to attack him on the side. When to right and left the front Divided, and to either flank retired. Milton. (b) (Fort.)  That part of a bastion which reaches from the curtain to the face, and defends the curtain, the flank and face of the opposite bastion; any part of a work defending another by a fire along the outside of its parapet. See Illust. of Bastion. 3. (Arch.)  The side of any building. Brands. 4. That part of the acting surface of a gear wheel tooth that lies within the pitch line. Flank attack (Mil.), an attack upon the side of an army or body of troops, distinguished from one upon its front or rear. -- Flank company (Mil.), a certain number of troops drawn up on the right or left of a battalion; usually grenadiers, light infantry, or riflemen. -- Flank defense (Fort.), protection of a work against undue exposure to an enemy's direct fire, by means of the fire from other works, sweeping the ground in its front. -- Flank en potence (Mil.), any part of the right or left wing formed at a projecting angle with the line. -- Flank files, the first men on the right, and the last on the left, of a company, battalion, etc. -- Flank march, a march made parallel or obliquely to an enemy's position, in order to turn it or to attack him on the flank. -- Flank movement, a change of march by an army, or portion of one, in order to turn one or both wings of the enemy, or to take up a new position. -- Flanks of a frontier, salient points in a national boundary, strengthened to protect the frontier against hostile incursion. -- Flank patrol, detachments acting independently of the column of an army, but patrolling along its flanks, to secure it against surprise and to observe the movements of the enemy.\n\n1. To stand at the flank or side of; to border upon. Stately colonnades are flanked with trees. Pitt. 2. To overlook or command the flank of; to secure or guard the flank of; to pass around or turn the flank of; to attack, or threaten to attack; the flank of.\n\n1. To border; to touch. Bp. Butler. 2. To be posted on the side."}