{"word":"flash","definition":"1. To burst or break forth with a sudden and transient flood of flame and light; as, the lighting flashes vividly; the powder flashed. 2. To break forth, as a sudden flood of light; to burst instantly and brightly on the sight; to show a momentary brilliancy; to come or pass like a flash. Names which have flashed and thundered as the watch words of unumbered struggles. Talfourd. The object is made to flash upon the eye of the mind. M. Arnold. A thought floashed through me, which I clothed in act. Tennyson. 3. To burst forth like a sudden flame; to break out violently; to rush hastily. Every hour He flashes into one gross crime or other. Shak. To flash in the pan, to fail of success. [Colloq.] See under Flash, a burst of light. Bartlett. Syn. -- Flash, Glitter, Gleam, Glisten, Glister. Flash differs from glitter and gleam, denoting a flood or wide extent of light. The latter words may express the issuing of light from a small object, or from a pencil of rays. Flash differs from other words, also, in denoting suddenness of appearance and disappearance. Flashing differs from exploding or disploding in not being accompanied with a loud report. To glisten, or glister, is to shine with a soft and fitful luster, as eyes suffused with tears, or flowers wet with dew.\n\n1. To send out in flashes; to cause to burst forth with sudden flame or light. The chariot of paternal Deity, Flashing thick flames. Milton. 2. To convey as by a flash; to light up, as by a sudden flame or light; as, to flash a message along the wires; to flash conviction on the mind. 3. (Glass Making)  To cover with a thin layer, as objects of glass with glass of a different color. See Flashing, n., 3 (b). 4. To trick up in a showy manner. Limning and flashing it with various dyes. A. Brewer. 5. Etym: [Perh. due to confusion between flash of light and plash, splash.]  To strike and throw up large bodies of water from the surface; to splash. [Obs.] He rudely flashed the waves about. Spenser. Flashed glass. See Flashing, n., 3.\n\n1. A sudden burst of light; a flood of light instantaneously appearing and disappearing; a momentary blaze; as, a flash of lightning. 2. A sudden and brilliant burst, as of wit or genius; a momentary brightness or show. The flash and outbreak of a fiery mind. Shak. No striking sentiment, no flash of fancy. Wirt. 3. The time during which a flash is visible; an instant; a very brief period. The Persians and Macedonians had it for a flash. Bacon. 4. A preparation of capsicum, burnt sugar, etc., for coloring and giving a fictious strength to liquors. Flash light, or Flashing light, a kind of light shown by lighthouses, produced by the revolution of reflectors, so as to show a flash of light every few seconds, alternating with periods of dimness. Knight. -- Flash in the pan, the flashing of the priming in the pan of a flintlock musket without discharging the piece; hence, sudden, spasmodic effort that accomplishes nothing.\n\n1. Showy, but counterfeit; cheap, pretentious, and vulgar; as, flash jewelry; flash finery. 2. Wearing showy, counterfeit ornaments; vulgarly pretentious; as, flash people; flash men or women; -- applied especially to thieves, gamblers, and prostitutes that dress in a showy way and wear much cheap jewelry. Flash house, a house frequented by flash people, as thieves and whores; hence, a brothel. \"A gang of footpads, reveling with their favorite beauties at a flash house.\" Macaulay.\n\nSlang or cant of thieves and prostitutes.\n\n1. A pool. [Prov. Eng.] Haliwell. 2. (Engineering)  A reservoir and sluiceway beside a navigable stream, just above a shoal, so that the stream may pour in water as boats pass, and thus bear them over the shoal. Flash wheel (Mech.), a paddle wheel made to revolve in a breast or curved water way, by which water is lifted from the lower to the higher level."}