{"word":"flat","definition":"1. Having an even and horizontal surface, or nearly so, without prominences or depressions; level without inclination; plane. Though sun and moon Were in the flat sea sunk. Milton. 2. Lying at full length, or spread out, upon the ground; level with the ground or earth; prostrate; as, to lie flat on the ground; hence, fallen; laid low; ruined; destroyed. What ruins kingdoms, and lays cities flat! Milton. I feel . . . my hopes all flat. Milton. 3. (Fine Arts)  Wanting relief; destitute of variety; without points of prominence and striking interest. A large part of the work is, to me, very flat. Coleridge. 4. Tasteless; stale; vapid; insipid; dead; as, fruit or drink flat to the taste. 5. Unanimated; dull; uninteresting; without point or spirit; monotonous; as, a flat speech or composition. How weary, stale, flat, and unprofitable Seem to me all the uses of this world. Shak. 6. Lacking liveliness of commercial exchange and dealings; depressed; dull; as, the market is flat. 7. Clear; unmistakable; peremptory; absolute; positive; downright. Flat burglary as ever was committed. Shak. A great tobacco taker too, -- that's flat. Marston. 8. (Mus.) (a) Below the true pitch; hence, as applied to intervals, minor, or lower by a half step; as, a flat seventh; A flat. (b) Not sharp or shrill; not acute; as, a flat sound. 9. (Phonetics)  Sonant; vocal; -- applied to any one of the sonant or vocal consonants, as distinguished from a nonsonant (or sharp) consonant. Flat arch. (Arch.) See under Arch, n., 2. (b). -- Flat cap, cap paper, not folded. See under Paper. -- Flat chasing, in fine art metal working, a mode of ornamenting silverware, etc., producing figures by dots and lines made with a punching tool. Knight. -- Flat chisel, a sculptor's chisel for smoothing. -- Flat file, a file wider than its thickness, and of rectangular section. See File. -- Flat nail, a small, sharp-pointed, wrought nail, with a flat, thin head, larger than a tack. Knight. -- Flat paper, paper which has not been folded. -- Flat rail, a railroad rail consisting of a simple flat bar spiked to a longitudinal sleeper. -- Flat rods (Mining), horizontal or inclined connecting rods, for transmitting motion to pump rods at a distance. Raymond. -- Flat rope, a rope made by plaiting instead of twisting; gasket; sennit. Note: Some flat hoisting ropes, as for mining shafts, are made by sewing together a number of ropes, making a wide, flat band. Knight. -- Flat space. (Geom.) See Euclidian space. -- Flat stitch, the process of wood engraving. [Obs.] -- Flat tint (Painting), a coat of water color of one uniform shade. -- To fall flat (Fig.), to produce no effect; to fail in the intended effect; as, his speech fell flat. Of all who fell by saber or by shot, Not one fell half so flat as Walter Scott. Lord Erskine.\n\n1. In a flat manner; directly; flatly. Sin is flat opposite to the Almighty. Herbert. 2. (Stock Exchange)  Without allowance for accrued interest. [Broker's Cant]\n\n1. A level surface, without elevation, relief, or prominences; an extended plain; specifically, in the United States, a level tract along the along the banks of a river; as, the Mohawk Flats. Envy is as the sunbeams that beat hotter upon a bank, or steep rising ground, than upon a flat. Bacon. 2. A level tract lying at little depth below the surface of water, or alternately covered and left bare by the tide; a shoal; a shallow; a strand. Half my power, this night Passing these flats, are taken by the tide. Shak. 3. Something broad and flat in form; as: (a) A flat-bottomed boat, without keel, and of small draught. (b) A straw hat, broad-brimmed and low-crowned. (c) (Railroad Mach.) A car without a roof, the body of which is a platform without sides; a platform car. (d) A platform on wheel, upon which emblematic designs, etc., are carried in processions. 4. The flat part, or side, of anything; as, the broad side of a blade, as distinguished from its edge. 5. (Arch.)  A floor, loft, or story in a building; especially, a floor of a house, which forms a complete residence in itself. 6. (Mining)  A horizontal vein or ore deposit auxiliary to a main vein; also, any horizontal portion of a vein not elsewhere horizontal. Raymond. 7. A dull fellow; a simpleton; a numskull. [Colloq.] Or if you can not make a speech, Because you are a flat. Holmes. 8. (Mus.)  A character [] before a note, indicating a tone which is a half step or semitone lower. 9. (Geom.)  A homaloid space or extension.\n\n1. To make flat; to flatten; to level. 2. To render dull, insipid, or spiritless; to depress. Passions are allayed, appetites are flatted. Barrow. 3. To depress in tone, as a musical note; especially, to lower in pitch by half a tone.\n\n1. To become flat, or flattened; to sink or fal to an even surface. Sir W. Temple. 2. (Mus.)  To fall form the pitch. To flat out, to fail from a promising beginning; to make a bad ending; to disappoint expectations. [Colloq.]"}