{"word":"flourish","definition":"1. To grow luxuriantly; to increase and enlarge, as a healthy growing plant; a thrive. A tree thrives and flourishes in a kindly . . . soil. Bp. Horne. 2. To be prosperous; to increase in wealth, honor, comfort, happiness, or whatever is desirable; to thrive; to be prominent and influental; specifically, of authors, painters, etc., to be in a state of activity or production. When all the workers of iniquity do flourish. Ps. xcii 7 Bad men as frequently prosper and flourish, and that by the means of their wickedness. Nelson. We say Of those that held their heads above the crowd, They flourished then or then. Tennyson. 3. To use florid language; to indulge in rhetorical figures and lofty expressions; to be flowery. They dilate . . . and flourish long on little incidents. J. Watts. 4. To make bold and sweeping, fanciful, or wanton movements, by way of ornament, parade, bravado, etc.; to play with fantastic and irregular motion. Impetuous spread The stream, and smoking flourished o'er his head. Pope. 5. To make ornamental strokes with the pen; to write graceful, decorative figures. 6. To execute an irregular or fanciful strain of music, by way of ornament or prelude. Why do the emperor's trumpets flourish thus Shak. 7. To boast; to vaunt; to brag. Pope.\n\n1. To adorn with flowers orbeautiful figures, either natural or artificial; to ornament with anything showy; to embellish. [Obs.] Fenton. 2. To embellish with the flowers of diction; to adorn with rhetorical figures; to grace with ostentatious eloquence; to set off with a parade of words. [Obs.] Sith that the justice of your title to him Doth flourish the deceit. Shak. 3. To move in bold or irregular figures; to swing about in circles or vibrations by way of show or triumph; to brandish. And flourishes his blade in spite of me. Shak. 4. To develop; to make thrive; to expand. [Obs.] Bottoms of thread . . . which with a good needle, perhaps flourished into large works. Bacon.\n\n1. A flourishing condition; prosperity; vigor. [Archaic] The Roman monarchy, in her highest flourish, never had the like. Howell. 2. Decoration; ornament; beauty. The flourish of his sober youth Was the pride of naked truth. Crashaw. 3. Something made or performed in a fanciful, wanton, or vaunting manner, by way of ostentation, to excite admiration, etc.; ostentatious embellishment; ambitious copiousness or amplification; parade of wordas, a flourish of rhetoric or of wit. He lards with flourishes his long harangue. Dryden. 4. A fanciful stroke of the pen or graver; a merely decorative figure. The neat characters and flourishes of a Bible curiously printed. Boyle. 5. A fantastic or decorative musical passage; a strain of triumph or bravado, not forming part of a regular musical composition; a cal; a fanfare. A flourish, trumpets! strike alarum, drums! Shak. 6. The waving of a weapon or other thing; a brandishing; as, the fluorish of a sword."}