{"word":"fly","definition":"1. To move in or pass thorugh the air with wings, as a bird. 2. To move through the air or before the wind; esp., to pass or be driven rapidly through the air by any impulse. 3. To float, wave, or rise in the air, as sparks or a flag. Man is born unto trouble, as the sparks fly upward. Job v. 7. 4. To move or pass swiftly; to hasten away; to circulate rapidly; as, a ship flies on the deep; a top flies around; rumor flies. Fly, envious Time, till thou run out thy race. Milton. The dark waves murmured as the ships flew on. Bryant. 5. To run from danger; to attempt to escape; to flee; as, an enemy or a coward flies. See Note under Flee. Fly, ere evil intercept thy flight. Milton. Whither shall I fly to escape their hands Shak. 6. To move suddenly, or with violence; to do an act suddenly or swiftly; -- usually with a qualifying word; as, a door flies open; a bomb flies apart. To fly about (Naut.), to change frequently in a short time; -- said of the wind. -- To fly around, to move about in haste. [Colloq.] -- To fly at, to spring toward; to rush on; to attack suddenly. -- To fly in the face of, to insult; to assail; to set at defiance; to oppose with violence; to act in direct opposition to; to resist. -- To fly off, to separate, or become detached suddenly; to revolt. -- To fly on, to attack. -- To fly open, to open suddenly, or with violence. -- To fly out. (a) To rush out. (b) To burst into a passion; to break out into license. -- To let fly. (a) To throw or drive with violence; to discharge. \"A man lets fly his arrow without taking any aim.\" Addison. (b) (Naut.) To let go suddenly and entirely; as, to let fly the sheets.\n\n1. To cause to fly or to float in the air, as a bird, a kite, a flag, etc. The brave black flag I fly. W. S. Gilbert. 2. To fly or flee from; to shun; to avoid. Sleep flies the wretch. Dryden. To fly the favors of so good a king. Shak. 3. To hunt with a hawk. [Obs.] Bacon. To fly a kite (Com.), to raise money on commercial notes. [Cant or Slang]\n\n1. (Zoöl.) (a) Any winged insect; esp., one with transparent wings; as, the Spanish fly; firefly; gall fly; dragon fly. (b) Any dipterous insect; as, the house fly; flesh fly; black fly. See Diptera, and Illust. in Append. 2. A hook dressed in imitation of a fly, -- used for fishing. \"The fur-wrought fly.\" Gay. 3. A familiar spirit; a witch's attendant. [Obs.] A trifling fly, none of your great familiars. B. Jonson. 4. A parasite. [Obs.] Massinger. 5. A kind of light carriage for rapid transit, plying for hire and usually drawn by one horse. [Eng.] 6. The length of an extended flag from its staff; sometimes, the length from the \"union\" to the extreme end. 7. The part of a vane pointing the direction from which the wind blows. 8. (Naut.)  That part of a compass on which the points are marked; the compass card. Totten. 9. (Mech.) (a) Two or more vanes set on a revolving axis, to act as a fanner, or to equalize or impede the motion of machinery by the resistance of the air, as in the striking part of a clock. (b) A heavy wheel, or cross arms with weights at the ends on a revolving axis, to regulate or equalize the motion of machinery by means of its inertia, where the power communicated, or the resistance to be overcome, is variable, as in the steam engine or the coining press. See Fly wheel (below). 10. (Knitting Machine)  The piece hinged to the needle, which holds the engaged loop in position while the needle is penetrating another loop; a latch. Knight. 11. The pair of arms revolving around the bobbin, in a spinning wheel or spinning frame, to twist the yarn. 12. (Weaving)  A shuttle driven through the shed by a blow or jerk. Knight. 13. (a) Formerly, the person who took the printed sheets from the press. (b) A vibrating frame with fingers, attached to a power to a power printing press for doing the same work. 14. The outer canvas of a tent with double top, usually drawn over the ridgepole, but so extended as to touch the roof of the tent at no other place. 15. One of the upper screens of a stage in a theater. 16. The fore flap of a bootee; also, a lap on trousers, overcoats, etc., to conceal a row of buttons. 17. (Baseball)  A batted ball that flies to a considerable distance, usually high in the air; also, the flight of a ball so struck; as, it was caught on the fly. Black fly, Cheese fly, Dragon fly, etc. See under Black, Cheese, etc. -- Fly agaric (Bot.), a mushroom (Agaricus muscarius), having a narcotic juice which, in sufficient quantities, is poisonous. -- Fly block (Naut.), a pulley whose position shifts to suit the working of the tackle with which it is connected; -- used in the hoisting tackle of yards. -- Fly board (Printing Press), the board on which printed sheets are deposited by the fly. -- Fly book, a case in the form of a book for anglers' flies. Kingsley. -- Fly cap, a cap with wings, formerly worn by women. -- Fly drill, a drill having a reciprocating motion controlled by a fly wheel, the driving power being applied by the hand through a cord winding in reverse directions upon the spindle as it rotates backward and forward. Knight. -- Fly fishing, the act or art of angling with a bait of natural or artificial flies. Walton. -- Fly flap, an implement for killing flies. -- Fly governor, a governor for regulating the speed of an engine, etc., by the resistance of vanes revolving in the air. -- Fly honeysuckle (Bot.), a plant of the honeysuckle genus (Lonicera), having a bushy stem and the flowers in pairs, as L. ciliata and L. Xylosteum. -- Fly hook, a fishhook supplied with an artificial fly. -- Fly leaf, an unprinted leaf at the beginning or end of a book, circular, programme, etc. -- Fly maggot, a maggot bred from the egg of a fly. Ray. -- Fly net, a screen to exclude insects. -- Fly nut (Mach.), a nut with wings; a thumb nut; a finger nut. -- Fly orchis (Bot.), a plant (Ophrys muscifera), whose flowers resemble flies. -- Fly paper, poisoned or sticky paper for killing flies that feed upon or are entangled by it. -- Fly powder, an arsenical powder used to poison flies. -- Fly press, a screw press for punching, embossing, etc., operated by hand and having a heavy fly. -- Fly rail, a bracket which turns out to support the hinged leaf of a table. -- Fly rod, a light fishing rod used in angling with a fly. -- Fly sheet, a small loose advertising sheet; a handbill. -- Fly snapper (Zoöl.), an American bird (Phainopepla nitens), allied to the chatterers and shrikes. The male is glossy blue-black; the female brownish gray. -- Fly wheel (Mach.), a heavy wheel attached to machinery to equalize the movement (opposing any sudden acceleration by its inertia and any retardation by its momentum), and to accumulate or give out energy for a variable or intermitting resistance. See Fly, n., 9. -- On the fly (Baseball), still in the air; -- said of a batted ball caught before touching the ground..\n\nKnowing; wide awake; fully understanding another's meaning. [Slang] Dickens."}