{"word":"focus","definition":"1. (Opt.)  A point in which the rays of light meet, after being reflected or refrcted, and at which the image is formed; as, the focus of a lens or mirror. 2. (Geom.)  A point so related to a conic section and certain straight line called the directrix that the ratio of the distace between any point of the curve and the focus to the distance of the same point from the directrix is constant. Note: Thus, in the ellipse FGHKLM, A is the focus and CD the directrix, when the ratios FA:FE, GA:GD, MA:MC, etc., are all equal. So in the hyperbola, A is the focus and CD the directrix when the ratio HA:HK is constant for all points of the curve; and in the parabola, A is the focus and CD the directrix when the ratio BA:BC is constant. In the ellipse this ratio is less than unity, in the parabola equal to unity, and in the hyperbola greater than unity. The ellipse and hyperbola have each two foci, and two corresponding directrixes, and the parabola has one focus and one directrix. In the ellipse the sum of the two lines from any point of the curve to the two foci is constant; that is: AG+GB=AH+HB; and in the hyperbola the difference of the corresponding lines is constant. The diameter which passes through the foci of the ellipse is the major axis. The diameter which being produced passes through the foci of the hyperbola is the transverse axis. The middle point of the major or the transverse axis is the center of the curve. Certain other curves, as the lemniscate and the Cartesian ovals, have points called foci, possessing properties similar to those of the foci of conic sections. In an ellipse, rays of light coming from one focus, and reflected from the curve, proceed in lines directed toward the other; in an hyperbola, in lines directed from the other; in a parabola, rays from the focus, after reflection at the curve, proceed in lines parallel to the axis. Thus rays from A in the ellipse are reflected to B; rays from A in the hyperbola are reflected toward L and M away from B. 3. A central point; a point of concentration. Aplanatic focus. (Opt.) See under Aplanatic. -- Conjugate focus (Opt.), the focus for rays which have a sensible divergence, as from a near object; -- so called because the positions of the object and its image are interchangeable. -- Focus tube (Phys.), a vacuum tube for Roentgen rays in which the cathode rays are focused upon the anticathode, for intensifying the effect. -- Principal, or Solar, focus (Opt.), the focus for parallel rays.\n\nTo bring to a focus; to focalize; as, to focus a camera. R. Hunt."}