{"word":"foil","definition":"1. To tread under foot; to trample. King Richard . . . caused the ensigns of Leopold to be pulled down and foiled under foot. Knoless. Whom he did all to pieces breake and foyle, In filthy durt, and left so in the loathely soyle. Spenser. 2. To render (an effort or attempt) vain or nugatory; to baffle; to outwit; to balk; to frustrate; to defeat. And by foiled. Dryden. Her long locks that foil the painter's power. Byron. 3. To blunt; to dull; to spoil; as, to foil the scent in chase. Addison.\n\nTo defile; to soil. [Obs.]\n\n1. Failure of success when on the point of attainment; defeat; frustration; miscarriage. Milton. Nor e'er was fate so near a foil. Dryden. 2. A blunt weapon used in fencing, resembling a smallsword in the main, but usually lighter and having a button at the point. Blunt as the fencer's foils, which hit, but hurt not. Shak. socrates contended with a foil against Demosthenes with a word. Mitford. 3. The track or trail of an animal. To run a foil,to lead astray; to puzzle; -- alluding to the habits of some animals of running back over the same track to mislead their pursuers. Brewer.\n\n1. A leaf or very thin sheet of metal; as, brass foil; tin foil; gold foil. 2. (Jewelry)  A thin leaf of sheet copper silvered and burnished, and afterwards coated with transparent colors mixed with isinglass; -- employed by jewelers to give color or brilliancy to pastes and inferior stones. Ure. 3. Anything that serves by contrast of color or quality to adorn or set off another thing to advantage. As she a black silk cap on him began To set, for foil of his milk- white to serve. Sir P. Sidney. Hector has a foil to set him off. Broome. 4. A thin coat of tin, with quicksilver, laid on the back of a looking-glass, to cause reflection. 5. (Arch.)  The space between the cusps in Gothic architecture; a rounded or leaflike ornament, in windows, niches, etc. A group of foils is called trefoil, quatrefoil, quinquefoil, etc., according to the number of arcs of which it is composed. Foil stone, an imitation of a jewel or precious stone."}