{"word":"follow","definition":"1. To go or come after; to move behind in the same path or direction; hence, to go with (a leader, guide, etc.); to accompany; to attend. It waves me forth again; I'll follow it. Shak. 2. To endeavor to overtake; to go in pursuit of; to chase; to pursue; to prosecute. I will harden the hearts of the Egyptians, and they shall follow them. Ex. xiv. 17. 3. To accept as authority; to adopt the opinions of; to obey; to yield to; to take as a rule of action; as, to follow good advice. Approve the best, and follow what I approve. Milton. Follow peace with all men. Heb. xii. 14. It is most agreeable to some men to follow their reason; and to others to follow their appetites. J. Edwards. 4. To copy after; to take as an example. We had rather follow the perfections of them whom we like not, than in defects resemble them whom we love. Hooker. 5. To succeed in order of time, rank, or office. 6. To result from, as an effect from a cause, or an inference from a premise. 7. To watch, as a receding object; to keep the eyes fixed upon while in motion; to keep the mind upon while in progress, as a speech, musical performance, etc.; also, to keep up with; to understand the meaning, connection, or force of, as of a course of thought or argument. He followed with his eyes the flitting shade. Dryden. 8. To walk in, as a road or course; to attend upon closely, as a profession or calling. O, had I but followed the arts! Shak. O Antony! I have followed thee to this. Shak. Follow board (Founding), a board on which the pattern and the flask lie while the sand is rammed into the flask. Knight. -- To follow the hounds, to hunt with dogs. -- To follow suit (Card Playing), to play a card of the same suit as the leading card; hence, colloquially, to follow an example set. -- To follow up, to pursue indefatigably. Syn.- To pursue; chase; go after; attend; accompany; succeed; imitate; copy; embrace; maintain. - To Follow, Pursue. To follow (v.t.) denotes simply to go after; to pursue denotes to follow with earnestness, and with a view to attain some definite object; as, a hound pursues the deer. So a person follows a companion whom he wishes to overtake on a journey; the officers of justice pursue a felon who has escaped from prison.\n\nTo go or come after; -- used in the various senses of the transitive verb: To pursue; to attend; to accompany; to be a result; to imitate. Syn.- To Follow, Succeed, Ensue. To follow (v.i.) means simply to come after; as, a crowd followed. To succeed means to come after in some regular series or succession; as, day succeeds to day, and night to night. To ensue means to follow by some established connection or principle of sequence. As wave follows wave, revolution succeeds to revolution; and nothing ensues but accumulated wretchedness."}