{"word":"fool","definition":"A compound of gooseberries scalded and crushed, with cream; -- commonly called gooseberry fool.\n\n1. One destitute of reason, or of the common powers of understanding; an idiot; a natural. 2. A person deficient in intellect; one who acts absurdly, or pursues a course contrary to the dictates of wisdom; one without judgment; a simpleton; a dolt. Extol not riches, then, the toil of fools. Milton. Experience keeps a dear school, but fools will learn in no other. Franklin. 3. (Script.)  One who acts contrary to moral and religious wisdom; a wicked person. The fool hath said in his heart, There is no God. Ps. xiv. 1. 4. One who counterfeits folly; a professional jester or buffoon; a retainer formerly kept to make sport, dressed fantastically in motley, with ridiculous accouterments. Can they think me . . . their fool or jester Milton. April fool, Court fool, etc. See under April, Court, etc. -- Fool's cap, a cap or hood to which bells were usually attached, formerly worn by professional jesters. -- Fool's errand, an unreasonable, silly, profitless adventure or undertaking. -- Fool's gold, iron or copper pyrites, resembling gold in color. -- Fool's paradise, a name applied to a limbo (see under Limbo) popularly believed to be the region of vanity and nonsense. Hence, any foolish pleasure or condition of vain self-satistaction. -- Fool's parsley (Bot.), an annual umbelliferous plant (Æthusa Cynapium) resembling parsley, but nauseous and poisonous. -- To make a fool of, to render ridiculous; to outwit; to shame. [Colloq.] -- To play the fool, to act the buffoon; to act a foolish part. \"I have played the fool, and have erred exceedingly.\" 1 Sam. xxvi. 21.\n\nTo play the fool; to trifle; to toy; to spend time in idle sport or mirth. Is this a time for fooling Dryden.\n\n1. To infatuate; to make foolish. Shak. For, fooled with hope, men favor the deceit. Dryden. 2. To use as a fool; to deceive in a shameful or mortifying manner; to impose upon; to cheat by inspiring foolish confidence; as, to fool one out of his money. You are fooled, discarded, and shook off By him for whom these shames ye underwent. Shak. To fool away, to get rid of foolishly; to spend in trifles, idleness, folly, or without advantage."}