{"word":"for","definition":"In the most general sense, indicating that in consideration of, in view of, or with reference to, which anything is done or takes place. 1. Indicating the antecedent cause or occasion of an action; the motive or inducement accompanying and prompting to an act or state; the reason of anything; that on account of which a thing is or is done. With fiery eyes sparkling for very wrath. Shak. How to choose dogs for scent or speed. Waller. Now, for so many glorious actions done, For peace at home, and for the public wealth, I mean to crown a bowl for Cæsar's health. Dryden. That which we, for our unworthiness, are afraid to crave, our prayer is, that God, for the worthiness of his Son, would, notwithstanding, vouchsafe to grant. Hooker. 2. Indicating the remoter and indirect object of an act; the end or final cause with reference to which anything is, acts, serves, or is done. The oak for nothing ill, The osier good for twigs, the poplar for the mill. Spenser. It was young counsel for the persons, and violent counsel for the matters. Bacon. Shall I think the worls was made for one, And men are born for kings, as beasts for men, Not for protection, but to be devoured Dryden. For he writes not for money, nor for praise. Denham. 3. Indicating that in favor of which, or in promoting which, anything is, or is done; hence, in behalf of; in favor of; on the side of; -- opposed to against. We can do nothing against the truth, but for the truth. 2 Cor. xiii. 8. It is for the general good of human society, and consequently of particular persons, to be true and just; and it is for men's health to be temperate. Tillotson. Aristotle is for poetical justice. Dennis. 4. Indicating that toward which the action of anything is directed, or the point toward which motion is made; We sailed from Peru for China and Japan. Bacon. 5. Indicating that on place of or instead of which anything acts or serves, or that to which a substitute, an equivalent, a compensation, or the like, is offered or made; instead of, or place of. And if any mischief follow, then thou shalt give life for life, eye for eye, tooth for tooth, hand for hand, foot for foot. Ex. xxi. 23, 24. 6. Indicating that in the character of or as being which anything is regarded or treated; to be, or as being. We take a falling meteor for a star. Cowley. If a man can be fully assured of anything for a truth, without having examined, what is there that he may not embrace for truLocke. Most of our ingenious young men take up some cried-up English poet for their model. Dryden. But let her go for an ungrateful woman. Philips. 7. Indicating that instead of which something else controls in the performing of an action, or that in spite of which anything is done, occurs, or is; hence, equivalent to notwithstanding, in spite of; -- generally followed by all, aught, anything, etc. The writer will do what she please for all me. Spectator. God's desertion shall, for aught he knows, the next minute supervene. Dr. H. More. For anything that legally appears to the contrary, it may be a contrivance to fright us. Swift. 8. Indicating the space or time through which an action or state extends; hence, during; in or through the space or time of. For many miles about There 's scarce a bush. Shak. Since, hired for life, thy servile muse sing. prior. To guide the sun's bright chariot for a day. Garth. 9. Indicating that in prevention of which, or through fear of which, anything is done. [Obs.] We 'll have a bib, for spoiling of thy doublet. Beau. & Fl. For, or As for, so far as concerns; as regards; with reference to; -- used parenthetically or independently. See under As. As for me and my house, we will serve the Lord. Josh. xxiv. 15. For me, my stormy voyage at an end, I to the port of death securely tend. Dryden. -- For all that, notwithstanding; in spite of. -- For all the world, wholly; exactly. \"Whose posy was, for all the world, like cutlers' poetry.\" Shak. -- For as much as, or Forasmuch as, in consideration that; seeing that; since. -- For by. See Forby, adv. -- For ever, eternally; at all times. See Forever. -- For me, or For all me, as far as regards me. -- For my life, or For the life of me, if my life depended on it. [Colloq.] T. Hook. -- For that, For the reason that, because; since. [Obs.] \"For that I love your daughter.\" Shak. -- For thy, or Forthy Etym: [AS. for, for this; on this account. [Obs.] \"Thomalin, have no care for thy.\" Spenser. -- For to, as sign of infinitive, in order to; to the end of. [Obs., except as sometimes heard in illiterate speech.] -- \"What went ye out for to see\" Luke vii. 25. See To, prep., 4. -- O for, would that I had; may there be granted; -- elliptically expressing desire or prayer. \"O for a muse of fire.\" Shak. -- Were it not for, or If it were not for, leaving out of account; but for the presence or action of. \"Moral consideration can no way move the sensible appetite, were it not for the will.\" Sir M. Hale.\n\n1. Because; by reason that; for that; indicating, in Old English, the reason of anything. And for of long that way had walkéd none, The vault was hid with plants and bushes hoar. Fairfax. And Heaven defend your good souls, that you think I will your serious and great business scant, For she with me. Shak. 2. Since; because; introducing a reason of something before advanced, a cause, motive, explanation, justification, or the like, of an action related or a statement made. It is logically nearly equivalent to since, or because, but connects less closely, and is sometimes used as a very general introduction to something suggested by what has gone before. Give thanks unto the Lord; for he is good; for his mercy endureth forever. Ps. cxxxvi. 1. Heaven doth with us as we with torches do, Not light them for themselves; for if our virtues Did not go forth of us, 't were all alike As if we had them not. Shak. For because, because. [Obs.] \"Nor for because they set less store by their own citizens.\" Robynson (More's Utopia). -- For why. (a) Why; for that reason; wherefore. [Obs.] (b) Because. [Obs.] See Forwhy. Syn. -- See Because.\n\nOne who takes, or that which is said on, the affrimative side; that which is said in favor of some one or something; -- the antithesis of against, and commonly used in connection with it. The fors and against. those in favor and those opposed; the pros and the cons; the advantages and the disadvantages. Jane Austen."}