{"word":"force","definition":"To stuff; to lard; to farce. [R.] Wit larded with malice, and malice forced with wit. Shak.\n\nA waterfall; a cascade. [Prov. Eng.] To see the falls for force of the river Kent. T. Gray.\n\n1. Strength or energy of body or mind; active power; vigor; might; often, an unusual degree of strength or energy; capacity of exercising an influence or producing an effect; especially, power to persuade, or convince, or impose obligation; pertinency; validity; special signification; as, the force of an appeal, an argument, a contract, or a term. He was, in the full force of the words, a good man. Macaulay. 2. Power exerted against will or consent; compulsory power; violence; coercion. Which now they hold by force, and not by right. Shak. 3. Strength or power war; hence, a body of land or naval combatants, with their appurtenances, ready for action; -- an armament; troops; warlike array; -- often in the plural; hence, a body of men prepared for action in other ways; as, the laboring force of a plantation. Is Lucius general of the forces Shak. 4. (Law) (a) Strength or power exercised without law, or contrary to law, upon persons or things; violence. (b) Validity; efficacy. Burrill. 5. (Physics)  Any action between two bodies which changes, or tends to change, their relative condition as to rest or motion; or, more generally, which changes, or tends to change, any physical relation between them, whether mechanical, thermal, chemical, electrical, magnetic, or of any other kind; as, the force of gravity; cohesive force; centrifugal force. Animal force (Physiol.), muscular force or energy. -- Catabiotic force Etym: [Gr. (Biol.), the influence exerted by living structures on adjoining cells, by which the latter are developed in harmony with the primary structures. -- Centrifugal force, Centripetal force, Coercive force, etc. See under Centrifugal, Centripetal, etc. -- Composition of forces, Correlation of forces, etc. See under Composition, Correlation, etc. -- Force and arms Etym: [trans. of L. vi et armis] (Law), an expression in old indictments, signifying violence. -- In force, or Of force, of unimpaired efficacy; valid; of full virtue; not suspended or reversed. \"A testament is of force after men are dead.\" Heb. ix. 17. -- Metabolic force (Physiol.), the influence which causes and controls the metabolism of the body. -- No force, no matter of urgency or consequence; no account; hence, to do no force, to make no account of; not to heed. [Obs.] Chaucer. -- Of force, of necessity; unavoidably; imperatively. \"Good reasons must, of force, give place to better.\" Shak. -- Plastic force (Physiol.), the force which presumably acts in the growth and repair of the tissues. -- Vital force (Physiol.), that force or power which is inherent in organization; that form of energy which is the cause of the vital phenomena of the body, as distinguished from the physical forces generally known. Syn. -- Strength; vigor; might; energy; stress; vehemence; violence; compulsion; coaction; constraint; coercion. -- Force, Strength. Strength looks rather to power as an inward capability or energy. Thus we speak of the strength of timber, bodily strength, mental strength, strength of emotion, etc. Force, on the other hand, looks more to the outward; as, the force of gravitation, force of circumstances, force of habit, etc. We do, indeed, speak of strength of will and force of will; but even here the former may lean toward the internal tenacity of purpose, and the latter toward the outward expression of it in action. But, though the two words do in a few cases touch thus closely on each other, there is, on the whole, a marked distinction in our use of force and strength. \"Force is the name given, in mechanical science, to whatever produces, or can produce, motion.\" Nichol. Thy tears are of no force to mollify This flinty man. Heywood. More huge in strength than wise in works he was. Spenser. Adam and first matron Eve Had ended now their orisons, and found Strength added from above, new hope to spring Out of despair. Milton.\n\n1. To constrain to do or to forbear, by the exertion of a power not resistible; to compel by physical, moral, or intellectual means; to coerce; as, masters force slaves to labor. 2. To compel, as by strength of evidence; as, to force conviction on the mind. 3. To do violence to; to overpower, or to compel by violence to one;s will; especially, to ravish; to violate; to commit rape upon. To force their monarch and insult the court. Dryden. I should have forced thee soon wish other arms. Milton. To force a spotless virgin's chastity. Shak. 4. To obtain or win by strength; to take by violence or struggle; specifically, to capture by assault; to storm, as a fortress. 5. To impel, drive, wrest, extort, get, etc., by main strength or violence; -- with a following adverb, as along, away, from, into, through, out, etc. It stuck so fast, so deeply buried lay That scarce the victor forced the steel away. Dryden. To force the tyrant from his seat by war. Sahk. Ethelbert ordered that none should be forced into religion. Fuller. 6. To put in force; to cause to be executed; to make binding; to enforce. [Obs.] What can the church force more J. Webster. 7. To exert to the utmost; to urge; hence, to strain; to urge to excessive, unnatural, or untimely action; to produce by unnatural effort; as, to force a consient or metaphor; to force a laugh; to force fruits. High on a mounting wave my head I bore, Forcing my strength, and gathering to the shore. Dryden. 8. (Whist)  To compel (an adversary or partner) to trump a trick by leading a suit of which he has none. 9. To provide with forces; to reënforce; to strengthen by soldiers; to man; to garrison. [Obs.] Shak. 10. To allow the force of; to value; to care for. [Obs.] For me, I force not argument a straw. Shak. Syn. -- To compel; constrain; oblige; necessitate; coerce; drive; press; impel.\n\n1. To use violence; to make violent effort; to strive; to endeavor. Forcing with gifts to win his wanton heart. Spenser. 2. To make a difficult matter of anything; to labor; to hesitate; hence, to force of, to make much account of; to regard. Your oath once broke, you force not to forswear. Shak. I force not of such fooleries. Camden. 3. To be of force, importance, or weight; to matter. It is not sufficient to have attained the name and dignity of a shepherd, not forcing how. Udall."}