{"word":"fore","definition":"Journey; way; method of proceeding. [Obs.] \"Follow him and his fore.\" Chaucer.\n\n1. In the part that precedes or goes first; -- opposed to aft, after, back, behind, etc. 2. Formerly; previously; afore. [Obs. or Colloq.] The eyes, fore duteous, now converted are. Shak. 3. (Naut.)  In or towards the bows of a ship. Fore and aft (Naut.), from stem to stern; lengthwise of the vessel; -- in distinction from athwart. R. H. Dana, Jr. -- Fore-and-aft rigged (Naut.), not rigged with square sails attached to yards, but with sails bent to gaffs or set on stays in the midship line of the vessel. See Schooner, Sloop, Cutter.\n\nAdvanced, as compared with something else; toward the front; being or coming first, in time, place, order, or importance; preceding; anterior; antecedent; earlier; forward; -- opposed to Ant: back or Ant: behind; as, the fore part of a garment; the fore part of the day; the fore and of a wagon. The free will of the subject is preserved, while it is directed by the fore purpose of the state. Southey. Note: Fore is much used adjectively or in composition. Fore bay, a reservoir or canal between a mill race and a water wheel; the discharging end of a pond or mill race. -- Fore body (Shipbuilding), the part of a ship forward of the largest cross-section, distinguisched from middle body abd after body. -- Fore boot, a receptacle in the front of a vehicle, for stowing baggage, etc. -- Fore bow, the pommel of a saddle. Knight. -- Fore cabin, a cabin in the fore part of a ship, usually with inferior accommodations. -- Fore carriage. (a) The forward part of the running gear of a four-wheeled vehicle. (b) A small carriage at the front end of a plow beam. -- Fore course (Naut.), the lowermost sail on the foremost of a square-rigged vessel; the foresail. See Illust. under Sail. -- Fore door. Same as Front door. -- Fore edge, the front edge of a book or folded sheet, etc. -- Fore elder, an ancestor. [Prov. Eng.] -- Fore end. (a) The end which precedes; the earlier, or the nearer, part; the beginning. I have . . . paid More pious debts to heaven, than in all The fore end of my time. Shak. (b) In firearms, the wooden stock under the barrel, forward of the trigger guard, or breech frame. -- Fore girth, a girth for the fore part (of a horse, etc.); a martingale. -- Fore hammer, a sledge hammer, working alternately, or in time, with the hand hammer. -- Fore leg, one of the front legs of a quadruped, or multiped, or of a chair, settee, etc. -- Fore peak (Naut.), the angle within a ship's bows; the portion of the hold which is farthest forward. -- Fore piece, a front piece, as the flap in the fore part of a sidesaddle, to guard the rider's dress. -- Fore plane, a carpenter's plane, in size and use between a jack plane and a smoothing plane. Knight. -- Fore reading, previous perusal. [Obs.] Hales. -- Fore rent, in Scotland, rent payable before a crop is gathered. -- Fore sheets (Naut.), the forward portion of a rowboat; the space beyond the front thwart. See Stern sheets. -- Fore shore. (a) A bank in advance of a sea wall, to break the force of the surf. (b) The seaward projecting, slightly inclined portion of a breakwater. Knight. (c) The part of the shore between high and low water marks. -- Fore sight, that one of the two sights of a gun which is near the muzzle. -- Fore tackle (Naut.), the tackle on the foremast of a ship. -- Fore topmast. (Naut.) See Fore-topmast, in the Vocabulary. -- Fore wind, a favorable wind. [Obs.] Sailed on smooth seas, by fore winds borne. Sandys. -- Fore world, the antediluvian world. [R.] Southey.\n\nThe front; hence, that which is in front; the future. At the fore (Naut.), at the fore royal masthead; -- said of a flag, so raised as a signal for sailing, etc. -- To the fore. (a) In advance; to the front; to a prominent position; in plain sight; in readiness for use. (b) In existence; alive; not worn out, lost, or spent, as money, etc. [Irish] \"While I am to the fore.\" W. Collins. \"How many captains in the regiment had two thousand pounds to the fore\" Thackeray.\n\nBefore; -- sometimes written 'fore as if a contraction of afore or before. [Obs.]"}