{"word":"forge","definition":"1. A place or establishment where iron or other metals are wrought by heating and hammering; especially, a furnace, or a shop with its furnace, etc., where iron is heated and wrought; a smithy. In the quick forge and working house of thought. Shak. 2. The works where wrought iron is produced directly from the ore, or where iron is rendered malleable by puddling and shingling; a shingling mill. 3. The act of beating or working iron or steel; the manufacture of metalic bodies. [Obs.] In the greater bodies the forge was easy. Bacon. American forge, a forge for the direct production of wrought iron, differing from the old Catalan forge mainly in using finely crushed ore and working continuously. Raymond. -- Catalan forge. (Metal.) See under Catalan. -- Forge cinder, the dross or slag form a forge or bloomary. -- Forge rolls, Forge train, the train of rolls by which a bloom is converted into puddle bars. -- Forge wagon (Mil.), a wagon fitted up for transporting a blackmith's forge and tools. -- Portable forge, a light and compact blacksmith's forge, with bellows, etc., that may be moved from place to place.\n\n1. To form by heating and hammering; to beat into any particular shape, as a metal. Mars's armor forged for proof eterne. Shak. 2. To form or shape out in any way; to produce; to frame; to invent. Those names that the schools forged, and put into the mouth of scholars, could never get admittance into common use. Locke. Do forge a life-long trouble for ourselves. Tennyson. 3. To coin. [Obs.] Chaucer. 4. To make falsely; to produce, as that which is untrue or not genuine; to fabricate; to counterfeit, as, a signature, or a signed document. That paltry story is untrue, And forged to cheat such gulls as you. Hudibras. Forged certificates of his . . . moral character. Macaulay. Syn. -- To fabricate; counterfeit; feign; falsify.\n\n1. To commit forgery. 2. (Naut.)  To move heavily and slowly, as a ship after the sails are furled; to work one's way, as one ship in outsailing another; -- used especially in the phrase to forge ahead. Totten. And off she [a ship] forged without a shock. De Quincey.\n\nTo impel forward slowly; as, to forge a ship forward."}