{"word":"foul","definition":"A bird. [Obs.] Chaucer.\n\n1. Covered with, or containing, extraneous matter which is injurious, noxious, offensive, or obstructive; filthy; dirty; not clean; polluted; nasty; defiled; as, a foul cloth; foul hands; a foul chimney; foul air; a ship's bottom is foul when overgrown with barnacles; a gun becomes foul from repeated firing; a well is foul with polluted water. My face is foul with weeping. Job. xvi. 16. 2. Scurrilous; obscene or profane; abusive; as, foul words; foul language. 3. Hateful; detestable; shameful; odious; wretched. \"The foul with Sycorax.\" Shak. Who first seduced them to that foul revolt Milton. 4. Loathsome; disgusting; as, a foul disease. 5. Ugly; homely; poor. [Obs.] Chaucer. Let us, like merchants, show our foulest wares. Shak. 6. Not favorable; unpropitious; not fair or advantageous; as, a foul wind; a foul road; cloudy or rainy; stormy; not fair; -- said of the weather, sky, etc. So foul a sky clears not without a storm. Shak. 7. Not conformed to the established rules and customs of a game, conflict, test, etc.; unfair; dishonest; dishonorable; cheating; as, foul play. 8. Having freedom of motion interfered with by collision or entanglement; entangled; -- opposed to clear; as, a rope or cable may get foul while paying it out. Foul anchor. (Naut.) See under Anchor. -- Foul ball (Baseball), a ball that first strikes the ground outside of the foul ball lines, or rolls outside of certain limits. -- Foul ball lines (Baseball), lines from the home base, through the first and third bases, to the boundary of the field. -- Foul berth (Naut.), a berth in which a ship is in danger of fouling another vesel. -- Foul bill, or Foul bill of health, a certificate, duly authenticated, that a ship has come from a place where a contagious disorder prevails, or that some of the crew are infected. -- Foul copy, a rough draught, with erasures and corrections; -- opposed to fair or clean copy. \"Some writers boast of negligence, and others would be ashamed to show their foul copies.\" Cowper. -- Foul proof, an uncorrected proof; a proof containing an excessive quantity of errors. -- Foul strike (Baseball), a strike by the batsman when any part of his person is outside of the lines of his position. -- To fall foul, to fall out; to quarrel. [Obs.] \"If they be any ways offended, they fall foul.\" Burton. -- To fall, or run, foul of. See under Fall. -- To make foul water, to sail in such shallow water that the ship's keel stirs the mud at the bottom.\n\n1. To make filthy; to defile; to daub; to dirty; to soil; as, to foul the face or hands with mire. 2. (Mil.)  To incrust (the bore of a gun) with burnt powder in the process of firing. 3. To cover (a ship's bottom) with anything that impered its sailing; as, a bottom fouled with barnacles. 4. To entangle, so as to impede motion; as, to foul a rope or cable in paying it out; to come into collision with; as, one boat fouled the other in a race.\n\n1. To become clogged with burnt powder in the process of firing, as a gun. 2. To become entagled, as ropes; to come into collision with something; as, the two boats fouled.\n\n1. An entanglement; a collision, as in a boat race. 2. (Baseball)  See Foul ball, under Foul, a."}