{"word":"fox","definition":"1. (Zoöl.)  A carnivorous animal of the genus Vulpes, family Canidæ, of many species. The European fox (V. vulgaris or V. vulpes), the American red fox (V. fulvus), the American gray fox (V. Virginianus), and the arctic, white, or blue, fox (V. lagopus) are well-known species. Note: The black or silver-gray fox is a variety of the American red fox, producing a fur of great value; the cross-gray and woods-gray foxes are other varieties of the same species, of less value. The common foxes of Europe and America are very similar; both are celebrated for their craftiness. They feed on wild birds, poultry, and various small animals. Subtle as the fox for prey. Shak. 2. (Zoöl.)  The European dragonet. 3. (Zoöl.)  The fox shark or thrasher shark; -- called also sea fox. See Thrasher shark, under Shark. 4. A sly, cunning fellow. [Colloq.] We call a crafty and cruel man a fox. Beattie. 5. (Naut.)  Rope yarn twisted together, and rubbed with tar; -- used for seizings or mats. 6. A sword; -- so called from the stamp of a fox on the blade, or perhaps of a wolf taken for a fox. [Obs.] Thou diest on point of fox. Shak. 7. pl. (Enthnol.)  A tribe of Indians which, with the Sacs, formerly occupied the region about Green Bay, Wisconsin; -- called also Outagamies. Fox and geese. (a) A boy's game, in which one boy tries to catch others as they run one goal to another. (b) A game with sixteen checkers, or some substitute for them, one of which is called the fox, and the rest the geese; the fox, whose first position is in the middle of the board, endeavors to break through the line of the geese, and the geese to pen up the fox. -- Fox bat (Zoöl.), a large fruit bat of the genus Pteropus, of many species, inhabiting Asia, Africa, and the East Indies, esp. P. medius of India. Some of the species are more than four feet across the outspread wings. See Fruit bat. -- Fox bolt, a bolt having a split end to receive a fox wedge. -- Fox brush (Zoöl.), the tail of a fox. -- Fox evil, a disease in which the hair falls off; alopecy. -- Fox grape (Bot.), the name of two species of American grapes. The northern fox grape (Vitis Labrusca) is the origin of the varieties called Isabella, Concord, Hartford, etc., and the southern fox grape (Vitis vulpina) has produced the Scuppernong, and probably the Catawba. -- Fox hunter. (a) One who pursues foxes with hounds. (b) A horse ridden in a fox chase. -- Fox shark (Zoöl.), the thrasher shark. See Thrasher shark, under Thrasher. -- Fox sleep, pretended sleep. -- Fox sparrow (Zoöl.), a large American sparrow (Passerella iliaca); -- so called on account of its reddish color. -- Fox squirrel (Zoöl.), a large North American squirrel (Sciurus niger, or S. cinereus). In the Southern States the black variety prevails; farther north the fulvous and gray variety, called the cat squirrel, is more common. -- Fox terrier (Zoöl.), one of a peculiar breed of terriers, used in hunting to drive foxes from their holes, and for other purposes. There are rough- and smooth-haired varieties. -- Fox trot, a pace like that which is adopted for a few steps, by a horse, when passing from a walk into a trot, or a trot into a walk. -- Fox wedge (Mach. & Carpentry), a wedge for expanding the split end of a bolt, cotter, dowel, tenon, or other piece, to fasten the end in a hole or mortise and prevent withdrawal. The wedge abuts on the bottom of the hole and the piece is driven down upon it. Fastening by fox wedges is called foxtail wedging. -- Fox wolf (Zoöl.), one of several South American wild dogs, belonging to the genus Canis. They have long, bushy tails like a fox.\n\n1. To intoxicate; to stupefy with drink. I drank . . . so much wine that I was almost foxed. Pepys. 2. To make sour, as beer, by causing it to ferment. 3. To repair the feet of, as of boots, with new front upper leather, or to piece the upper fronts of.\n\nTo turn sour; -- said of beer, etc., when it sours in fermenting."}