{"word":"frame","definition":"1. (Arch. & Engin.)  To construct by fitting and uniting the several parts of the skeleton of any structure; specifically, in woodwork, to put together by cutting parts of one member to fit parts of another. See Dovetail, Halve, v. t., Miter, Tenon, Tooth, Tusk, Scarf, and Splice. 2. To originate; to plan; to devise; to contrive; to compose; in a bad sense, to invent or fabricate, as something false. How many excellent reasonings are framed in the mind of a man of wisdom and study in a length of years. I. Watts. 3. To fit to something else, or for some specific end; to adjust; to regulate; to shape; to conform. And frame my face to all occasions. Shak. We may in some measure frame our minds for the reception of happiness. Landor. The human mind is framed to be influenced. I. Taylor. 4. To cause; to bring about; to produce. [Obs.] Fear frames disorder, and disorder wounds. Shak. 5. To support. [Obs. & R.] That on a staff his feeble steps did frame. Spenser. 6. To provide with a frame, as a picture.\n\n1. To shape; to arrange, as the organs of speech. [Obs.] Judg. xii. 6. 2. To proceed; to go. [Obs.] The bauty of this sinful dame Made many princes thither frame. Shak.\n\n1. Anything composed of parts fitted and united together; a fabric; a structure; esp., the constructional system, whether of timber or metal, that gives to a building, vessel, etc., its model and strength; the skeleton of a structure. These are thy glorius works, Parent of good, Almighty! thine this universal frame. Milton. 2. The bodily structure; physical constitution; make or build of a person. Some bloody passion shakes your very frame. Shak. No frames could be strong enough to endure it. Prescott. 3. A kind of open case or structure made for admitting, inclosing, or supporting things, as that which incloses or contains a window, door, picture, etc.; that on which anything is held or stretched; as: (a) The skeleton structure which supports the boiler and machinery of a locomotive upon its wheels. (b) (Founding) A molding box or flask, which being filled with sand serves as a mold for castings. (c) The ribs and stretchers of an umbrella or other structure with a fabric covering. (d) A structure of four bars, adjustable in size, on which cloth, etc., is stretched for quilting, embroidery, etc. (e) (Hort.) A glazed portable structure for protecting young plants from frost. (f) (Print.) A stand to support the type cases for use by the compositor. 4. (Mach.)  A term applied, especially in England, to certain machines built upon or within framework; as, a stocking frame; lace frame; spinning frame, etc. 5. Form; shape; proportion; scheme; structure; constitution; system; as, a frameof government. She that hath a heart of that fine frame To pay this debt of love but to a brother. Shak. Put your discourse into some frame. Shak. 6. Particular state or disposition, as of the mind; humor; temper; mood; as, to be always in a happy frame. 7. Contrivance; the act of devising or scheming. [Obs.] John the bastard Whose spirits toil in frame of villainies. Shak. Balloon frame, Cant frames, etc. See under Balloon, Cant, etc. -- Frame building or house, a building of which the form and support is made of framed timbers. [U.S.] -- Frame level, a mason's level. -- Frame saw, a thin saw stretched in a frame to give it rigidity."}