{"word":"french","definition":"Of or pertaining to France or its inhabitants. French bean (Bot.), the common kidney bean (Phaseolus vulgaris). -- French berry (Bot.), the berry of a species of buckthorn (Rhamnus catharticus), which affords a saffron, green or purple pigment. -- French casement (Arch.) See French window, under Window. -- French chalk (Min.), a variety of granular talc; -- used for drawing lines on cloth, etc. See under Chalk. -- French cowslip (Bot.) The Primula Auricula. See Bear's-ear. -- French fake (Naut.), a mode of coiling a rope by running it backward and forward in parallel bends, so that it may run freely. -- French honeysuckle (Bot.) a plant of the genus Hedysarum (H. coronarium); -- called also garland honeysuckle. -- French horn, a metallic wind instrument, consisting of a long tube twisted into circular folds and gradually expanding from the mouthpiece to the end at which the sound issues; -- called in France cor de chasse. -- French leave, an informal, hasty, or secret departure; esp., the leaving a place without paying one's debts. -- French pie Etym: [French (here used in sense of \"foreign\") + pie a magpie (in allusion to its black and white color)] (Zoöl.), the European great spotted woodpecker (Dryobstes major); -- called also wood pie. -- French polish. (a) A preparation for the surface of woodwork, consisting of gums dissolved in alcohol, either shellac alone, or shellac with other gums added. (b) The glossy surface produced by the application of the above. -- French purple, a dyestuff obtained from lichens and used for coloring woolen and silken fabrics, without the aid of mordants. Ure. -- French red rouge. -- French rice, amelcorn. -- French roof (Arch.), a modified form of mansard roof having a nearly flat deck for the upper slope. -- French tub, a dyer's mixture of protochloride of tin and logwood; -- called also plum tub. Ure. -- French window. See under Window.\n\n1. The language spoken in France. 2. Collectively, the people of France."}