{"word":"friction","definition":"1. The act of rubbing the surface of one body against that of another; attrition; in hygiene, the act of rubbing the body with the hand, with flannel, or with a brush etc., to excite the skin to healthy action. 2. (Mech.)  The resistance which a body meets with from the surface on which it moves. It may be resistance to sliding motion, or to rolling motion. 3. A clashing between two persons or parties in opinions or work; a disagreement tending to prevent or retard progress. Angle of friction (Mech.), the angle which a plane onwhich a body is lying makes with a horizontal plane,when the hody is just ready to slide dewn the plane. Note: This angle varies for different bodies, and for planes of different materials. -- Anti-friction wheels (Mach.), wheels turning freely on small pivots, and sustaining, at the angle formed by their circumferences, the pivot or journal of a revolving shaft, to relieve it of friction; -- called also friction wheels. -- Friction balls, or Friction rollers, balls or rollers placed so as to receive the pressure or weight of bodies in motion, and relieve friction, as in the hub of a bicycle wheel. -- Friction brake (Mach.), a form of dynamometer for measuring the power a motor exerts. A clamp around the revolving shaft or fly wheel of the motor resists the motion by its friction, the work thus absorbed being ascertained by observing the force required to keep the clamp from revolving with the shaft; a Prony brake. -- Friction chocks, brakes attached to the common standing garrison carriages of guns, so as to raise the trucks or wheels off the platform when the gun begins to recoil, and prevent its running back. Earrow. -- Friction clutch, Friction coupling, an engaging and disengaging gear for revolving shafts, pulleys, etc., acting by friction; esp.: (a) A device in which a piece on one shaft or pulley is so forcibly pressed against a piece on another shaft that the two will revolve together; as, in the illustration, the cone a on one shaft, when thrust forcibly into the corresponding hollow cone b on the other shaft, compels the shafts to rotate together, by the hold the friction of the conical surfaces gives. (b) A toothed clutch, one member of which, instead of being made fast on its shaft, is held by friction and can turn, by slipping, under excessive strain or in starting. -- Friction drop hammer, one in which the hammer is raised for striking by the friction of revolving rollers which nip the hammer rod. -- Friction gear. See Frictional gearing, under Frictional. -- Friction machine, an electrical machine, generating electricity by friction. -- Friction meter, an instrument for measuring friction, as in testing lubricants. -- Friction powder, Friction composition, a composition of chlorate of potassium, antimony, sulphide, etc, which readily ignites by friction. -- Friction primer, Friction tube, a tube used for firing cannon by means of the friction of a roughened wire in the friction powder or composition with which the tube is filled -- Friction wheel (Mach.), one of the wheels in frictional gearing. See under Frictional."}