{"word":"fruit","definition":"1. Whatever is produced for the nourishment or enjoyment of man or animals by the processes of vegetable growth, as corn, grass, cotton, flax, etc.; -- commonly used in the plural. Six years thou shalt sow thy land, and shalt gather in the fruits thereof. Ex. xxiii. 10. 2. (Hort.)  The pulpy, edible seed vessels of certain plants, especially those grown on branches above ground, as apples, oranges, grapes, melons, berries, etc. See 3. 3. (Bot.)  The ripened ovary of a flowering plant, with its contents and whatever parts are consolidated with it. Note: Fruits are classified as fleshy, drupaceous, and -dry. Fleshy fruits include berries, gourds, and melons, orangelike fruita and pomes; drupaceous fruits are stony within and fleshy without, as peaches, plums, and chercies;and dry fruits are further divided into achenes, follicles, legumes, capsules, nuts, and several other kinds. 4. (Bot.)  The spore cases or conceptacles of flowerless plants, as of ferns, mosses, algae, etc., with the spores contained in them. 6. The produce of animals; offspring; young; as, the fruit of the womb, of the loins, of the body. King Edward's fruit, true heir to the English crown. Shak. 6. That which is produced; the effect or consequence of any action; advantageous or desirable product or result; disadvantageous or evil consequence or effect; as, the fruits of labor, of self-denial, of intemperance. The fruit of rashness. Shak. What I obtained was the fruit of no bargain. Burke. They shall eat the fruit of their doings. Is. iii 10. The fruits of this education became visible. Macaulay. Note: Fruit is frequently used adjectively, signifying of, for, or pertaining to a fruit or fruits; as, fruit bud; fruit frame; fruit jar; fruit knife; fruit loft; fruit show; fruit stall; fruit tree; etc. Fruit bat (Zoöl.), one of the Frugivora; -- called also fruit- eating bat. -- Fruit bud (Bot.), a bud that produces fruit; -- in most oplants the same as the power bud. Fruit dot (Bot.), a collection of fruit cases, as in ferns. See Sorus. -- Fruit fly (Zoöl.), a small dipterous insect of the genus Drosophila, which lives in fruit, in the larval state. -- Fruit jar, a jar for holding preserved fruit, usually made of glass or earthenware. -- Fruit pigeon (Zoöl.), one of numerous species of pigeons of the family Carpophagidæ, inhabiting India, Australia, and the Pacific Islands. They feed largely upon fruit. and are noted for their beautiful colors. -- Fruit sugar (Chem.), a kind of sugar occurring, naturally formed, in many ripe fruits, and in honey; levulose. The name is also, though rarely, applied to invert sugar, or to the natural mixture or dextrose and levulose resembling it, and found in fruits and honey. -- Fruit tree (Hort.), a tree cultivated for its edible fruit. -- Fruit worm (Zoöl.), one of numerous species of insect larvæ: which live in the interior of fruit. They are mostly small species of Lepidoptera and Diptera. -- Small fruits (Hort.), currants, raspberries, strawberries, etc.\n\nTo bear fruit. Chesterfield."}