{"word":"full","definition":"1. Filled up, having within its limits all that it can contain; supplied; not empty or vacant; -- said primarily of hollow vessels, and hence of anything else; as, a cup full of water; a house full of people. Had the throne been full, their meeting would not have been regular. Blackstone. 2. Abundantly furnished or provided; sufficient in. quantity, quality, or degree; copious; plenteous; ample; adequate; as, a full meal; a full supply; a full voice; a full compensation; a house full of furniture. 3. Not wanting in any essential quality; complete, entire; perfect; adequate; as, a full narrative; a person of full age; a full stop; a full face; the full moon. It came to pass, at the end of two full years, that Pharaoh dreamed. Gen. xii. 1. The man commands Like a full soldier. Shak. I can not Request a fuller satisfaction Than you have freely granted. Ford. 4. Sated; surfeited. I am full of the burnt offerings of rams. Is. i. 11. 5. Having the mind filled with ideas; stocked with knowledge; stored with information. Reading maketh a full man. Bacon. 6. Having the attention, thoughts, etc., absorbed in any matter, and the feelings more or less excited by it, as, to be full of some project. Every one is full of the miracles done by cold baths on decayed and weak constitutions. Locke. 7. Filled with emotions. The heart is so full that a drop overfills it. Lowell. 8. Impregnated; made pregnant. [Obs.] Ilia, the fair, . . . full of Mars. Dryden. At full, when full or complete. Shak. -- Full age (Law) the age at which one attains full personal rights; majority; -- in England and the United States the age of 21 years. Abbott. -- Full and by (Naut.), sailing closehauled, having all the sails full, and lying as near the wind as poesible. -- Full band (Mus.), a band in which all the instruments are employed. -- Full binding, the binding of a book when made wholly of leather, as distinguished from half binding. -- Full bottom, a kind of wig full and large at the bottom. -- Full brother or sister, a brother or sister having the same parents as another. -- Full cry (Hunting), eager chase; -- said of hounds that have caught the scent, and give tongue together. -- Full dress, the dress prescribed by authority or by etiquette to be worn on occasions of ceremony. -- Full hand (Poker), three of a kind and a pair. -- Full moon. (a) The moon with its whole disk illuminated, as when opposite to the sun. (b) The time when the moon is full. -- Full organ (Mus.), the organ when all or most stops are out. -- Full score (Mus.), a score in which all the parts for voices and instruments are given. -- Full sea, high water. -- Full swing, free course; unrestrained liberty; \"Leaving corrupt nature to . . . the full swing and freedom of its own extravagant actings.\" South (Colloq.) -- In full, at length; uncontracted; unabridged; written out in words, and not indicated by figures. -- In full blast. See under Blast.\n\nComplete measure; utmost extent; the highest state or degree. The swan's-down feather, That stands upon the swell at full of tide. Shak. Full of the moon, the time of full moon.\n\nQuite; to the same degree; without abatement or diminution; with the whole force or effect; thoroughly; completely; exactly; entirely. The pawn I proffer shall be full as good. Dryden. The diapason closing full in man. Dryden. Full in the center of the sacred wood. Addison. Note: Full is placed before adjectives and adverbs to heighten or strengthen their signification. \"Full sad.\" Milton. \"Master of a full poor cell.\" Shak. \"Full many a gem of purest ray serene.\" T. Gray. Full is also prefixed to participles to express utmost extent or degree; as, full-bloomed, full-blown, full-crammed full-grown, full- laden, full-stuffed, etc. Such compounds, for the most part, are self-defining.\n\nTo become full or wholly illuminated; as, the moon fulls at midnight.\n\nTo thicken by moistening, heating, and pressing, as cloth; to mill; to make compact; to scour, cleanse, and thicken in a mill.\n\nTo become fulled or thickened; as, this material fulls well."}