{"word":"gain","definition":"A square or beveled notch cut out of a girder, binding joist, or other timber which supports a floor beam, so as to receive the end of the floor beam.\n\nConvenient; suitable; direct; near; handy; dexterous; easy; profitable; cheap; respectable. [Obs. or Prov. Eng.]\n\n1. That which is gained, obtained, or acquired, as increase, profit, advantage, or benefit; -- opposed to loss. But what things were gain to me, those I counted loss for Christ. Phil. iii. 7. Godliness with contentment is great gain. 1 Tim. vi. 6. Every one shall share in the gains. Shak. 2. The obtaining or amassing of profit or valuable possessions; acquisition; accumulation. \"The lust of gain.\" Tennyson.\n\n1. To get, as profit or advantage; to obtain or acquire by effort or labor; as, to gain a good living. What is a man profited, if he shall gain the whole world, and lose his own soul Matt. xvi. 26. To gain dominion, or to keep it gained. Milton. For fame with toil we gain, but lose with ease. Pope. 2. To come off winner or victor in; to be successful in; to obtain by competition; as, to gain a battle; to gain a case at law; to gain a prize. 3. To draw into any interest or party; to win to one's side; to conciliate. If he shall hear thee, thou hast gained thy brother. Matt. xviii. 15. To gratify the queen, and gained the court. Dryden. 4. To reach; to attain to; to arrive at; as, to gain the top of a mountain; to gain a good harbor. Forded Usk and gained the wood. Tennyson. 5. To get, incur, or receive, as loss, harm, or damage. [Obs. or Ironical] Ye should . . . not have loosed from Crete, and to have gained this harm and loss. Acts xxvii. 21. Gained day, the calendar day gained in sailing eastward around the earth. -- To gain ground, to make progress; to advance in any undertaking; to prevail; to acquire strength or extent. -- To gain over, to draw to one's party or interest; to win over. -- To gain the wind (Naut.), to reach the windward side of another ship. Syn. -- To obtain; acquire; get; procure; win; earn; attain; achieve. See Obtain. -- To Gain, Win. Gain implies only that we get something by exertion; win, that we do it in competition with others. A person gains knowledge, or gains a prize, simply by striving for it; he wins a victory, or wins a prize, by taking it in a struggle with others.\n\nTo have or receive advantage or profit; to acquire gain; to grow rich; to advance in interest, health, or happiness; to make progress; as, the sick man gains daily. Thou hast greedily gained of thy neighbors by extortion. Ezek. xxii. 12. Gaining twist, in rifled firearms, a twist of the grooves, which increases regularly from the breech to the muzzle. To gain on or upon. (a) To encroach on; as, the ocean gains on the land. (b) To obtain influence with. (c) To win ground upon; to move faster than, as in a race or contest. (d) To get the better of; to have the advantage of. The English have not only gained upon the Venetians in the Levant, but have their cloth in Venice itself. Addison. My good behavior had so far gained on the emperor, that I began to conceive hopes of liberty. Swift."}