{"word":"gall","definition":"1. (Physiol.)  The bitter, alkaline, viscid fluid found in the gall bladder, beneath the liver. It consists of the secretion of the liver, or bile, mixed with that of the mucous membrane of the gall bladder. 2. The gall bladder. 3. Anything extremely bitter; bitterness; rancor. He hath . . . compassed me with gall and travail. Lam. iii. 5. Comedy diverted without gall. Dryden. 4. Impudence; brazen assurance. [Slang] Gall bladder (Anat.), the membranous sac, in which the bile, or gall, is stored up, as secreted by the liver; the cholecystis. See Illust. of Digestive apparatus. -- Gall duct, a duct which conveys bile, as the cystic duct, or the hepatic duct. -- Gall sickness, a remitting bilious fever in the Netherlands. Dunglison. -- Gall of the earth (Bot.), an herbaceous composite plant with variously lobed and cleft leaves, usually the Prenanthes serpentaria.\n\nAn excrescence of any form produced on any part of a plant by insects or their larvae. They are most commonly caused by small Hymenoptera and Diptera which puncture the bark and lay their eggs in the wounds. The larvae live within the galls. Some galls are due to aphids, mites, etc. See Gallnut. Note: The galls, or gallnuts, of commerce are produced by insects of the genus Cynips, chiefly on an oak (Quercus infectoria or Lusitanica) of Western Asia and Southern Europe. They contain much tannin, and are used in the manufacture of that article and for making ink and a black dye, as well as in medicine. Gall insect (Zoöl.), any insect that produces galls. -- Gall midge (Zoöl.), any small dipterous insect that produces galls. -- Gall oak, the oak (Quercus infectoria) which yields the galls of commerce. -- Gall of glass, the neutral salt skimmed off from the surface of melted crown glass;- called also glass gall and sandiver. Ure.-- Gall wasp. (Zoöl.) See Gallfly.\n\nTo impregnate with a decoction of gallnuts. Ure.\n\n1. To fret and wear away by friction; to hurt or break the skin of by rubbing; to chafe; to injure the surface of by attrition; as, a saddle galls the back of a horse; to gall a mast or a cable. I am loth to gall a new-healed wound. Shak. 2. To fret; to vex; as, to be galled by sarcasm. They that are most galled with my folly, They most must laugh. Shak. 3. To injure; to harass; to annoy; as, the troops were galled by the shot of the enemy. In our wars against the French of old, we used to gall them with our longbows, at a greater distance than they could shoot their arrows. Addison.\n\nTo scoff; to jeer. [R.] Shak.\n\nA wound in the skin made by rubbing."}