{"word":"game","definition":"Crooked; lame; as, a game leg. [Colloq.]\n\n1. Sport of any kind; jest, frolic. We have had pastimes here, and pleasant game. Shak. 2. A contest, physical or mental, according to certain rules, for amusement, recreation, or for winning a stake; as, a game of chance; games of skill; field games, etc. But war's a game, which, were their subject wise, Kings would not play at. Cowper. Note: Among the ancients, especially the Greeks and Romans, there were regularly recurring public exhibitions of strength, agility, and skill under the patronage of the government, usually accompanied with religious ceremonies. Such were the Olympic, the Pythian, the Nemean, and the Isthmian games. 3. The use or practice of such a game; a single match at play; a single contest; as, a game at cards. Talk the game o'er between the deal. Lloyd. 4. That which is gained, as the stake in a game; also, the number of points necessary to be scored in order to win a game; as, in short whist five points are game. 5. (Card Playing)  In some games, a point credited on the score to the player whose cards counts up the highest. 6. A scheme or art employed in the pursuit of an object or purpose; method of procedure; projected line of operations; plan; project. Your murderous game is nearly up. Blackw. Mag. It was obviously Lord Macaulay's game to blacken the greatest literary champion of the cause he had set himself to attack. Saintsbury. 7. Animals pursued and taken by sportsmen; wild meats designed for, or served at, table. Those species of animals . . . distinguished from the rest by the well-known appellation of game. Blackstone. Confidence game. See under Confidence. -- To make game of, to make sport of; to mock. Milton.\n\n1. Having a resolute, unyielding spirit, like the gamecock; ready to fight to the last; plucky. I was game . . . .I felt that I could have fought even to the death. W. Irving. 2. Of or pertaining to such animals as are hunted for game, or to the act or practice of hunting. Game bag, a sportsman's bag for carrying small game captured; also, the whole quantity of game taken. -- Game bird, any bird commonly shot for food, esp. grouse, partridges, quails, pheasants, wild turkeys, and the shore or wading birds, such as plovers, snipe, woodcock, curlew, and sandpipers. The term is sometimes arbitrarily restricted to birds hunted by sportsmen, with dogs and guns. -- Game egg, an egg producing a gamecock. -- Game laws, laws regulating the seasons and manner of taking game for food or for sport. -- Game preserver, a land owner who regulates the killing of game on his estate with a view to its increase. [Eng.] -- To be game. (a) To show a brave, unyielding spirit. (b) To be victor in a game. [Colloq.] -- To die game, to maintain a bold, unyielding spirit to the last; to die fighting.\n\n1. To rejoice; to be pleased; -- often used, in Old English, impersonally with dative. [Obs.] God loved he best with all his whole hearte At alle times, though him gamed or smarte. Chaucer. 2. To play at any sport or diversion. 3. To play for a stake or prize; to use cards, dice, billiards, or other instruments, according to certain rules, with a view to win money or other thing waged upon the issue of the contest; to gamble."}