{"word":"gang","definition":"To go; to walk. Note: Obsolete in English literature, but still used in the North of England, and also in Scotland.\n\n1. A going; a course. [Obs.] 2. A number going in company; hence, a company, or a number of persons associated for a particular purpose; a group of laborers under one foreman; a squad; as, a gang of sailors; a chain gang; a gang of thieves. 3. A combination of similar implements arranged so as, by acting together, to save time or labor; a set; as, a gang of saws, or of plows. 4. (Naut.)  A set; all required for an outfit; as, a new gang of stays. 5. Etym: [Cf. Gangue.] (Mining)  The mineral substance which incloses a vein; a matrix; a gangue. Gang board, or Gang plank. (Naut.) (a) A board or plank, with cleats for steps, forming a bridge by which to enter or leave a vessel. (b) A plank within or without the bulwarks of a vessel's waist, for the sentinel to walk on. -- Gang cask, a small cask in which to bring water aboard ships or in which it is kept on deck. -- Gang cultivator, Gang plow, a cultivator or plow in which several shares are attached to one frame, so as to make two or more furrows at the same time. -- Gang days, Rogation days; the time of perambulating parishes. See Gang week (below). -- Gang drill, a drilling machine having a number of drills driven from a common shaft. -- Gang master, a master or employer of a gang of workmen. -- Gang plank. See Gang board (above). -- Gang plow. See Gang cultivator (above). -- Gang press, a press for operating upon a pile or row of objects separated by intervening plates. -- Gang saw, a saw fitted to be one of a combination or gang of saws hung together in a frame or sash, and set at fixed distances apart. -- Gang tide. See Gang week (below). -- Gang tooth, a projecting tooth. [Obs.] Halliwell. -- Gang week, Rogation week, when formerly processions were made to survey the bounds of parishes. Halliwell. -- Live gang, or Round gang, the Western and the Eastern names, respectively, for a gang of saws for cutting the round log into boards at one operation. Knight. -- Slabbing gang, an arrangement of saws which cuts slabs from two sides of a log, leaving the middle part as a thick beam."}