{"word":"gas","definition":"1. An aëriform fluid; -- a term used at first by chemists as synonymous with air, but since restricted to fluids supposed to be permanently elastic, as oxygen, hydrogen, etc., in distinction from vapors, as steam, which become liquid on a reduction of temperature. In present usage, since all of the supposed permanent gases have been liquified by cold and pressure, the term has resumed nearly its original signification, and is applied to any substance in the elastic or aëriform state. 2. (Popular Usage) (a) A complex mixture of gases, of which the most important constituents are marsh gas, olefiant gas, and hydrogen, artificially produced by the destructive distillation of gas coal, or sometimes of peat, wood, oil, resin, etc. It gives a brilliant light when burned, and is the common gas used for illuminating purposes. (b) Laughing gas. (c) Any irrespirable aëriform fluid. Note: Gas is often used adjectively or in combination; as, gas fitter or gasfitter; gas meter or gas-meter, etc. Air gas (Chem.), a kind of gas made by forcing air through some volatile hydrocarbon, as the lighter petroleums. The air is so saturated with combustible vapor as to be a convenient illuminating and heating agent. -- Gas battery (Elec.), a form of voltaic battery, in which gases, especially hydrogen and oxygen, are the active agents. -- Gas carbon, Gas coke, etc. See under Carbon, Coke, etc. -- Gas coal, a bituminous or hydrogenous coal yielding a high percentage of volatile matters, and therefore available for the manufacture of illuminating gas. R. W. Raymond. -- Gas engine, an engine in which the motion of the piston is produced by the combustion or sudden production or expansion of gas; -- especially, an engine in which an explosive mixture of gas and air is forced into the working cylinder and ignited there by a gas flame or an electric spark. -- Gas fitter, one who lays pipes and puts up fixtures for gas. -- Gas fitting. (a) The occupation of a gas fitter. (b) pl. The appliances needed for the introduction of gas into a building, as meters, pipes, burners, etc. -- Gas fixture, a device for conveying illuminating or combustible gas from the pipe to the gas-burner, consisting of an appendage of cast, wrought, or drawn metal, with tubes upon which the burners, keys, etc., are adjusted. -- Gas generator, an apparatus in which gas is evolved; as: (a) a retort in which volatile hydrocarbons are evolved by heat; (b) a machine in which air is saturated with the vapor of liquid hydrocarbon; a carburetor; (c) a machine for the production of carbonic acid gas, for aërating water, bread, etc. Knight. -- Gas jet, a flame of illuminating gas. -- Gas machine, an apparatus for carbureting air for use as illuminating gas. -- Gas meter, an instrument for recording the quantity of gas consumed in a given time, at a particular place. -- Gas retort, a retort which contains the coal and other materials, and in which the gas is generated, in the manufacture of gas. -- Gas stove, a stove for cooking or other purposes, heated by gas. -- Gas tar, coal tar. -- Gas trap, a drain trap; a sewer trap. See 4th Trap, 5. -- Gas washer (Gas Works), an apparatus within which gas from the condenser is brought in contact with a falling stream of water, to precipitate the tar remaining in it. Knight. -- Gas water, water through which gas has been passed for purification; -- called also gas liquor and ammoniacal water, and used for the manufacture of sal ammoniac, carbonate of ammonia, and Prussian blue. Tomlinson. -- Gas well, a deep boring, from which natural gas is discharged. Raymond. -- Gas works, a manufactory of gas, with all the machinery and appurtenances; a place where gas is generated for lighting cities. -- Laughing gas. See under Laughing. -- Marsh gas (Chem.), a light, combustible, gaseous hydrocarbon, CH4, produced artificially by the dry distillation of many organic substances, and occurring as a natural product of decomposition in stagnant pools, whence its name. It is an abundant ingredient of ordinary illuminating gas, and is the first member of the paraffin series. Called also methane, and in coal mines, fire damp. -- Natural gas, gas obtained from wells, etc., in Pennsylvania, Ohio, and elsewhere, and largely used for fuel and illuminating purposes. It is chiefly derived from the Coal Measures. -- Olefiant gas (Chem.). See Ethylene. -- Water gas (Chem.), a kind of gas made by forcing steam over glowing coals, whereby there results a mixture of hydrogen and carbon monoxide. This gives a gas of intense heating power, but destitute of light-giving properties, and which is charged by passing through some volatile hydrocarbon, as gasoline.synthesis gas"}