{"word":"gauge","definition":"1. To measure or determine with a gauge. 2. To measure or to ascertain the contents or the capacity of, as of a pipe, barrel, or keg. 3. (Mech.)  To measure the dimensions of, or to test the accuracy of the form of, as of a part of a gunlock. The vanes nicely gauged on each side. Derham. 4. To draw into equidistant gathers by running a thread through it, as cloth or a garment. 5. To measure the capacity, character, or ability of; to estimate; to judge of. You shall not gauge me By what we do to-night. Shak.\n\n1. A measure; a standard of measure; an instrument to determine dimensions, distance, or capacity; a standard. This plate must be a gauge to file your worm and groove to equal breadth by. Moxon. There is not in our hands any fixed gauge of minds. I. Taylor. 2. Measure; dimensions; estimate. The gauge and dimensions of misery, depression, and contempt. Burke. 3. (Mach. & Manuf.)  Any instrument for ascertaining or regulating the dimensions or forms of things; a templet or template; as, a button maker's gauge. 4. (Physics)  Any instrument or apparatus for measuring the state of a phenomenon, or for ascertaining its numerical elements at any moment; -- usually applied to some particular instrument; as, a rain gauge; a steam gauge. 5. (Naut.) (a) Relative positions of two or more vessels with reference to the wind; as, a vessel has the weather gauge of another when on the windward side of it, and the lee gauge when on the lee side of it. (b) The depth to which a vessel sinks in the water. Totten. 6. The distance between the rails of a railway. Note: The standard gauge of railroads in most countries is four feet, eight and one half inches. Wide, or broad, gauge, in the United States, is six feet; in England, seven feet, and generally any gauge exceeding standard gauge. Any gauge less than standard gauge is now called narrow gauge. It varies from two feet to three feet six inches. 7. (Plastering)  The quantity of plaster of Paris used with common plaster to accelerate its setting. 8. (Building)  That part of a shingle, slate, or tile, which is exposed to the weather, when laid; also, one course of such shingles, slates, or tiles. Gauge of a carriage, car, etc., the distance between the wheels; -- ordinarily called the track. -- Gauge cock, a stop cock used as a try cock for ascertaining the height of the water level in a steam boiler. -- Gauge concussion (Railroads), the jar caused by a car-wheel flange striking the edge of the rail. -- Gauge glass, a glass tube for a water gauge. -- Gauge lathe, an automatic lathe for turning a round object having an irregular profile, as a baluster or chair round, to a templet or gauge. -- Gauge point, the diameter of a cylinder whose altitude is one inch, and contents equal to that of a unit of a given measure; -- a term used in gauging casks, etc. -- Gauge rod, a graduated rod, for measuring the capacity of barrels, casks, etc. -- Gauge saw, a handsaw, with a gauge to regulate the depth of cut. Knight. -- Gauge stuff, a stiff and compact plaster, used in making cornices, moldings, etc., by means of a templet. -- Gauge wheel, a wheel at the forward end of a plow beam, to determine the depth of the furrow. -- Joiner's gauge, an instrument used to strike a line parallel to the straight side of a board, etc. -- Printer's gauge, an instrument to regulate the length of the page. -- Rain gauge, an instrument for measuring the quantity of rain at any given place. -- Salt gauge, or Brine gauge, an instrument or contrivance for indicating the degree of saltness of water from its specific gravity, as in the boilers of ocean steamers. -- Sea gauge, an instrument for finding the depth of the sea. -- Siphon gauge, a glass siphon tube, partly filled with mercury, -- used to indicate pressure, as of steam, or the degree of rarefaction produced in the receiver of an air pump or other vacuum; a manometer. -- Sliding gauge. (Mach.) (a) A templet or pattern for gauging the commonly accepted dimensions or shape of certain parts in general use, as screws, railway-car axles, etc. (b) A gauge used only for testing other similar gauges, and preserved as a reference, to detect wear of the working gauges. (c) (Railroads) See Note under Gauge, n., 5. -- Star gauge (Ordnance), an instrument for measuring the diameter of the bore of a cannon at any point of its length. -- Steam gauge, an instrument for measuring the pressure of steam, as in a boiler. -- Tide gauge, an instrument for determining the height of the tides. -- Vacuum gauge, a species of barometer for determining the relative elasticities of the vapor in the condenser of a steam engine and the air. -- Water gauge. (a) A contrivance for indicating the height of a water surface, as in a steam boiler; as by a gauge cock or glass. (b) The height of the water in the boiler. -- Wind gauge, an instrument for measuring the force of the wind on any given surface; an anemometer. -- Wire gauge, a gauge for determining the diameter of wire or the thickness of sheet metal; also, a standard of size. See under Wire."}