{"word":"german","definition":"Nearly related; closely akin. Wert thou a leopard, thou wert german to the lion. Shak. Brother german. See Brother german. -- Cousins german. See the Note under Cousin.\n\n1. A native or one of the people of Germany. 2. The German language. 3. (a) A round dance, often with a waltz movement, abounding in capriciosly involved figures. (b) A social party at which the german is danced. High German, the Teutonic dialect of Upper or Southern Germany, -- comprising Old High German, used from the 8th to the 11th century; Middle H. G., from the 12th to the 15th century; and Modern or New H. G., the language of Luther's Bible version and of modern German literature. The dialects of Central Germany, the basis of the modern literary language, are often called Middle German, and the Southern German dialects Upper German; but High German is also used to cover both groups. -- Low German, the language of Northern Germany and the Netherlands, -- including Friesic; Anglo-Saxon or Saxon; Old Saxon; Dutch or Low Dutch, with its dialect, Flemish; and Plattdeutsch (called also Low German), spoken in many dialects.\n\nOf or pertaining to Germany. German Baptists. See Dunker. -- German bit, a wood-boring tool, having a long elliptical pod and a scew point. -- German carp (Zoöl.), the crucian carp. -- German millet (Bot.), a kind of millet (Setaria Italica, var.), whose seed is sometimes used for food. -- German paste, a prepared food for caged birds. -- German process (Metal.), the process of reducing copper ore in a blast furnace, after roasting, if necessary. Raymond. -- German sarsaparilla, a substitute for sarsaparilla extract. -- German sausage, a polony, or gut stuffed with meat partly cooked. -- German silver (Chem.), a silver-white alloy, hard and tough, but malleable and ductile, and quite permanent in the air. It contains nickel, copper, and zinc in varying proportions, and was originally made from old copper slag at Henneberg. A small amount of iron is sometimes added to make it whiter and harder. It is essentially identical with the Chinese alloy packfong. It was formerly much used for tableware, knife handles, frames, cases, bearings of machinery, etc., but is now largely superseded by other white alloys. -- German steel (Metal.), a metal made from bog iron ore in a forge, with charcoal for fuel. -- German text (Typog.), a character resembling modern German type, used in English printing for ornamental headings, etc., as in the words, Note: This line is German Text. -- German tinder. See Amadou."}