{"word":"get","definition":"Jet, the mineral. [Obs.] Chaucer.\n\n1. Fashion; manner; custom. [Obs.] Chaucer. 2. Artifice; contrivance. [Obs.] Chaucer.\n\n1. To procure; to obtain; to gain possession of; to acquire; to earn; to obtain as a price or reward; to come by; to win, by almost any means; as, to get favor by kindness; to get wealth by industry and economy; to get favor by kindness; to get wealth by industry and economy; to get land by purchase, etc. 2. Hence, with have and had, to come into or be in possession of; to have. Johnson. Thou hast got the face of man. Herbert. 3. To beget; to procreate; to generate. I had rather to adopt a child than get it. Shak. 4. To obtain mental possession of; to learn; to commit to memory; to memorize; as to get a lesson; also with out; as, to get out one's Greek lesson. It being harder with him to get one sermon by heart, than to pen twenty. Bp. Fell. 5. To prevail on; to induce; to persuade. Get him to say his prayers. Shak. 6. To procure to be, or to cause to be in any state or condition; -- with a following participle. Those things I bid you do; get them dispatched. Shak. 7. To betake; to remove; -- in a reflexive use. Get thee out from this land. Gen. xxxi. 13. He . . . got himself . . . to the strong town of Mega. Knolles. Note: Get, as a transitive verb, is combined with adverbs implying motion, to express the causing to, or the effecting in, the object of the verb, of the kind of motion indicated by the preposition; thus, to get in, to cause to enter, to bring under shelter; as, to get in the hay; to get out, to make come forth, to extract; to get off, to take off, to remove; to get together, to cause to come together, to collect. To get by heart, to commit to memory. -- To get the better of, To get the best of, to obtain an advantage over; to surpass; to subdue. -- To get up, to cause to be established or to exit; to prepare; to arrange; to construct; to invent; as, to get up a celebration, a machine, a book, an agitation. Syn. -- To obtain; gain; win; acquire. See Obtain.\n\n1. To make acquisition; to gain; to profit; to receive accessions; to be increased. We mourn, France smiles; we lose, they daily get. Shak. 2. To arrive at, or bring one's self into, a state, condition, or position; to come to be; to become; -- with a following adjective or past participle belonging to the subject of the verb; as, to get sober; to get awake; to get beaten; to get elected. To get rid of fools and scoundrels. Pope. His chariot wheels get hot by driving fast. Coleridge. Note: It [get] gives to the English language a middle voice, or a power of verbal expression which is neither active nor passive. Thus we say to get acquitted, beaten, confused, dressed. Earle. Note: Get, as an intransitive verb, is used with a following preposition, or adverb of motion, to indicate, on the part of the subject of the act, movement or action of the kind signified by the preposition or adverb; or, in the general sense, to move, to stir, to make one's way, to advance, to arrive, etc.; as, to get away, to leave to escape; to disengage one's self from; to get down, to descend, esp. with effort, as from a literal or figurative elevation; to get along, to make progress; hence, to prosper, succeed, or fare; to get in, to enter; to get out, to extricate one's self, to escape; to get through, to traverse; also, to finish, to be done; to get to, to arrive at, to reach; to get off, to alight, to descend from, to dismount; also, to escape, to come off clear; to get together, to assemble, to convene. To get ahead, to advance; to prosper. -- To get along, to proceed; to advance; to prosper. -- To get a mile (or other distance), to pass over it in traveling. -- To get among, to go or come into the company of; to become one of a number. -- To get asleep, to fall asleep. -- To get astray, to wander out of the right way. -- To get at, to reach; to make way to. To get away with, to carry off; to capture; hence, to get the better of; to defeat. -- To get back, to arrive at the place from which one departed; to return. -- To get before, to arrive in front, or more forward. -- To get behind, to fall in the rear; to lag. -- To get between, to arrive between. -- To get beyond, to pass or go further than; to exceed; to surpass. \"Three score and ten is the age of man, a few get beyond it.\" Thackeray. -- To get clear, to disengage one's self; to be released, as from confinement, obligation, or burden; also, to be freed from danger or embarrassment. -- To get drunk, to become intoxicated. -- To get forward, to proceed; to advance; also, to prosper; to advance in wealth. -- To get home, to arrive at one's dwelling, goal, or aim. -- To get into. (a) To enter, as, \"she prepared to get into the coach.\" Dickens. (b) To pass into, or reach; as, \" as, \" a language has got into the inflated state.\" Keary. -- To get loose or free, to disengage one's self; to be released from confinement. -- To get near, to approach within a small distance. -- To get on, to proceed; to advance; to prosper. -- To get over. (a) To pass over, surmount, or overcome, as an obstacle or difficulty. (b) To recover from, as an injury, a calamity. -- To get through. (a) To pass through something. (b) To finish what one was doing. -- To get up. (a) To rise; to arise, as from a bed, chair, etc. (b) To ascend; to climb, as a hill, a tree, a flight of stairs, etc.\n\nOffspring; progeny; as, the get of a stallion."}