{"word":"good","definition":"1. Possessing desirable qualities; adapted to answer the end designed; promoting success, welfare, or happiness; serviceable; useful; fit; excellent; admirable; commendable; not bad, corrupt, evil, noxious, offensive, or troublesome, etc. And God saw everything that he had made, and behold, it was very good. Gen. i. 31. Good company, good wine, good welcome. Shak. 2. Possessing moral excellence or virtue; virtuous; pious; religious; -- said of persons or actions. In all things showing thyself a pattern of good works. Tit. ii. 7. 3. Kind; benevolent; humane; merciful; gracious; polite; propitious; friendly; well-disposed; -- often followed by to or toward, also formerly by unto. The men were very good unto us. 1 Sam. xxv. 15. 4. Serviceable; suited; adapted; suitable; of use; to be relied upon; -- followed especially by for. All quality that is good for anything is founded originally in merit. Collier. 5. Clever; skillful; dexterous; ready; handy; -- followed especially by at. He . . . is a good workman; a very good tailor. Shak. Those are generally good at flattering who are good for nothing else. South. 6. Adequate; sufficient; competent; sound; not fallacious; valid; in a commercial sense, to be depended on for the discharge of obligations incurred; having pecuniary ability; of unimpaired credit. My reasons are both good and weighty. Shak. My meaning in saying he is a good man is . . . that he is sufficient . . . I think I may take his bond. Shak. 7. Real; actual; serious; as in the phrases in good earnest; in good sooth. Love no man in good earnest. Shak. 8. Not small, insignificant, or of no account; considerable; esp., in the phrases a good deal, a good way, a good degree, a good share or part, etc. 9. Not lacking or deficient; full; complete. Good measure, pressed down, and shaken together, and running over. Luke vi. 38. 10. Not blemished or impeached; fair; honorable; unsullied; as in the phrases a good name, a good report, good repute, etc. A good name is better than precious ointment. Eccl. vii. 1. As good as. See under As. -- For good, or For good and all, completely and finally; fully; truly. The good woman never died after this, till she came to die for good and all. L'Estrange. -- Good breeding, polite or polished manners, formed by education; a polite education. Distinguished by good humor and good breeding. Macaulay. -- Good cheap, literally, good bargain; reasonably cheap. -- Good consideration (Law). (a) A consideration of blood or of natural love and affection. Blackstone. (b) A valuable consideration, or one which will sustain a contract. -- Good fellow, a person of companionable qualities. [Familiar] -- Good folk, or Good people, fairies; brownies; pixies, etc. [Colloq. Eng. & Scot.] -- Good for nothing. (a) Of no value; useless; worthless. (b) Used substantively, an idle, worthless person. My father always said I was born to be a good for nothing. Ld. Lytton. -- Good Friday, the Friday of Holy Week, kept in some churches as a fast, in memoory of our Savior's passion or suffering; the anniversary of the crucifixion. -- Good humor, or Good-humor, a cheerful or pleasant temper or state of mind. -- Good nature, or Good-nature, habitual kindness or mildness of temper or disposition; amiability; state of being in good humor. The good nature and generosity which belonged to his character. Macaulay. The young count's good nature and easy persuadability were among his best characteristics. Hawthorne. -- Good people. See Good folk (above). -- Good speed, good luck; good success; godspeed; -- an old form of wishing success. See Speed. -- Good turn, an act of kidness; a favor. -- Good will. (a) Benevolence; well wishing; kindly feeling. (b) (Law) The custom of any trade or business; the tendency or inclination of persons, old customers and others, to resort to an established place of business; the advantage accruing from tendency or inclination. The good will of a trade is nothing more than the probability that the old customers will resort to the old place. Lord Eldon. -- In good time. (a) Promptly; punctually; opportunely; not too soon nor too late. (b) (Mus.) Correctly; in proper time. -- To hold good, to remain true or valid; to be operative; to remain in force or effect; as, his promise holds good; the condition still holds good. -- To make good, to fulfill; to establish; to maintain; to supply (a defect or deficiency); to indemmify; to prove or verify (an accusation); to prove to be blameless; to clear; to vindicate. Each word made good and true. Shak. Of no power to make his wishes good. Shak. I . . . would by combat make her good. Shak. Convenient numbers to make good the city. Shak. -- To think good, to approve; to be pleased or satisfied with; to consider expedient or proper. If ye think good, give me my price; and if not, forbear. Zech. xi. 12. Note: Good, in the sense of wishing well, is much used in greeting and leave-taking; as, good day, good night, good evening, good morning, etc.\n\n1. That which possesses desirable qualities, promotes success, welfare, or happiness, is serviceable, fit, excellent, kind, benevolent, etc.; -- opposed to evil. There be many that say, Who will show us any good Ps. iv. 6. 2. Advancement of interest or happiness; welfare; prosperity; advantage; benefit; -- opposed to harm, etc. The good of the whole community can be promoted only by advancing the good of each of the members composing it. Jay. 3. pl.  Wares; commodities; chattels; -- formerly used in the singular in a collective sense. In law, a comprehensive name for almost all personal property as distinguished from land or real property. Wharton. He hath made us spend much good. Chaucer. Thy lands and goods Are, by the laws of Venice, confiscate Unto the state of Venice. Shak. Dress goods, Dry goods, etc. See in the Vocabulary. -- Goods engine, a freight locomotive. [Eng.] -- Goods train, a freight train. [Eng.] -- Goods wagon, a freight car [Eng.] See the Note under Car, n., 2.\n\nWell, -- especially in the phrase as good, with a following as expressed or implied; equally well with as much advantage or as little harm as possible. As good almost kill a man as kill a good book. Milton. As good as, in effect; virtually; the same as. They who counsel ye to such a suppressing, do as good as bid ye suppress yourselves. Milton.\n\n1. To make good; to turn to good. [Obs.] 2. To manure; to improve. [Obs.] Bp. Hall."}