{"word":"goose","definition":"1. Any large web-footen bird of the subfamily Anserinæ, and belonging to Anser, Branta, Chen, and several allied genera. See Anseres. Note: The common domestic goose is believed to have been derived from the European graylag goose (Anser anser). The bean goose (A. segetum), the American wild or Canada goose (Branta Canadensis), and the bernicle goose (Branta leucopsis) are well known species. The American white or snow geese and the blue goose belong to the genus Chen. See Bernicle, Emperor goose, under Emperor, Snow goose, Wild goose, Brant. 2. Any large bird of other related families, resembling the common goose. Note: The Egyptian or fox goose (Alopochen Ægyptiaca) and the African spur-winged geese (Plectropterus) belong to the family Plectropteridæ. The Australian semipalmated goose (Anseranas semipalmata) and Cape Barren goose (Cereopsis Novæ-Hollandiæ) are very different from northern geese, and each is made the type of a distinct family. Both are domesticated in Australia. 3. A tailor's smoothing iron, so called from its handle, which resembles the neck of a goose. 4. A silly creature; a simpleton. 5. A game played with counters on a board divided into compartments, in some of which a goose was depicted. The pictures placed for ornament and use, The twelve good rules, the royal game of goose. Goldsmith. A wild goose chase, an attempt to accomplish something impossible or unlikely of attainment. -- Fen goose. See under Fen. -- Goose barnacle (Zoöl.), any pedunculated barnacle of the genus Anatifa or Lepas; -- called also duck barnacle. See Barnacle, and Cirripedia. -- Goose cap, a silly person. [Obs.] Beau. & . -- Goose corn (Bot.), a coarse kind of rush (Juncus squarrosus). -- Goose feast, Michaelmas. [Colloq. Eng.] -- Goose flesh, a peculiar roughness of the skin produced by cold or fear; -- called also goose skin.goose pimples and goose bumps -- Goose grass. (Bot.) (a) A plant of the genus Galium (G. Aparine), a favorite food of geese; -- called also catchweed and cleavers. (b) A species of knotgrass (Polygonum aviculare). (c) The annual spear grass (Poa annua). -- Goose neck, anything, as a rod of iron or a pipe, curved like the neck of a goose; specially (Naut.), an iron hook connecting a spar with a mast. -- Goose quill, a large feather or quill of a goose; also, a pen made from it. -- Goose skin. See Goose flesh, above. -- Goose tongue (Bot.), a composite plant (Achillea ptarmica), growing wild in the British islands. -- Sea goose. (Zoöl.) See Phalarope. -- Solan goose. (Zoöl.) See Gannet."}