{"word":"grace","definition":"1. The exercise of love, kindness, mercy, favor; disposition to benefit or serve another; favor bestowed or privilege conferred. To bow and sue for grace With suppliant knee. Milton. 2. (Theol.)  The divine favor toward man; the mercy of God, as distinguished from His justice; also, any benefits His mercy imparts; divine love or pardon; a state of acceptance with God; enjoyment of the divine favor. And if by grace, then is it no more of works. Rom. xi. 6. My grace is sufficicnt for thee. 2 Cor. xii. 9. Where sin abounded, grace did much more abound. Rom. v. 20. By whom also we have access by faith into this grace wherein we stand. Rom. v.2 3. (Law) (a) The prerogative of mercy execised by the executive, as pardon. (b) The same prerogative when exercised in the form of equitable relief through chancery. 4. Fortune; luck; -- used commonly with hard or sorry when it means misfortune. [Obs.] Chaucer. 5. Inherent excellence; any endowment or characteristic fitted to win favor or confer pleasure or benefit. He is complete in feature and in mind. With all good grace to grace a gentleman. Shak. I have formerly given the general character of Mr. Addison's style and manner as natural and unaffected, easy and polite, and full of those graces which a flowery imagination diffuses over writing. Blair. 6. Beauty, physical, intellectual, or moral; loveliness; commonly, easy elegance of manners; perfection of form. Grace in women gains the affections sooner, and secures them longer, than any thing else. Hazlitt. I shall answer and thank you again For the gift and the grace of the gift. Longfellow. 7. pl. (Myth.)  Graceful and beautiful females, sister goddesses, represented by ancient writers as the attendants sometimes of Apollo but oftener of Venus. They were commonly mentioned as three in number; namely, Aglaia, Euphrosyne, and Thalia, and were regarded as the inspirers of the qualities which give attractiveness to wisdom, love, and social intercourse. The Graces love to weave the rose. Moore. The Loves delighted, and the Graces played. Prior. 8. The title of a duke, a duchess, or an archbishop, and formerly of the king of England. How fares your Grace ! Shak. 9. (Commonly pl.)  Thanks. [Obs.] Yielding graces and thankings to their lord Melibeus. Chaucer. 10. A petition for grace; a blessing asked, or thanks rendered, before or after a meal. 11. pl. (Mus.)  Ornamental notes or short passages, either introduced by the performer, or indicated by the composer, in which case the notation signs are called grace notes, appeggiaturas, turns, etc. 12. (Eng. Universities)  An act, vote, or decree of the government of the institution; a degree or privilege conferred by such vote or decree. Walton. 13. pl.  A play designed to promote or display grace of motion. It consists in throwing a small hoop from one player to another, by means of two sticks in the hands of each. Called also grace hoop or hoops. Act of grace. See under Act. -- Day of grace (Theol.), the time of probation, when the offer of divine forgiveness is made and may be accepted. That day of grace fleets fast away. I. Watts. -- Days of grace (Com.), the days immediately following the day when a bill or note becomes due, which days are allowed to the debtor or payer to make payment in. In Great Britain and the United States, the days of grace are three, but in some countries more, the usages of merchants being different. -- Good graces, favor; friendship. -- Grace cup. (a) A cup or vessel in which a health is drunk after grace. (b) A health drunk after grace has been said. The grace cup follows to his sovereign's health. Hing. -- Grace drink, a drink taken on rising from the table; a grace cup. To [Queen Margaret, of Scotland] . . . we owe the custom of the grace drink, she having established it as a rule at her table, that whosoever staid till grace was said was rewarded with a bumper. Encyc. Brit. -- Grace hoop, a hoop used in playing graces. See Grace, n., 13. -- Grace note (Mus.), an appoggiatura. See Appoggiatura, and def. 11 above. -- Grace stroke, a finishing stoke or touch; a coup de grace. -- Means of grace, means of securing knowledge of God, or favor with God, as the preaching of the gospel, etc. -- To do grace, to reflect credit upon. Content to do the profession some grace. Shak. -- To say grace, to render thanks before or after a meal. -- With a good grace, in a fit and proper manner grace fully; graciously. -- With a bad grace, in a forced, reluctant, or perfunctory manner; ungraciously. What might have been done with a good grace would at least be done with a bad grace. Macaulay. Syn. -- Elegance; comeliness; charm; favor; kindness; mercy. -- Grace, Mercy. These words, though often interchanged, have each a distinctive and peculiar meaning. Grace, in the strict sense of the term, is spontaneous favor to the guilty or undeserving; mercy is kindness or compassion to the suffering or condemned. It was the grace of God that opened a way for the exercise of mercy toward men. See Elegance.\n\n1. To adorn; to decorate; to embellish and dignify. Great Jove and Phoebus graced his noble line. Pope. We are graced with wreaths of victory. Shak. 2. To dignify or raise by an act of favor; to honor. He might, at his pleasure, grace or disgrace whom he would in court. Knolles. 3. To supply with heavenly grace. Bp. Hall. 4. (Mus.) To add grace notes, cadenzas, etc., to."}