{"word":"grain","definition":"See Groan. [Obs.]\n\n1. A single small hard seed; a kernel, especially of those plants, like wheat, whose seeds are used for food. 2. The fruit of certain grasses which furnish the chief food of man, as corn, wheat, rye, oats, etc., or the plants themselves; -- used collectively. Storehouses crammed with grain. Shak. 3. Any small, hard particle, as of sand, sugar, salt, etc.; hence, any minute portion or particle; as, a grain of gunpowder, of pollen, of starch, of sense, of wit, etc. I . . . with a grain of manhood well resolved. Milton. 4. The unit of the English system of weights; -- so called because considered equal to the average of grains taken from the middle of the ears of wheat. 7,000 grains constitute the pound avoirdupois, and 5,760 grains the pound troy. A grain is equal to .0648 gram. See Gram. 5. A reddish dye made from the coccus insect, or kermes; hence, a red color of any tint or hue, as crimson, scarlet, etc.; sometimes used by the poets as equivalent to Tyrian purple. All in a robe of darkest grain. Milton. Doing as the dyers do, who, having first dipped their silks in colors of less value, then give' them the last tincture of crimson in grain. Quoted by Coleridge, preface to Aids to Reflection. 6. The composite particles of any substance; that arrangement of the particles of any body which determines its comparative roughness or hardness; texture; as, marble, sugar, sandstone, etc., of fine grain. Hard box, and linden of a softer grain. Dryden. 7. The direction, arrangement, or appearance of the fibers in wood, or of the strata in stone, slate, etc. Knots, by the conflux of meeting sap, Infect the sound pine and divert his grain Tortive and errant from his course of growth. Shak. 8. The fiber which forms the substance of wood or of any fibrous material. 9. The hair side of a piece of leather, or the marking on that side. Knight. 10. pl.  The remains of grain, etc., after brewing or distillation; hence, any residuum. Also called draff. 11. (Bot.)  A rounded prominence on the back of a sepal, as in the common dock. See Grained, a., 4. 12. Temper; natural disposition; inclination. [Obs.] Brothers . . . not united in grain. Hayward. 13. A sort of spice, the grain of paradise. [Obs.] He cheweth grain and licorice, To smellen sweet. Chaucer. Against the grain, against or across the direction of the fibers; hence, against one's wishes or tastes; unwillingly; unpleasantly; reluctantly; with difficulty. Swift.Saintsbury.-- A grain of allowance, a slight indulgence or latitude a small allowance. -- Grain binder, an attachment to a harvester for binding the grain into sheaves. -- Grain colors, dyes made from the coccus or kermes in sect. -- Grain leather. (a) Dressed horse hides. (b) Goat, seal, and other skins blacked on the grain side for women's shoes, etc. -- Grain moth (Zoöl.), one of several small moths, of the family Tineidæ (as Tinea granella and Butalis cereAlella), whose larvæ devour grain in storehouses. -- Grain side (Leather), the side of a skin or hide from which the hair has been removed; -- opposed to flesh side. -- Grains of paradise, the seeds of a species of amomum. -- grain tin, crystalline tin ore metallic tin smelted with charcoal. -- Grain weevil (Zoöl.), a small red weevil (Sitophilus granarius), which destroys stored wheat and othar grain, by eating out the interior. -- Grain worm (Zoöl.), the larva of the grain moth. See grain moth, above. -- In grain, of a fast color; deeply seated; fixed; innate; genuine. \"Anguish in grain.\" Herbert.-- To dye in grain, to dye of a fast color by means of the coccus or kermes grain [see Grain, n., 5]; hence, to dye firmly; also, to dye in the wool, or in the raw material. See under Dye. The red roses flush up in her cheeks . . . Likce crimson dyed in grain. Spenser. -- To go against the grain of (a person), to be repugnant to; to vex, irritate, mortify, or trouble.\n\n1. To paint in imitation of the grain of wood, marble, etc. 2. To form (powder, sugar, etc.) into grains. 3. To take the hair off (skins); to soften and raise the grain of (leather, etc.).\n\n1. To yield fruit. [Obs.] Gower. 2. To form grains, or to assume a granular ferm, as the result of crystallization; to granulate.\n\n1. A branch of a tree; a stalk or stem of a plant. [Obs.] G. Douglas. 2. A tine, prong, or fork. Specifically: (a) One the branches of a valley or of a river. (b) pl.  An iron first speak or harpoon, having four or more barbed points. 3. A blade of a sword, knife, etc. 4. (Founding)  A thin piece of metal, used in a mold to steady a core."}