{"word":"grass","definition":"1. Popularly: Herbage; the plants which constitute the food of cattle and other beasts; pasture. 2. (Bot.)  An endogenous plant having simple leaves, a stem generally jointed and tubular, the husks or glumes in pairs, and the seed single. Note: This definition includes wheat, rye, oats, barley, etc., and excludes clover and some other plants which are commonly called by the name of grass. The grasses form a numerous family of plants. 3. The season of fresh grass; spring. [Colloq.] Two years old next grass. Lathsm. 4. Metaphorically used for what is transitory. Surely the people is grass. Is. xl. 7. Note: The following list includes most of the grasses of the United States of special interest, except cereals. Many of these terms will be found with definitions in the Vocabulary. See Illustrations in Appendix. Barnyard grass, for hay. South. Panicum Grus-galli. Bent, pasture and hay. Agrostis, several species. Bermuda grass, pasture. South. Cynodon Dactylon. Black bent. Same as Switch grass (below). Blue bent, hay. North and West. Andropogon provincialis. Blue grass, pasture. Poa compressa. Blue joint, hay. Northwest. Aqropyrum glaucum. Buffalo grass, grazing. Rocky Mts., etc. (a) Buchloë dectyloides. (b) Same as Grama grass (below). Bunch grass, grazing. Far West. Eriocoma, Festuca, Stips, etc. Chess, or Cheat, a weed. Bromus secalinus, etc. Couch grass. Same as Quick grass (below). Crab grass, (a) Hay, in South. A weed, in North. Panicum sanguinale. (b) Pasture and hay. South. Eleusine Indica. Darnel (a) Bearded, a noxious weed. Lolium temulentum. (b) Common. Same as Rye grass (below). Drop seed, fair for forage and hay. Muhlenbergia, several species. English grass. Same as Redtop (below). Fowl meadow grass. (a) Pasture and hay. Poa serotina. (b) Hay, on moist land. Gryceria nervata. Gama grass, cut fodder. South. Tripsacum dactyloides. Grama grass, grazing. West and Pacific slope. Bouteloua oligostachya, etc. Great bunch grass, pasture and hay. Far West. Festuca scabrella. Guinea grass, hay. South. Panicum jumentorum. Herd's grass, in New England Timothy, in Pennsylvania and South Redtop. Indian grass. Same as Wood grass (below). Italian rye grass, forage and hay. Lolium Italicum. Johnson grass, grazing aud hay. South and Southwest. Sorghum Halepense. Kentucky blue grass, pasture. Poa pratensis. Lyme grass, coarse hay. South. Elymus, several species. Manna grass, pasture and hay. Glyceria, several species. Meadow fescue, pasture and hay. Festuca elatior. Meadow foxtail, pasture, hay, lawn. North. Alopecurus pratensis. Meadow grass, pasture, hay, lawn. Poa, several species. Mesquite, or Muskit grass. Same as Grama grass (above). Nimble Will, a kind of drop seed. Muhlenbergia diffsa. Orchard grass, pasture and hay. Dactylis glomerata. Porcupine grass, troublesome to sheep. Northwest. Stipa spartea. Quaking grass, ornamental. Briza media and maxima. Quitch, or Quick, grass, etc., a weed. Agropyrum repens. Ray grass. Same as Rye grass (below). Redtop, pasture and hay. Agrostis vulgaris. Red-topped buffalo grass, forage. Northwest. Poa tenuifolia. Reed canary grass, of slight value. Phalaris arundinacea. Reed meadow grass, hay. North. Glyceria aquatica. Ribbon grass, a striped leaved form of Reed canary grass. Rye grass, pasture, hay. Lolium perenne, var. Seneca grass, fragrant basket work, etc. North. Hierochloa borealis. Sesame grass. Same as Gama grass (above). Sheep's fescue, sheep pasture, native in Northern Europe and Asia. Festuca ovina. Small reed grass, meadow pasture and hay. North. Deyeuxia Canadensis. Spear grass, Same as Meadow grass (above). Squirrel-tail grass, troublesome to animals. Seacoast and Northwest. Hordeum jubatum. Switch grass, hay, cut young. Panicum virgatum. Timothy, cut young, the best of hay. North. Phleum pratense. Velvet grass, hay on poor soil. South. Holcus lanatus. Vernal grass, pasture, hay, lawn. Anthoxanthum odoratum. Wire grass, valuable in pastures. Poa compressa. Wood grass, Indian grass, hay. Chrysopogon nutans. Note: Many plants are popularly called grasses which are not true grasses botanically considered, such as black grass, goose grass, star grass, etc. Black grass, a kind of small rush (Juncus Gerardi), growing in salt marshes, used for making salt hay. -- Grass of the Andes, an oat grass, the Arrhenatherum avenaceum of Europe.-- Grass of Parnassus, a plant of the genus Parnassia growing in wet ground. The European species is P. palustris; in the United States there are several species. -- Grass bass (Zoöl.), the calico bass. -- Grass bird, the dunlin. -- Grass cloth, a cloth woven from the tough fibers of the grass- cloth plant. -- Grass-cloth plant, a perennial herb of the Nettle family (Boehmeria nivea or Urtica nivea), which grows in Sumatra, China, and Assam, whose inner bark has fine and strong fibers suited for textile purposes. -- Grass finch. (Zoöl.) (a) A common American sparrow (Poöcætes gramineus); -- called also vesper sparrow and bay-winged bunting. (b) Any Australian finch, of the genus Poëphila, of which several species are known. -- Grass lamb, a lamb suckled by a dam running on pasture land and giving rich milk.-- Grass land, land kept in grass and not tilled. -- Grass moth (Zoöl.), one of many small moths of the genus Crambus, found in grass. -- Grass oil, a fragrant essential volatile oil, obtained in India from grasses of the genus Andropogon, etc.; -- used in perfumery under the name of citronella, ginger grass oil, lemon grass oil, essence of verbena etc. -- Grass owl (Zoöl.), a South African owl (Strix Capensis). -- Grass parrakeet (Zoöl.), any of several species of Australian parrots, of the genus Euphemia; -- also applied to the zebra parrakeet. -- Grass plover (Zoöl.), the upland or field plover. -- Grass poly (Bot.), a species of willowwort (Lythrum Hyssopifolia). Johnson. -- Crass quit (Zoöl.), one of several tropical American finches of the genus Euetheia. The males have most of the head and chest black and often marked with yellow.-- Grass snake. (Zoöl.) (a) The common English, or ringed, snake (Tropidonotus natrix). (b) The common green snake of the Northern United States. See Green snake, under Green. -- Grass snipe (Zoöl.), the pectoral sandpiper (Tringa maculata) -- called also jacksnipe in America. -- Grass spider (Zoöl.), a common spider (Agelena nævia), which spins flat webs on grass, conspicuous when covered with dew. -- Grass sponge (Zoöl.), an inferior kind of commercial sponge from Florida and the Bahamas. -- Grass table. (Arch.) See Earth table, under Earth. -- Grass vetch (Bot.), a vetch (Lathyrus Nissolia), with narrow grasslike leaves. -- Grass widow. Etym: [Cf. Prov. R. an unmarried mother, G. strohwittwe a mock widow, Sw. gräsenka a grass widow.] (a) An unmarried woman who is a mother. [Obs.] (b) A woman separated from her husband by abandonment or prolonged absence; a woman living apart from her husband. [Slang.] -- Grass wrack (Bot.) eelgrass. -- To bring to grass (Mining.), to raise, as ore, to the surface of the ground. -- To put to grass, To put out to grass, to put out to graze a season, as cattle.\n\n1. To cover with grass or with turf. 2. To expose, as flax, on the grass for bleaching, etc. 3. To bring to the grass or ground; to land; as, to grass a fish. [Colloq.]\n\nTo produce grass. [R.] Tusser."}