{"word":"gray","definition":"1. White mixed with black, as the color of pepper and salt, or of ashes, or of hair whitened by age; sometimes, a dark mixed color; as, the soft gray eye of a dove. These gray and dun colors may be also produced by mixing whites and blacks. Sir I. Newton. 2. Gray-haired; gray-headed; of a gray color; hoary. 3. Old; mature; as, gray experience. Ames. Gray antimony (Min.), stibnite. -- Gray buck (Zoöl.), the chickara. -- Gray cobalt (Min.), smaltite. -- Gray copper (Min.), tetrahedrite. -- Gray duck (Zoöl.), the gadwall; also applied to the female mallard. -- Gray falcon (Zoöl.) the peregrine falcon. -- Gray Friar. See Franciscan, and Friar. -- Gray hen (Zoöl.), the female of the blackcock or black grouse. See Heath grouse. -- Gray mill or millet (Bot.), a name of several plants of the genus Lithospermum; gromwell. -- Gray mullet (Zoöl.) any one of the numerous species of the genus Mugil, or family Mugilidæ, found both in the Old World and America; as the European species (M. capito, and M. auratus), the American striped mullet (M. albula), and the white or silver mullet (M. Braziliensis). See Mullet. -- Gray owl (Zoöl.), the European tawny or brown owl (Syrnium aluco). The great gray owl (Ulula cinerea) inhabits arctic America. -- Gray parrot (Zoöl.), a parrot (Psittacus erithacus), very commonly domesticated, and noted for its aptness in learning to talk. -- Gray pike. (Zoöl.) See Sauger. -- Gray snapper (Zoöl.), a Florida fish; the sea lawyer. See Snapper. -- Gray snipe (Zoöl.), the dowitcher in winter plumage. -- Gray whale (Zoöl.), a rather large and swift California whale (Rhachianectes glaucus), formerly taken in large numbers in the bays; -- called also grayback, devilfish, and hardhead.\n\n1. A gray color; any mixture of white and black; also, a neutral or whitish tint. 2. An animal or thing of gray color, as a horse, a badger, or a kind of salmon. Woe worth the chase, woe worth the day. That coats thy life, my gallant gray. Sir W. Scott."}