{"word":"great","definition":"1. Large in space; of much size; big; immense; enormous; expanded; -- opposed to small and little; as, a great house, ship, farm, plain, distance, length. 2. Large in number; numerous; as, a great company, multitude, series, etc. 3. Long continued; lengthened in duration; prolonged in time; as, a great while; a great interval. 4. Superior; admirable; commanding; -- applied to thoughts, actions, and feelings. 5. Endowed with extraordinary powers; uncommonly gifted; able to accomplish vast results; strong; powerful; mighty; noble; as, a great hero, scholar, genius, philosopher, etc. 6. Holding a chief position; elevated: lofty: eminent; distingushed; formost; principal; as, great men; the great seal; the great marshal, etc. He doth object I am too great of birth. Shak. 7. Entitled to earnest consideration; weighty; important; as, a great argument, truth, or principle. 8. Pregnant; big (with young). The ewes great with young. Ps. lxxviii. 71. 9. More than ordinary in degree; very considerable in degree; as, to use great caution; to be in great pain. We have all Great cause to give great thanks. Shak. 10. (Genealogy) Older, younger, or more remote, by single generation; -- often used before grand to indicate one degree more remote in the direct line of de scent; as, great-grandfather (a grandfather's or a grand- mother's father), great-grandson, etc. Great bear (Astron.), the constellation Ursa Major. -- Great cattle (Law), all manner of cattle except sheep and yearlings. Wharton. -- Great charter (Eng. Hist.), Magna Charta. -- Great circle of a sphere, a circle the plane of which passes through the center of the sphere. -- Great circle sailing, the process or art of conducting a ship on a great circle of the globe or on the shortest arc between two places. -- Great go, the final examination for a degree at the University of Oxford, England; -- called also greats. T. Hughes. -- Great guns. (Naut.) See under Gun. -- The Great Lakes the large fresh-water lakes (Lakes Superior, Michigan, Huron, Erie, and Ontario) which lie on the northern borders of the United States. -- Great master. Same as Grand master, under Grand. -- Great organ (Mus.), the largest and loudest of the three parts of a grand organ (the others being the choir organ and the swell, and sometimes the pedal organ or foot keys), It is played upon by a separate keyboard, which has the middle position. -- The great powers (of Europe), in modern diplomacy, Great Britain, France, Germany, Austria, Russia, and Italy. -- Great primer. See under Type. -- Great scale (Mus.), the complete scale; -- employed to designate the entire series of musical sounds from lowest to highest. -- Great sea, the Mediterranean sea. In Chaucer both the Black and the Mediterranean seas are so called. -- Great seal. (a) The principal seal of a kingdom or state. (b) In Great Britain, the lord chancellor (who is custodian of this seal); also, his office. -- Great tithes. See under Tithes. -- The great, the eminent, distinguished, or powerful. -- The Great Spirit, among the North American Indians, their chief or principal deity. -- To be great (with one), to be intimate or familiar (with him). Bacon.\n\nThe whole.; the gross; as, a contract to build a ship by the great."}