{"word":"green","definition":"1. Having the color of grass when fresh and growing; resembling that color of the solar spectrum which is between the yellow and the blue; verdant; emerald. 2. Having a sickly color; wan. To look so green and pale. Shak. 3. Full of life aud vigor; fresh and vigorous; new; recent; as, a green manhood; a green wound. As valid against such an old and beneficent government as against . . . the greenest usurpation. Burke. 4. Not ripe; immature; not fully grown or ripened; as, green fruit, corn, vegetables, etc. 5. Not roasted; half raw. [R.] We say the meat is green when half roasted. L. Watts. 6. Immature in age or experience; young; raw; not trained; awkward; as, green in years or judgment. I might be angry with the officious zeal which supposes that its green conceptions can instruct my gray hairs. Sir W. Scott. 7. Not seasoned; not dry; containing its natural juices; as, green wood, timber, etc. Shak. Green brier (Bot.), a thorny climbing shrub (Emilaz rotundifolia) having a yellowish green stem and thick leaves, with small clusters of flowers, common in the United States; -- called also cat brier. -- Green con (Zoöl.), the pollock. -- Green crab (Zoöl.), an edible, shore crab (Carcinus menas) of Europe and America; -- in New England locally named joe-rocker. -- Green crop, a crop used for food while in a growing or unripe state, as distingushed from a grain crop, root crop, etc. -- Green diallage. (Min.) (a) Diallage, a variety of pyroxene. (b) Smaragdite. -- Green dragon (Bot.), a North American herbaceous plant (Arisæma Dracontium), resembling the Indian turnip; -- called also dragon root. -- Green earth (Min.), a variety of glauconite, found in cavities in amygdaloid and other eruptive rock, and used as a pigment by artists; -- called also mountain green. -- Green ebony. (a) A south American tree (Jacaranda ovalifolia), having a greenish wood, used for rulers, turned and inlaid work, and in dyeing. (b) The West Indian green ebony. See Ebony. -- Green fire (Pyrotech.), a composition which burns with a green flame. It consists of sulphur and potassium chlorate, with some salt of barium (usually the nitrate), to which the color of the flame is due. -- Green fly (Zoöl.), any green species of plant lice or aphids, esp. those that infest greenhouse plants. -- Green gage, (Bot.) See Greengage, in the Vocabulary. -- Green gland (Zoöl.), one of a pair of large green glands in Crustacea, supposed to serve as kidneys. They have their outlets at the bases of the larger antennæ. -- Green hand, a novice. [Colloq.] -- Green heart (Bot.), the wood of a lauraceous tree found in the West Indies and in South America, used for shipbuilding or turnery. The green heart of Jamaica and Guiana is the Nectandra Rodioei, that of Martinique is the Colubrina ferruginosa. -- Green iron ore (Min.) dufrenite. -- Green laver (Bot.), an edible seaweed (Ulva latissima); -- called also green sloke. -- Green lead ore (Min.), pyromorphite. -- Green linnet (Zoöl.), the greenfinch. -- Green looper (Zoöl.), the cankerworm. -- Green marble (Min.), serpentine. -- Green mineral, a carbonate of copper, used as a pigment. See Greengill. -- Green monkey (Zoöl.) a West African long-tailed monkey (Cercopithecus callitrichus), very commonly tamed, and trained to perform tricks. It was introduced into the West Indies early in the last century, and has become very abundant there. -- Green salt of Magnus (Old Chem.), a dark green crystalline salt, consisting of ammonia united with certain chlorides of platinum. -- Green sand (Founding) molding sand used for a mold while slightly damp, and not dried before the cast is made. -- Green sea (Naut.), a wave that breaks in a solid mass on a vessel's deck. -- Green sickness (Med.), chlorosis. -- Green snake (Zoöl.), one of two harmless American snakes (Cyclophis vernalis, and C. æstivus). They are bright green in color. -- Green turtle (Zoöl.), an edible marine turtle. See Turtle. -- Green vitriol. (a) (Chem.) Sulphate of iron; a light green crystalline substance, very extensively used in the preparation of inks, dyes, mordants, etc. (b) (Min.) Same as copperas, melanterite and sulphate of iron. -- Green ware, articles of pottery molded and shaped, but not yet baked. -- Green woodpecker (Zoöl.), a common European woodpecker (Picus viridis); -- called also yaffle.\n\n1. The color of growing plants; the color of the solar spectrum intermediate between the yellow and the blue. 2. A grassy plain or plat; a piece of ground covered with verdant herbage; as, the village green. O'er the smooth enameled green. Milton. 3. Fresh leaves or branches of trees or other plants; wreaths; -- usually in the plural. In that soft season when descending showers Call forth the greens, and wake the rising flowers. Pope. 4. pl. Leaves and stems of young plants, as spinach, beets, etc., which in their green state are boiled for food. 5. Any substance or pigment of a green color. Alkali green (Chem.), an alkali salt of a sulphonic acid derivative of a complex aniline dye, resembling emerald green; -- called also Helvetia green.-- Berlin green. (Chem.) See under Berlin. -- Brilliant green (Chem.), a complex aniline dye, resembling emerald green in composition. -- Brunswick green an oxychloride of copper. -- Chrome green. See under Chrome. -- Emerald green. (Chem.) (a) A complex basic derivative of aniline produced as a metallic, green crystalline substance, and used for dyeing silk, wool, and mordanted vegetable fiber a brilliant green; - - called also aldehyde green, acid green, malachite green, Victoria green, solid green, etc. It is usually found as a double chloride, with zinc chloride, or as an oxalate. (b) See Paris green (below). -- Gaignet's green (Chem.) a green pigment employed by the French artist, Adrian Gusgnet, and consisting essentially of a basic hydrate of chromium. -- Methyl green (Chem.), an artificial rosaniline dyestuff, obtained as a green substance having a brilliant yellow luster; -- called also light-green. -- Mineral green. See under Mineral. -- Mountain green. See Green earth, under Green, a. -- Paris green (Chem.), a poisonous green powder, consisting of a mixture of several double salts of the acetate and arsenite of copper. It has found very extensive use as a pigment for wall paper, artificial flowers, etc., but particularly as an exterminator of insects, as the potato bug; -- called also Schweinfurth green, imperial green, Vienna green, emerald qreen, and mitis green. -- Scheele's green (Chem.), a green pigment, consisting essentially of a hydrous arsenite of copper; -- called also Swedish green. It may enter into various pigments called parrot green, pickel green, Brunswick green, nereid green, or emerald green.\n\nTo make green. Great spring before Greened all the year. Thomson.\n\nTo become or grow green. Tennyson. By greening slope and singing flood. Whittier."}