{"word":"guard","definition":"1. To protect from danger; to secure against surprise, attack, or injury; to keep in safety; to defend; to shelter; to shield from surprise or attack; to protect by attendance; toaccompany for protection; to vare for. For Heaven still guards the right. Shak. 2. To keep watch over, in order to prevent escape or restrain from acts of violence, or the like. 3. To protect the edge of, esp. with an ornamental border; hence, to face or ornament with lists, laces, etc. The body of your discourse it sometime guarded with fragments, and the guards are but slightly basted on neither. Shak. 4. To fasten by binding; to gird. [Obs.] B. Jonson. Syn. -- To defend, protect, shield; keep; watch.\n\nTo watch by way of caution or defense; to be caution; to be in a state or position of defense or safety; as, careful persons guard against mistakes.\n\n1. One who, or that which, guards from injury, danger, exposure, or attack; defense; protection. His greatness was no guard to bar heaven's shaft. Shak. 2. A man, or body of men, stationed to protect or control a person or position; a watch; a sentinel. The guard which kept the door of the king's house. Kings xiv. 27. 3. One who has charge of a mail coach or a railway train; a conductor. [Eng.] 4. Any fixture or attachment designed to protect or secure against injury, soiling, or defacement, theft or loss; as: (a) That part of a sword hilt which protects the hand. (b) Ornamental lace or hem protecting the edge of a garment. (c) A chain or cord for fastening a watch to one's person or dress. (d) A fence or rail to prevent falling from the deck of a vessel. (e) An extension of the deck of a vessel beyond the hull; esp., in side-wheel steam vessels, the framework of strong timbers, which curves out on each side beyond the paddle wheel, and protects it and the shaft against collision. (f) A plate of metal, beneath the stock, or the lock frame, of a gun or pistol, having a loop, called a bow, to protect the trigger. (g) (Bookbinding) An interleaved strip at the back, as in a scrap book, to guard against its breaking when filled. 5. A posture of defense in fencing, and in bayonet and saber exercise. 6. An expression or admission intended to secure against objections or censure. They have expressed themselves with as few guards and restrictions as I. Atterbury. 7. Watch; heed; care; attention; as, to keep guard. 8. (Zoöl.)  The fibrous sheath which covers the phragmacone of the Belemnites. Note: Guard is often used adjectively or in combination; as, guard boat or guardboat; guardroom or guard room; guard duty. Advanced guard, Coast guard, etc. See under Advanced, Coast, etc. -- Grand guard (Mil.), one of the posts of the second line belonging to a system of advance posts of an army. Mahan. -- Guard boat. (a) A boat appointed to row the rounds among ships of war in a harbor, to see that their officers keep a good lookout. (b) A boat used by harbor authorities to enforce the observance of quarantine regulations. -- Guard cells (Bot.), the bordering cells of stomates; they are crescent-shaped and contain chlorophyll. -- Guard chamber, a guardroom. -- Guard detail (Mil.men from a company regiment etc., detailed for guard duty. -- Guard duty (Mil.), the duty of watching patrolling, etc., performed by a sentinel or sentinels. -- Guard lock (Engin.), a tide lock at the mouth of a dock or basin. -- Guard of honor (Mil.), a guard appointed to receive or to accompany eminent persons. -- Guard rail (Railroads), a rail placed on the inside of a main rail, on bridges, at switches, etc., as a safeguard against derailment. -- Guard ship, a war vessel appointed to superintend the marine affairs in a harbor, and also, in the English service, to receive seamen till they can be distributed among their respective ships. -- Life guard (Mil.), a body of select troops attending the person of a prince or high officer. -- Off one's guard, in a careless state; inattentive; unsuspicious of danger. -- On guard, serving in the capacity of a guard; doing duty as a guard or sentinel; watching. -- On one's guard, in a watchful state; alert; vigilant. -- To mount guard (Mil.), to go on duty as a guard or sentinel. -- To run the guard, to pass the watch or sentinel without leave. Syn. -- Defense; shield; protection; safeguard; convoy; escort; care; attention; watch; heed."}