{"word":"guide","definition":"1. To lead or direct in a way; to conduct in a course or path; to pilot; as, to guide a traveler. I wish . . . you 'ld guide me to your sovereign's court. Shak. 2. To regulate and manage; to direct; to order; to superintend the training or education of; to instruct and influence intellectually or morally; to train. He will guide his affairs with discretion. Ps. cxii. 5. The meek will he guide in judgment. Ps. xxv. 9.\n\n1. A person who leads or directs another in his way or course, as in a strange land; one who exhibits points of interest to strangers; a conductor; also, that which guides; a guidebook. 2. One who, or that which, directs another in his conduct or course of lifo; a director; a regulator. He will be our guide, even unto death. Ps. xlviii. 14. 3. Any contrivance, especially one having a directing edge, surface, or channel, for giving direction to the motion of anything, as water, an instrument, or part of a machine, or for directing the hand or eye, as of an operator; as: (a) (Water Wheels) A blade or channel for directing the flow of water to the wheel buckets. (b) (Surgery)  A grooved director for a probe or knife. (c) (Printing) A strip or device to direct the compositor's eye to the line of copy he is setting. 4. (Mil.)  A noncommissioned officer or soldier placed on the directiug flank of each subdivision of a column of troops, or at the end of a line, to mark the pivots, formations, marches, and alignments in tactics. Farrow. Guide bar (Mach.), the part of a steam engine on which the crosshead slides, and by which the motion of the piston rod is kept parallel to the cylinder, being a substitute for the parallel motion; -- called also guide, and slide bar. -- Guide block (Steam Engine), a block attached in to the crosshead to work in contact with the guide bar. -- Guide meridian. (Surveying) See under Meridian. -- Guide pile (Engin.), a pile driven to mark a place, as a point to work to. -- Guide pulley (Mach.), a pulley for directing or changing the line of motion of belt; an idler. Knight. -- Guide rail (Railroads), an additional rail, between the others, gripped by horizontal driving wheels on the locomotive, as a means of propulsion on steep gradients."}