{"word":"gum","definition":"The dense tissues which invest the teeth, and cover the adjacent parts of the jaws. Gum rash (Med.), strophulus in a teething child; red gum. -- Gum stick, a smooth hard substance for children to bite upon while teething.\n\nTo deepen and enlarge the spaces between the teeth of (a worn saw). See Gummer.\n\n1. A vegetable secretion of many trees or plants that hardens when it exudes, but is soluble in water; as, gum arabic; gum tragacanth; the gum of the cherry tree. Also, with less propriety, exudations that are not soluble in water; as, gum copal and gum sandarac, which are really resins. 2. (Bot.)  See Gum tree, below. 3. A hive made of a section of a hollow gum tree; hence, any roughly made hive; also, a vessel or bin made of a hollow log. [Southern U. S.] 4. A rubber overshoe. [Local, U. S.] Black gum, Blue gum, British gum, etc. See under Black, Blue, etc. -- Gum Acaroidea, the resinous gum of the Australian grass tree (Xanlhorrhoea). -- Gum animal (Zoöl.), the galago of West Africa; -- so called because it feeds on gums. See Galago. -- Gum animi or animé. See Animé. -- Gum arabic, a gum yielded mostly by several species of Acacia (chiefly A. vera and A. Arabica) growing in Africa and Southern Asia; -- called also gum acacia. East Indian gum arabic comes from a tree of the Orange family which bears the elephant apple. -- Gum butea, a gum yielded by the Indian plants Butea frondosa and B. superba, and used locally in tanning and in precipitating indigo. -- Gum cistus, a plant of the genus Cistus (Cistus ladaniferus), a species of rock rose.-- Gum dragon. See Tragacanth. -- Gum elastic, Elastic gum. See Caoutchouc. -- Gum elemi. See Elemi. -- Gum juniper. See Sandarac. -- Gum kino. See under Kino. -- Gum lac. See Lac. -- Gum Ladanum, a fragrant gum yielded by several Oriental species of Cistus or rock rose. -- Gum passages, sap receptacles extending through the parenchyma of certain plants (Amygdalaceæ, Cactaceæ, etc.), and affording passage for gum. -- Gum pot, a varnish maker's utensil for melting gum and mixing other ingredients. -- Gum resin, the milky juice of a plant solidified by exposure to air; one of certain inspissated saps, mixtures of, or having properties of, gum and resin; a resin containing more or less mucilaginous and gummy matter. -- Gum sandarac. See Sandarac. -- Gum Senegal, a gum similar to gum arabic, yielded by trees (Acacia Verek and A. Adansoniä) growing in the Senegal country, West Africa. -- Gum tragacanth. See Tragacanth. -- Gum tree, the name given to several trees in America and Australia: (a) The black gum (Nyssa multiflora), one of the largest trees of the Southern States, bearing a small blue fruit, the favorite food of the opossum. Most of the large trees become hollow. (b) A tree of the genus Eucalyptus. See Eucalpytus. (c) The sweet gum tree of the United States (Liquidambar styraciflua), a large and beautiful tree with pointedly lobed leaves and woody burlike fruit. It exudes an aromatic terebinthine juice. -- Gum water, a solution of gum, esp. of gum arabic, in water. -- Gum wood, the wood of any gum tree, esp. the wood of the Eucalyptus piperita, of New South Wales.\n\nTo smear with gum; to close with gum; to unite or stiffen by gum or a gumlike substance; to make sticky with a gumlike substance. He frets likke a gummed velvet.Shak.\n\nTo exude or from gum; to become gummy."}