{"word":"gun","definition":"1. A weapon which throws or propels a missile to a distance; any firearm or instrument for throwing projectiles by the explosion of gunpowder, consisting of a tube or barrel closed at one end, in which the projectile is placed, with an explosive charge behind, which is ignited by various means. Muskets, rifles, carbines, and fowling pieces are smaller guns, for hand use, and are called small arms. Larger guns are called cannon, ordnance, fieldpieces, carronades, howitzers, etc. See these terms in the Vocabulary. As swift as a pellet out of a gunne When fire is in the powder runne. Chaucer. The word gun was in use in England for an engine to cast a thing from a man long before there was any gunpowder found out. Selden. 2. (Mil.)  A piece of heavy ordnance; in a restricted sense, a cannon. 3. pl. (Naut.)  Violent blasts of wind. Note: Guns are classified, according to their construction or manner of loading as rifled or smoothbore, breech-loading or muzzle-loading, cast or built-up guns; or according to their use, as field, mountain, prairie, seacoast, and siege guns. Armstrong gun, a wrought iron breech-loading cannon named after its English inventor, Sir William Armstrong. -- Great gun, a piece of heavy ordnance; hence (Fig.), a person superior in any way. -- Gun barrel, the barrel or tube of a gun. -- Gun carriage, the carriage on which a gun is mounted or moved. -- Gun cotton (Chem.), a general name for a series of explosive nitric ethers of cellulose, obtained by steeping cotton in nitric and sulphuric acids. Although there are formed substances containing nitric acid radicals, yet the results exactly resemble ordinary cotton in appearance. It burns without ash, with explosion if confined, but quietly and harmlessly if free and open, and in small quantity. Specifically, the lower nitrates of cellulose which are insoluble in ether and alcohol in distinction from the highest (pyroxylin) which is soluble. See Pyroxylin, and cf. Xyloidin. The gun cottons are used for blasting and somewhat in gunnery: for making celluloid when compounded with camphor; and the soluble variety (pyroxylin) for making collodion. See Celluloid, and Collodion. Gun cotton is frequenty but improperly called nitrocellulose. It is not a nitro compound, but an ethereal salt of nitric acid. -- Gun deck. See under Deck. -- Gun fire, the time at which the morning or the evening gun is fired. -- Gun metal, a bronze, ordinarily composed of nine parts of copper and one of tin, used for cannon, etc. The name is also given to certain strong mixtures of cast iron. -- Gun port (Naut.), an opening in a ship through which a cannon's muzzle is run out for firing. -- Gun tackle (Naut.), the blocks and pulleys affixed to the side of a ship, by which a gun carriage is run to and from the gun port. -- Gun tackle purchase (Naut.), a tackle composed of two single blocks and a fall. Totten. -- Krupp gun, a wrought steel breech-loading cannon, named after its German inventor, Herr Krupp. -- Machine gun, a breech-loading gun or a group of such guns, mounted on a carriage or other holder, and having a reservoir containing cartridges which are loaded into the gun or guns and fired in rapid succession, sometimes in volleys, by machinery operated by turning a crank. Several hundred shots can be fired in a minute with accurate aim. The Gatling gun, Gardner gun, Hotchkiss gun, and Nordenfelt gun, named for their inventors, and the French mitrailleuse, are machine guns. -- To blow great guns (Naut.), to blow a gale. See Gun, n., 3.\n\nTo practice fowling or hunting small game; -- chiefly in participial form; as, to go gunning."}