{"word":"half","definition":"1. Consisting of a moiety, or half; as, a half bushel; a half hour; a half dollar; a half view. Note: The adjective and noun are often united to form a compound. 2. Consisting of some indefinite portion resembling a half; approximately a half, whether more or less; partial; imperfect; as, a half dream; half knowledge. Assumed from thence a half consent. Tennyson. Half ape (Zoöl.), a lemur. -- Half back. (Football) See under 2d Back. -- Half bent, the first notch, for the sear point to enter, in the tumbler of a gunlock; the halfcock notch. -- Half binding, a style of bookbinding in which only the back and corners are in leather. -- Half boarder, one who boards in part; specifically, a scholar at a boarding school who takes dinner only. -- Half-breadth plan (Shipbuilding), a horizontal plan of the half a vessel, divided lengthwise, showing the lines. -- Half cadence (Mus.), a cadence on the dominant. -- Half cap, a slight salute with the cap. [Obs.] Shak. -- A half cock, the position of the cock of a gun when retained by the first notch. -- Half hitch, a sailor's knot in a rope; half of a clove hitch. -- Half hose, short stockings; socks. -- Half measure, an imperfect or weak line of action. -- Half note (Mus.), a minim, one half of a semibreve. -- Half pay, half of the wages or salary; reduced pay; as, an officer on half pay. -- Half price, half the ordinary price; or a price much reduced. -- Half round. (a) (Arch.) A molding of semicircular section. (b) (Mech.) Having one side flat and the other rounded; -- said of a file. -- Half shift (Mus.), a position of the hand, between the open position and the first shift, in playing on the violin and kindred instruments. See Shift. -- Half step (Mus.), a semitone; the smallest difference of pitch or interval, used in music. -- Half tide, the time or state of the tide equally distant from ebb and flood. -- Half time, half the ordinary time for work or attendance; as, the half-time system. -- Half tint (Fine Arts), a middle or intermediate tint, as in drawing or painting. See Demitint. -- Half truth, a statement only partially true, or which gives only a part of the truth. Mrs. Browning. -- Half year, the space of six moths; one term of a school when there are two terms in a year.\n\nIn an equal part or degree; in some paas, half-colored, half done, half-hearted, half persuaded, half conscious. \"Half loth and half consenting.\" Dryden. Their children spoke halfin the speech of Ashdod. Neh. xiii. 24\n\n1. Part; side; behalf. [Obs.] Wyclif. The four halves of the house. Chaucer. 2. One of two equal parts into which anything may be divided, or considered as divided; -- sometimes followed by of; as, a half of an apple. Not half his riches known, and yet despised. Milton. A friendship so complete Portioned in halves between us. Tennyson. Better half. See under Better. -- In half, in two; an expression sometimes used improperly instead of in or into halves; as, to cut in half. [Colloq.] Dickens. -- In, or On, one's half, in one's behalf; on one's part. [Obs.] -- To cry halves, to claim an equal share with another. -- To go halves, to share equally between two.\n\nTo halve. [Obs.] See Halve. Sir H. Wotton."}