{"word":"hard","definition":"1. Not easily penetrated, cut, or separated into parts; not yielding to pressure; firm; solid; compact; -- applied to material bodies, and opposed to soft; as, hard wood; hard flesh; a hard apple. 2. Difficult, mentally or judicially; not easily apprehended, decided, or resolved; as a hard problem. The hard causes they brought unto Moses. Ex. xviii. 26. In which are some things hard to be understood. 2 Peter iii. 16. 3. Difficult to accomplish; full of obstacles; laborious; fatiguing; arduous; as, a hard task; a disease hard to cure. 4. Difficult to resist or control; powerful. The stag was too hard for the horse. L'Estrange. A power which will be always too hard for them. Addison. 5. Difficult to bear or endure; not easy to put up with or consent to; hence, severe; rigorous; oppressive; distressing; unjust; grasping; as, a hard lot; hard times; hard fare; a hard winter; hard conditions or terms. I never could drive a hard bargain. Burke. 6. Difficult to please or influence; stern; unyielding; obdurate; unsympathetic; unfeeling; cruel; as, a hard master; a hard heart; hard words; a hard character. 7. Not easy or agreeable to the taste; stiff; rigid; ungraceful; repelling; as, a hard style. Figures harder than even the marble itself. Dryden. 8. Rough; acid; sour, as liquors; as, hard cider. 9. (Pron.) Abrupt or explosive in utterance; not aspirated, sibilated, or pronounced with a gradual change of the organs from one position to another;- said of certain consonants, as c in came, and g in go, as distinguished from the same letters in center, general, etc. 10. Wanting softness or smoothness of utterance; harsh; as, a hard tone. 11. (Painting) (a) Rigid in the drawing or distribution of the figures; formal; lacking grace of composition. (b) Having disagreeable and abrupt contrasts in the coloring or light and shade. Hard cancer, Hard case, etc. See under Cancer, Case, etc. -- Hard clam, or Hard-shelled clam (Zoöl.), the guahog. -- Hard coal, anthracite, as distinguished from bituminous or soft coal. -- Hard and fast. (Naut.) See under Fast. -- Hard finish (Arch.), a smooth finishing coat of hard fine plaster applied to the surface of rough plastering. -- Hard lines, hardship; difficult conditions. -- Hard money, coin or specie, as distinguished from paper money. -- Hard oyster (Zoöl.), the northern native oyster. [Local, U. S.] - - Hard pan, the hard stratum of earth lying beneath the soil; hence, figuratively, the firm, substantial, fundamental part or quality of anything; as, the hard pan of character, of a matter in dispute, etc. See Pan. -- Hard rubber. See under Rubber. -- Hard solder. See under Solder. -- Hard water, water, which contains lime or some mineral substance rendering it unfit for washing. See Hardness, 3.- Hard wood, wood of a solid or hard texture; as walnut, oak, ash, box, and the like, in distinction from pine, poplar, hemlock, etc.- In hard condition, in excellent condition for racing; having firm muscles;-said of race horses. Syn. -- Solid; arduous; powerful; trying; unyielding; stubborn; stern; flinty; unfeeling; harsh; difficult; severe; obdurate; rigid. See Solid, and Arduous.\n\n1. With pressure; with urgency; hence, diligently; earnestly. And prayed so hard for mercy from the prince. Dryden. My father Is hard at study; pray now, rest yourself. Shak. 2. With difficulty; as, the vehicle moves hard. 3. Uneasily; vexatiously; slowly. Shak. 4. So as to raise difficulties. \" The guestion is hard set\". Sir T. Browne. 5. With tension or strain of the powers; violently; with force; tempestuously; vehemently; vigorously; energetically; as, to press, to blow, to rain hard; hence, rapidly; as, to run hard. 6. Close or near. Whose house joined hard to the synagogue. Acts xviii.7. Hard by, near by; close at hand; not far off. \"Hard by a cottage chimney smokes.\" Milton. -- Hard pushed, Hard run, greatly pressed; as, he was hard pushed or hard run for time, money, etc. [Colloq.] -- Hard up, closely pressed by want or necessity; without money or resources; as, hard up for amusements. [Slang] Note: Hard in nautical language is often joined to words of command to the helmsman, denoting that the order should be carried out with the utmost energy, or that the helm should be put, in the direction indicated, to the extreme limit, as, Hard aport! Hard astarboard! Hard alee! Hard aweather up! Hard is also often used in composition with a participle; as, hard-baked; hard-earned; hard-working; hard- won.\n\nTo harden; to make hard. [Obs.] Chaucer.\n\nA ford or passage across a river or swamp."}