{"word":"harmonical","definition":"1. Concordant; musical; consonant; as, harmonic sounds. Harmonic twang! of leather, horn, and brass. Pope. 2. (Mus.)  Relating to harmony, -- as melodic relates to melody; harmonious; esp., relating to the accessory sounds or overtones which accompany the predominant and apparent single tone of any string or sonorous body. 3. (Math.)  Having relations or properties bearing some resemblance to those of musical consonances; -- said of certain numbers, ratios, proportions, points, lines. motions, and the like. Harmonic interval (Mus.), the distance between two notes of a chord, or two consonant notes. -- Harmonical mean (Arith. & Alg.), certain relations of numbers and quantities, which bear an analogy to musical consonances. -- Harmonic motion, the motion of the point A, of the foot of the perpendicular PA, when P moves uniformly in the circumference of a circle, and PA is drawn perpendicularly upon a fixed diameter of the circle. This is simple harmonic motion. The combinations, in any way, of two more simple harmonic motions, make other kinds of harmonic motion. The motion of the pendulum bob of a clock is approximately simple harmonic motion. -- Harmonic proportion. See under Proportion. -- Harmonic series or progression. See under Progression. -- Spherical harmonic analysis, a mathematical method, sometimes referred to as that of Laplace's Coefficients, which has for its object the expression of an arbitrary, periodic function of two independent variables, in the proper form for a large class of physical problems, involving arbitrary data, over a spherical surface, and the deduction of solutions for every point of space. The functions employed in this method are called spherical harmonic functions. Thomson & Tait. -- Harmonic suture (Anat.), an articulation by simple apposition of comparatively smooth surfaces or edges, as between the two superior maxillary bones in man; -- called also harmonic, and harmony. -- Harmonic triad (Mus.), the chord of a note with its third and fifth; the common chord."}