{"word":"hawk","definition":"One of numerous species and genera of rapacious birds of the family Falconidæ. They differ from the true falcons in lacking the prominent tooth and notch of the bill, and in having shorter and less pointed wings. Many are of large size and grade into the eagles. Some, as the goshawk, were formerly trained like falcons. In a more general sense the word is not infrequently applied, also, to true falcons, as the sparrow hawk, pigeon hawk, duck hawk, and prairie hawk. Note: Among the common American species are the red-tailed hawk (Buteo borealis); the red-shouldered (B. lineatus); the broad-winged (B. Pennsylvanicus); the rough-legged (Archibuteo lagopus); the sharp-shinned Accipiter fuscus). See Fishhawk, Goshawk, Marsh hawk, under Marsh, Night hawk, under Night. Bee hawk (Zoöl.), the honey buzzard. -- Eagle hawk. See under Eagle. -- Hawk eagle (Zoöl.), an Asiatic bird of the genus Spizætus, or Limnætus, intermediate between the hawks and eagles. There are several species. -- Hawk fly (Zoöl.), a voracious fly of the family Asilidæ. See Hornet fly, under Hornet. -- Hawk moth. (Zoöl.) See Hawk moth, in the Vocabulary. -- Hawk owl. (Zoöl.) (a) A northern owl (Surnia ulula) of Europe and America. It flies by day, and in some respects resembles the hawks. (b) An owl of India (Ninox scutellatus). -- Hawk's bill (Horology), the pawl for the rack, in the striking mechanism of a clock.\n\n1. To catch, or attempt to catch, birds by means of hawks trained for the purpose, and let loose on the prey; to practice falconry. A falconer Henry is, when Emma hawks. Prior. 2. To make an attack while on the wing; to soar and strike like a hawk; -- generally with at; as, to hawk at flies. Dryden. A falcon, towering in her pride of place, Was by a mousing owl hawked at and killed. Shak.\n\nTo clear the throat with an audible sound by forcing an expiratory current of air through the narrow passage between the depressed soft palate and the root of the tongue, thus aiding in the removal of foreign substances.\n\nTo raise by hawking, as phlegm.\n\nAn effort to force up phlegm from the throat, accompanied with noise.\n\nTo offer for sale by outcry in the street; to carry (merchandise) about from place to place for sale; to peddle; as, to hawk goods or pamphlets. His works were hawked in every street. Swift.\n\nA small board, with a handle on the under side, to hold mortar. Hawk boy, an attendant on a plasterer to supply him with mortar."}