{"word":"head","definition":"1. The anterior or superior part of an animal, containing the brain, or chief ganglia of the nervous system, the mouth, and in the higher animals, the chief sensory organs; poll; cephalon. 2. The uppermost, foremost, or most important part of an inanimate object; such a part as may be considered to resemble the head of an animal; often, also, the larger, thicker, or heavier part or extremity, in distinction from the smaller or thinner part, or from the point or edge; as, the head of a cane, a nail, a spear, an ax, a mast, a sail, a ship; that which covers and closes the top or the end of a hollow vessel; as, the head of a cask or a steam boiler. 3. The place where the head should go; as, the head of a bed, of a grave, etc.; the head of a carriage, that is, the hood which covers the head. 4. The most prominent or important member of any organized body; the chief; the leader; as, the head of a college, a school, a church, a state, and the like. \"Their princes and heads.\" Robynson (More's Utopia). The heads of the chief sects of philosophy. Tillotson. Your head I him appoint. Milton. 5. The place or honor, or of command; the most important or foremost position; the front; as, the head of the table; the head of a column of soldiers. An army of fourscore thousand troops, with the duke Marlborough at the head of them. Addison. 6. Each one among many; an individual; -- often used in a plural sense; as, a thousand head of cattle. It there be six millions of people, there are about four acres for every head. Graunt. 7. The seat of the intellect; the brain; the understanding; the mental faculties; as, a good head, that is, a good mind; it never entered his head, it did not occur to him; of his own head, of his own thought or will. Men who had lost both head and heart. Macaulay. 8. The source, fountain, spring, or beginning, as of a stream or river; as, the head of the Nile; hence, the altitude of the source, or the height of the surface, as of water, above a given place, as above an orifice at which it issues, and the pressure resulting from the height or from motion; sometimes also, the quantity in reserve; as, a mill or reservoir has a good head of water, or ten feet head; also, that part of a gulf or bay most remote from the outlet or the sea. 9. A headland; a promontory; as, Gay Head. Shak. 10. A separate part, or topic, of a discourse; a theme to be expanded; a subdivision; as, the heads of a sermon. 11. Culminating point or crisis; hence, strength; force; height. Ere foul sin, gathering head, shall break into corruption. Shak. The indisposition which has long hung upon me, is at last grown to such a head, that it must quickly make an end of me or of itself. Addison. 12. Power; armed force. My lord, my lord, the French have gathered head. Shak. 13. A headdress; a covering of the head; as, a laced head; a head of hair. Swift. 14. An ear of wheat, barley, or of one of the other small cereals. 15. (Bot.) (a) A dense cluster of flowers, as in clover, daisies, thistles; a capitulum. (b) A dense, compact mass of leaves, as in a cabbage or a lettuce plant. 16. The antlers of a deer. 17. A rounded mass of foam which rises on a pot of beer or other effervescing liquor. Mortimer. 18. pl.  Tiles laid at the eaves of a house. Knight. Note: Head is often used adjectively or in self-explaining combinations; as, head gear or headgear, head rest. Cf. Head, a. A buck of the first head, a male fallow deer in its fifth year, when it attains its complete set of antlers. Shak. -- By the head. (Naut.) See under By. -- Elevator head, Feed head, etc. See under Elevator, Feed, etc. -- From head to foot, through the whole length of a man; completely; throughout. \"Arm me, audacity, from head to foot.\" Shak. -- Head and ears, with the whole person; deeply; completely; as, he was head and ears in debt or in trouble. [Colloq.] -- Head fast. (Naut.) See 5th Fast. -- Head kidney (Anat.), the most anterior of the three pairs of embryonic renal organs developed in most vertebrates -- Head money, a capitation tax; a poll tax. Milton. -- Head pence, a poll tax. [Obs.] -- Head sea, a sea that meets the head of a vessel or rolls against her course. -- Head and shoulders. (a) By force; violently; as, to drag one, head and shoulders. \"They bring in every figure of speech, head and shoulders.\" Felton. (b) By the height of the head and shoulders; hence, by a great degree or space; by far; much; as, he is head and shoulders above them. -- Head or tail, this side or that side; this thing or that; -- a phrase used in throwing a coin to decide a choice, guestion, or stake, head being the side of the coin bearing the effigy or principal figure (or, in case there is no head or face on either side, that side which has the date on it), and tail the other side. -- Neither head nor tail, neither beginning nor end; neither this thing nor that; nothing distinct or definite; -- a phrase used in speaking of what is indefinite or confused; as, they made neither head nor tail of the matter. [Colloq.] -- Head wind, a wind that blows in a direction opposite the vessel's course. -- Out one's own head, according to one's own idea; without advice or coöperation of another. Over the head of, beyond the comprehension of. M. Arnold. -- To be out of one's head, to be temporarily insane. -- To come or draw to a head. See under Come, Draw. -- To give (one) the head, or To give head, to let go, or to give up, control; to free from restraint; to give license. \"He gave his able horse the head.\" Shak. \"He has so long given his unruly passions their head.\" South. -- To his head, before his face. \"An uncivil answer from a son to a father, from an obliged person to a benefactor, is a greater indecency than if an enemy should storm his house or revile him to his head.\" Jer. Taylor. -- To lay heads together, to consult; to conspire. -- To lose one's head, to lose presence of mind. -- To make head, or To make head against, to resist with success; to advance. -- To show one's head, to appear. Shak. -- To turn head, to turn the face or front. \"The ravishers turn head, the fight renews.\" Dryden.\n\nPrincipal; chief; leading; first; as, the head master of a school; the head man of a tribe; a head chorister; a head cook.\n\n1. To be at the head of; to put one's self at the head of; to lead; to direct; to act as leader to; as, to head an army, an expedition, or a riot. Dryden. 2. To form a head to; to fit or furnish with a head; as, to head a nail. Spenser. 3. To behead; to decapitate. [Obs.] Shak. 4. To cut off the top of; to lop off; as, to head trees. 5. To go in front of; to get in the front of, so as to hinder or stop; to oppose; hence, to check or restrain; as, to head a drove of cattle; to head a person; the wind heads a ship. 6. To set on the head; as, to head a cask. To head off, to intercept; to get before; as, an officer heads off a thief who is escaping. -- To head up, to close, as a cask or barrel, by fitting a head to.\n\n1. To originate; to spring; to have its A broad river, that heads in the great Blue Ridge. Adair. 2. To go or point in a certain direction; to tend; as, how does the ship head 3. To form a head; as, this kind of cabbage heads early."}