{"word":"heart","definition":"1. (Anat.)  A hollow, muscular organ, which, by contracting rhythmically, keeps up the circulation of the blood. Why does my blood thus muster to my heart! Shak. Note: In adult mammals and birds, the heart is four-chambered, the right auricle and ventricle being completely separated from the left auricle and ventricle; and the blood flows from the systematic veins to the right auricle, thence to the right ventricle, from which it is forced to the lungs, then returned to the left auricle, thence passes to the left ventricle, from which it is driven into the systematic arteries. See Illust. under Aorta. In fishes there are but one auricle and one ventricle, the blood being pumped from the ventricle through the gills to the system, and thence returned to the auricle. In most amphibians and reptiles, the separation of the auricles is partial or complete, and in reptiles the ventricles also are separated more or less completely. The so-called lymph hearts, found in many amphibians, reptiles, and birds, are contractile sacs, which pump the lymph into the veins. 2. The seat of the affections or sensibilities, collectively or separately, as love, hate, joy, grief, courage, and the like; rarely, the seat of the understanding or will; -- usually in a good sense, when no epithet is expressed; the better or lovelier part of our nature; the spring of all our actions and purposes; the seat of moral life and character; the moral affections and character itself; the individual disposition and character; as, a good, tender, loving, bad, hard, or selfish heart. Hearts are dust, hearts' loves remain. Emerson. 3. The nearest the middle or center; the part most hidden and within; the inmost or most essential part of any body or system; the source of life and motion in any organization; the chief or vital portion; the center of activity, or of energetic or efficient action; as, the heart of a country, of a tree, etc. Exploits done in the heart of France. Shak. Peace subsisting at the heart Of endless agitation. Wordsworth. 4. Courage; courageous purpose; spirit. Eve, recovering heart, replied. Milton. The expelled nations take heart, and when they fly from one country invade another. Sir W. Temple. 5. Vigorous and efficient activity; power of fertile production; condition of the soil, whether good or bad. That the spent earth may gather heart again. Dryden. 6. That which resembles a heart in shape; especially, a roundish or oval figure or object having an obtuse point at one end, and at the other a corresponding indentation, -- used as a symbol or representative of the heart. 7. One of a series of playing cards, distinguished by the figure or figures of a heart; as, hearts are trumps. 8. Vital part; secret meaning; real intention. And then show you the heart of my message. Shak. 9. A term of affectionate or kindly and familiar address. \"I speak to thee, my heart.\" Shak. Note: Heart is used in many compounds, the most of which need no special explanation; as, heart-appalling, heart-breaking, heart- cheering, heart-chilled, heart-expanding, heart-free, heart-hardened, heart-heavy, heart-purifying, heart-searching, heart-sickening, heart-sinking, heart-stirring, heart-touching, heart-wearing, heart- whole, heart-wounding, heart-wringing, etc. After one's own heart, conforming with one's inmost approval and desire; as, a friend after my own heart. The Lord hath sought him a man after his own heart. 1 Sam. xiii. 14. -- At heart, in the inmost character or disposition; at bottom; really; as, he is at heart a good man. -- By heart, in the closest or most thorough manner; as, to know or learn by heart. \"Composing songs, for fools to get by heart\" (that is, to commit to memory, or to learn thoroughly). Pope. -- For my heart, for my life; if my life were at stake. [Obs.] \"I could not get him for my heart to do it.\" Shak. -- Heart bond (Masonry), a bond in which no header stone stretches across the wall, but two headers meet in the middle, and their joint is covered by another stone laid header fashion. Knight. -- Heart and hand, with enthusiastic coöperation. -- Heart hardness, hardness of heart; callousness of feeling; moral insensibility. Shak. -- Heart heaviness, depression of spirits. Shak. -- Heart point (Her.), the fess point. See Escutcheon. -- Heart rising, a rising of the heart, as in opposition. -- Heart shell (Zoöl.), any marine, bivalve shell of the genus Cardium and allied genera, having a heart-shaped shell; esp., the European Isocardia cor; -- called also heart cockle. -- Heart sickness, extreme depression of spirits. -- Heart and soul, with the utmost earnestness. -- Heart urchin (Zoöl.), any heartshaped, spatangoid sea urchin. See Spatangoid. -- Heart wheel, a form of cam, shaped like a heart. See Cam. -- In good heart, in good courage; in good hope. -- Out of heart, discouraged. -- Poor heart, an exclamation of pity. -- To break the heart of. (a) To bring to despair or hopeless grief; to cause to be utterly cast down by sorrow. (b) To bring almost to completion; to finish very nearly; -- said of anything undertaken; as, he has broken the heart of the task. -- To find in the heart, to be willing or disposed. \"I could find in my heart to ask your pardon.\" Sir P. Sidney. -- To have at heart, to desire (anything) earnestly. -- To have in the heart, to purpose; to design or intend to do. -- To have the heart in the mouth, to be much frightened. -- To lose heart, to become discouraged. -- To lose one's heart, to fall in love. -- To set the heart at rest, to put one's self at ease. -- To set the heart upon, to fix the desires on; to long for earnestly; to be very fond of. -- To take heart of grace, to take courage. -- To take to heart, to grieve over. -- To wear one's heart upon one's sleeve, to expose one's feelings or intentions; to be frank or impulsive. -- With all one's whole heart, very earnestly; fully; completely; devotedly.\n\nTo give heart to; to hearten; to encourage; to inspirit. [Obs.] My cause is hearted; thine hath no less reason. Shak.\n\nTo form a compact center or heart; as, a hearting cabbage."}