{"word":"hear","definition":"1. To perceive by the ear; to apprehend or take cognizance of by the ear; as, to hear sounds; to hear a voice; to hear one call. Lay thine ear close to the ground, and list if thou canst hear the tread of travelers. Shak. He had been heard to utter an ominous growl. Macaulay. 2. To give audience or attention to; to listen to; to heed; to accept the doctrines or advice of; to obey; to examine; to try in a judicial court; as, to hear a recitation; to hear a class; the case will be heard to-morrow. 3. To attend, or be present at, as hearer or worshiper; as, to hear a concert; to hear Mass. 4. To give attention to as a teacher or judge. Thy matters are good and right, but there is no man deputed of the king to hear thee. 2 Sam. xv. 3. I beseech your honor to hear me one single word. Shak. 5. To accede to the demand or wishes of; to listen to and answer favorably; to favor. I love the Lord, because he hath heard my voice. Ps. cxvi. 1. They think that they shall be heard for their much speaking. Matt. vi. 7. Hear him. See Remark, under Hear, v. i. -- To hear a bird sing, to receive private communication. [Colloq.] Shak. -- To hear say, to hear one say; to learn by common report; to receive by rumor. [Colloq.]\n\n1. To have the sense or faculty of perceiving sound. \"The Hearing ear.\" Prov. xx. 12. 2. To use the power of perceiving sound; to perceive or apprehend by the ear; to attend; to listen. So spake our mother Eve, and Adam heard, Well pleased, but answered not. Milton. 3. To be informed by oral communication; to be told; to receive information by report or by letter. I have heard, sir, of such a man. Shak. I must hear from thee every day in the hour. Shak. To hear ill, to be blamed. [Obs.] Not only within his own camp, but also now at Rome, he heard ill for his temporizing and slow proceedings. Holland. -- To hear well, to be praised. [Obs.] Note: Hear, or Hear him, is often used in the imperative, especially in the course of a speech in English assemblies, to call attention to the words of the speaker. Hear him, . . . a cry indicative, according to the tone, of admiration, acquiescence, indignation, or derision. Macaulay."}