{"word":"heat","definition":"1. A force in nature which is recognized in various effects, but especially in the phenomena of fusion and evaporation, and which, as manifested in fire, the sun's rays, mechanical action, chemical combination, etc., becomes directly known to us through the sense of feeling. In its nature heat is a mode if motion, being in general a form of molecular disturbance or vibration. It was formerly supposed to be a subtile, imponderable fluid, to which was given the name caloric. Note: As affecting the human body, heat produces different sensations, which are called by different names, as heat or sensible heat, warmth, cold, etc., according to its degree or amount relatively to the normal temperature of the body. 2. The sensation caused by the force or influence of heat when excessive, or above that which is normal to the human body; the bodily feeling experienced on exposure to fire, the sun's rays, etc.; the reverse of cold. 3. High temperature, as distinguished from low temperature, or cold; as, the heat of summer and the cold of winter; heat of the skin or body in fever, etc. Else how had the world . . . Avoided pinching cold and scorching heat! Milton. 4. Indication of high temperature; appearance, condition, or color of a body, as indicating its temperature; redness; high color; flush; degree of temperature to which something is heated, as indicated by appearance, condition, or otherwise. It has raised . . . heats in their faces. Addison. The heats smiths take of their iron are a blood-red heat, a white- flame heat, and a sparking or welding heat. Moxon. 5. A single complete operation of heating, as at a forge or in a furnace; as, to make a horseshoe in a certain number of heats. 6. A violent action unintermitted; a single effort; a single course in a race that consists of two or more courses; as, he won two heats out of three. Many causes . . . for refreshment betwixt the heats. Dryden. [He] struck off at one heat the matchless tale of \"Tam o'Shanter.\" J. C. Shairp. 7. Utmost violence; rage; vehemence; as, the heat of battle or party. \"The heat of their division.\" Shak. 8. Agitation of mind; inflammation or excitement; exasperation. \"The head and hurry of his rage.\" South. 9. Animation, as in discourse; ardor; fervency. With all the strength and heat of eloquence. Addison. 10. Sexual excitement in animals. 11. Fermentation. Animal heat, Blood heat, Capacity for heat, etc. See under Animal, Blood, etc. -- Atomic heat (Chem.), the product obtained by multiplying the atomic weight of any element by its specific heat. The atomic heat of all solid elements is nearly a constant, the mean value being 6.4. -- Dynamical theory of heat, that theory of heat which assumes it to be, not a peculiar kind of matter, but a peculiar motion of the ultimate particles of matter. Heat engine, any apparatus by which a heated substance, as a heated fluid, is made to perform work by giving motion to mechanism, as a hot-air engine, or a steam engine. -- Heat producers. (Physiol.) See under Food. -- Heat rays, a term formerly applied to the rays near the red end of the spectrum, whether within or beyond the visible spectrum. -- Heat weight (Mech.), the product of any quantity of heat by the mechanical equivalent of heat divided by the absolute temperature; -- called also thermodynamic function, and entropy. -- Mechanical equivalent of heat. See under Equivalent. -- Specific heat of a substance (at any temperature), the number of units of heat required to raise the temperature of a unit mass of the substance at that temperature one degree. -- Unit of heat, the quantity of heat required to raise, by one degree, the temperature of a unit mass of water, initially at a certain standard temperature. The temperature usually employed is that of 0ยบ Centigrade, or 32ยบ Fahrenheit.\n\n1. To make hot; to communicate heat to, or cause to grow warm; as, to heat an oven or furnace, an iron, or the like. Heat me these irons hot. Shak. 2. To excite or make hot by action or emotion; to make feverish. Pray, walk softly; do not heat your blood. Shak. 3. To excite ardor in; to rouse to action; to excite to excess; to inflame, as the passions. A noble emulation heats your breast. Dryden.\n\n1. To grow warm or not by the action of fire or friction, etc., or the communication of heat; as, the iron or the water heats slow. 2. To grow warm or hot by fermentation, or the development of heat by chemical action; as, green hay heats in a mow, and manure in the dunghill.\n\nHeated; as, the iron though heat red-hot. [Obs. or Archaic.] Shak."}