{"word":"heave","definition":"1. To cause to move upward or onward by a lifting effort; to lift; to raise; to hoist; -- often with up; as, the wave heaved the boat on land. One heaved ahigh, to be hurled down below. Shak. Note: Heave, as now used, implies that the thing raised is heavy or hard to move; but formerly it was used in a less restricted sense. Here a little child I stand, Heaving up my either hand. Herrick. 2. To throw; to cast; -- obsolete, provincial, or colloquial, except in certain nautical phrases; as, to heave the lead; to heave the log. 3. To force from, or into, any position; to cause to move; also, to throw off; -- mostly used in certain nautical phrases; as, to heave the ship ahead. 4. To raise or force from the breast; to utter with effort; as, to heave a sigh. The wretched animal heaved forth such groans. Shak. 5. To cause to swell or rise, as the breast or bosom. The glittering, finny swarms That heave our friths, and crowd upon our shores. Thomson. To heave a cable short (Naut.), to haul in cable till the ship is almost perpendicularly above the anchor. -- To heave a ship ahead (Naut.), to warp her ahead when not under sail, as by means of cables. -- To heave a ship down (Naut.), to throw or lay her down on one side; to careen her. -- To heave a ship to (Naut.), to bring the ship's head to the wind, and stop her motion. -- To heave about (Naut.), to put about suddenly. -- To heave in (Naut.), to shorten (cable). -- To heave in stays (Naut.), to put a vessel on the other tack. -- To heave out a sail (Naut.), to unfurl it. -- To heave taut (Naut.), to turn a capstan, etc., till the rope becomes strained. See Taut, and Tight. -- To heave the lead (Naut.), to take soundings with lead and line. -- To heave the log. (Naut.) See Log. -- To heave up anchor (Naut.), to raise it from the bottom of the sea or elsewhere.\n\n1. To be thrown up or raised; to rise upward, as a tower or mound. And the huge columns heave into the sky. Pope. Where heaves the turf in many a moldering heap. Gray. The heaving sods of Bunker Hill. E. Everett. 2. To rise and fall with alternate motions, as the lungs in heavy breathing, as waves in a heavy sea, as ships on the billows, as the earth when broken up by frost, etc.; to swell; to dilate; to expand; to distend; hence, to labor; to struggle. Frequent for breath his panting bosom heaves. Prior. The heaving plain of ocean. Byron. 3. To make an effort to raise, throw, or move anything; to strain to do something difficult. The Church of England had struggled and heaved at a reformation ever since Wyclif's days. Atterbury. 4. To make an effort to vomit; to retch; to vomit. To heave at. (a) To make an effort at. (b) To attack, to oppose. [Obs.] Fuller. -- To heave in sight (as a ship at sea), to come in sight; to appear. -- To heave up, to vomit. [Low]\n\n1. An effort to raise something, as a weight, or one's self, or to move something heavy. After many strains and heaves He got up to his saddle eaves. Hudibras. 2. An upward motion; a rising; a swell or distention, as of the breast in difficult breathing, of the waves, of the earth in an earthquake, and the like. There's matter in these sighs, these profound heaves, You must translate. Shak. None could guess whether the next heave of the earthquake would settle . . . or swallow them. Dryden. 3. (Geol.)  A horizontal dislocation in a metallic lode, taking place at an intersection with another lode."}