{"word":"heavy","definition":"Having the heaves.\n\n1. Heaved or lifted with labor; not light; weighty; ponderous; as, a heavy stone; hence, sometimes, large in extent, quantity, or effects; as, a heavy fall of rain or snow; a heavy failure; heavy business transactions, etc.; often implying strength; as, a heavy barrier; also, difficult to move; as, a heavy draught. 2. Not easy to bear; burdensome; oppressive; hard to endure or accomplish; hence, grievous, afflictive; as, heavy yokes, expenses, undertakings, trials, news, etc. The hand of the Lord was heavy upon them of Ashdod. 1 Sam. v. 6. The king himself hath a heavy reckoning to make. Shak. Sent hither to impart the heavy news. Wordsworth. Trust him not in matter of heavy consequence. Shak. 3. Laden with that which is weighty; encumbered; burdened; bowed down, either with an actual burden, or with care, grief, pain, disappointment. The heavy [sorrowing] nobles all in council were. Chapman. A light wife doth make a heavy husband. Shak. 4. Slow; sluggish; inactive; or lifeless, dull, inanimate, stupid; as, a heavy gait, looks, manners, style, and the like; a heavy writer or book. Whilst the heavy plowman snores. Shak. Of a heavy, dull, degenerate mind. Dryden. Neither [is] his ear heavy, that it can not hear. Is. lix. 1. 5. Strong; violent; forcible; as, a heavy sea, storm, cannonade, and the like. 6. Loud; deep; -- said of sound; as, heavy thunder. But, hark! that heavy sound breaks in once more. Byron. 7. Dark with clouds, or ready to rain; gloomy; -- said of the sky. 8. Impeding motion; cloggy; clayey; -- said of earth; as, a heavy road, soil, and the like. 9. Not raised or made light; as, heavy bread. 10. Not agreeable to, or suitable for, the stomach; not easily digested; -- said of food. 11. Having much body or strength; -- said of wines, or other liquors. 12. With child; pregnant. [R.] Heavy artillery. (Mil.) (a) Guns of great weight or large caliber, esp. siege, garrison, and seacoast guns. (b) Troops which serve heavy guns. -- Heavy cavalry. See under Cavalry. -- Heavy fire (Mil.), a continuous or destructive cannonading, or discharge of small arms. -- Heavy metal (Mil.), large guns carrying balls of a large size; also, large balls for such guns. -- Heavy metals. (Chem.) See under Metal. -- Heavy weight, in wrestling, boxing, etc., a term applied to the heaviest of the classes into which contestants are divided. Cf. Feather weight (c), under Feather. Note: Heavy is used in composition to form many words which need no special explanation; as, heavy-built, heavy-browed, heavy-gaited, etc.\n\n, adv. Heavily; -- sometimes used in composition; as, heavy- laden.\n\nTo make heavy. [Obs.] Wyclif."}