{"word":"heel","definition":"To lean or tip to one side, as a ship; as, the ship heels aport; the boat heeled over when the squall struck it. Heeling error (Naut.), a deviation of the compass caused by the heeling of an iron vessel to one side or the other.\n\n1. The hinder part of the foot; sometimes, the whole foot; -- in man or quadrupeds. He [the stag] calls to mind his strength and then his speed, His winged heels and then his armed head. Denham. 2. The hinder part of any covering for the foot, as of a shoe, sock, etc.; specif., a solid part projecting downward from the hinder part of the sole of a boot or shoe. 3. The latter or remaining part of anything; the closing or concluding part. \"The heel of a hunt.\" A. Trollope. \"The heel of the white loaf.\" Sir W. Scott. 4. Anything regarded as like a human heel in shape; a protuberance; a knob. 5. The part of a thing corresponding in position to the human heel; the lower part, or part on which a thing rests; especially: (a) (Naut.) The after end of a ship's keel. (b) (Naut.) The lower end of a mast, a boom, the bowsprit, the sternpost, etc. (c) (Mil.) In a small arm, the corner of the but which is upwards in the firing position. (d) (Mil.) The uppermost part of the blade of a sword, next to the hilt. (e) The part of any tool next the tang or handle; as, the heel of a scythe. 6. (Man.)  Management by the heel, especially the spurred heel; as, the horse understands the heel well. 7. (Arch.) (a) The lower end of a timber in a frame, as a post or rafter. In the United States, specif., the obtuse angle of the lower end of a rafter set sloping. (b) A cyma reversa; -- so called by workmen. Gwilt. Heel chain (Naut.), a chain passing from the bowsprit cap around the heel of the jib boom. -- Heel plate, the butt plate of a gun. -- Heel of a rafter. (Arch.) See Heel, n., 7. -- Heel ring, a ring for fastening a scythe blade to the snath. -- Neck and heels, the whole body. (Colloq.) -- To be at the heels of, to pursue closely; to follow hard: as, hungry want is at my heels. Otway. -- To be down at the heel, to be slovenly or in a poor plight. -- To be out at the heels, to have on stockings that are worn out; hence, to be shabby, or in a poor plight. Shak. -- To cool the heels. See under Cool. -- To go heels over head, to turn over so as to bring the heels uppermost; hence, to move in a inconsiderate, or rash, manner. -- To have the heels of, to outrun. -- To lay by the heels, to fetter; to shackle; to imprison. Shak. Addison. -- To show the heels, to flee; to run from. -- To take to the heels, to flee; to betake to flight. -- To throw up another's heels, to trip him. Bunyan. -- To tread upon one's heels, to follow closely. Shak.\n\n1. To perform by the use of the heels, as in dancing, running, and the like. [R.] I cannot sing, Nor heel the high lavolt. Shak. 2. To add a heel to; as, to heel a shoe. 3. To arm with a gaff, as a cock for fighting."}