{"word":"help","definition":"1. To furnish with strength or means for the successful performance of any action or the attainment of any object; to aid; to assist; as, to help a man in his work; to help one to remember; -- the following infinitive is commonly used without to; as, \"Help me scale yon balcony.\" Longfellow. 2. To furnish with the means of deliverance from trouble; as, to help one in distress; to help one out of prison. \"God help, poor souls, how idly do they talk!\" Shak. 3. To furnish with relief, as in pain or disease; to be of avail against; -- sometimes with of before a word designating the pain or disease, and sometimes having such a word for the direct object. \"To help him of his blindness.\" in is used for that function; -- \"to help him in his misery\" Shak. The true calamus helps coughs. Gerarde. 4. To change for the better; to remedy. Cease to lament for what thou canst not help. Shak. 5. To prevent; to hinder; as, the evil approaches, and who can help it Swift. 6. To forbear; to avoid. I can not help remarking the resemblance betwixt him and our author. Pope. 7. To wait upon, as the guests at table, by carving and passing food. To help forward, to assist in advancing. -- To help off, to help to go or pass away, as time; to assist in removing. Locke. -- To help on, to forward; to promote by aid. -- To help out, to aid, as in delivering from a difficulty, or to aid in completing a design or task. The god of learning and of light Would want a god himself to help him out. Swift. -- To help over, to enable to surmount; as, to help one over an obstacle. -- To help to, to supply with; to furnish with; as, to help one to soup. -- To help up, to help (one) to get up; to assist in rising, as after a fall, and the like. \"A man is well holp up that trusts to you.\" Shak. Syn. -- To aid; assist; succor; relieve; serve; support; sustain; befriend. -- To Help, Aid, Assist. These words all agree in the idea of affording relief or support to a person under difficulties. Help turns attention especially to the source of relief. If I fall into a pit, I call for help; and he who helps me out does it by an act of his own. Aid turns attention to the other side, and supposes coöperation on the part of him who is relieved; as, he aided me in getting out of the pit; I got out by the aid of a ladder which he brought. Assist has a primary reference to relief afforded by a person who \"stands by\" in order to relieve. It denotes both help and aid. Thus, we say of a person who is weak, I assisted him upstairs, or, he mounted the stairs by my assistance. When help is used as a noun, it points less distinctively and exclusively to the source of relief, or, in other words, agrees more closely with aid. Thus we say, I got out of a pit by the help of my friend.\n\nTo lend aid or assistance; to contribute strength or means; to avail or be of use; to assist. A generous present helps to persuade, as well as an agreeable person. Garth. To help out, to lend aid; to bring a supply.\n\n1. Strength or means furnished toward promoting an object, or deliverance from difficulty or distress; aid; ^; also, the person or thing furnishing the aid; as, he gave me a help of fifty dollars. Give us help from trouble, for vain is the help of man. Ps. lx. 11. God is . . . a very present help in trouble. Ps. xlvi. 1. Virtue is a friend and a help to nature. South. 2. Remedy; relief; as, there is no help for it. 3. A helper; one hired to help another; also, thew hole force of hired helpers in any business. 4. Specifically, a domestic servant, man or woman. [Local, U. S.]"}