{"word":"high","definition":"To hie. [Obs.] Men must high them apace, and make haste. Holland.\n\n1. Elevated above any starting point of measurement, as a line, or surface; having altitude; lifted up; raised or extended in the direction of the zenith; lofty; tall; as, a high mountain, tower, tree; the sun is high. 2. Regarded as raised up or elevated; distinguished; remarkable; conspicuous; superior; -- used indefinitely or relatively, and often in figurative senses, which are understood from the connection; as - (a) Elevated in character or quality, whether moral or intellectual; preëminent; honorable; as, high aims, or motives. \"The highest faculty of the soul.\" Baxter. (b) Exalted in social standing or general estimation, or in rank, reputation, office, and the like; dignified; as, she was welcomed in the highest circles. He was a wight of high renown. Shak. (c) Of noble birth; illustrious; as, of high family. (d) Of great strength, force, importance, and the like; strong; mighty; powerful; violent; sometimes, triumphant; victorious; majestic, etc.; as, a high wind; high passions. \"With rather a high manner.\" Thackeray. Strong is thy hand, and high is thy right hand. Ps. lxxxix. 13. Can heavenly minds such high resentment show Dryden. (e) Very abstract; difficult to comprehend or surmount; grand; noble. Both meet to hear and answer such high things. Shak. Plain living and high thinking are no more. Wordsworth. (f) Costly; dear in price; extravagant; as, to hold goods at a high price. If they must be good at so high a rate, they know they may be safe at a cheaper. South. (g) Arrogant; lofty; boastful; proud; ostentatious; -- used in a bad sense. An high look and a proud heart . . . is sin. Prov. xxi. 4. His forces, after all the high discourses, amounted really but to eighteen hundred foot. Clarendon. 3. Possessing a characteristic quality in a supreme or superior degree; as, high (i. e., intense) heat; high (i. e., full or quite) noon; high (i. e., rich or spicy) seasoning; high (i. e., complete) pleasure; high (i. e., deep or vivid) color; high (i. e., extensive, thorough) scholarship, etc. High time it is this war now ended were. Spenser. High sauces and spices are fetched from the Indies. Baker. 4. (Cookery)  Strong-scented; slightly tainted; as, epicures do not cook game before it is high. 5. (Mus.)  Acute or sharp; -- opposed to grave or low; as, a high note. 6. (Phon.)  Made with a high position of some part of the tongue in relation to the palate, as e (eve), oo (food). See Guide to Pronunciation, §§ 10, 11. High admiral, the chief admiral. -- High altar, the principal altar in a church. -- High and dry, out of water; out of reach of the current or tide; -- said of a vessel, aground or beached. -- High and mighty arrogant; overbearing. [Colloq.] -- High art, art which deals with lofty and dignified subjects and is characterized by an elevated style avoiding all meretricious display. -- High bailiff, the chief bailiff. -- High Church, and Low Church, two ecclesiastical parties in the Church of England and the Protestant Episcopal Church. The high- churchmen emphasize the doctrine of the apostolic succession, and hold, in general, to a sacramental presence in the Eucharist, to baptismal regeneration, and to the sole validity of Episcopal ordination. They attach much importance to ceremonies and symbols in worship. Low-churchmen lay less stress on these points, and, in many instances, reject altogether the peculiar tenets of the high-church school. See Broad Church. -- High constable (Law), a chief of constabulary. See Constable, n., 2. -- High commission court,a court of ecclesiastical jurisdiction in England erected and united to the regal power by Queen Elizabeth in 1559. On account of the abuse of its powers it was abolished in 1641. -- High day (Script.), a holy or feast day. John xix. 31. -- High festival (Eccl.), a festival to be observed with full ceremonial. -- High German, or High Dutch. See under German. -- High jinks, an old Scottish pastime; hence, noisy revelry; wild sport. [Colloq.] \"All the high jinks of the county, when the lad comes of age.\" F. Harrison. -- High latitude (Geog.), one designated by the higher figures; consequently, a latitude remote from the equator. -- High life, life among the aristocracy or the rich. -- High liver, one who indulges in a rich diet. -- High living, a feeding upon rich, pampering food. -- High Mass. (R. C. Ch.) See under Mass. -- High milling, a process of making flour from grain by several successive grindings and intermediate sorting, instead of by a single grinding. -- High noon, the time when the sun is in the meridian. -- High place (Script.), an eminence or mound on which sacrifices were offered. -- High priest. See in the Vocabulary. -- High relief. (Fine Arts) See Alto-rilievo. -- High school. See under School. High seas (Law), the open sea; the part of the ocean not in the territorial waters of any particular sovereignty, usually distant three miles or more from the coast line. Wharton. -- High steam, steam having a high pressure. -- High steward, the chief steward. -- High tea, tea with meats and extra relishes. -- High tide, the greatest flow of the tide; high water. -- High time. (a) Quite time; full time for the occasion. (b) A time of great excitement or enjoyment; a carousal. [Slang] -- High treason, treason against the sovereign or the state, the highest civil offense. See Treason. Note: It is now sufficient to speak of high treason as treason simply, seeing that petty treason, as a distinct offense, has been abolished. Mozley & W. -- High water, the utmost flow or greatest elevation of the tide; also, the time of such elevation. -- High-water mark. (a) That line of the seashore to which the waters ordinarily reach at high water. (b) A mark showing the highest level reached by water in a river or other body of fresh water, as in time of freshet. -- High-water shrub (Bot.), a composite shrub (Iva frutescens), growing in salt marshes along the Atlantic coast of the United States. -- High wine, distilled spirits containing a high percentage of alcohol; -- usually in the plural. -- To be on a high horse, to be on one's dignity; to bear one's self loftily. [Colloq.] -- With a high hand. (a) With power; in force; triumphantly. \"The children of Israel went out with a high hand.\" Ex. xiv. 8.(b) In an overbearing manner, arbitrarily. \"They governed the city with a high hand.\" Jowett (Thucyd. ). Syn. -- Tall; lofty; elevated; noble; exalted; supercilious; proud; violent; full; dear. See Tall.\n\nIn a high manner; in a high place; to a great altitude; to a great degree; largely; in a superior manner; eminently; powerfully. \"And reasoned high.\" Milton. \"I can not reach so high.\" Shak. Note: High is extensively used in the formation of compound words, most of which are of very obvious signification; as, high-aimed, high-arched, high-aspiring, high-bearing, high-boasting, high-browed, high-crested, high-crowned, high-designing, high-engendered, high- feeding, high-flaming, high-flavored, high-gazing, high-heaped, high- heeled, high-priced, high-reared, high-resolved, high-rigged, high- seated, high-shouldered, high-soaring, high-towering, high-voiced, and the like. High and low, everywhere; in all supposable places; as, I hunted high and low. [Colloq.]\n\n1. An elevated place; a superior region; a height; the sky; heaven. 2. People of rank or high station; as, high and low. 3. (Card Playing)  The highest card dealt or drawn. High, low, jack, and the game, a game at cards; -- also called all fours, old sledge, and seven up. -- In high and low, utterly; completely; in every respect. [Obs.] Chaucer. -- On high, aloft; above. The dayspring from on high hath visited us. Luke i. 78. -- The Most High, the Supreme Being; God.\n\nTo rise; as, the sun higheth. [Obs.]"}