{"word":"hit","definition":"It. [Obs.] Chaucer.\n\n3d pers. sing. pres. of Hide, contracted from hideth. [Obs.] Chaucer.\n\n1. To reach with a stroke or blow; to strike or touch, usually with force; especially, to reach or touch (an object aimed at). I think you have hit the mark. Shak. 2. To reach or attain exactly; to meet according to the occasion; to perform successfully; to attain to; to accord with; to be conformable to; to suit. Birds learning tunes, and their endeavors to hit the notes right. Locke. There you hit him; . . . that argument never fails with him. Dryden. Whose saintly visage is too bright To hit the sense of human sight. Milton. He scarcely hit my humor. Tennyson. 3. To guess; to light upon or discover. \"Thou hast hit it.\" Shak. 4. (Backgammon)  To take up, or replace by a piece belonging to the opposing player; -- said of a single unprotected piece on a point. To hit off, to describe with quick characteristic strokes; as, to hit off a speaker. Sir W. Temple. -- To hit out, to perform by good luck. [Obs.] Spenser.\n\n1. To meet or come in contact; to strike; to clash; -- followed by against or on. If bodies be extension alone, how can they move and hit one against another Locke. Corpuscles, meeting with or hitting on those bodies, become conjoined with them. Woodward. 2. To meet or reach what was aimed at or desired; to succeed, -- often with implied chance, or luck. And oft it hits Where hope is coldest and despair most fits. Shak. And millions miss for one that hits. Swift. To hit on or upon, to light upon; to come to by chance. \"None of them hit upon the art.\" Addison.\n\n1. A striking against; the collision of one body against another; the stroke that touches anything. So he the famed Cilician fencer praised, And, at each hit, with wonder seems amazed. Dryden. 2. A stroke of success in an enterprise, as by a fortunate chance; as, he made a hit. What late he called a blessing, now was wit, And God's good providence, a lucky hit. Pope. 3. A peculiarly apt expression or turn of thought; a phrase which hits the mark; as, a happy hit. 4. A game won at backgammon after the adversary has removed some of his men. It counts less than a gammon. 5. (Baseball)  A striking of the ball; as, a safe hit; a foul hit; -- sometimes used specifically for a base hit. Base hit, Safe hit, Sacrifice hit. (Baseball) See under Base, Safe, etc.\n\nhaving become very popular or acclaimed; -- said of entertainment performances; as, a hit record, a hit movie."}