{"word":"holy","definition":"1. Set apart to the service or worship of God; hallowed; sacred; reserved from profane or common use; holy vessels; a holy priesthood. \"Holy rites and solemn feasts.\" Milton. 2. Spiritually whole or sound; of unimpaired innocence and virtue; free from sinful affections; pure in heart; godly; pious; irreproachable; guiltless; acceptable to God. Now through her round of holy thought The Church our annual steps has brought. Keble. Holy Alliance (Hist.), a league ostensibly for conserving religion, justice, and peace in Europe, but really for repressing popular tendencies toward constitutional government, entered into by Alexander I. of Russia, Francis I. of Austria, and Frederic William III. of Prussia, at Paris, on the 26th of September, 1815, and subsequently joined by all the sovereigns of Europe, except the pope and the king of England. -- Holy bark. See Cascara sagrada. -- Holy Communion. See Eucharist. -- Holy family (Art), a picture in which the infant Christ, his parents, and others of his family are represented. -- Holy Father, a title of the pope. -- Holy Ghost (Theol.),the third person of the Trinity; the Comforter; the Paraclete. -- Holy Grail. See Grail. -- Holy grass (Bot.), a sweet-scented grass (Hierochloa borealis and H. alpina). In the north of Europe it was formerly strewed before church doors on saints' days; whence the name. It is common in the northern and western parts of the United States. Called also vanilla, or Seneca, grass. -- Holy Innocents' day, Childermas day. -- Holy Land, Palestine, the birthplace of Christianity. -- Holy office, the Inquisition. -- Holy of holies (Script.), the innermost apartment of the Jewish tabernacle or temple, where the ark was kept, and where no person entered, except the high priest once a year. -- Holy One. (a) The Supreme Being; -- so called by way of emphasis. \" The Holy One of Israel.\" Is. xliii. 14. (b) One separated to the service of God. -- Holy orders. See Order. -- Holy rood, the cross or crucifix, particularly one placed, in churches. over the entrance to the chancel. -- Holy rope, a plant, the hemp agrimony. -- Holy Saturday (Eccl.), the Saturday immediately preceding the festival of Easter; the vigil of Easter. -- Holy Spirit, same as Holy Ghost (above). -- Holy Spirit plant. See Dove plant. -- Holy thistle (Bot.), the blessed thistle. See under Thistle. -- Holy Thursday. (Eccl.) (a) (Episcopal Ch.) Ascension day. (b) (R. C. Ch.) The Thursday in Holy Week; Maundy Thursday. -- Holy war, a crusade; an expedition carried on by Christians against the Saracens in the Holy Land, in the eleventh, twelfth, and thirteenth centuries, for the possession of the holy places. -- Holy water (Gr. & R. C. Churches), water which has been blessed by the priest for sacred purposes. -- Holy-water stoup, the stone stoup or font placed near the entrance of a church, as a receptacle for holy water. -- Holy Week (Eccl.), the week before Easter, in which the passion of our Savior is commemorated. -- Holy writ, the sacred Scriptures. \" Word of holy writ.\" Wordsworth."}