{"word":"honey","definition":"1. A sweet viscid fluid, esp. that collected by bees from flowers of plants, and deposited in the cells of the honeycomb. 2. That which is sweet or pleasant, like honey. The honey of his language. Shak. 3. Sweet one; -- a term of endearment. Chaucer. Honey, you shall be well desired in Cyprus. Shak. Note: Honey is often used adjectively or as the first part of compound; as, honeydew or honey dew; honey guide or honeyguide; honey locust or honey-locust. Honey ant (Zoöl.), a small ant (Myrmecocystus melliger), found in the Southwestern United States, and in Mexico, living in subterranean formicares. There are larger and smaller ordinary workers, and others, which serve as receptacles or cells for the storage of honey, their abdomens becoming distended to the size of a currant. These, in times of scarcity, regurgitate the honey and feed the rest. -- Honey badger (Zoöl.), the ratel. -- Honey bear. (Zoöl.) See Kinkajou. -- Honey buzzard (Zoöl.), a bird related to the kites, of the genus Pernis. The European species is P. apivorus; the Indian or crested honey buzzard is P. ptilorhyncha. They feed upon honey and the larvæ of bees. Called also bee hawk, bee kite. -- Honey creeper (Zoöl.), one of numerous species of small, bright, colored, passerine birds of the family Coerebidæ, abundant in Central and South America. -- Honey easter (Zoöl.), one of numerous species of small passerine birds of the family Meliphagidæ, abundant in Australia and Oceania; - - called also honeysucker. -- Honey flower (Bot.), an evergreen shrub of the genus Melianthus, a native of the Cape of Good Hope. The flowers yield much honey. -- Honey guide (Zoöl.), one of several species of small birds of the family Indicatoridæ, inhabiting Africa and the East Indies. They have the habit of leading persons to the nests to wild bees. Called also honeybird, and indicator. -- Honey harvest, the gathering of honey from hives, or the honey which is gathered. Dryden. -- Honey kite. (Zoöl.) See Honey buzzard (above). -- Honey locust (Bot.), a North American tree (Gleditschia triacanthos), armed with thorns, and having long pods with a sweet pulp between the seeds. -- Honey month. Same as Honeymoon. -- Honey weasel (Zoöl.), the ratel.\n\nTo be gentle, agreeable, or coaxing; to talk fondly; to use endearments; also, to be or become obsequiously courteous or complimentary; to fawn. \"Honeying and making love.\" Shak. Rough to common men, But honey at the whisper of a lord. Tennyson.\n\nTo make agreeable; to cover or sweeten with, or as with, honey. Canst thou not honey me with fluent speech Marston."}