{"word":"hook","definition":"1. A piece of metal, or other hard material, formed or bent into a curve or at an angle, for catching, holding, or sustaining anything; as, a hook for catching fish; a hook for fastening a gate; a boat hook, etc. 2. That part of a hinge which is fixed to a post, and on which a door or gate hangs and turns. 3. An implement for cutting grass or grain; a sickle; an instrument for cutting or lopping; a billhook. Like slashing Bentley with his desperate hook. Pope. 4. (Steam Engin.)  See Eccentric, and V-hook. 5. A snare; a trap. [R.] Shak. 6. A field sown two years in succession. [Prov. Eng.] 7. pl.  The projecting points of the thigh bones of cattle; -- called also hook bones. By hook or by crook, one way or other; by any means, direct or indirect. Milton. \"In hope her to attain by hook or crook.\" Spenser. -- Off the hooks, unhinged; disturbed; disordered. [Colloq.] \"In the evening, by water, to the Duke of Albemarle, whom I found mightly off the hooks that the ships are not gone out of the river.\" Pepys. -- On one's own hook, on one's own account or responsibility; by one's self. [Colloq. U.S.] Bartlett. -- To go off the hooks, to die. [Colloq.] Thackeray. -- Bid hook, a small boat hook. -- Chain hook. See under Chain. -- Deck hook, a horizontal knee or frame, in the bow of a ship, on which the forward part of the deck rests. -- Hook and eye, one of the small wire hooks and loops for fastening together the opposite edges of a garment, etc. -- Hook bill (Zoöl.), the strongly curved beak of a bird. -- Hook ladder, a ladder with hooks at the end by which it can be suspended, as from the top of a wall. -- Hook motion (Steam Engin.), a valve gear which is reversed by V hooks. -- Hook squid, any squid which has the arms furnished with hooks, instead of suckers, as in the genera Enoploteuthis and Onychteuthis. -- Hook wrench, a wrench or spanner, having a hook at the end, instead of a jaw, for turning a bolthead, nut, or coupling.\n\n1. To catch or fasten with a hook or hooks; to seize, capture, or hold, as with a hook, esp. with a disguised or baited hook; hence, to secure by allurement or artifice; to entrap; to catch; as, to hook a dress; to hook a trout. Hook him, my poor dear, . . . at any sacrifice. W. Collins. 2. To seize or pierce with the points of the horns, as cattle in attacking enemies; to gore. 3. To steal. [Colloq. Eng. & U.S.] To hook on, to fasten or attach by, or as by, hook.\n\nTo bend; to curve as a hook."}