{"word":"hoop","definition":"1. A pliant strip of wood or metal bent in a circular form, and united at the ends, for holding together the staves of casks, tubs, etc. 2. A ring; a circular band; anything resembling a hoop, as the cylinder (cheese hoop) in which the curd is pressed in making cheese. 3. A circle, or combination of circles, of thin whalebone, metal, or other elastic material, used for expanding the skirts of ladies' dresses; crinoline; -- used chiefly in the plural. Though stiff with hoops, and armed with ribs of whale. Pope. 4. A quart pot; -- so called because originally bound with hoops, like a barrel. Also, a portion of the contents measured by the distance between the hoops. [Obs.] 5. An old measure of capacity, variously estimated at from one to four pecks. [Eng.] Halliwell. Bulge hoop, Chine hoop, Quarter hoop, the hoop nearest the middle of a cask, that nearest the end, and the intermediate hoop between these two, respectively. -- Flat hoop, a wooden hoop dressed flat on both sides. -- Half-round hoop, a wooden hoop left rounding and undressed on the outside. -- Hoop iron, iron in thin narrow strips, used for making hoops. -- Hoop lock, the fastening for uniting the ends of wooden hoops by notching and interlocking them. -- Hoop skirt, a framework of hoops for expanding the skirts of a woman's dress; -- called also hoop petticoat. -- Hoop snake (Zoöl.), a harmless snake of the Southern United States (Abaster erythrogrammus); -- so called from the mistaken notion that it curves itself into a hoop, taking its tail into its mouth, and rolls along with great velocity. -- Hoop tree (Bot.), a small West Indian tree (Melia sempervirens), of the Mahogany family.\n\n1. To bind or fasten with hoops; as, to hoop a barrel or puncheon. 2. To clasp; to encircle; to surround. Shak.\n\n1. To utter a loud cry, or a sound imitative of the word, by way of call or pursuit; to shout. [Usually written whoop.] 2. To whoop, as in whooping cough. See Whoop. Hooping cough. (Med.) See Whooping cough.\n\n1. To drive or follow with a shout. \"To be hooped out of Rome.\" Shak. 2. To call by a shout or peculiar cry.\n\n1. A shout; a whoop, as in whooping cough. 2. (Zoöl.)  The hoopoe. See Hoopoe."}