{"word":"horn","definition":"1. A hard, projecting, and usually pointed organ, growing upon the heads of certain animals, esp. of the ruminants, as cattle, goats, and the like. The hollow horns of the Ox family consist externally of true horn, and are never shed. 2. The antler of a deer, which is of bone throughout, and annually shed and renewed. 3. (Zoöl.)  Any natural projection or excrescence from an animal, resembling or thought to resemble a horn in substance or form; esp.: (a) A projection from the beak of a bird, as in the hornbill. (b) A tuft of feathers on the head of a bird, as in the horned owl. (c) A hornlike projection from the head or thorax of an insect, or the head of a reptile, or fish. (d) A sharp spine in front of the fins of a fish, as in the horned pout. 4. (Bot.)  An incurved, tapering and pointed appendage found in the flowers of the milkweed (Asclepias). 5. Something made of a horn, or in resemblance of a horn; as: (a) A wind instrument of music; originally, one made of a horn (of an ox or a ram); now applied to various elaborately wrought instruments of brass or other metal, resembling a horn in shape. \"Wind his horn under the castle wall.\" Spenser. See French horn, under French. (b) A drinking cup, or beaker, as having been originally made of the horns of cattle. \"Horns of mead and ale.\" Mason. (c) The cornucopia, or horn of plenty. See Cornucopia. \"Fruits and flowers from Amalthæa's horn.\" Milton. (d) A vessel made of a horn; esp., one designed for containing powder; anciently, a small vessel for carrying liquids. \"Samuel took the hornof oil and anointed him [David].\" 1 Sam. xvi. 13. (e) The pointed beak of an anvil. (f) The high pommel of a saddle; also, either of the projections on a lady's saddle for supporting the leg. (g) (Arch.) The Ionic volute. (h) (Naut.) The outer end of a crosstree; also, one of the projections forming the jaws of a gaff, boom, etc. (i) (Carp.) A curved projection on the fore part of a plane. (j) One of the projections at the four corners of the Jewish altar of burnt offering. \"Joab . . . caught hold on the horns of the altar.\" 1 Kings ii. 28. 6. One of the curved ends of a crescent; esp., an extremity or cusp of the moon when crescent-shaped. The moon Wears a wan circle round her blunted horns. Thomson. 7. (Mil.)  The curving extremity of the wing of an army or of a squadron drawn up in a crescentlike form. Sharpening in mooned horns Their phalanx. Milton. 8. The tough, fibrous material of which true horns are composed, being, in the Ox family, chiefly albuminous, with some phosphate of lime; also, any similar substance, as that which forms the hoof crust of horses, sheep, and cattle; as, a spoon of horn. 9. (Script.)  A symbol of strength, power, glory, exaltation, or pride. The Lord is . . . the horn of my salvation. Ps. xviii. 2. 10. An emblem of a cuckold; -- used chiefly in the plural. \"Thicker than a cuckold's horn.\" Shak. Horn block, the frame or pedestal in which a railway car axle box slides up and down; -- also called horn plate. -- Horn of a dilemma. See under Dilemma. -- Horn distemper, a disease of cattle, affecting the internal substance of the horn. -- Horn drum, a wheel with long curved scoops, for raising water. -- Horn lead (Chem.), chloride of lead. -- Horn maker, a maker of cuckolds. [Obs.] Shak. -- Horn mercury. (Min.) Same as Horn quicksilver (below). -- Horn poppy (Bot.), a plant allied to the poppy (Glaucium luteum), found on the sandy shores of Great Britain and Virginia; -- called also horned poppy. Gray. -- Horn pox (Med.), abortive smallpox with an eruption like that of chicken pox. -- Horn quicksilver (Min.), native calomel, or bichloride of mercury. -- Horn shell (Zoöl.), any long, sharp, spiral, gastropod shell, of the genus Cerithium, and allied genera. -- Horn silver (Min.), cerargyrite. -- Horn slate, a gray, siliceous stone. -- To haul in one's horns, to withdraw some arrogant pretension. [Colloq.] -- To raise, or lift, the horn (Script.), to exalt one's self; to act arrogantly. \"'Gainst them that raised thee dost thou lift thy horn\" Milton. -- To take a horn, to take a drink of intoxicating liquor. [Low]\n\n1. To furnish with horns; to give the shape of a horn to. 2. To cause to wear horns; to cuckold. [Obs.] Shak."}