{"word":"humor","definition":"1. Moisture, especially, the moisture or fluid of animal bodies, as the chyle, lymph, etc.; as, the humors of the eye, etc. Note: The ancient physicians believed that there were four humors (the blood, phlegm, yellow bile or choler, and black bile or melancholy), on the relative proportion of which the temperament and health depended. 2. (Med.)  A vitiated or morbid animal fluid, such as often causes an eruption on the skin. \"A body full of humors.\" Sir W. Temple. 3. State of mind, whether habitual or temporary (as formerly supposed to depend on the character or combination of the fluids of the body); disposition; temper; mood; as, good humor; ill humor. Examine how your humor is inclined, And which the ruling passion of your mind. Roscommon. A prince of a pleasant humor. Bacon. I like not the humor of lying. Shak. 4. pl.  Changing and uncertain states of mind; caprices; freaks; vagaries; whims. Is my friend all perfection, all virtue and discretion Has he not humors to be endured South. 5. That quality of the imagination which gives to ideas an incongruous or fantastic turn, and tends to excite laughter or mirth by ludicrous images or representations; a playful fancy; facetiousness. For thy sake I admit That a Scot may have humor, I'd almost said wit. Goldsmith. A great deal of excellent humor was expended on the perplexities of mine host. W. Irving. Aqueous humor, Crystalline humor or lens, Vitreous humor. (Anat.) See Eye. -- Out of humor, dissatisfied; displeased; in an unpleasant frame of mind. Syn. -- Wit; satire; pleasantry; temper; disposition; mood; frame; whim; fancy; caprice. See Wit.\n\n1. To comply with the humor of; to adjust matters so as suit the peculiarities, caprices, or exigencies of; to adapt one's self to; to indulge by skillful adaptation; as, to humor the mind. It is my part to invent, and the musician's to humor that invention. Dryden. 2. To help on by indulgence or compliant treatment; to soothe; to gratify; to please. You humor me when I am sick. Pope. Syn. -- To gratify; to indulge. See Gratify."}