{"word":"hydrogen","definition":"A gaseous element, colorless, tasteless, and odorless, the lightest known substance, being fourteen and a half times lighter than air (hence its use in filling balloons), and over eleven thousand times lighter than water. It is very abundant, being an ingredient of water and of many other substances, especially those of animal or vegetable origin. It may by produced in many ways, but is chiefly obtained by the action of acids (as sulphuric) on metals, as zinc, iron, etc. It is very inflammable, and is an ingredient of coal gas and water gas. It is standard of chemical equivalents or combining weights, and also of valence, being the typical monad. Symbol H. Atomic weight 1. Note: Although a gas, hydrogen is chemically similar to the metals in its nature, having the properties of a weak base. It is, in all acids, the base which is replaced by metals and basic radicals to form salts. Like all other gases, it is condensed by great cold and pressure to a liquid which freezes and solidifies by its own evaporation. It is absorbed in large quantities by certain metals (esp. palladium), forming alloy-like compounds; hence, in view of quasi-metallic nature, it is sometimes called hydrogenium. It is the typical reducing agent, as opposed to oxidizers, as oxygen, chlorine, etc. Bicarbureted hydrogen, an old name for ethylene. -- Carbureted hydrogen gas. See under Carbureted. -- Hydrogen dioxide, a thick, colorless liquid, H2O2, resembling water, but having a bitter, sour taste, produced by the action of acids on barium peroxide. It decomposes into water and oxygen, and is manufactured in large quantities for an oxidizing and bleaching agent. Called also oxygenated water. -- Hydrogen oxide, a chemical name for water, H -- Hydrogen sulphide, a colorless inflammable gas, H2S, having the characteristic odor of bad eggs, and found in many mineral springs. It is produced by the action of acids on metallic sulphides, and is an important chemical reagent. Called also sulphureted hydrogen."}