{"word":"hydraulic","definition":"Of or pertaining to hydraulics, or to fluids in motion; conveying, or acting by, water; as, an hydraulic clock, crane, or dock. Hydraulic accumulator, an accumulator for hydraulic machinery of any kind. See Accumulator, 2. -- Hydraulic brake, a cataract. See Cataract, 3. -- Hydraulic cement, a cement or mortar made of hydraulic lime, which will harden under water. -- Hydraulic elevator, a lift operated by the weight or pressure of water. -- Hydraulic jack. See under Jack. -- Hydraulic lime, quicklime obtained from hydraulic limestone, and used for cementing under water, etc. -- Hydraulic limestone, a limestone which contains some clay, and which yields a quicklime that will set, or form a firm, strong mass, under water. -- Hydraulic main (Gas Works), a horizontal pipe containing water at the bottom into which the ends of the pipes from the retorts dip, for passing the gas through water in order to remove ammonia. -- Hydraulic mining, a system of mining in which the force of a jet of water is used to wash down a bank of gold-bearing gravel or earth. [Pacific Coast] -- Hydraulic press, a hydrostatic press. See under Hydrostatic. -- Hydraulic propeller, a device for propelling ships by means of a stream of water ejected under water rearward from the ship. -- Hydraulic ram, a machine for raising water by means of the energy of the moving water of which a portion is to be raised. When the rush of water through the main pipe d shuts the valve at a, the momentum of the current thus suddenly checked forces part of it into the air chamber b, and up the pipe c, its return being prevented by a valve at the entrance to the air chamber, while the dropping of the valve a by its own weight allows another rush through the main pipe, and so on alternately. -- Hydraulic valve. (Mach.) (a) A valve for regulating the distribution of water in the cylinders of hydraulic elevators, cranes, etc. (b) (Gas Works) An inverted cup with a partition dipping into water, for opening or closing communication between two gas mains, the open ends of which protrude about the water."}