{"word":"ice","definition":"1. Water or other fluid frozen or reduced to the solid state by cold; frozen water. It is a white or transparent colorless substance, crystalline, brittle, and viscoidal. Its specific gravity (0.92, that of water at 4° C. being 1.0) being less than that of water, ice floats. Note: Water freezes at 32° F. or 0° Cent., and ice melts at the same temperature. Ice owes its cooling properties to the large amount of heat required to melt it. 2. Concreted sugar. Johnson. 3. Water, cream, custard, etc., sweetened, flavored, and artificially frozen. 4. Any substance having the appearance of ice; as, camphor ice. Anchor ice, ice which sometimes forms about stones and other objects at the bottom of running or other water, and is thus attached or anchored to the ground. -- Bay ice, ice formed in bays, fiords, etc., often in extensive fields which drift out to sea. -- Ground ice, anchor ice. -- Ice age (Geol.), the glacial epoch or period. See under Glacial. -- Ice anchor (Naut.), a grapnel for mooring a vessel to a field of ice. Kane. -- Ice blink Etym: [Dan. iisblink], a streak of whiteness of the horizon, caused by the reflection of light from ice not yet in sight. -- Ice boat. (a) A boat fitted with skates or runners, and propelled on ice by sails; an ice yacht. (b) A strong steamboat for breaking a channel through ice. -- Ice box or chest, a box for holding ice; a box in which things are kept cool by means of ice; a refrigerator. -- Ice brook, a brook or stream as cold as ice. [Poetic] Shak. -- Ice cream Etym: [for iced cream], cream, milk, or custard, sweetened, flavored, and frozen. -- Ice field, an extensive sheet of ice. -- Ice float, Ice floe, a sheet of floating ice similar to an ice field, but smaller. -- Ice foot, shore ice in Arctic regions; an ice belt. Kane. -- Ice house, a close-covered pit or building for storing ice. -- Ice machine (Physics), a machine for making ice artificially, as by the production of a low temperature through the sudden expansion of a gas or vapor, or the rapid evaporation of a volatile liquid. -- Ice master. See Ice pilot (below). -- Ice pack, an irregular mass of broken and drifting ice. -- Ice paper, a transparent film of gelatin for copying or reproducing; papier glacé. -- Ice petrel (Zoöl.), a shearwater (Puffinus gelidus) of the Antarctic seas, abundant among floating ice. -- Ice pick, a sharp instrument for breaking ice into small pieces. -- Ice pilot, a pilot who has charge of a vessel where the course is obstructed by ice, as in polar seas; -- called also ice master. -- Ice pitcher, a pitcher adapted for ice water. -- Ice plow, a large tool for grooving and cutting ice. ice sculpture = a sculpture carved from a block of ice, often used for decorating restaurants. ice show an entertainment consisting of ice skaters performing figure-skating on a sheet of ice, usually in an arena, often accompanied by music. -- Ice sludge, bay ice broken small by the wind or waves; sludge. -- Ice spar (Min.), a variety of feldspar, the crystals of which are very clear like ice; rhyacolite. -- Ice tongs, large iron nippers for handling ice. -- Ice water. (a) Water cooled by ice. (b) Water formed by the melting of ice. -- Ice yacht. See Ice boat (above). -- To break the ice. See under Break. -- Water ice, a confection consisting of water sweetened, flavored, and frozen.\n\n1. To cover with ice; to convert into ice, or into something resembling ice. 2. To cover with icing, or frosting made of sugar and milk or white of egg; to frost, as cakes, tarts, etc. 3. To chill or cool, as with ice; to freeze."}