{"word":"ill","definition":"1. Contrary to good, in a physical sense; contrary or opposed to advantage, happiness, etc.; bad; evil; unfortunate; disagreeable; unfavorable. Neither is it ill air only that maketh an ill seat, but ill ways, ill markets, and ill neighbors. Bacon. There 's some ill planet reigns. Shak. 2. Contrary to good, in a moral sense; evil; wicked; wrong; iniquitious; naughtly; bad; improper. Of his own body he was ill, and gave The clergy ill example. Shak. 3. Sick; indisposed; unwell; diseased; disordered; as, ill of a fever. I am in health, I breathe, and see thee ill. Shak. 4. Not according with rule, fitness, or propriety; incorrect; rude; unpolished; inelegant. That 's an ill phrase. Shak. Ill at ease, uneasy; uncomfortable; anxious. \"I am very ill at ease.\" Shak. -- Ill blood, enmity; resentment. -- Ill breeding, want of good breeding; rudeness. -- Ill fame, ill or bad repute; as, a house of ill fame, a house where lewd persons meet for illicit intercourse. -- Ill humor, a disagreeable mood; bad temper. -- Ill nature, bad disposition or temperament; sullenness; esp., a disposition to cause unhappiness to others. -- Ill temper, anger; moroseness; crossness. -- Ill turn. (a) An unkind act. (b) A slight attack of illness. [Colloq. U.S.] -- Ill will, unkindness; enmity; malevolence. Syn. -- Bad; evil; wrong; wicked; sick; unwell.\n\n1. Whatever annoys or impairs happiness, or prevents success; evil of any kind; misfortune; calamity; disease; pain; as, the ills of humanity. Who can all sense of others' ills escape Is but a brute at best in human shape. Tate. That makes us rather bear those ills we have Than fly to others that we know not of. Shak. 2. Whatever is contrary to good, in a moral sense; wickedness; depravity; iniquity; wrong; evil. Strong virtue, like strong nature, struggles still, Exerts itself, and then throws off the ill. Dryden.\n\nIn a ill manner; badly; weakly. How ill this taper burns! Shak. Ill fares the land, to hastening ills a prey, Where wealth accumulates and men decay. Goldsmith. Note: Ill, like above, well, and so, is used before many participal adjectives, in its usual adverbal sense. When the two words are used as an epithet preceding the noun qualified they are commonly hyphened; in other cases they are written separatively; as, an ill- educated man; he was ill educated; an ill-formed plan; the plan, however ill formed, was acceptable. Ao, also, the following: ill- affected or ill affected, ill-arranged or ill arranged, ill-assorted or ill assorted, ill-boding or ill boding, ill-bred or ill bred, ill- conditioned, ill-conducted, ill-considered, ill-devised, ill- disposed, ill-doing, ill-fairing, ill-fated, ill-favored, ill- featured, ill-formed, ill-gotten, ill-imagined, ill-judged, ill- looking, ill-mannered, ill-matched, ill-meaning, ill-minded, ill- natured, ill-omened, ill-proportioned, ill-provided, ill-required, ill-sorted, ill-starred, ill-tempered, ill-timed, ill-trained, ill- used, and the like. I' LL I' ll  . Contraction for I will or I shall. I'll by a sign give notice to our friends. Shak."}