{"word":"image","definition":"1. An imitation, representation, or similitude of any person, thing, or act, sculptured, drawn, painted, or otherwise made perceptible to the sight; a visible presentation; a copy; a likeness; an effigy; a picture; a semblance. Even like a stony image, cold and numb. Shak. Whose is this image and superscription Matt. xxii. 20. This play is the image of a murder done in Vienna. Shak. And God created man in his own image. Gen. i. 27. 2. Hence: The likeness of anything to which worship is paid; an idol. Chaucer. Thou shalt not make unto thee any graven image, . . . thou shalt not bow down thyself to them. Ex. xx. 4, 5. 3. Show; appearance; cast. The face of things a frightful image bears. Dryden. 4. A representation of anything to the mind; a picture drawn by the fancy; a conception; an idea. Can we conceive Image of aught delightful, soft, or great Prior. 5. (Rhet.)  A picture, example, or illustration, often taken from sensible objects, and used to illustrate a subject; usually, an extended metaphor. Brande & C. 6. (Opt.)  The figure or picture of any object formed at the focus of a lens or mirror, by rays of light from the several points of the object symmetrically refracted or reflected to corresponding points in such focus; this may be received on a screen, a photographic plate, or the retina of the eye, and viewed directly by the eye, or with an eyeglass, as in the telescope and microscope; the likeness of an object formed by reflection; as, to see one's image in a mirror. Electrical image. See under Electrical. -- Image breaker, one who destroys images; an iconoclast. -- Image graver, Image maker, a sculptor. -- Image worship, the worship of images as symbols; iconolatry distinguished from idolatry; the worship of images themselves. -- Image Purkinje (Physics), the image of the retinal blood vessels projected in, not merely on, that membrane. -- Virtual image (Optics), a point or system of points, on one side of a mirror or lens, which, if it existed, would emit the system of rays which actually exists on the other side of the mirror or lens. Clerk Maxwell.\n\n1. To represent or form an image of; as, the still lake imaged the shore; the mirror imaged her figure. \"Shrines of imaged saints.\" J. Warton. 2. To represent to the mental vision; to form a likeness of by the fancy or recollection; to imagine. Condemn'd whole years in absence to deplore, And image charms he must behold no more. Pope."}