{"word":"imagination","definition":"1. The imagine-making power of the mind; the power to create or reproduce ideally an object of sense previously perceived; the power to call up mental imagines. Our simple apprehension of corporeal objects, if present, is sense; if absent, is imagination. Glanvill. Imagination is of three kinds: joined with belief of that which is to come; joined with memory of that which is past; and of things present, or as if they were present. Bacon. 2. The representative power; the power to reconstruct or recombine the materials furnished by direct apprehension; the complex faculty usually termed the plastic or creative power; the fancy. The imagination of common language -- the productive imagination of philosophers -- is nothing but the representative process plus the process to which I would give the name of the \"comparative.\" Sir W. Hamilton. The power of the mind to decompose its conceptions, and to recombine the elements of them at its pleasure, is called its faculty of imagination. I. Taylor. The business of conception is to present us with an exact transcript of what we have felt or perceived. But we have moreover a power of modifying our conceptions, by combining the parts of different ones together, so as to form new wholes of our creation. I shall employ the word imagination to express this power. Stewart. 3. The power to recombine the materials furnished by experience or memory, for the accomplishment of an elevated purpose; the power of conceiving and expressing the ideal. The lunatic, the lover, and the poet Are of imagination all compact . . . The poet's eye, in a fine frenzy rolling, Doth glance from heaven to earth, from earth to heaven, And as imagination bodies forth The forms of things unknown, the poet's pen Turns them to shapes, and gives to airy nothing A local habitation and a name. Shak. 4. A mental image formed by the action of the imagination as a faculty; a conception; a notion. Shak. Syn. -- Conception; idea; conceit; fancy; device; origination; invention; scheme; design; purpose; contrivance. -- Imagination, Fancy. These words have, to a great extent, been interchanged by our best writers, and considered as strictly synonymous. A distinction, however, is now made between them which more fully exhibits their nature. Properly speaking, they are different exercises of the same general power -- the plastic or creative faculty. Imagination consists in taking parts of our conceptions and combining them into new forms and images more select, more striking, more delightful, more terrible, etc., than those of ordinary nature. It is the higher exercise of the two. It creates by laws more closely connected with the reason; it has strong emotion as its actuating and formative cause; it aims at results of a definite and weighty character. Milton's fiery lake, the debates of his Pandemonium, the exquisite scenes of his Paradise, are all products of the imagination. Fancy moves on a lighter wing; it is governed by laws of association which are more remote, and sometimes arbitrary or capricious. Hence the term fanciful, which exhibits fancy in its wilder flights. It has for its actuating spirit feelings of a lively, gay, and versatile character; it seeks to please by unexpected combinations of thought, startling contrasts, flashes of brilliant imagery, etc. Pope's Rape of the Lock is an exhibition of fancy which has scarcely its equal in the literature of any country. -- \"This, for instance, Wordworth did in respect of the words `imagination' and `fancy.' Before he wrote, it was, I suppose, obscurely felt by most that in `imagination' there was more of the earnest, in `fancy' of the play of the spirit; that the first was a loftier faculty and gift than the second; yet for all this words were continually, and not without loss, confounded. He first, in the preface to his Lyrical Ballads, rendered it henceforth impossible that any one, who had read and mastered what he has written on the two words, should remain unconscious any longer of the important difference between them.\" Trench. The same power, which we should call fancy if employed on a production of a light nature, would be dignified with the title of imagination if shown on a grander scale. C. J. Smith."}