{"word":"improve","definition":"1. To disprove or make void; to refute. [Obs.] Neither can any of them make so strong a reason which another can not improve. Tyndale. 2. To disapprove; to find fault with; to reprove; to censure; as, to improve negligence. [Obs.] Chapman. When he rehearsed his preachings and his doing unto the high apostles, they could improve nothing. Tyndale.\n\n1. To make better; to increase the value or good qualities of; to ameliorate by care or cultivation; as, to improve land. Donne. I love not to improve the honor of the living by impairing that of the dead. Denham. 2. To use or employ to good purpose; to make productive; to turn to profitable account; to utilize; as, to improve one's time; to improve his means. Shak. We shall especially honor God by improving diligently the talents which God hath committed to us. Barrow. A hint that I do not remember to have seen opened and improved. Addison. The court seldom fails to improve the oppotunity. Blackstone. How doth the little busy bee Improve each shining hour. I. Watts. Those moments were diligently improved. Gibbon. True policy, as well as good faith, in my opinion, binds us to improve the occasion. Washington. 3. To advance or increase by use; to augment or add to; -- said with reference to what is bad. [R.] We all have, I fear, . . . not a little improved the wretched inheritance of our ancestors. Bp. Porteus. Syn. -- To better; meliorate; ameliorate; advance; heighten; mend; correct; recify; amend; reform.\n\n1. To grow better; to advance or make progress in what is desirable; to make or show improvement; as, to improve in health. We take care to improve in our frugality and diligence. Atterbury. 2. To advance or progress in bad qualities; to grow worse. \"Domitain improved in cruelty.\" Milner. 3. To increase; to be enhanced; to rise in value; as, the price of cotton improves. To improve on or upon, to make useful additions or amendments to, or changes in; to bring nearer to perfection; as, to improve on the mode of tillage."}