{"word":"in","definition":"The specific signification of in is situation or place with respect to surrounding, environment, encompassment, etc. It is used with verbs signifying being, resting, or moving within limits, or within circumstances or conditions of any kind conceived of as limiting, confining, or investing, either wholly or in part. In its different applications, it approaches some of the meanings of, and sometimes is interchangeable with, within, into, on, at, of, and among. It is used: -- 1. With reference to space or place; as, he lives in Boston; he traveled in Italy; castles in the air. The babe lying in a manger. Luke ii. 16. Thy sun sets weeping in the lowly west. Shak. Situated in the forty-first degree of latitude. Gibbon. Matter for censure in every page. Macaulay. 2. With reference to circumstances or conditions; as, he is in difficulties; she stood in a blaze of light. \"Fettered in amorous chains.\" Shak. Wrapt in sweet sounds, as in bright veils. Shelley. 3. With reference to a whole which includes or comprises the part spoken of; as, the first in his family; the first regiment in the army. Nine in ten of those who enter the ministry. Swift. 4. With reference to physical surrounding, personal states, etc., abstractly denoted; as, I am in doubt; the room is in darkness; to live in fear. When shall we three meet again, In thunder, lightning, or in rain Shak. 5. With reference to character, reach, scope, or influence considered as establishing a limitation; as, to be in one's favor. \"In sight of God's high throne.\" Milton. Sounds inharmonious in themselves, and harsh. Cowper. 6. With reference to movement or tendency toward a certain limit or environment; -- sometimes equivalent to into; as, to put seed in the ground; to fall in love; to end in death; to put our trust in God. He would not plunge his brother in despair. Addison. She had no jewels to deposit in their caskets. Fielding. 7. With reference to a limit of time; as, in an hour; it happened in the last century; in all my life. In as much as, or Inasmuch as, in the degree that; in like manner as; in consideration that; because that; since. See Synonym of Because, and cf. For as much as, under For, prep. -- In that, because; for the reason that. \"Some things they do in that they are men . . . ; some things in that they are men misled and blinded with error.\" Hooker. -- In the name of, in behalf of; on the part of; by authority; as, it was done in the name of the people; -- often used in invocation, swearing, praying, and the like. -- To be in for it. (a) To be in favor of a thing; to be committed to a course. (b) To be unable to escape from a danger, penalty, etc. [Colloq.] -- To be (or keep) in with. (a) To be close or near; as, to keep a ship in with the land. (b) To be on terms of friendship, familiarity, or intimacy with; to secure and retain the favor of. [Colloq.] Syn. -- Into; within; on; at. See At.\n\n1. Not out; within; inside. In, the preposition, becomes an adverb by omission of its object, leaving it as the representative of an adverbial phrase, the context indicating what the omitted object is; as, he takes in the situation (i. e., he comprehends it in his mind); the Republicans were in (i. e., in office); in at one ear and out at the other (i. e., in or into the head); his side was in (i. e., in the turn at the bat); he came in (i. e., into the house). Their vacation . . . falls in so pat with ours. Lamb. Note: The sails of a vessel are said, in nautical language, to be in when they are furled, or when stowed. In certain cases in has an adjectival sense; as, the in train (i. e., the incoming train); compare up grade, down grade, undertow, afterthought, etc. 2. (Law)  With privilege or possession; -- used to denote a holding, possession, or seisin; as, in by descent; in by purchase; in of the seisin of her husband. Burrill. In and in breeding. See under Breeding. -- In and out (Naut.), through and through; -- said of a through bolt in a ship's side. Knight. -- To be in, to be at home; as, Mrs. A. is in. -- To come in. See under Come.\n\n1. One who is in office; -- the opposite of Ant: out. 2. A reëntrant angle; a nook or corner. Ins and outs, nooks and corners; twists and turns. All the ins and outs of this neighborhood. D. Jerrold.\n\nTo inclose; to take in; to harvest. [Obs.] He that ears my land spares my team and gives me leave to in the crop. Shak."}