{"word":"increase","definition":"1. To become greater or more in size, quantity, number, degree, value, intensity, power, authority, reputation, wealth; to grow; to augment; to advance; -- opposed to decrease. The waters increased and bare up the ark. Gen. vii. 17. He must increase, but I must decrease. John iii. 30. The heavens forbid But that our loves and comforts should increase, Even as our days do grow! Shak. 2. To multiply by the production of young; to be fertile, fruitful, or prolific. Fishes are more numerous of increasing than beasts or birds, as appears by their numerous spawn. Sir M. Hale. 3. (Astron.)  To become more nearly full; to show more of the surface; to wax; as, the moon increases. Increasing function (Math.), a function whose value increases when that of the variable increases, and decreases when the latter is diminished. Syn. -- To enlarge; extend; multiply; expand; develop; heighten; amplify; raise; enhance; spread; aggravate; magnify; augment; advance. -- To Increase, Enlarge, Extend. Enlarge implies to make larger or broader in size. Extend marks the progress of enlargement so as to have wider boundaries. Increase denotes enlargement by growth and internal vitality, as in the case of plants. A kingdom is enlarged by the addition of new territories; the mind is enlarged by knowledge. A kingdom is extended when its boundaries are carried to a greater distance from the center. A man's riches, honors, knowledge, etc., are increased by accessions which are made from time to time.\n\nTo augment or make greater in bulk, quantity, extent, value, or amount, etc.; to add to; to extend; to lengthen; to enhance; to aggravate; as, to increase one's possessions, influence. I will increase the famine. Ezek. v. 16. Make denials Increase your services. Shak.\n\n1. Addition or enlargement in size, extent, quantity, number, intensity, value, substance, etc.; augmentation; growth. As if increase of appetite had grown By what if fed on. Shak. For things of tender kind for pleasure made Shoot up with swift increase, and sudden are decay'd. Dryden. 2. That which is added to the original stock by augmentation or growth; produce; profit; interest. Take thou no usury of him, or increase. Lev. xxv. 36. Let them not live to taste this land's increase. Shak. 3. Progeny; issue; offspring. All the increase of thy house shall die in the flower of their age. 1 Sam. ii. 33. 4. Generation. [Obs.] \"Organs of increase.\" Shak. 5. (Astron.)  The period of increasing light, or luminous phase; the waxing; -- said of the moon. Seeds, hair, nails, hedges, and herbs will grow soonest if set or cut in the increase of the moon. Bacon. Increase twist, the twixt of a rifle groove in which the angle of twist increases from the breech to the muzzle. Syn. -- Enlargement; extension; growth; development; increment; addition; accession; production."}