{"word":"indigo","definition":"1. A kind of deep blue, one of the seven prismatic colors. 2. (Chem.)  A blue dyestuff obtained from several plants belonging to very different genera and orders; as, the woad, Isatis tinctoria, Indigofera tinctoria, I. Anil, Nereum tinctorium, etc. It is a dark blue earthy substance, tasteless and odorless, with a copper-violet luster when rubbed. Indigo does not exist in the plants as such, but is obtained by decomposition of the glycoside indican. Note: Commercial indigo contains the essential coloring principle indigo blue or indigotine, with several other dyes; as, indigo red, indigo brown, etc., and various impurities. Indigo is insoluble in ordinary reagents, with the exception of strong sulphuric acid. Chinese indigo (Bot.), Isatis indigotica, a kind of woad. -- Wild indigo (Bot.), the American herb Baptisia tinctoria which yields a poor quality of indigo, as do several other species of the same genus.\n\nHaving the color of, pertaining to, or derived from, indigo. Indigo berry (Bot.), the fruit of the West Indian shrub Randia aculeata, used as a blue dye. -- Indigo bird (Zoöl.), a small North American finch (Cyanospiza cyanea). The male is indigo blue in color. Called also indigo bunting. -- Indigo blue. (a) The essential coloring material of commercial indigo, from which it is obtained as a dark blue earthy powder, with a reddish luster, C16H10N2O2, which may be crystallized by sublimation. Indigo blue is also made from artificial amido cinnamic acid, and from artificial isatine; and these methods are of great commercial importance. Called also indigotin. (b) A dark, dull blue color like the indigo of commerce. -- Indigo brown (Chem.), a brown resinous substance found in crude indigo. -- Indigo copper (Min.), covellite. -- Indigo green, a green obtained from indigo. -- Indigo plant (Bot.), a leguminous plant of several species (genus Indigofera), from which indigo is prepared. The different varieties are natives of Asia, Africa, and America. Several species are cultivated, of which the most important are the I. tinctoria, or common indigo plant, the I. Anil, a larger species, and the I. disperma. -- Indigo purple, a purple obtained from indigo. -- Indigo red, a dyestuff, isomeric with indigo blue, obtained from crude indigo as a dark brown amorphous powder. -- Indigo snake (Zoöl.), the gopher snake. -- Indigo white, a white crystalline powder obtained by reduction from indigo blue, and by oxidation easily changed back to it; -- called also indigogen. -- Indigo yellow, a substance obtained from indigo."}