{"word":"indian","definition":"1. Of or pertaining to India proper; also to the East Indies, or, sometimes, to the West Indies. 2. Of or pertaining to the aborigines, or Indians, of America; as, Indian wars; the Indian tomahawk. 3. Made of maize or Indian corn; as, Indian corn, Indian meal, Indian bread, and the like. [U.S.] Indian bay (Bot.), a lauraceous tree (Persea Indica). -- Indian bean (Bot.), a name of the catalpa. -- Indian berry. (Bot.) Same as Cocculus indicus. -- Indian bread. (Bot.) Same as Cassava. -- Indian club, a wooden club, which is swung by the hand for gymnastic exercise. -- Indian cordage, cordage made of the fibers of cocoanut husk. -- Indian corn (Bot.), a plant of the genus Zea (Z. Mays); the maize, a native of America. See Corn, and Maize. -- Indian cress (Bot.), nasturtium. See Nasturtium, 2. -- Indian cucumber (Bot.), a plant of the genus Medeola (M. Virginica), a common in woods in the United States. The white rootstock has a taste like cucumbers. -- Indian currant (Bot.), a plant of the genus Symphoricarpus (S. vulgaris), bearing small red berries. -- Indian dye, the puccoon. -- Indian fig. (Bot.) (a) The banyan. See Banyan. (b) The prickly pear. -- Indian file, single file; arrangement of persons in a row following one after another, the usual way among Indians of traversing woods, especially when on the war path. -- Indian fire, a pyrotechnic composition of sulphur, niter, and realgar, burning with a brilliant white light. -- Indian grass (Bot.), a coarse, high grass (Chrysopogon nutans), common in the southern portions of the United States; wood grass. Gray. -- Indian hemp. (Bot.) (a) A plant of the genus Apocynum (A. cannabinum), having a milky juice, and a tough, fibrous bark, whence the name. The root it used in medicine and is both emetic and cathartic in properties. (b) The variety of common hemp (Cannabis Indica), from which hasheesh is obtained. -- Indian mallow (Bot.), the velvet leaf (Abutilon Avicennæ). See Abutilon. -- Indian meal, ground corn or maize. [U.S.] -- Indian millet (Bot.), a tall annual grass (Sorghum vulgare), having many varieties, among which are broom corn, Guinea corn, durra, and the Chinese sugar cane. It is called also Guinea corn. See Durra. -- Indian ox (Zoöl.), the zebu. -- Indian paint. See Bloodroot. -- Indian paper. See India paper, under India. -- Indian physic (Bot.), a plant of two species of the genus Gillenia (G. trifoliata, and G. stipulacea), common in the United States, the roots of which are used in medicine as a mild emetic; -- called also American ipecac, and bowman's root. Gray. -- Indian pink. (Bot.) (a) The Cypress vine (Ipomoea Quamoclit); -- so called in the West Indies. (b) See China pink, under China. -- Indian pipe (Bot.), a low, fleshy herb (Monotropa uniflora), growing in clusters in dark woods, and having scalelike leaves, and a solitary nodding flower. The whole plant is waxy white, but turns black in drying. -- Indian plantain (Bot.), a name given to several species of the genus Cacalia, tall herbs with composite white flowers, common through the United States in rich woods. Gray. -- Indian poke (Bot.), a plant usually known as the white hellebore (Veratrum viride). -- Indian pudding, a pudding of which the chief ingredients are Indian meal, milk, and molasses. -- Indian purple. (a) A dull purple color. (b) The pigment of the same name, intensely blue and black. -- Indian red. (a) A purplish red earth or pigment composed of a silicate of iron and alumina, with magnesia. It comes from the Persian Gulf. Called also Persian red. (b) See Almagra. -- Indian rice (Bot.), a reedlike water grass. See Rice. -- Indian shot (Bot.), a plant of the genus Canna (C. Indica). The hard black seeds are as large as swan shot. See Canna. -- Indian summer, in the United States, a period of warm and pleasant weather occurring late in autumn. See under Summer. -- Indian tobacco (Bot.), a species of Lobelia. See Lobelia. -- Indian turnip (Bot.), an American plant of the genus Arisæma. A. triphyllum has a wrinkled farinaceous root resembling a small turnip, but with a very acrid juice. See Jack in the Pulpit, and Wake-robin. -- Indian wheat, maize or Indian corn. -- Indian yellow. (a) An intense rich yellow color, deeper than gamboge but less pure than cadmium. (b) See Euxanthin.\n\n1. A native or inhabitant of India. 2. One of the aboriginal inhabitants of America; -- so called originally from the supposed identity of America with India."}