{"word":"indicator","definition":"1. One who, or that which, shows or points out; as, a fare indicator in a street car. 2. (Mach.)  A pressure gauge; a water gauge, as for a steam boiler; an apparatus or instrument for showing the working of a machine or moving part; as: (a) (Steam Engine) An instrument which draws a diagram showing the varying pressure in the cylinder of an engine or pump at every point of the stroke. It consists of a small cylinder communicating with the engine cylinder and fitted with a piston which the varying pressure drives upward more or less against the resistance of a spring. A lever imparts motion to a pencil which traces the diagram on a card wrapped around a vertical drum which is turned back and forth by a string connected with the piston rod of the engine. See Indicator card (below). (b) A telltale connected with a hoisting machine, to show, at the surface, the position of the cage in the shaft of a mine, etc. 3. (Mech.)  The part of an instrument by which an effect is indicated, as an index or pointer. 4. (Zoöl.)  Any bird of the genus Indicator and allied genera. See Honey guide, under Honey. 5. (Chem.)  That which indicates the condition of acidity, alkalinity, or the deficiency, excess, or sufficiency of a standard reagent, by causing an appearance, disappearance, or change of color, as in titration or volumetric analysis. Note: The common indicators are limits, tropæolin, phenol phthalein, potassic permanganate, etc. Indicator card, the figure drawn by an engine indicator, by means of which the working of the engine can be investigated and its power calculated. The Illustration shows one form of indicator card, from a steam engine, together with scales by which the pressure of the steam above or below that of the atmosphere, corresponding to any position of the engine piston in its stroke, can be measured. Called also indicator diagram. -- Indicator telegraph, a telegraph in which the signals are the deflections of a magnetic needle, as in the trans-Atlantic system."}