{"word":"interest","definition":"1. To engage the attention of; to awaken interest in; to excite emotion or passion in, in behalf of a person or thing; as, the subject did not interest him; to interest one in charitable work. To love our native country . . . to be interested in its concerns is natural to all men. Dryden. A goddess who used to interest herself in marriages. Addison. 2. To be concerned with or engaged in; to affect; to concern; to excite; -- often used impersonally. [Obs.] Or rather, gracious sir, Create me to this glory, since my cause Doth interest this fair quarrel. Ford. 3. To cause or permit to share. [Obs.] The mystical communion of all faithful men is such as maketh every one to be interested in those precious blessings which any one of them receiveth at God's hands. Hooker. Syn. -- To concern; excite; attract; entertain; engage; occupy; hold.\n\n1. Excitement of feeling, whether pleasant or painful, accompanying special attention to some object; concern. Note: Interest expresses mental excitement of various kinds and degrees. It may be intellectual, or sympathetic and emotional, or merely personal; as, an interest in philosophical research; an interest in human suffering; the interest which an avaricious man takes in money getting. So much interest have I in thy sorrow. Shak. 2. Participation in advantage, profit, and responsibility; share; portion; part; as, an interest in a brewery; he has parted with his interest in the stocks. 3. Advantage, personal or general; good, regarded as a selfish benefit; profit; benefit. Divisions hinder the common interest and public good. Sir W. Temple. When interest calls of all her sneaking train. Pope. 4. Premium paid for the use of money, -- usually reckoned as a percentage; as, interest at five per cent per annum on ten thousand dollars. They have told their money, and let out Their coin upon large interest. Shak. 5. Any excess of advantage over and above an exact equivalent for what is given or rendered. You shall have your desires with interest. Shak. 6. The persons interested in any particular business or measure, taken collectively; as, the iron interest; the cotton interest. Compound interest, interest, not only on the original principal, but also on unpaid interest from the time it fell due. -- Simple interest, interest on the principal sum without interest on overdue interest."}