{"word":"iron","definition":"1. (Chem.)  The most common and most useful metallic element, being of almost universal occurrence, usually in the form of an oxide (as hematite, magnetite, etc.), or a hydrous oxide (as limonite, turgite, etc.). It is reduced on an enormous scale in three principal forms; viz., cast iron, steel, and wrought iron. Iron usually appears dark brown, from oxidation or impurity, but when pure, or an fresh surface, is a gray or white metal. It is easily oxidized (rusted) by moisture, and is attacked by many corrosive agents. Symbol Fe (Latin Ferrum). Atomic weight 55.9. Specific gravity, pure iron, 7.86; cast iron, 7.1. In magnetic properties, it is superior to all other substances. Note: The value of iron is largely due to the facility with which it can be worked. Thus, when heated it is malleable and ductile, and can be easily welded and forged at a high temperature. As cast iron, it is easily fusible; as steel, is very tough, and (when tempered) very hard and elastic. Chemically, iron is grouped with cobalt and nickel. Steel is a variety of iron containing more carbon than wrought iron, but less that cast iron. It is made either from wrought iron, by roasting in a packing of carbon (cementation) or from cast iron, by burning off the impurities in a Bessemer converter (then called Bessemer steel), or directly from the iron ore (as in the Siemens rotatory and generating furnace). 2. An instrument or utensil made of iron; -- chiefly in composition; as, a flatiron, a smoothing iron, etc. My young soldier, put up your iron. Shak. 3. pl.  Fetters; chains; handcuffs; manacles. Four of the sufferers were left to rot in irons. Macaulay. 4. Strength; power; firmness; inflexibility; as, to rule with a rod of iron. Bar iron. See Wrought iron (below). -- Bog iron, bog ore; limonite. See Bog ore, under Bog. -- Cast iron (Metal.), an impure variety of iron, containing from three to six percent of carbon, part of which is united with a part of the iron, as a carbide, and the rest is uncombined, as graphite. It there is little free carbon, the product is white iron; if much of the carbon has separated as graphite, it is called gray iron. See also Cast iron, in the Vocabulary. -- Fire irons. See under Fire, n. -- Gray irons. See under Fire, n. -- Gray iron. See Cast iron (above). -- It irons (Naut.), said of a sailing vessel, when, in tacking, she comes up head to the wind and will not fill away on either tack. -- Magnetic iron. See Magnetite. -- Malleable iron (Metal.), iron sufficiently pure or soft to be capable of extension under the hammer; also, specif., a kind of iron produced by removing a portion of the carbon or other impurities from cast iron, rendering it less brittle, and to some extent malleable. -- Meteoric iron (Chem.), iron forming a large, and often the chief, ingredient of meteorites. It invariably contains a small amount of nickel and cobalt. Cf. Meteorite. -- Pig iron, the form in which cast iron is made at the blast furnace, being run into molds, called pigs. -- Reduced iron. See under Reduced. -- Specular iron. See Hematite. -- Too many irons in the fire, too many objects requiring the attention at once. -- White iron. See Cast iron (above). -- Wrought iron (Metal.), the purest form of iron commonly known in the arts, containing only about half of one per cent of carbon. It is made either directly from the ore, as in the Catalan forge or bloomery, or by purifying (puddling) cast iron in a reverberatory furnace or refinery. It is tough, malleable, and ductile. When formed into bars, it is called bar iron.\n\n1. Of, or made of iron; consisting of iron; as, an iron bar, dust. 2. Resembling iron in color; as, iron blackness. 3. Like iron in hardness, strength, impenetrability, power of endurance, insensibility, etc.; as: (a) Rude; hard; harsh; severe. Iron years of wars and dangers. Rowe. Jove crushed the nations with an iron rod. Pope. (b) Firm; robust; enduring; as, an iron constitution. (c) Inflexible; unrelenting; as, an iron will. (d) Not to be broken; holding or binding fast; tenacious. \"Him death's iron sleep oppressed.\" Philips. Note: Iron is often used in composition, denoting made of iron, relating to iron, of or with iron; producing iron, etc.; resembling iron, literally or figuratively, in some of its properties or characteristics; as, iron-shod, iron-sheathed, iron-fisted, iron- framed, iron-handed, iron-hearted, iron foundry or iron-foundry. Iron age. (a) (Myth.) The age following the golden, silver, and bronze ages, and characterized by a general degeneration of talent and virtue, and of literary excellence. In Roman literature the Iron Age is commonly regarded as beginning after the taking of Rome by the Goths, A. D. 410. (b) (Archæol.) That stage in the development of any people characterized by the use of iron implements in the place of the more cumbrous stone and bronze. -- Iron cement, a cement for joints, composed of cast-iron borings or filings, sal ammoniac, etc. -- Iron clay (Min.), a yellowish clay containing a large proportion of an ore of iron. -- Iron cross, a Prussian order of military merit; also, the decoration of the order. -- Iron crown, a golden crown set with jewels, belonging originally to the Lombard kings, and indicating the dominion of Italy. It was so called from containing a circle said to have been forged from one of the nails in the cross of Christ. -- Iron flint (Min.), an opaque, flintlike, ferruginous variety of quartz. -- Iron founder, a maker of iron castings. -- Iron foundry, the place where iron castings are made. -- Iron furnace, a furnace for reducing iron from the ore, or for melting iron for castings, etc.; a forge; a reverberatory; a bloomery. -- Iron glance (Min.), hematite. -- Iron hat, a headpiece of iron or steel, shaped like a hat with a broad brim, and used as armor during the Middle Ages. -- Iron horse, a locomotive engine. [Colloq.] -- Iron liquor, a solution of an iron salt, used as a mordant by dyers. -- Iron man (Cotton Manuf.), a name for the self-acting spinning mule. -- Iron mold or mould, a yellow spot on cloth stained by rusty iron. -- Iron ore (Min.), any native compound of iron from which the metal may be profitably extracted. The principal ores are magnetite, hematite, siderite, limonite, Göthite, turgite, and the bog and clay iron ores. -- Iron pyrites (Min.), common pyrites, or pyrite. See Pyrites. -- Iron sand, an iron ore in grains, usually the magnetic iron ore, formerly used to sand paper after writing. -- Iron scale, the thin film which on the surface of wrought iron in the process of forging. It consists essentially of the magnetic oxide of iron, Fe3O4. -- Iron works, a furnace where iron is smelted, or a forge, rolling mill, or foundry, where it is made into heavy work, such as shafting, rails, cannon, merchant bar, etc.\n\n1. To smooth with an instrument of iron; especially, to smooth, as cloth, with a heated flatiron; -- sometimes used with out. 2. To shackle with irons; to fetter or handcuff. \"Ironed like a malefactor.\" Sir W. Scott. 3. To furnish or arm with iron; as, to iron a wagon."}