{"word":"issue","definition":"1. The act of passing or flowing out; a moving out from any inclosed place; egress; as, the issue of water from a pipe, of blood from a wound, of air from a bellows, of people from a house. 2. The act of sending out, or causing to go forth; delivery; issuance; as, the issue of an order from a commanding officer; the issue of money from a treasury. 3. That which passes, flows, or is sent out; the whole quantity sent forth or emitted at one time; as, an issue of bank notes; the daily issue of a newspaper. 4. Progeny; a child or children; offspring. In law, sometimes, in a general sense, all persons descended from a common ancestor; all lineal descendants. If the king Should without issue die. Shak. 5. Produce of the earth, or profits of land, tenements, or other property; as, A conveyed to B all his right for a term of years, with all the issues, rents, and profits. 6. A discharge of flux, as of blood. Matt. ix. 20. 7. (Med.)  An artificial ulcer, usually made in the fleshy part of the arm or leg, to produce the secretion and discharge of pus for the relief of some affected part. 8. The final outcome or result; upshot; conclusion; event; hence, contest; test; trial. Come forth to view The issue of the exploit. Shak. While it is hot, I 'll put it to the issue. Shak. 9. A point in debate or controversy on which the parties take affirmative and negative positions; a presentation of alternatives between which to choose or decide. 10. (Law)  In pleading, a single material point of law or fact depending in the suit, which, being affirmed on the one side and denied on the other, is presented for determination. See General issue, under General, and Feigned issue, under Feigned. Blount. Cowell. At issue, in controversy; disputed; opposing or contesting; hence, at variance; disagreeing; inconsistent. As much at issue with the summer day As if you brought a candle out of doors. Mrs. Browning. -- Bank of issue, Collateral issue, etc. See under Bank, Collateral, etc. -- Issue pea, a pea, or a similar round body, used to maintain irritation in a wound, and promote the secretion and discharge of pus. -- To join, or take, issue, to take opposing sides in a matter in controversy.\n\n1. To pass or flow out; to run out, as from any inclosed place. From it issued forced drops of blood. Shak. 2. To go out; to rush out; to sally forth; as, troops issued from the town, and attacked the besiegers. 3. To proceed, as from a source; as, water issues from springs; light issues from the sun. 4. To proceed, as progeny; to be derived; to be descended; to spring. Of thy sons that shall issue from thee. 2 Kings xx. 18. 5. To extend; to pass or open; as, the path issues into the highway. 6. To be produced as an effect or result; to grow or accrue; to arise; to proceed; as, rents and profits issuing from land, tenements, or a capital stock. 7. To close; to end; to terminate; to turn out; as, we know not how the cause will issue. 8. (Law)  In pleading, to come to a point in fact or law, on which the parties join issue.\n\n1. To send out; to put into circulation; as, to issue notes from a bank. 2. To deliver for use; as, to issue provisions. 3. To send out officially; to deliver by authority; as, to issue an order; to issue a writ."}