{"word":"jack","definition":"A large tree, the Artocarpus integrifolia, common in the East Indies, closely allied to the breadfruit, from which it differs in having its leaves entire. The fruit is of great size, weighing from thirty to forty pounds, and through its soft fibrous matter are scattered the seeds, which are roasted and eaten. The wood is of a yellow color, fine grain, and rather heavy, and is much used in cabinetwork. It is also used for dyeing a brilliant yellow. [Written also jak.]\n\n1. A familiar nickname of, or substitute for, John. You are John Rugby, and you are Jack Rugby. Shak. 2. An impertinent or silly fellow; a simpleton; a boor; a clown; also, a servant; a rustic. \"Jack fool.\" Chaucer. Since every Jack became a gentleman, There 's many a gentle person made a Jack. Shak. 3. A popular colloquial name for a sailor; -- called also Jack tar, and Jack afloat. 4. A mechanical contrivance, an auxiliary machine, or a subordinate part of a machine, rendering convenient service, and often supplying the place of a boy or attendant who was commonly called Jack; as: (a) A device to pull off boots. (b) A sawhorse or sawbuck. (c) A machine or contrivance for turning a spit; a smoke jack, or kitchen jack. (b) (Mining) A wooden wedge for separating rocks rent by blasting. (e) (Knitting Machine) A lever for depressing the sinkers which push the loops down on the needles. (f) (Warping Machine) A grating to separate and guide the threads; a heck box. (g) (Spinning) A machine for twisting the sliver as it leaves the carding machine. (h) A compact, portable machine for planing metal. (i) A machine for slicking or pebbling leather. (k) A system of gearing driven by a horse power, for multiplying speed. (l) A hood or other device placed over a chimney or vent pipe, to prevent a back draught. (m) In the harpsichord, an intermediate piece communicating the action of the key to the quill; -- called also hopper. (n) In hunting, the pan or frame holding the fuel of the torch used to attract game at night; also, the light itself. C. Hallock. 5. A portable machine variously constructed, for exerting great pressure, or lifting or moving a heavy body through a small distance. It consists of a lever, screw, rack and pinion, hydraulic press, or any simple combination of mechanical powers, working in a compact pedestal or support and operated by a lever, crank, capstan bar, etc. The name is often given to a jackscrew, which is a kind of jack. 6. The small bowl used as a mark in the game of bowls. Shak. Like an uninstructed bowler who thinks to attain the jack by delivering his bowl straight forward upon it. Sir W. Scott. 7. The male of certain animals, as of the ass. 8. (Zoöl.) (a) A young pike; a pickerel. (b) The jurel. (c) A large, California rock fish (Sebastodes paucispinus); -- called also boccaccio, and mérou. (d) The wall-eyed pike. 9. A drinking measure holding half a pint; also, one holding a quarter of a pint. [Prov. Eng.] Halliwell. 10. (Naut.) (a) A flag, containing only the union, without the fly, usually hoisted on a jack staff at the bowsprit cap; -- called also union jack. The American jack is a small blue flag, with a star for each State. (b) A bar of iron athwart ships at a topgallant masthead, to support a royal mast, and give spread to the royal shrouds; -- called also jack crosstree. R. H. Dana, Jr. 11. The knave of a suit of playing cards. Note: Jack is used adjectively in various senses. It sometimes designates something cut short or diminished in size; as, a jack timber; a jack rafter; a jack arch, etc. Jack arch, an arch of the thickness of one brick. -- Jack back (Brewing & Malt Vinegar Manuf.), a cistern which receives the wort. See under 1st Back. -- Jack block (Naut.), a block fixed in the topgallant or royal rigging, used for raising and lowering light masts and spars. -- Jack boots, boots reaching above the knee; -- worn in the 17 century by soldiers; afterwards by fishermen, etc. -- Jack crosstree. (Naut.) See 10, b, above. -- Jack curlew (Zoöl.), the whimbrel. -- Jack frame. (Cotton Spinning) See 4 (g), above. -- Jack Frost, frost personified as a mischievous person. -- Jack hare, a male hare. Cowper. -- Jack lamp, a lamp for still hunting and camp use. See def. 4 (n.), above. -- Jack plane, a joiner's plane used for coarse work. -- Jack post, one of the posts which support the crank shaft of a deep-well-boring apparatus. -- Jack pot (Poker Playing), the name given to the stakes, contributions to which are made by each player successively, till such a hand is turned as shall take the \"pot,\" which is the sum total of all the bets. -- Jack rabbit (Zoöl.), any one of several species of large American hares, having very large ears and long legs. The California species (Lepus Californicus), and that of Texas and New Mexico (L. callotis), have the tail black above, and the ears black at the tip. They do not become white in winter. The more northern prairie hare (L. campestris) has the upper side of the tail white, and in winter its fur becomes nearly white. -- Jack rafter (Arch.), in England, one of the shorter rafters used in constructing a hip or valley roof; in the United States, any secondary roof timber, as the common rafters resting on purlins in a trussed roof; also, one of the pieces simulating extended rafters, used under the eaves in some styles of building. -- Jack salmon (Zoöl.), the wall-eyed pike, or glasseye. -- Jack sauce, an impudent fellow. [Colloq. & Obs.] -- Jack shaft (Mach.), the first intermediate shaft, in a factory or mill, which receives power, through belts or gearing, from a prime mover, and transmits it, by the same means, to other intermediate shafts or to a line shaft. -- Jack sinker (Knitting Mach.), a thin iron plate operated by the jack to depress the loop of thread between two needles. -- Jack snipe. (Zoöl.) See in the Vocabulary. -- Jack staff (Naut.), a staff fixed on the bowsprit cap, upon which the jack is hoisted. -- Jack timber (Arch.), any timber, as a rafter, rib, or studding, which, being intercepted, is shorter than the others. -- Jack towel, a towel hung on a roller for common use. -- Jack truss (Arch.), in a hip roof, a minor truss used where the roof has not its full section. -- Jack tree. (Bot.) See 1st Jack, n. -- Jack yard (Naut.), a short spar to extend a topsail beyond the gaff. Blue jack, blue vitriol; sulphate of copper. -- Hydraulic jack, a jack used for lifting, pulling, or forcing, consisting of a compact portable hydrostatic press, with its pump and a reservoir containing a supply of liquid, as oil. -- Jack-at-a-pinch. (a) One called upon to take the place of another in an emergency. (b) An itinerant parson who conducts an occasional service for a fee. -- Jack-at-all-trades, one who can turn his hand to any kind of work. -- Jack-by-the-hedge (Bot.), a plant of the genus Erysimum (E. alliaria, or Alliaria officinalis), which grows under hedges. It bears a white flower and has a taste not unlike garlic. Called also, in England, sauce-alone. Eng. Cyc. -- Jack-in-a-box. (a) (Bot.) A tropical tree (Hernandia sonora), which bears a drupe that rattles when dry in the inflated calyx. (b) A child's toy, consisting of a box, out of which, when the lid is raised, a figure springs. (c) (Mech.) An epicyclic train of bevel gears for transmitting rotary motion to two parts in such a manner that their relative rotation may be variable; applied to driving the wheels of tricycles, road locomotives, and to cotton machinery, etc.; an equation box; a jack frame; -- called also compensating gearing. (d) A large wooden screw turning in a nut attached to the crosspiece of a rude press. -- Jack-in-office, an insolent fellow in authority. Wolcott. -- Jack-in-the-bush (Bot.), a tropical shrub with red fruit (Cordia Cylindrostachya). -- Jack-in-the-green, a chimney sweep inclosed in a framework of boughs, carried in Mayday processions. -- Jack-in-the-pulpit (Bot.), the American plant Arisæma triphyllum, or Indian turnip, in which the upright spadix is inclosed. -- Jack-of-the-buttery (Bot.), the stonecrop (Sedum acre). -- Jack-of-the-clock, a figure, usually of a man, on old clocks, which struck the time on the bell. -- Jack-on-both-sides, one who is or tries to be neutral. -- Jack-out-of-office, one who has been in office and is turned out. Shak. -- Jack the Giant Killer, the hero of a well-known nursery story. -- Jack-with-a-lantern, Jack-o'-lantern. (a) An ignis fatuus; a will-o'-the-wisp. \"[Newspaper speculations] supplying so many more jack-o'-lanterns to the future historian.\" Lowell. (b) A lantern made of a pumpkin so prepared as to show in illumination the features of a human face, etc. -- Yellow Jack (Naut.), the yellow fever; also, the quarantine flag. See Yellow flag, under Flag.\n\nA coarse and cheap mediæval coat of defense, esp. one made of leather. Their horsemen are with jacks for most part clad. Sir J. Harrington.\n\nA pitcher or can of waxed leather; -- called also black jack. [Obs.] Dryden.\n\nTo hunt game at night by means of a jack. See 2d Jack, n., 4, n.\n\nTo move or lift, as a house, by means of a jack or jacks. See 2d Jack, n., 5."}