{"word":"jade","definition":"A stone, commonly of a pale to dark green color but sometimes whitish. It is very hard and compact, capable of fine polish, and is used for ornamental purposes and for implements, esp. in Eastern countries and among many early peoples. Note: The general term jade includes nephrite, a compact variety of tremolite with a specific gravity of 3, and also the mineral jadeite, a silicate of alumina and soda, with a specific gravity of 3.3. The latter is the more highly prized and includes the feitsui of the Chinese. The name has also been given to other tough green minerals capable of similar use.\n\n1. A mean or tired horse; a worthless nag. Chaucer. Tired as a jade in overloaden cart. Sir P. Sidney. 2. A disreputable or vicious woman; a wench; a quean; also, sometimes, a worthless man. Shak. She shines the first of battered jades. Swift. 3. A young woman; -- generally so called in irony or slight contempt. A souple jade she was, and strang. Burns.\n\n1. To treat like a jade; to spurn. [Obs.] Shak. 2. To make ridiculous and contemptible. [Obs.] I do now fool myself, to let imagination jade me. Shak. 3. To exhaust by overdriving or long-continued labor of any kind; to tire or wear out by severe or tedious tasks; to harass. The mind, once jaded by an attempt above its power, . . . checks at any vigorous undertaking ever after. Locke. Syn. -- To fatigue; tire; weary; harass. -- To Jade, Fatigue, Tire, Weary. Fatigue is the generic term; tire denotes fatigue which wastes the strength; weary implies that a person is worn out by exertion; jade refers to the weariness created by a long and steady repetition of the same act or effort. A little exertion will tire a child or a weak person; a severe or protracted task wearies equally the body and the mind; the most powerful horse becomes jaded on a long journey by a continual straining of the same muscles. Wearied with labor of body or mind; tired of work, tired out by importunities; jaded by incessant attention to business.\n\nTo become weary; to lose spirit. They . . . fail, and jade, and tire in the prosecution. South."}