{"word":"job","definition":"1. A sudden thrust or stab; a jab. 2. A piece of chance or occasional work; any definite work undertaken in gross for a fixed price; as, he did the job for a thousand dollars. 3. A public transaction done for private profit; something performed ostensibly as a part of official duty, but really for private gain; a corrupt official business. 4. Any affair or event which affects one, whether fortunately or unfortunately. [Colloq.] 5. A situation or opportunity of work; as, he lost his job. [Colloq.] Note: Job is used adjectively to signify doing jobs, used for jobs, or let on hire to do jobs; as, job printer; job master; job horse; job wagon, etc. By the job, at a stipulated sum for the work, or for each piece of work done; -- distinguished from time work; as, the house was built by the job. -- Job lot, a quantity of goods, usually miscellaneous, sold out of the regular course of trade, at a certain price for the whole; as, these articles were included in a job lot. -- Job master, one who lest out horses and carriages for hire, as for family use. [Eng.] -- Job printer, one who does miscellaneous printing, esp. circulars, cards, billheads, etc. -- Odd job, miscellaneous work of a petty kind; occasional work, of various kinds, or for various people.\n\n1. To strike or stab with a pointed instrument. L'Estrange. 2. To thrust in, as a pointed instrument. Moxon. 3. To do or cause to be done by separate portions or lots; to sublet (work); as, to job a contract. 4. (Com.)  To buy and sell, as a broker; to purchase of importers or manufacturers for the purpose of selling to retailers; as, to job goods. 5. To hire or let by the job or for a period of service; as, to job a carriage. Thackeray.\n\n1. To do chance work for hire; to work by the piece; to do petty work. Authors of all work, to job for the season. Moore. 2. To seek private gain under pretense of public service; to turn public matters to private advantage. And judges job, and bishops bite the town. Pope. 3. To carry on the business of a jobber in merchandise or stocks.\n\nThe hero of the book of that name in the Old Testament; the typical patient man. Job's comforter. (a) A false friend; a tactless or malicious person who, under pretense of sympathy, insinuates rebukes. (b) A boil. [Colloq.] -- Job's news, bad news. Carlyle. -- Job's tears (Bot.), a kind of grass (Coix Lacryma), with hard, shining, pearly grains."}