{"word":"judgment","definition":"1. The act of judging; the operation of the mind, involving comparison and discrimination, by which a knowledge of the values and relations of thins, whether of moral qualities, intellectual concepts, logical propositions, or material facts, is obtained; as, by careful judgment he avoided the peril; by a series of wrong judgments he forfeited confidence. I oughte deme, of skilful jugement, That in the salte sea my wife is deed. Chaucer. 2. The power or faculty of performing such operations (see 1); esp., when unqualified, the faculty of judging or deciding rightly, justly, or wisely; good sense; as, a man of judgment; a politician without judgment. He shall judge thy people with righteousness and thy poor with judgment. Ps. lxxii. 2. Hernia. I would my father look'd but with my eyes. Theseus. Rather your eyes must with his judgment look. Shak. 3. The conclusion or result of judging; an opinion; a decision. She in my judgment was as fair as you. Shak. Who first his judgment asked, and then a place. Pope. 4. The act of determining, as in courts of law, what is conformable to law and justice; also, the determination, decision, or sentence of a court, or of a judge; the mandate or sentence of God as the judge of all. In judgments between rich and poor, consider not what the poor man needs, but what is his own. Jer. Taylor. Most heartily I do beseech the court To give the judgment. Shak. 5. (Philos.) (a) That act of the mind by which two notions or ideas which are apprehended as distinct are compared for the purpose of ascertaining their agreement or disagreement. See 1. The comparison may be threefold: (1) Of individual objects forming a concept. (2) Of concepts giving what is technically called a judgment. (3) Of two judgments giving an inference. Judgments have been further classed as analytic, synthetic, and identical. (b) That power or faculty by which knowledge dependent upon comparison and discrimination is acquired. See 2. A judgment is the mental act by which one thing is affirmed or denied of another. Sir W. Hamilton. The power by which we are enabled to perceive what is true or false, probable or improbable, is called by logicians the faculty of judgment. Stewart. 6. A calamity regarded as sent by God, by way of recompense for wrong committed; a providential punishment. \"Judgments are prepared for scorners.\" Prov. xix. 29. \"This judgment of the heavens that makes us tremble.\" Shak. 7. (Theol.)  The final award; the last sentence. Note: Judgment, abridgment, acknowledgment, and lodgment are in England sometimes written, judgement, abridgement, acknowledgement, and lodgement. Note: Judgment is used adjectively in many self-explaining combinations; as, judgment hour; judgment throne. Judgment day (Theol.), the last day, or period when final judgment will be pronounced on the subjects of God's moral government. -- Judgment debt (Law), a debt secured to the creditor by a judge's order. -- Judgment hall, a hall where courts are held. -- Judgment seat, the seat or bench on which judges sit in court; hence, a court; a tribunal. \"We shall all stand before the judgment seat of Christ.\" Rom. xiv. 10. -- Judgment summons (Law), a proceeding by a judgment creditor against a judgment debtor upon an unsatisfied judgment. Arrest of judgment. (Law) See under Arrest, n. -- Judgment of God, a term formerly applied to extraordinary trials of secret crimes, as by arms and single combat, by ordeal, etc.; it being imagined that God would work miracles to vindicate innocence. See under Ordeal. Syn. -- Discernment; decision; determination; award; estimate; criticism; taste; discrimination; penetration; sagacity; intelligence; understanding. See Taste."}