{"word":"jump","definition":"(a) A kind of loose jacket for men. (b) pl.  A bodice worn instead of stays by women in the 18th century.\n\n1. To spring free from the ground by the muscular action of the feet and legs; to project one's self through the air; to spring; to bound; to leap. Not the worst of the three but jumps twelve foot and a half by the square. Shak. 2. To move as if by jumping; to bounce; to jolt. \"The jumping chariots.\" Nahum iii. 2. A flock of geese jump down together. Dryden. 3. To coincide; to agree; to accord; to tally; -- followed by with. \"It jumps with my humor.\" Shak. To jump at, to spring to; hence, fig., to accept suddenly or eagerly; as, a fish jumps at a bait; to jump at a chance.\n\n1. To pass by a spring or leap; to overleap; as, to jump a stream. 2. To cause to jump; as, he jumped his horse across the ditch. 3. To expose to danger; to risk; to hazard. [Obs.] To jump a body with a dangerous physic. Shak. 4. (Smithwork) (a) To join by a butt weld. (b) To thicken or enlarge by endwise blows; to upset. 5. (Quarrying)  To bore with a jumper. To jump a claim, to enter upon and take possession of land to which another has acquired a claim by prior entry and occupation. [Western U. S. & Australia] See Claim, n., 3. -- To jump one's bail, to abscond while at liberty under bail bonds. [Slang, U. S.]\n\n1. The act of jumping; a leap; a spring; a bound. \"To advance by jumps.\" Locke. 2. An effort; an attempt; a venture. [Obs.] Our fortune lies Upon thisjump. Shak. 3. The space traversed by a leap. 4. (Mining)  A dislocation in a stratum; a fault. 5. (Arch.)  An abrupt interruption of level in a piece of brickwork or masonry. From the jump, from the start or beginning. [Colloq.] -- Jump joint. (a) A butt joint. (b) A flush joint, as of plank in carvel-built vessels. -- Jump seat. (a) A movable carriage seat. (b) A carriage constructed with a seat which may be shifted so as to make room for second or extra seat. Also used adjectively; as, a jump-seat wagon.\n\nNice; exact; matched; fitting; precise. [Obs.] \"Jump names.\" B. Jonson.\n\nExactly; pat.[Obs.] Shak."}