{"word":"just","definition":"1. Conforming or conformable to rectitude or justice; not doing wrong to any; violating no right or obligation; upright; righteous; honest; true; -- said both of persons and things. \"O just but severe law!\" Shak. There is not a just man upon earth, that doeth good, and sinneth not. Eccl. vii. 20. Just balances, just weights, . . . shall ye have. Lev. xix. 36. How should man be just with God Job ix. 2. We know your grace to be a man. Just and upright. Shak. 2. Not transgressing the requirement of truth and propriety; conformed to the truth of things, to reason, or to a proper standard; exact; normal; reasonable; regular; due; as, a just statement; a just inference. Just of thy word, in every thought sincere. Pope. The prince is here at hand: pleaseth your lordship To meet his grace just distance 'tween our armies. Shak. He was a comely personage, a little above just stature. Bacon. Fire fitted with just materials casts a constant heat. Jer. Taylor. When all The war shall stand ranged in its just array. Addison. Their named alone would make a just volume. Burton. 3. Rendering or disposed to render to each one his due; equitable; fair; impartial; as, just judge. Men are commonly so just to virtue and goodness as to praise it in others, even when they do not practice it themselves. Tillotson. Just intonation. (Mus.) (a) The correct sounding of notes or intervals; true pitch. (b) The giving all chords and intervals in their purity or their exact mathematical ratio, or without temperament; a process in which the number of notes and intervals required in the various keys is much greater than the twelve to the octave used in systems of temperament. H. W. Poole. Syn. -- Equitable; upright; honest; true; fair; impartial; proper; exact; normal; orderly; regular.\n\n1. Precisely; exactly; -- in place, time, or degree; neither more nor less than is stated. And having just enough, not covet more. Dryden. The god Pan guided my hand just to the heart of the beast. Sir P. Sidney. To-night, at Herne's oak, just 'twixt twelve and one. Shak. 2. Closely; nearly; almost. Just at the point of death. Sir W. Temple. 3. Barely; merely; scarcely; only; by a very small space or time; as, he just missed the train; just too late. A soft Etesian gale But just inspired and gently swelled the sail. Dryden. Just now, the least possible time since; a moment ago.\n\nTo joust. Fairfax.\n\nA joust. Dryden."}