{"word":"keep","definition":"1. To care; to desire. [Obs.] I kepe not of armes for to yelp [boast]. Chaucer. 2. To hold; to restrain from departure or removal; not to let go of; to retain in one's power or possession; not to lose; to retain; to detain. If we lose the field, We can not keep the town. Shak. That I may know what keeps me here with you. Dryden. If we would weigh and keep in our minds what we are considering, that would instruct us. Locke. 3. To cause to remain in a given situation or condition; to maintain unchanged; to hold or preserve in any state or tenor. His loyalty he kept, his love, his zeal. Milton. Keep a stiff rein, and move but gently on. Addison. Note: In this sense it is often used with prepositions and adverbs, as to keep away, to keep down, to keep from, to keep in, out, or off, etc. \"To keep off impertinence and solicitation from his superior.\" Addison. 4. To have in custody; to have in some place for preservation; to take charge of. The crown of Stephanus, first king of Hungary, was always kept in the castle of Vicegrade. Knolles. 5. To preserve from danger, harm, or loss; to guard. Behold, I am with thee, and will keep thee. Gen. xxviii. 15. 6. To preserve from discovery or publicity; not to communicate, reveal, or betray, as a secret. Great are thy virtues . . . though kept from man. Milton. 7. To attend upon; to have the care of; to tend. And the Lord God took the man, and put him into the garden of Eden, to dress it and to keep it. Gen. ii. 15. In her girlish age, she kept sheep on the moor. Carew. 8. To record transactions, accounts, or events in; as, to keep books, a journal, etc. ; also, to enter (as accounts, records, etc. ) in a book. 9. To maintain, as an establishment, institution, or the like; to conduct; to manage; as, to keep store. Like a pedant that keeps a school. Shak. Every one of them kept house by himself. Hayward. 10. To supply with necessaries of life; to entertain; as, to keep boarders. 11. To have in one's service; to have and maintain, as an assistant, a servant, a mistress, a horse, etc. I keep but three men and a boy. Shak. 12. To have habitually in stock for sale. 13. To continue in, as a course or mode of action; not to intermit or fall from; to hold to; to maintain; as, to keep silence; to keep one's word; to keep possession. Both day and night did we keep company. Shak. Within this portal as I kept my watch. Smollett. 14. To observe; to adhere to; to fulfill; not to swerve from or violate; to practice or perform, as duty; not to neglect; to be faithful to. I have kept the faith. 2 Tim. iv. 7. Him whom to love is to obey, and keep His great command. Milton. 15. To confine one's self to; not to quit; to remain in; as, to keep one's house, room, bed, etc. ; hence, to haunt; to frequent. Shak. 'Tis hallowed ground; Fairies, and fawns, and satyrs do it keep. J. Fletcher. 16. To observe duty, as a festival, etc. ; to celebrate; to solemnize; as, to keep a feast. I went with them to the house of God . . . with a multitude that kept holyday. Ps. xlii. 4. To keep at arm's length. See under Arm, n. -- To keep back. (a) To reserve; to withhold. \"I will keep nothing back from you.\" Jer. xlii. 4. (b) To restrain; to hold back. \"Keep back thy servant also from presumptuous sins.\" Ps. xix. 13. -- To keep company with. (a) To frequent the society of; to associate with; as, let youth keep company with the wise and good. (b) To accompany; to go with; as, to keep company with one on a voyage; also, to pay court to, or accept attentions from, with a view to marriage. [Colloq.] -- To keep counsel. See under Counsel, n. -- To keep down. (a) To hold in subjection; to restrain; to hinder. (b) (Fine Arts) To subdue in tint or tone, as a portion of a picture, so that the spectator's attention may not be diverted from the more important parts of the work. -- To keep good (or bad) hours, to be customarily early (or late) in returning home or in retiring to rest. -- To keep house. (a) To occupy a separate house or establishment, as with one's family, as distinguished from boarding; to manage domestic affairs. (b) (Eng. Bankrupt Law) To seclude one's self in one's house in order to evade the demands of creditors. -- To keep one's hand in, to keep in practice. -- To keep open house, to be hospitable. -- To keep the peace (Law), to avoid or to prevent a breach of the peace. -- To keep school, to govern, manage and instruct or teach a school, as a preceptor. -- To keep a stiff upper lip, to keep up one's courage. [Slang] -- To keep term. (a) (Eng. Universities) To reside during a term. (b) (Inns of Court) To eat a sufficient number of dinners in hall to make the term count for the purpose of being called to the bar. [Eng.] Mozley & W. -- To keep touch. See under Touch, n. -- To keep under, to hold in subjection; hence, to oppress. -- To keep up. (a) To maintain; to prevent from falling or diminution; as, to keep up the price of goods; to keep up one's credit. (b) To maintain; to continue; to prevent from ceasing. \"In joy, that which keeps up the action is the desire to continue it.\" Locke. Syn. -- To retain; detain; reserve; preserve; hold; restrain; maintain; sustain; support; withhold. -- To Keep. Retain, Preserve. Keep is the generic term, and is often used where retain or preserve would too much restrict the meaning; as, to keep silence, etc. Retain denotes that we keep or hold things, as against influences which might deprive us of them, or reasons which might lead us to give them up; as, to retain vivacity in old age; to retain counsel in a lawsuit; to retain one's servant after a reverse of fortune. Preserve denotes that we keep a thing against agencies which might lead to its being destroyed or broken in upon; as, to preserve one's health; to preserve appearances.\n\n1. To remain in any position or state; to continue; to abide; to stay; as, to keep at a distance; to keep aloft; to keep near; to keep in the house; to keep before or behind; to keep in favor; to keep out of company, or out reach. 2. To last; to endure; to remain unimpaired. If the malt be not thoroughly dried, the ale it makes will not keep. Mortimer. 3. To reside for a time; to lodge; to dwell. [Now disused except locally or colloquially.] Knock at his study, where, they say, he keeps. Shak. 4. To take care; to be solicitous; to watch. [Obs.] Keep that the lusts choke not the word of God that is in us. Tyndale. 5. To be in session; as, school keeps to-day. [Colloq.] To keep from, to abstain or refrain from. -- To keep in with, to keep on good terms with; as, to keep in with an opponent. -- To keep on, to go forward; to proceed; to continue to advance. -- To keep to, to adhere strictly to; not to neglect or deviate from; as, to keep to old customs; to keep to a rule; to keep to one's word or promise. -- To keep up, to remain unsubdued; also, not to be confined to one's bed.\n\n1. The act or office of keeping; custody; guard; care; heed; charge. Chaucer. Pan, thou god of shepherds all, Which of our tender lambkins takest keep. Spenser. 2. The state of being kept; hence, the resulting condition; case; as, to be in good keep. 3. The means or provisions by which one is kept; maintenance; support; as, the keep of a horse. Grass equal to the keep of seven cows. Carlyle. I performed some services to the college in return for my keep. T. Hughes. 4. That which keeps or protects; a stronghold; a fortress; a castle; specifically, the strongest and securest part of a castle, often used as a place of residence by the lord of the castle, especially during a siege; the donjon. See Illust. of Castle. The prison strong, Within whose keep the captive knights were laid. Dryden. The lower chambers of those gloomy keeps. Hallam. I think . . . the keep, or principal part of a castle, was so called because the lord and his domestic circle kept, abode, or lived there. M. A. Lower. 5. That which is kept in charge; a charge. [Obs.] Often he used of his keep A sacrifice to bring. Spenser. 6. (Mach.)  A cap for retaining anything, as a journal box, in place. To take keep, to take care; to heed. [Obs.] Chaucer."}