{"word":"key","definition":"1. An instrument by means of which the bolt of a lock is shot or drawn; usually, a removable metal instrument fitted to the mechanism of a particular lock and operated by turning in its place. 2. An instrument which is turned like a key in fastening or adjusting any mechanism; as, a watch key; a bed key, etc. 3. That part of an instrument or machine which serves as the means of operating it; as, a telegraph key; the keys of a pianoforte, or of a typewriter. 4. A position or condition which affords entrance, control, pr possession, etc.; as, the key of a line of defense; the key of a country; the key of a political situation. Hence, that which serves to unlock, open, discover, or solve something unknown or difficult; as, the key to a riddle; the key to a problem. Those who are accustomed to reason have got the true key of books. Locke. Who keeps the keys of all the creeds. Tennyson. 5. That part of a mechanism which serves to lock up, make fast, or adjust to position. 6. (Arch.) (a) A piece of wood used as a wedge. (b) The last board of a floor when laid down. 7. (Masonry) (a) A keystone. (b) That part of the plastering which is forced through between the laths and holds the rest in place. 8. (Mach.) (a) A wedge to unite two or more pieces, or adjust their relative position; a cotter; a forelock. See Illusts. of Cotter, and Gib. (b) A bar, pin or wedge, to secure a crank, pulley, coupling, etc., upon a shaft, and prevent relative turning; sometimes holding by friction alone, but more frequently by its resistance to shearing, being usually embedded partly in the shaft and partly in the crank, pulley, etc. 9. (Bot.)  An indehiscent, one-seeded fruit furnished with a wing, as the fruit of the ash and maple; a samara; -- called also key fruit. 10. (Mus.) (a) A family of tones whose regular members are called diatonic tones, and named key tone (or tonic) or one (or eight), mediant or three, dominant or five, subdominant or four, submediant or six, supertonic or two, and subtonic or seven. Chromatic tones are temporary members of a key, under such names as \" sharp four,\" \"flat seven,\" etc. Scales and tunes of every variety are made from the tones of a key. (b) The fundamental tone of a movement to which its modulations are referred, and with which it generally begins and ends; keynote. Both warbling of one song, both in one key. Shak. 11. Fig: The general pitch or tone of a sentence or utterance. You fall at once into a lower key. Cowper. Key bed. Same as Key seat. -- Key bolt, a bolt which has a mortise near the end, and is secured by a cotter or wedge instead of a nut. Key bugle. See Kent bugle. -- Key of a position or country. (Mil.) See Key, 4. -- Key seat (Mach.), a bed or groove to receive a key which prevents one part from turning on the other. -- Key way, a channel for a key, in the hole of a piece which is keyed to a shaft; an internal key seat; -- called also key seat. -- Key wrench (Mach.), an adjustable wrench in which the movable jaw is made fast by a key. -- Power of the keys (Eccl.), the authority claimed by the ministry in some Christian churches to administer the discipline of the church, and to grant or withhold its privileges; -- so called from the declaration of Christ, \"I will give unto thee the keys of the kingdom of heaven.\" Matt. xvi. 19.\n\nTo fasten or secure firmly; to fasten or tighten with keys or wedges. Francis. To key up. (a) (Arch.) To raise (the whole ring of an arch) off its centering, by driving in the keystone forcibly. (b) (Mus.) To raise the pitch of. (c) Hence, fig., to produce nervous tension in."}