{"word":"kind","definition":"1. Characteristic of the species; belonging to one's nature; natural; native. [Obs.] Chaucer. It becometh sweeter than it should be, and loseth the kind taste. Holland. 2. Having feelings befitting our common nature; congenial; sympathetic; as, a kind man; a kind heart. Yet was he kind, or if severe in aught, The love he bore to learning was his fault. Goldsmith. 3. Showing tenderness or goodness; disposed to do good and confer happiness; averse to hurting or paining; benevolent; benignant; gracious. He is kind unto the unthankful and to evil. Luke vi 35. O cruel Death, to those you take more kind Than to the wretched mortals left behind. Waller. A fellow feeling makes one wondrous kind. Garrick. 4. Proceeding from, or characterized by, goodness, gentleness, or benevolence; as, a kind act. \"Manners so kind, yet stately.\" Tennyson. 5. Gentle; tractable; easily governed; as, a horse kind in harness. Syn. -- Benevolent; benign; beneficent; bounteous; gracious; propitious; generous; forbearing; indulgent; tender; humane; compassionate; good; lenient; clement; mild; gentle; bland; obliging; friendly; amicable. See Obliging.\n\n1. Nature; natural instinct or disposition. [Obs.] He knew by kind and by no other lore. Chaucer. Some of you, on pure instinct of nature, Are led by kind t'admire your fellow-creature. Dryden. 2. Race; genus; species; generic class; as, in mankind or humankind. \"Come of so low a kind.\" Chaucer. Every kind of beasts, and of birds. James iii.7. She follows the law of her kind. Wordsworth. Here to sow the seed of bread, That man and all the kinds be fed. Emerson. 3. Nature; style; character; sort; fashion; manner; variety; description; class; as, there are several kinds of eloquence, of style, and of music; many kinds of government; various kinds of soil, etc. How diversely Love doth his pageants play, And snows his power in variable kinds ! Spenser. There is one kind of flesh of men, another flesh of beasts, another of fishes, and another of birds. I Cor. xv. 39. Diogenes was asked in a kind of scorn: What was the matter that philosophers haunted rich men, and not rich men philosophers Bacon. A kind of, something belonging to the class of; something like to; -- said loosely or slightingly. In kind, in the produce or designated commodity itself, as distinguished from its value in money. Tax on tillage was often levied in kind upon corn. Arbuthnot. Syn. -- Sort; species; class; genus; nature; style; character; breed; set.\n\nTo beget. [Obs.] Spenser."}