{"word":"king","definition":"A Chinese musical instrument, consisting of resonant stones or metal plates, arranged according to their tones in a frame of wood, and struck with a hammer.\n\n1. A chief ruler; a sovereign; one invested with supreme authority over a nation, country, or tribe, usually by hereditary succession; a monarch; a prince. \"Ay, every inch a king.\" Shak. Kings will be tyrants from policy, when subjects are rebels from principle. Burke. There was a State without king or nobles. R. Choate. But yonder comes the powerful King of Day, Rejoicing in the east Thomson. 2. One who, or that which, holds a supreme position or rank; a chief among competitors; as, a railroad king; a money king; the king of the lobby; the king of beasts. 3. A playing card having the picture of a king; as, the king of diamonds. 4. The chief piece in the game of chess. 5. A crowned man in the game of draughts. 6. pl.  The title of two historical books in the Old Testament. Note: King is often used adjectively, or in combination, to denote preëminence or superiority in some particular; as, kingbird; king crow; king vulture. Apostolic king.See Apostolic. -- King-at-arms, or King-of-arms, the chief heraldic officer of a country. In England the king-at-arms was formerly of great authority. His business is to direct the heralds, preside at their chapters, and have the jurisdiction of armory. There are three principal kings-at- arms, viz., Garter, Clarencieux, and Norroy. The latter (literally north roy or north king) officiates north of the Trent. -- King auk (Zoöl.), the little auk or sea dove. -- King bird of paradise. (Zoöl.), See Bird of paradise. -- King card, in whist, the best unplayed card of each suit; thus, if the ace and king of a suit have been played, the queen is the king card of the suit. -- King Cole , a legendary king of Britain, who is said to have reigned in the third century. -- King conch (Zoöl.), a large and handsome univalve shell (Cassis cameo), found in the West Indies. It is used for making cameos. See Helmet shell, under Helmet. -- King Cotton, a popular personification of the great staple production of the southern United States. -- King crab. (Zoöl.) (a) The limulus or horseshoe crab. See Limulus. (b) The large European spider crab or thornback (Maia sguinado). -- King crow. (Zoöl.) (a) A black drongo shrike (Buchanga atra) of India; -- so called because, while breeding, they attack and drive away hawks, crows, and other large birds. (b) The Dicrurus macrocercus of India, a crested bird with a long, forked tail. Its color is black, with green and blue reflections. Called also devil bird. -- King duck (Zoöl.), a large and handsome eider duck (Somateria spectabilis), inhabiting the arctic regions of both continents. -- King eagle (Zoöl.), an eagle (Aquila heliaca) found in Asia and Southeastern Europe. It is about as large as the golden eagle. Some writers believe it to be the imperial eagle of Rome. -- King hake (Zoöl.), an American hake (Phycis regius), fond in deep water along the Atlantic coast. -- King monkey (Zoöl.), an African monkey(Colobus polycomus), inhabiting Sierra Leone. -- King mullet (Zoöl.), a West Indian red mullet (Upeneus maculatus); -- so called on account of its great beauty. Called also goldfish. -- King of terrors, death. -- King parrakeet (Zoöl.), a handsome Australian parrakeet (Platycercys scapulatus), often kept in a cage. Its prevailing color is bright red, with the back and wings bright green, the rump blue, and tail black. -- King penguin (Zoöl.), any large species of penguin of the genus Aptenodytes; esp., A. longirostris, of the Falkland Islands and Kerguelen Land, and A. Patagonica , of Patagonia. -- King rail (Zoöl.), a small American rail (Rallus elegans), living in fresh-water marshes. The upper parts are fulvous brown, striped with black; the breast is deep cinnamon color. -- King salmon (Zoöl.), the quinnat. See Quinnat. -- King's, or Queen's, counsel (Eng. Law), barristers learned in the law, who have been called within the bar, and selected to be the king's or gueen's counsel. They answer in some measure to the advocates of the revenue (advocati fisci) among the Romans. They can not be employed against the crown without special license. Wharton's Law Dict. -- King's cushion, a temporary seat made by two persons crossing their hands. [Prov. Eng.] Halliwell. -- The king's English, correct or current language of good speakers; pure English. Shak. -- King's or Queen's, evidence, testimony in favor of the Crown by a witness who confesses his guilt as an accomplice. See under Evidence. [Eng.] -- King's evil, scrofula; -- so called because formerly supposed to be healed by the touch of a king. -- King snake (Zoöl.), a large, nearly black, harmless snake (Ophiobolus getulus) of the Southern United States; -- so called because it kills and eats other kinds of snakes, including even the rattlesnake. -- King's spear (Bot.), the white asphodel (Asphodelus albus). -- King's yellow, a yellow pigment, consisting essentially of sulphide and oxide of arsenic; -- called also yellow orpiment. -- King tody (Zoöl.), a small fly-catching bird (Eurylaimus serilophus) of tropical America. The head is adorned with a large, spreading, fan-shaped crest, which is bright red, edged with black. -- King vulture (Zoöl.), a large species of vulture (Sarcorhamphus papa), ranging from Mexico to Paraguay, The general color is white. The wings and tail are black, and the naked carunculated head and the neck are briliantly colored with scarlet, yellow, orange, and blue. So called because it drives away other vultures while feeding. -- King wood, a wood from Brazil, called also violet wood, beautifully streaked in violet tints, used in turning and small cabinetwork. The tree is probably a species of Dalbergia. See Jacaranda.\n\nTo supply with a king; to make a king of; to raise to royalty. [R.] Shak. Those traitorous captains of Israel who kinged themselves by slaying their masters and reigning in their stead. South."}