{"word":"knot","definition":"1. (a) A fastening together of the pars or ends of one or more threads, cords, ropes, etc., by any one of various ways of tying or entangling. (b) A lump or loop formed in a thread, cord, rope. etc., as at the end, by tying or interweaving it upon itself. (c) An ornamental tie, as of a ribbon. Note: The names of knots vary according to the manner of their making, or the use for which they are intended; as, dowknot, reef knot, stopper knot, diamond knot, etc. 2. A bond of union; a connection; a tie. \"With nuptial knot.\" Shak. Ere we knit the knot that can never be loosed. Bp. Hall. 3. Something not easily solved; an intricacy; a difficulty; a perplexity; a problem. Knots worthy of solution. Cowper. A man shall be perplexed with knots, and problems of business, and contrary affairs. South. 4. A figure the lines of which are interlaced or intricately interwoven, as in embroidery, gardening, etc. \"Garden knots.\" Bacon. Flowers worthy of paradise, which, not nice art In beds and curious knots, but nature boon Poured forth profuse on hill, and dale, and plain. Milton. 5. A cluster of persons or things; a collection; a group; a hand; a clique; as, a knot of politicians. \"Knots of talk.\" Tennyson. His ancient knot of dangerous adversaries. Shak. Palms in cluster, knots of Paradise. Tennyson. As they sat together in small, separate knots, they discussed doctrinal and metaphysical points of belief. Sir W. Scott. 6. A portion of a branch of a tree that forms a mass of woody fiber running at an angle with the grain of the main stock and making a hard place in the timber. A loose knot is generally the remains of a dead branch of a tree covered by later woody growth. 7. A knob, lump, swelling, or protuberance. With lips serenely placid, felt the knot Climb in her throat. Tennyson. 8. A protuberant joint in a plant. 9. The point on which the action of a story depends; the gist of a matter. [Obs.] I shoulde to the knotte condescend, And maken of her walking soon an end. Chaucer. 10. (Mech.)  See Node. 11. (Naut.) (a) A division of the log line, serving to measure the rate of the vessel's motion. Each knot on the line bears the same proportion to a mile that thirty seconds do to an hour. The number of knots which run off from the reel in half a minute, therefore, shows the number of miles the vessel sails in an hour. Hence: (b) A nautical mile, or 6080.27 feet; as, when a ship goes eight miles an hour, her speed is said to be eight knots. 12. A kind of epaulet. See Shoulder knot. 13. (Zoöl.)  A sandpiper (Tringa canutus), found in the northern parts of all the continents, in summer. It is grayish or ashy above, with the rump and upper tail coverts white, barred with dusky. The lower parts are pale brown, with the flanks and under tail coverts white. When fat it is prized by epicures. Called also dunne. Note: The name is said to be derived from King Canute, this bird being a favorite article of food with him. The knot that called was Canutus' bird of old, Of that great king of Danes his name that still doth hold, His appetite to please that far and near was sought. Drayton.\n\n1. To tie in or with, or form into, a knot or knots; to form a knot on, as a rope; to entangle. \"Knotted curls.\" Drayton. As tight as I could knot the noose. Tennyson. 2. To unite closely; to knit together. Bacon. 3. To entangle or perplex; to puzzle. [Obs. or R.]\n\n1. To form knots or joints, as in a cord, a plant, etc.; to become entangled. Cut hay when it begins to knot. Mortimer. 2. To knit knots for fringe or trimming. 3. To copulate; -- said of toads. [R.] Shak."}