{"word":"know","definition":"Knee. [Obs.] Chaucer.\n\n1. To perceive or apprehend clearly and certainly; to understand; to have full information of; as, to know one's duty. O, that a man might know The end of this day's business ere it come! Shak. There is a certainty in the proposition, and we know it. Dryden. Know how sublime a thing it is To suffer and be strong. Longfellow. 2. To be convinced of the truth of; to be fully assured of; as, to know things from information. 3. To be acquainted with; to be no stranger to; to be more or less familiar with the person, character, etc., of; to possess experience of; as, to know an author; to know the rules of an organization. He hath made him to be sin for us, who knew no sin. 2 Cor. v. 21. Not to know me argues yourselves unknown. Milton. 4. To recognize; to distinguish; to discern the character of; as, to know a person's face or figure. Ye shall know them by their fruits. Matt. vil. 16. And their eyes were opened, and they knew him. Luke xxiv. 31. To know Faithful friend from flattering foe. Shak. At nearer view he thought he knew the dead. Flatman. 5. To have sexual commerce with. And Adam knew Eve his wife. Gen. iv. 1. Note: Know is often followed by an objective and an infinitive (with or without to) or a participle, a dependent sentence, etc. And I knew that thou hearest me always. John xi. 42. The monk he instantly knew to be the prior. Sir W. Scott. In other hands I have known money do good. Dickens. To know how, to understand the manner, way, or means; to have requisite information, intelligence, or sagacity. How is sometimes omitted. \" If we fear to die, or know not to be patient.\" Jer. Taylor.\n\n1. To have knowledge; to have a clear and certain perception; to possess wisdom, instruction, or information; -- often with of. Israel doth not know, my people doth not consider. Is. i. 3. If any man will do his will, he shall know of the doctrine, whether it be of God, or whether I speak of myself. John vii. 17. The peasant folklore of Europe still knows of willows that bleed and weep and speak when hewn. Tylor. 2. To be assured; to feel confident. To know of,to ask, to inquire. [Obs.] \" Know of your youth, examine well your blood.\" Shak."}