{"word":"lace","definition":"1. That which binds or holds, especially by being interwoven; a string, cord, or band, usually one passing through eyelet or other holes, and used in drawing and holding together parts of a garment, of a shoe, of a machine belt, etc. His hat hung at his back down by a lace. Chaucer. For striving more, the more in laces strong Himself he tied. Spenser. 2. A snare or gin, especially one made of interwoven cords; a net. [Obs.] Fairfax. Vulcanus had caught thee [Venus] in his lace. Chaucer. 3. A fabric of fine threads of linen, silk, cotton, etc., often ornamented with figures; a delicate tissue of thread, much worn as an ornament of dress. Our English dames are much given to the wearing of costlylaces. Bacon. 4. Spirits added to coffee or some other beverage. [Old Slang] Addison. Alencon lace, a kind of point lace, entirely of needlework, first made at Alencon in France, in the 17th century. It is very durable and of great beauty and cost. -- Bone lace, Brussels lace, etc. See under Bone, Brussels, etc. -- Gold lace, or Silver lace, lace having warp threads of silk, or silk and cotton, and a weft of silk threads covered with gold (or silver), or with gilt. -- Lace leather, thin, oil-tanned leather suitable for cutting into lacings for machine belts. -- Lace lizard (Zoöl.), a large, aquatic, Australian lizard (Hydrosaurus giganteus), allied to the monitors. -- Lace paper, paper with an openwork design in imitation of lace. -- Lace piece (Shipbuilding), the main piece of timber which supports the beak or head projecting beyond the stem of a ship. -- Lace pillow, and Pillow lace. See under Pillow.\n\n1. To fasten with a lace; to draw together with a lace passed through eyelet holes; to unite with a lace or laces, or, figuratively. with anything resembling laces. Shak. When Jenny's stays are newly laced. Prior. 2. To adorn with narrow strips or braids of some decorative material; as, cloth laced with silver. Shak. 3. To beat; to lash; to make stripes on. [Colloq.] I'll lace your coat for ye. L'Estrange. 4. To add spirits to (a beverage). [Old Slang]\n\nTo be fastened with a lace, or laces; as, these boots lace."}