{"word":"lady","definition":"1. A woman who looks after the domestic affairs of a family; a mistress; the female head of a household. Agar, the handmaiden of Sara, whence comest thou, and whither goest thou The which answered, Fro the face of Sara my lady. Wyclif (Gen. xvi. 8.). 2. A woman having proprietary rights or authority; mistress; -- a feminine correlative of lord. \"Lord or lady of high degree.\" Lowell. Of all these bounds, even from this line to this, . . . We make thee lady. Shak. 3. A woman to whom the particular homage of a knight was paid; a woman to whom one is devoted or bound; a sweetheart. The soldier here his wasted store supplies, And takes new valor from his lady's eyes. Waller. 4. A woman of social distinction or position. In England, a title prefixed to the name of any woman whose husband is not of lower rank than a baron, or whose father was a nobleman not lower than an earl. The wife of a baronet or knight has the title of Lady by courtesy, but not by right. 5. A woman of refined or gentle manners; a well-bred woman; -- the feminine correlative of gentleman. 6. A wife; -- not now in approved usage. Goldsmith. 7. (Zoöl.)  The triturating apparatus in the stomach of a lobster; -- so called from a fancied resemblance to a seated female figure. It consists of calcareous plates. Ladies' man, a man who affects the society of ladies. -- Lady altar, an altar in a lady chapel. Shipley. -- Lady chapel, a chapel dedicated to the Virgin Mary. -- Lady court, the court of a lady of the manor. -- Lady crab (Zoöl.), a handsomely spotted swimming crab (Platyonichus ocellatus) very common on the sandy shores of the Atlantic coast of the United States. -- Lady fern. (Bot.) See Female fern, under Female, and Illust. of Fern. -- Lady in waiting, a lady of the queen's household, appointed to wait upon or attend the queen. -- Lady Mass, a Mass said in honor of the Virgin Mary. Shipley. Lady of the manor, a lady having jurisdiction of a manor; also, the wife of a manor lord. Lady's maid, a maidservant who dresses and waits upon a lady. Thackeray. -- Our Lady, the Virgin Mary.\n\nBelonging or becoming to a lady; ladylike. \"Some lady trifles.\" Shak."}