{"word":"lake","definition":"A pigment formed by combining some coloring matter, usually by precipitation, with a metallic oxide or earth, esp. with aluminium hydrate; as, madder lake; Florentine lake; yellow lake, etc.\n\nA kind of fine white linen, formerly in use. [Obs.] Chaucer.\n\nTo play; to sport. [Prov. Eng.]\n\nA large body of water contained in a depression of the earth's surface, and supplied from the drainage of a more or less extended area. Note: Lakes are for the most part of fresh water; the salt lakes, like the Great Salt Lake of Utah, have usually no outlet to the ocean. Lake dwellers (Ethnol.), people of a prehistoric race, or races, which inhabited different parts of Europe. Their dwellings were built on piles in lakes, a short distance from the shore. Their relics are common in the lakes of Switzerland. -- Lake dwellings (Archæol.), dwellings built over a lake, sometimes on piles, and sometimes on rude foundations kept in place by piles; specifically, such dwellings of prehistoric times. Lake dwellings are still used by many savage tribes. Called also lacustrine dwellings. See Crannog. -- Lake fly (Zoöl.), any one of numerous species of dipterous flies of the genus Chironomus. In form they resemble mosquitoes, but they do not bite. The larvæ live in lakes. -- Lake herring (Zoöl.), the cisco (Coregonus Artedii). -- Lake poets, Lake school, a collective name originally applied in contempt, but now in honor, to Southey, Coleridge, and Wordsworth, who lived in the lake country of Cumberland, England, Lamb and a few others were classed with these by hostile critics. Called also lakers and lakists. -- Lake sturgeon (Zoöl.), a sturgeon (Acipenser rubicundus), of moderate size, found in the Great Lakes and the Mississippi River. It is used as food. -- Lake trout (Zoöl.), any one of several species of trout and salmon; in Europe, esp. Salmo fario; in the United States, esp. Salvelinus namaycush of the Great Lakes, and of various lakes in New York, Eastern Maine, and Canada. A large variety of brook trout (S. fontinalis), inhabiting many lakes in New England, is also called lake trout. See Namaycush. -- Lake whitefish. (Zoöl.) See Whitefish. -- Lake whiting (Zoöl.), an American whitefish (Coregonus Labradoricus), found in many lakes in the Northern United States and Canada. It is more slender than the common whitefish."}