{"word":"land","definition":"Urine. See Lant. [Obs.]\n\n1. The solid part of the surface of the earth; -- opposed to water as constituting a part of such surface, especially to oceans and seas; as, to sight land after a long voyage. They turn their heads to sea, their sterns to land. Dryden. 2. Any portion, large or small, of the surface of the earth, considered by itself, or as belonging to an individual or a people, as a country, estate, farm, or tract. Go view the land, even Jericho. Josh. ii. 1. Ill fares the land, to hastening ills a prey, Where wealth accumulates and men decay. Goldsmith. Note: In the expressions \"to be, or dwell, upon land,\" \"to go, or fare, on land,\" as used by Chaucer, land denotes the country as distinguished from the town. A poor parson dwelling upon land [i.e., in the country]. Chaucer. 3. Ground, in respect to its nature or quality; soil; as, wet land; good or bad land. 4. The inhabitants of a nation or people. These answers, in the silent night received, The kind himself divulged, the land believed. Dryden. 5. The mainland, in distinction from islands. 6. The ground or floor. [Obs.] Herself upon the land she did prostrate. Spenser. 7. (Agric.)  The ground left unplowed between furrows; any one of several portions into which a field is divided for convenience in plowing. 8. (Law)  Any ground, soil, or earth whatsoever, as meadows, pastures, woods, etc., and everything annexed to it, whether by nature, as trees, water, etc., or by the hand of man, as buildings, fences, etc.; real estate. Kent. Bouvier. Burrill. 9. (Naut.)  The lap of the strakes in a clinker-built boat; the lap of plates in an iron vessel; -- called also landing. Knight. 10. In any surface prepared with indentations, perforations, or grooves, that part of the surface which is not so treated, as the level part of a millstone between the furrows, or the surface of the bore of a rifled gun between the grooves. Land agent, a person employed to sell or let land, to collect rents, and to attend to other money matters connected with land. -- Land boat, a vehicle on wheels propelled by sails. -- Land blink, a peculiar atmospheric brightness seen from sea over distant snow-covered land in arctic regions. See Ice blink. -- Land breeze. See under Breeze. -- Land chain. See Gunter's chain. -- Land crab (Zoöl.), any one of various species of crabs which live much on the land, and resort to the water chiefly for the purpose of breeding. They are abundant in the West Indies and South America. Some of them grow to a large size. -- Land fish a fish on land; a person quite out of place.Shak. -- Land force, a military force serving on land, as distinguished from a naval force. -- Land, ho! (Naut.), a sailor's cry in announcing sight of land. -- Land ice, a field of ice adhering to the coast, in distinction from a floe. -- Land leech (Zoöl.), any one of several species of blood-sucking leeches, which, in moist, tropical regions, live on land, and are often troublesome to man and beast. -- Land measure, the system of measurement used in determining the area of land; also, a table of areas used in such measurement. -- Land, or House, of bondage, in Bible history, Egypt; by extension, a place or condition of special oppression. -- Land o' cakes, Scotland. -- Land of Nod, sleep. -- Land of promise, in Bible history, Canaan: by extension, a better country or condition of which one has expectation. -- Land of steady habits, a nickname sometimes given to the State of Connecticut. -- Land office, a government office in which the entries upon, and sales of, public land are registered, and other business respecting the public lands is transacted. [U.S.] -- Land pike. (Zoöl.) (a) The gray pike, or sauger. (b) The Menobranchus. -- Land service, military service as distinguished from naval service. -- Land rail. (Zoöl) (a) The crake or corncrake of Europe. See Crake. (b) An Australian rail (Hypotænidia Phillipensis); -- called also pectoral rail. -- Land scrip, a certificate that the purchase money for a certain portion of the public land has been paid to the officer entitled to receive it. [U.S.] -- Land shark, a swindler of sailors on shore. [Sailors' Cant] -- Land side (a) That side of anything in or on the sea, as of an island or ship, which is turned toward the land. (b) The side of a plow which is opposite to the moldboard and which presses against the unplowed land. -- Land snail (Zoöl.), any snail which lives on land, as distinguished from the aquatic snails are Pulmonifera, and belong to the Geophila; but the operculated land snails of warm countries are Dioecia, and belong to the Tænioglossa. See Geophila, and Helix. -- Land spout, a descent of cloud and water in a conical form during the occurrence of a tornado and heavy rainfall on land. -- Land steward, a person who acts for another in the management of land, collection of rents, etc. -- Land tortoise, Land turtle (Zoöl.), any tortoise that habitually lives on dry land, as the box tortoise. See Tortoise. -- Land warrant, a certificate from the Land Office, authorizing a person to assume ownership of a public land. [U.S.] -- Land wind. Same as Land breeze (above). -- To make land (Naut.), to sight land. To set the land, to see by the compass how the land bears from the ship. -- To shut in the land, to hide the land, as when fog, or an intervening island, obstructs the view.\n\n1. To set or put on shore from a ship or other water craft; to disembark; to debark. I 'll undertake top land them on our coast. Shak. 2. To catch and bring to shore; to capture; as, to land a fish. 3. To set down after conveying; to cause to fall, alight, or reach; to bring to the end of a course; as, he landed the quoit near the stake; to be thrown from a horse and landed in the mud; to land one in difficulties or mistakes.\n\nTo go on shore from a ship or boat; to disembark; to come to the end of a course."}