{"word":"language","definition":"1. Any means of conveying or communicating ideas; specifically, human speech; the expression of ideas by the voice; sounds, expressive of thought, articulated by the organs of the throat and mouth. Note: Language consists in the oral utterance of sounds which usage has made the representatives of ideas. When two or more persons customarily annex the same sounds to the same ideas, the expression of these sounds by one person communicates his ideas to another. This is the primary sense of language, the use of which is to communicate the thoughts of one person to another through the organs of hearing. Articulate sounds are represented to the eye by letters, marks, or characters, which form words. 2. The expression of ideas by writing, or any other instrumentality. 3. The forms of speech, or the methods of expressing ideas, peculiar to a particular nation. 4. The characteristic mode of arranging words, peculiar to an individual speaker or writer; manner of expression; style. Others for language all their care express. Pope. 5. The inarticulate sounds by which animals inferior to man express their feelings or their wants. 6. The suggestion, by objects, actions, or conditions, of ideas associated therewith; as, the language of flowers. There was . . . language in their very gesture. Shak. 7. The vocabulary and phraseology belonging to an art or department of knowledge; as, medical language; the language of chemistry or theology. 8. A race, as distinguished by its speech. [R.] All the people, the nations, and the languages, fell down and worshiped the golden image. Dan. iii. 7. Language master, a teacher of languages.[Obs.] Syn. -- Speech; tongue; idiom; dialect; phraseology; diction; discourse; conversation; talk. -- Language, Speech, Tongue, Idiom, Dialect. Language is generic, denoting, in its most extended use, any mode of conveying ideas; speech is the language of articulate sounds; tongue is the Anglo- Saxon tern for language, esp. for spoken language; as, the English tongue. Idiom denotes the forms of construction peculiar to a particular language; dialects are varieties if expression which spring up in different parts of a country among people speaking substantially the same language.\n\nTo communicate by language; to express in language. Others were languaged in such doubtful expressions that they have a double sense. Fuller."}