{"word":"lantern","definition":"1. Something inclosing a light, and protecting it from wind, rain, etc. ; -- sometimes portable, as a closed vessel or case of horn, perforated tin, glass, oiled paper, or other material, having a lamp or candle within; sometimes fixed, as the glazed inclosure of a street light, or of a lighthouse light. 2. (Arch.) (a) An open structure of light material set upon a roof, to give light and air to the interior. (b) A cage or open chamber of rich architecture, open below into the building or tower which it crowns. (c) A smaller and secondary cupola crowning a larger one, for ornament, or to admit light; such as the lantern of the cupola of the Capitol at Washington, or that of the Florence cathedral. 3. (Mach.)  A lantern pinion or trundle wheel. See Lantern pinion (below). 4. (Steam Engine)  A kind of cage inserted in a stuffing box and surrounding a piston rod, to separate the packing into two parts and form a chamber between for the reception of steam, etc. ; -- called also lantern brass. 5. (Founding)  A perforated barrel to form a core upon. 6. (Zoöl.)  See Aristotle's lantern. Note: Fig. 1 represents a hand lantern; fig. 2, an arm lantern; fig. 3, a breast lantern; -- so named from the positions in which they are carried. Dark lantern, a lantern with a single opening, which may be closed so as to conceal the light; -- called also bull's-eye. -- Lantern fly, Lantern carrier (Zoöl.), any one of several species of large, handsome, hemipterous insects of the genera Laternaria, Fulgora, and allies, of the family Fulgoridæ. The largest species is Laternaria phosphorea of Brazil. The head of some species has been supposed to be phosphorescent. -- Lantern jaws, long, thin jaws; hence, a thin visage. -- Lantern pinion, Lantern wheel (Mach.), a kind of pinion or wheel having cylindrical bars or trundles, instead of teeth, inserted at their ends in two parallel disks or plates; -- so called as resembling a lantern in shape; -- called also wallower, or trundle. -- Lantern shell (Zoöl.), any translucent, marine, bivalve shell of the genus Anatina, and allied genera. -- Magic lantern, an optical instrument consisting of a case inclosing a light, and having suitable lenses in a lateral tube, for throwing upon a screen, in a darkened room or the like, greatly magnified pictures from slides placed in the focus of the outer lens.\n\nTo furnish with a lantern; as, to lantern a lighthouse."}