{"word":"lap","definition":"1. The loose part of a coat; the lower part of a garment that plays loosely; a skirt; an apron. Chaucer. 2. An edge; a border; a hem, as of cloth. Chaucer. If he cuts off but a lap of truth's garment, his heart smites him. Fuller. 3. The part of the clothing that lies on the knees or thighs when one sits down; that part of the person thus covered; figuratively, a place of rearing and fostering; as, to be reared in the lap of luxury. Men expect that happiness should drop into their laps. Tillotson. 4. That part of any substance or fixture which extends over, or lies upon, or by the side of, a part of another; as, the lap of a board; also, the measure of such extension over or upon another thing. Note: The lap of shingles or slates in roofing is the distance one course extends over the second course below, the distance over the course immediately below being called the cover. 5. (Steam Engine)  The amount by which a slide valve at its half stroke overlaps a port in the seat, being equal to the distance the valve must move from its mid stroke position in order to begin to open the port. Used alone, lap refers to outside lap. See Outside lap (below). 6. The state or condition of being in part extended over or by the side of something else; or the extent of the overlapping; as, the second boat got a lap of half its length on the leader. 7. One circuit around a race track, esp. when the distance is a small fraction of a mile; as, to run twenty laps; to win by three laps. See Lap, to fold, 2. 8. In card playing and other games, the points won in excess of the number necessary to complete a game; -- so called when they are counted in the score of the following game. 9. (Cotton Manuf.)  A sheet, layer, or bat, of cotton fiber prepared for the carding machine. 10. (Mach.)  A piece of brass, lead, or other soft metal, used to hold a cutting or polishing powder in cutting glass, gems, and the like, or in polishing cutlery, etc. It is usually in the form of wheel or disk, which revolves on a vertical axis. Lap joint, a joint made by one layer, part, or piece, overlapping another, as in the scarfing of timbers. -- Lap weld, a lap joint made by welding together overlapping edges or ends. -- Inside lap (Steam Engine), lap of the valve with respect to the exhaust port. -- Outside lap, lap with respect to the admission, or steam, port.\n\n1. To rest or recline in a lap, or as in a lap. To lap his head on lady's breast. Praed. 2. To cut or polish with a lap, as glass, gems, cutlery, etc. See 1st Lap, 10.\n\n1. To fold; to bend and lay over or on something; as, to lap a piece of cloth. 2. To wrap or wind around something. About the paper . . . I lapped several times a slender thread of very black silk. Sir I. Newton. 3. To infold; to hold as in one's lap; to cherish. Her garment spreads, and laps him in the folds. Dryden. 4. To lay or place over anything so as to partly or wholly cover it; as, to lap one shingle over another; to lay together one partly over another; as, to lap weather-boards; also, to be partly over, or by the side of (something); as, the hinder boat lapped the foremost one. 5. (Carding & Spinning)  To lay together one over another, as fleeces or slivers for further working. To lap boards, shingles, etc., to lay one partly over another. -- To lap timbers, to unite them in such a way as to preserve the same breadth and depth throughout, as by scarfing. Weale.\n\nTo be turned or folded; to lie partly upon or by the side of something, or of one another; as, the cloth laps back; the boats lap; the edges lap. The upper wings are opacous; at their hinder ends, where they lap over, transparent, like the wing of a flay. Grew.\n\n1. To take up drink or food with the tongue; to drink or feed by licking up something. The dogs by the River Nilus's side, being thirsty, lap hastily as they run along the shore. Sir K. Digby. 2. To make a sound like that produced by taking up drink with the tongue. I heard the ripple washing in the reeds, And the wild water lapping on the crag. Tennyson.\n\nTo take into the mouth with the tongue; to lick up with a quick motion of the tongue. They 'II take suggestion as a cat laps milk. Shak.\n\n1. The act of lapping with, or as with, the tongue; as, to take anything into the mouth with a lap. 2. The sound of lapping."}