{"word":"large","definition":"1. Exceeding most other things of like in bulk, capacity, quantity, superficial dimensions, or number of constituent units; big; great; capacious; extensive; -- opposed to small; as, a nlarge horse; a large house or room; a large lake or pool; a large jug or spoon; a large vineyard; a large army; a large city. Note: For linear dimensions, and mere extent, great, and not large, is used as a qualifying word; as, great length, breadth, depth; a great distance; a great height. 2. Abundant; ample; as, a large supply of provisions. We hare yet large day. Milton. 3. Full in statement; diffuse; full; profuse. I might be very large upon the importance and advantages of education. Felton. 4. Having more than usual power or capacity; having broad sympathies and generous impulses; comprehensive; -- said of the mind and heart. 5. Free; unembarrassed. [Obs.] Of burdens all he set the Paynims large. Fairfax. 6. Unrestrained by decorum; -- said of language. [Obs.] \"Some large jests he will make.\" Shak. 7. Prodigal in expending; lavish. [Obs.] Chaucer. 8. (Naut.)  Crossing the line of a ship's course in a favorable direction; -- said of the wind when it is abeam, or between the beam and the quarter. At large. (a) Without restraint or confinement; as, to go at large; to be left at large. (b) Diffusely; fully; in the full extent; as, to discourse on a subject at large. -- Common at large. See under Common, n. -- Electors at large, Representative at large, electors, or a representative, as in Congress, chosen to represent the whole of a State, in distinction from those chosen to represent particular districts in a State. [U. S.] -- To give, go, run, or sail large (Naut.), to have the wind crossing the direction of a vessel's course in such a way that the sails feel its full force, and the vessel gains its highest speed. See Large, a., 8. Syn. -- Big; bulky; huge; capacious; comprehensive; ample; abundant; plentiful; populous; copious; diffusive; liberal.\n\nFreely; licentiously. [Obs.] Chaucer.\n\nA musical note, formerly in use, equal to two longs, four breves, or eight semibreves."}