{"word":"last","definition":"of Last, to endure, contracted from lasteth. [Obs.] Chaucer.\n\n1. Being after all the others, similarly classed or considered, in time, place, or order of succession; following all the rest; final; hindmost; farthest; as, the last year of a century; the last man in a line of soldiers; the last page in a book; his last chance. Also day by day, from the first day unto the last day, he read in the book of the law of God. Neh. viii. 18. Fairest of stars, last in the train of night. Milton. 2. Next before the present; as, I saw him last week. 3. Supreme; highest in degree; utmost. Contending for principles of the last importance. R. Hall . 4. Lowest in rank or degree; as, the last prize. Pope. 5. Farthest of all from a given quality, character, or condition; most unlikely; having least fitness; as, he is the last person to be accused of theft. At last, at the end of a certain period; after delay. \"The duke of Savoy felt that the time had at last arrived.\" Motley. -- At the last. Etym: [Prob. fr. AS. on laste behind, following behind, fr. last race, track, footstep. See Last mold of the foot.] At the end; in the conclusion. [Obs.] \"Gad, a troop shall overcome him; but he shall overcome at the last.\" Gen. xlix. 19. -- Last heir, the person to whom lands escheat for want of an heir. [Eng.] Abbott. -- On one's last legs, at, or near, the end of one's resources; hence, on the verge of failure or ruin, especially in a financial sense. [Colloq.] -- To breathe one's last, to die. -- To the last, to the end; till the conclusion. And blunder on in business to the last. Pope. Syn. -- At Last, At Length. These phrases both denote that some delayed end or result has been reached. At length implies that a long period was spent in so doing; as, after a voyage of more than three months, we at Length arrived safe. At last commonly implies that something has occurred (as interruptions, disappointments, etc.) which leads us to emphasize the idea of having reached the end; as, in spite of every obstacle, we have at last arrived.\n\n1. At a time or on an occasion which is the latest of all those spoken of or which have occurred; the last time; as, I saw him last in New York. 2. In conclusion; finally.lastly Pleased with his idol, he commends, admires, Adores; and, last, the thing adored desires. Dryden. 3. At a time next preceding the present time. How long is't now since last yourself and I Were in a mask Shak.\n\n1. To continue in time; to endure; to remain in existence. [I] proffered me to be slave in all that she me would ordain while my life lasted. Testament of Love. 2. To endure use, or continue in existence, without impairment or exhaustion; as, this cloth lasts better than that; the fuel will last through the winter.\n\nA wooden block shaped like the human foot, on which boots and shoes are formed. The cobbler is not to go beyond his last. L'Estrange. Darning last, a smooth, hard body, often egg-shaped, put into a stocking to preserve its shape in darning.\n\nTo shape with a last; to fasten or fit to a last; to place smoothly on a last; as, to last a boot.\n\n1. A load; a heavy burden; hence, a certain weight or measure, generally estimated at 4,000 lbs., but varying for different articles and in different countries. In England, a last of codfish, white herrings, meal, or ashes, is twelve barrels; a last of corn, ten quarters, or eighty bushels, in some parts of England, twenty-one quarters; of gunpowder, twenty-four barrels, each containing 100 lbs; of red herrings, twenty cades, or 20,000; of hides, twelve dozen; of leather, twenty dickers; of pitch and tar, fourteen barrels; of wool, twelve sacks; of flax or feathers, 1,700 lbs. 2. The burden of a ship; a cargo."}