{"word":"laugh","definition":"1. To show mirth, satisfaction, or derision, by peculiar movement of the muscles of the face, particularly of the mouth, causing a lighting up of the face and eyes, and usually accompanied by the emission of explosive or chuckling sounds from the chest and throat; to indulge in laughter. Queen Hecuba laughed that her eyes ran o'er. Shak. He laugheth that winneth. Heywood's Prov. 2. Fig.: To be or appear gay, cheerful, pleasant, mirthful, lively, or brilliant; to sparkle; to sport. Then laughs the childish year, with flowerets crowned. Dryden. In Folly's cup still laughs the bubble Joy. Pope. To laugh at, to make an object of laughter or ridicule; to make fun of; to deride. No wit to flatter left of all his store, No fool to laugh at, which he valued more. Pope. -- To laugh in the sleeve, to laugh secretly, or so as not to be observed, especially while apparently preserving a grave or serious demeanor toward the person or persons laughed at. -- To laugh out, to laugh in spite of some restraining influence; to laugh aloud. -- To laugh out of the other corner (or side) of the mouth, to weep or cry; to feel regret, vexation, or disappointment after hilarity or exaltation. [Slang]\n\n1. To affect or influence by means of laughter or ridicule. Will you laugh me asleep, for I am very heavy Shak. I shall laugh myself to death. Shak. 2. To express by, or utter with, laughter; -- with out. From his deep chest laughs out a loud applause. Shak. To laugh away. (a) To drive away by laughter; as, to laugh away regret. (b) To waste in hilarity. \"Pompey doth this day laugh away his fortune.\" Shak. -- To laugh down. (a) To cause to cease or desist by laughter; as, to laugh down a speaker. (b) To cause to be given up on account of ridicule; as, to laugh down a reform. -- To laugh one out of, to cause one by laughter or ridicule to abandon or give up; as, to laugh one out of a plan or purpose. -- To laugh to scorn, to deride; to treat with mockery, contempt, and scorn; to despise.\n\nAn expression of mirth peculiar to the human species; the sound heard in laughing; laughter. See Laugh, v. i. And the loud laugh that spoke the vacant mind. Goldsmith. That man is a bad man who has not within him the power of a hearty laugh. F. W. Robertson."}