{"word":"lead","definition":"1. (Chem.)  One of the elements, a heavy, pliable, inelastic metal, having a bright, bluish color, but easily tarnished. It is both malleable and ductile, though with little tenacity, and is used for tubes, sheets, bullets, etc. Its specific gravity is 11.37. It is easily fusible, forms alloys with other metals, and is an ingredient of solder and type metal. Atomic weight, 206.4. Symbol Pb (L. Plumbum). It is chiefly obtained from the mineral galena, lead sulphide. 2. An article made of lead or an alloy of lead; as: (a) A plummet or mass of lead, used in sounding at sea. (b) (Print.) A thin strip of type metal, used to separate lines of type in printing. (c) Sheets or plates of lead used as a covering for roofs; hence, pl., a roof covered with lead sheets or terne plates. I would have the tower two stories, and goodly leads upon the top. Bacon 3. A small cylinder of black lead or plumbago, used in pencils. Black lead, graphite or plumbago, ; -- so called from its leadlike appearance and streak. [Colloq.] -- Coasting lead, a sounding lead intermediate in weight between a hand lead and deep-sea lead. -- Deep-sea lead, the heaviest of sounding leads, used in water exceeding a hundred fathoms in depth. Ham. Nav. Encyc. -- Hand lead, a small lead use for sounding in shallow water. -- Krems lead, Kremnitz lead Etym: [so called from Krems or Kremnitz, in Austria], a pure variety of white lead, formed into tablets, and called also Krems, or Kremnitz, white, and Vienna white. -- Lead arming, tallow put in the hollow of a sounding lead. See To arm the lead (below). -- Lead colic. See under Colic. -- Lead color, a deep bluish gray color, like tarnished lead. -- Lead glance. (Min.) Same as Galena. -- Lead line (a) (Med.) A dark line along the gums produced by a deposit of metallic lead, due to lead poisoning. (b) (Naut.) A sounding line. -- Lead mill, a leaden polishing wheel, used by lapidaries. -- Lead ocher (Min.), a massive sulphur-yellow oxide of lead. Same as Massicot. -- Lead pencil, a pencil of which the marking material is graphite (black lead). -- Lead plant (Bot.), a low leguminous plant, genus Amorpha (A. canescens), found in the Northwestern United States, where its presence is supposed to indicate lead ore. Gray. -- Lead tree. (a) (Bot.) A West Indian name for the tropical, leguminous tree, Leucæna glauca; -- probably so called from the glaucous color of the foliage. (b) (Chem.) Lead crystallized in arborescent forms from a solution of some lead salt, as by suspending a strip of zinc in lead acetate. -- Mock lead, a miner's term for blende. -- Red lead, a scarlet, crystalline, granular powder, consisting of minium when pure, but commonly containing several of the oxides of lead. It is used as a paint or cement and also as an ingredient of flint glass. -- Red lead ore (Min.), crocoite. -- Sugar of lead, acetate of lead. -- To arm the lead, to fill the hollow in the bottom of a sounding lead with tallow in order to discover the nature of the bottom by the substances adhering. Ham. Nav. Encyc. -- To cast, or heave, the lead, to cast the sounding lead for ascertaining the depth of water. -- White lead, hydrated carbonate of lead, obtained as a white, amorphous powder, and much used as an ingredient of white paint.\n\n1. To cover, fill, or affect with lead; as, continuous firing leads the grooves of a rifle. 2. (Print.)  To place leads between the lines of; as, to lead a page; leaded matter.\n\n1. To guide or conduct with the hand, or by means of some physical contact connection; as, a father leads a child; a jockey leads a horse with a halter; a dog leads a blind man. If a blind man lead a blind man, both fall down in the ditch. Wyclif (Matt. xv. 14.) They thrust him out of the city, and led him unto the brow of the hill. Luke iv. 29. In thy right hand lead with thee The mountain nymph, sweet Liberty. Milton. 2. To guide or conduct in a certain course, or to a certain place or end, by making the way known; to show the way, esp. by going with or going in advance of. Hence, figuratively: To direct; to counsel; to instruct; as, to lead a traveler; to lead a pupil. The Lord went before them by day in a pillar of a cloud, to lead them the way. Ex. xiii. 21. He leadeth me beside the still waters. Ps. xxiii. 2. This thought might lead me through the world's vain mask. Content, though blind, had I no better guide. Milton. 3. To conduct or direct with authority; to have direction or charge of; as, to lead an army, an exploring party, or a search; to lead a political party. Christ took not upon him flesh and blood that he might conquer and rule nations, lead armies, or possess places. South. 4. To go or to be in advance of; to precede; hence, to be foremost or chief among; as, the big sloop led the fleet of yachts; the Guards led the attack; Demosthenes leads the orators of all ages. As Hesperus, that leads the sun his way. Fairfax. And lo ! Ben Adhem's name led all the rest. Leigh Hunt. 5. To draw or direct by influence, whether good or bad; to prevail on; to induce; to entice; to allure; as, to lead one to espouse a righteous cause. He was driven by the necessities of the times, more than led by his own disposition, to any rigor of actions. Eikon Basilike. Silly women, laden with sins,led away by divers lusts. 2 Tim. iii. 6 (Rev. Ver.). 6. To guide or conduct one's self in, through, or along (a certain course); hence, to proceed in the way of; to follow the path or course of; to pass; to spend. Also, to cause (one) to proceed or follow in (a certain course). That we may lead a quiet and peaceable life. 1 Tim. ii. 2. Nor thou with shadowed hint confuse A life that leads melodious days. Tennyson. You remember . . . the life he used to lead his wife and daughter. Dickens. 7. (Cards & Dominoes)  To begin a game, round, or trick, with; as, to lead trumps; the double five was led. To lead astray, to guide in a wrong way, or into error; to seduce from truth or rectitude. -- To lead captive, to carry or bring into captivity. -- To lead the way, to show the way by going in front; to act as guide. Goldsmith.\n\n1. To guide or conduct, as by accompanying, going before, showing, influencing, directing with authority, etc.; to have precedence or preëminence; to be first or chief; -- used in most of the senses of lead, v. t. 2. To tend or reach in a certain direction, or to a certain place; as, the path leads to the mill; gambling leads to other vices. The mountain foot that leads towards Mantua. Shak. To lead off or out, to go first; to begin.\n\n1. The act of leading or conducting; guidance; direction; as, to take the lead; to be under the lead of another. At the time I speak of, and having a momentary lead, . . . I am sure I did my country important service. Burke. 2. precedence; advance position; also, the measure of precedence; as, the white horse had the lead; a lead of a boat's length, or of half a second. 3. (Cards & Dominoes)  The act or right of playing first in a game or round; the card suit, or piece, so played; as, your partner has the lead. 4. An open way in an ice field. Kane. 5. (Mining)  A lode. 6. (Naut.)  The course of a rope from end to end. 7. (Steam Engine)  The width of port opening which is uncovered by the valve, for the admission or release of steam, at the instant when the piston is at end of its stroke. Note: When used alone it means outside lead, or lead for the admission of steam. Inside lead refers to the release or exhaust. 8. (Civil Engineering)  the distance of haul, as from a cutting to an embankment. 9. (Horology)  The action of a tooth, as a tooth of a wheel, in impelling another tooth or a pallet. Saunier. Lead angle (Steam Engine), the angle which the crank maker with the line of centers, in approaching it, at the instant when the valve opens to admit steam. -- Lead screw (Mach.), the main longitudinal screw of a lathe, which gives the feed motion to the carriage."}