{"word":"leaf","definition":"1. (Bot.)  A colored, usually green, expansion growing from the side of a stem or rootstock, in which the sap for the use of the plant is elaborated under the influence of light; one of the parts of a plant which collectively constitute its foliage. Note: Such leaves usually consist of a blade, or lamina , supported upon a leafstalk or petiole, which, continued through the blade as the midrib, gives off woody ribs and veins that support the cellular texture. The petiole has usually some sort of an appendage on each side of its base, which is called the stipule. The green parenchyma of the leaf is covered with a thin epiderm pierced with closable microscopic openings, known as stomata. 2. (Bot.)  A special organ of vegetation in the form of a lateral outgrowth from the stem, whether appearing as a part of the foliage, or as a cotyledon, a scale, a bract, a spine, or a tendril. Note: In this view every part of a plant, except the root and the stem, is either a leaf, or is composed of leaves more or less modified and transformed. 3. Something which is like a leaf in being wide and thin and having a flat surface, or in being attached to a larger body by one edge or end; as : (a) A part of a book or folded sheet containing two pages upon its opposite sides. (b) A side, division, or part, that slides or is hinged, as of window shutters, folding doors, etc. (c) The movable side of a table. (d) A very thin plate; as, gold leaf. (e) A portion of fat lying in a separate fold or layer. (f) One of the teeth of a pinion, especially when small. Leaf beetle (Zoöl.), any beetle which feeds upon leaves; esp., any species of the family Chrysomelidæ, as the potato beetle and helmet beetle. -- Leaf bridge, a draw-bridge having a platform or leaf which swings vertically on hinges. -- Leaf bud (Bot.), a bud which develops into leaves or a leafy branch. -- Leaf butterfly (Zoöl.), any butterfly which, in the form and colors of its wings, resembles the leaves of plants upon which it rests; esp., butterflies of the genus Kallima, found in Southern Asia and the East Indies. -- Leaf crumpler (Zoöl.), a small moth (Phycis indigenella), the larva of which feeds upon leaves of the apple tree, and forms its nest by crumpling and fastening leaves together in clusters. -- Leaf cutter (Zoöl.) , any one of various species of wild bees of the genus Megachile, which cut rounded pieces from the edges of leaves, or the petals of flowers, to be used in the construction of their nests, which are made in holes and crevices, or in a leaf rolled up for the purpose. Among the common American species are M. brevis and M. centuncularis. Called also rose-cutting bee. -- Leaf fat, the fat which lies in leaves or layers within the body of an animal. -- Leaf flea (Zoöl.), a jumping plant louse of the family Psyllidæ. -- Leaf frog (Zoöl.), any tree frog of the genus Phyllomedusa. -- Leaf green.(Bot.) See Chlorophyll. -- Leaf hopper (Zoöl.), any small jumping hemipterous insect of the genus Tettigonia, and allied genera. They live upon the leaves and twigs of plants. See Live hopper. -- Leaf insect (Zoöl.), any one of several genera and species of orthopterous insects, esp. of the genus Phyllium, in which the wings, and sometimes the legs, resemble leaves in color and form. They are common in Southern Asia and the East Indies. -- Leaf lard, lard from leaf fat. See under Lard. -- Leaf louse (Zoöl.), an aphid. -- Leaf metal, metal in thin leaves, as gold, silver, or tin. -- Leaf miner (Zoöl.), any one of various small lepidopterous and dipterous insects, which, in the larval stages, burrow in and eat the parenchyma of leaves; as, the pear-tree leaf miner (Lithocolletis geminatella). -- Leaf notcher (Zoöl.), a pale bluish green beetle (Artipus Floridanus), which, in Florida, eats the edges of the leaves of orange trees. -- Leaf roller (Zoöl.), the larva of any tortricid moth which makes a nest by rolling up the leaves of plants. See Tortrix. -- Leaf scar (Bot.), the cicatrix on a stem whence a leaf has fallen. -- Leaf sewer (Zoöl.), a tortricid moth, whose caterpillar makes a nest by rolling up a leaf and fastening the edges together with silk, as if sewn; esp., Phoxopteris nubeculana, which feeds upon the apple tree. -- Leaf sight, a hinges sight on a firearm, which can be raised or folded down. -- Leaf trace (Bot.), one or more fibrovascular bundles, which may be traced down an endogenous stem from the base of a leaf. -- Leaf tier (Zoöl.), a tortricid moth whose larva makes a nest by fastening the edges of a leaf together with silk; esp., Teras cinderella, found on the apple tree. -- Leaf valve, a valve which moves on a hinge. -- Leaf wasp (Zoöl.), a sawfiy. -- To turn over a new leaf, to make a radical change for the better in one's way of living or doing. [Colloq.] They were both determined to turn over a new leaf. Richardson.\n\nTo shoot out leaves; to produce leaves; to leave; as, the trees leaf in May. Sir T. Browne."}