{"word":"let","definition":"To retard; to hinder; to impede; to oppose. [Archaic] He was so strong that no man might him let. Chaucer. He who now letteth will let, until he be taken out of the way. 2. Thess. ii. 7. Mine ancient wound is hardly whole, And lets me from the saddle. Tennyson.\n\n1. A retarding; hindrance; obstacle; impediment; delay; -- common in the phrase without let or hindrance, but elsewhere archaic. Keats. Consider whether your doings be to the let of your salvation or not. Latimer. 2. (Lawn Tennis)  A stroke in which a ball touches the top of the net in passing over.\n\n1. To leave; to relinquish; to abandon. [Obs. or Archaic, except when followed by alone or be.] He . . . prayed him his voyage for to let Chaucer. Yet neither spins nor cards, ne cares nor frets, But to her mother Nature all her care she lets. Spenser. Let me alone in choosing of my wife. Chaucer. 2. To consider; to think; to esteem. [Obs.] Chaucer. 3. To cause; to make; -- used with the infinitive in the active form but in the passive sense; as, let make, i. e., cause to be made; let bring, i. e., cause to be brought. [Obs.] This irous, cursed wretch Let this knight's son anon before him fetch. Chaucer. He . . . thus let do slay hem all three. Chaucer. Anon he let two coffers make. Gower. 4. To permit; to allow; to suffer; -- either affirmatively, by positive act, or negatively, by neglecting to restrain or prevent. Note: In this sense, when followed by an infinitive, the latter is commonly without the sign to; as to let us walk, i. e., to permit or suffer us to walk. Sometimes there is entire omission of the verb; as, to let [to be or to go] loose. Pharaoh said, I will let you go Ex. viii. 28. If your name be Horatio, as I am let to know it is. Shak. 5. To allow to be used or occupied for a compensation; to lease; to rent; to hire out; -- often with out; as, to let a farm; to let a house; to let out horses. 6. To give, grant, or assign, as a work, privilege, or contract; -- often with out; as, to let the building of a bridge; to let out the lathing and the plastering. Note: The active form of the infinitive of let, as of many other English verbs, is often used in a passive sense; as, a house to let (i. e., for letting, or to be let). This form of expression conforms to the use of the Anglo-Saxon gerund with to (dative infinitive) which was commonly so employed. See Gerund, 2. \" Your elegant house in Harley Street is to let.\" Thackeray. In the imperative mood, before the first person plural, let has a hortative force. \" Rise up, let us go.\" Mark xiv. 42. \" Let us seek out some desolate shade.\" Shak. To let alone, to leave; to withdraw from; to refrain from interfering with. -- To let blood, to cause blood to flow; to bleed. -- To let down. (a) To lower. (b) To soften in tempering; as to let down tools, cutlery, and the like. -- To let drive or fly, to discharge with violence, as a blow, an arrow, or stone. See under Drive, and Fly. -- To let in or into. (a) To permit or suffer to enter; to admit. (b) To insert, or imbed, as a piece of wood, in a recess formed in a surface for the purpose. To let loose, to remove restraint from; to permit to wander at large. -- To let off (a) To discharge; to let fly, as an arrow; to fire the charge of, as a gun. (b) To release, as from an engagement or obligation. [Colloq.] To let out. (a) To allow to go forth; as, to let out a prisoner. (b) To extend or loosen, as the folds of a garment; to enlarge; to suffer to run out, as a cord. (c) To lease; to give out for performance by contract, as a job. (d) To divulge. -- To let slide, to let go; to cease to care for. [Colloq.] \" Let the world slide.\" Shak.\n\n1. To forbear. [Obs.] Bacon. 2. To be let or leased; as, the farm lets for $500 a year. See note under Left, v. i. To let on, to tell; to tattle; to divulge something. [Low] -- To let up, to become less severe; to diminish; to cease; as, when the storm lets up. [Colloq.]"}