{"word":"level","definition":"1. A line or surface to which, at every point, a vertical or plumb line is perpendicular; a line or surface which is everywhere parallel to the surface of still water; -- this is the true level, and is a curve or surface in which all points are equally distant from the center of the earth, or rather would be so if the earth were an exact sphere. 2. A horizontal line or plane; that is, a straight line or a plane which is tangent to a true level at a given point and hence parallel to the horizon at that point; -- this is the apparent level at the given point. 3. An approximately horizontal line or surface at a certain degree of altitude, or distance from the center of the earth; as, to climb from the level of the coast to the l of the plateau and then descent to the level of the valley or of the sea. After draining of the level in Northamptonshire. Sir M. Hale. Shot from the deadly level of a gun. Shak. 4. Hence, figuratively, a certain position, rank, standard, degree, quality, character, etc., conceived of as in one of several planes of different elevation. Providence, for the most part, sets us on a level. Addison. Somebody there of his own level. Swift. Be the fair level of thy actions laid As temperance wills and prudence may persuade. Prior. 5. A uniform or average height; a normal plane or altitude; a condition conformable to natural law or which will secure a level surface; as, moving fluids seek a level. When merit shall find its level. F. W. Robertson. 6. (Mech. & Surv.) (a) An instrument by which to find a horizontal line, or adjust something with reference to a horizontal line. (b) A measurement of the difference of altitude of two points, by means of a level; as, to take a level. 7. A horizontal passage, drift, or adit, in mine. Air level, a spirit level. See Spirit level (below). -- Box level, a spirit level in which a glass-covered box is used instead of a tube. -- Garpenter's level, Mason's level, either the plumb level or a straight bar of wood, in which is imbedded a small spirit level. -- Level of the sea, the imaginary level from which heights and depths are calculated, taken at a mean distance between high and low water. -- Line of levels, a connected series of measurements, by means of a level, along a given line, as of a railroad, to ascertain the profile of the ground. -- Plumb level, one in which a horizontal bar is placed in true position by means of a plumb line, to which it is at right angles. -- Spirit level, one in which the adjustment to the horizon is shown by the position of a bubble in alcohol or ether contained in a nearly horizontal glass tube, or a circular box with a glass cover. -- Surveyor's level, a telescope, with a spirit level attached, and with suitable screws, etc., for accurate adjustment, the whole mounted on a tripod, for use in leveling; -- called also leveling instrument. -- Water level, an instrument to show the level by means the surface of water in a trough, or in upright tubes connected by a pipe.\n\n1. Even; flat; having no part higher than another; having, or conforming to, the curvature which belongs to the undisturbed liquid parts of the earth's surface; as, a level field; level ground; the level surface of a pond or lake. Ample spaces o'er the smooth And level pavement. Milton. 2. Coinciding or parallel with the plane of the horizon; horizontal; as, the telescope is now level. 3. Even with anything else; of the same height; on the same line or plane; on the same footing; of equal importance; -- followed by with, sometimes by to. Young boys and girls Are level now with men; the odds is gone. Shak. Everything lies level to our wish. Shak. 4. Straightforward; direct; direct; clear; open. A very plain and level account. M. Arnold. 5. Well balanced; even; just; steady; impartial; as, a level head; a level understanding. [Colloq.] \" A level consideration.\" Shak. 6. (Phonetics)  Of even tone; without rising or falling inflection. H. Sweet. Level line (Shipbuilding), the outline of a section which is horizontal crosswise, and parallel with the rabbet of the keel lengthwise. Level surface (Physics), an equipotential surface at right angles at every point to the lines of force.\n\n1. To make level; to make horizontal; to bring to the condition of a level line or surface; hence, to make flat or even; as, to level a road, a walk, or a garden. 2. To bring to a lower level; to overthrow; to topple down; to reduce to a flat surface; to lower. And their proud structures level with the ground. Sandys. He levels mountains and he raises plains. Dryden. 3. To bring to a horizontal position, as a gun; hence, to point in taking aim; to aim; to direct. Bertram de Gordon, standing on the castle wall, leveled a quarrel out of a crossbow. Stow. 4. Figuratively, to bring to a common level or plane, in respect of rank, condition, character, privilege, etc.; as, to level all the ranks and conditions of men. 5. To adjust or adapt to a certain level; as, to level remarks to the capacity of children. For all his mind on honor fixed is, To which he levels all his purposes. Spenser.\n\n1. To be level; to be on a level with, or on an equality with, something; hence, to accord; to agree; to suit. [Obs.] With such accommodation and besort As levels with her breeding. Shak. 2. To aim a gun, spear, etc., horizontally; hence, to aim or point a weapon in direct line with the mark; fig., to direct the eye, mind, or effort, directly to an object. The foeman may with as great aim level at the edge of a penknife. Shak. The glory of God and the good of his church . . . ought to be the mark whereat we also level. Hooker. She leveled at our purposes. Shak."}