{"word":"liberal","definition":"1. Free by birth; hence, befitting a freeman or gentleman; refined; noble; independent; free; not servile or mean; as, a liberal ancestry; a liberal spirit; liberal arts or studies. \" Liberal education.\" Macaulay. \" A liberal tongue.\" Shak. 2. Bestowing in a large and noble way, as a freeman; generous; bounteous; open-handed; as, a liberal giver. \" Liberal of praise.\" Bacon. Infinitely good, and of his good As liberal and free as infinite. Milton. 3. Bestowed in a large way; hence, more than sufficient; abundant; bountiful; ample; profuse; as, a liberal gift; a liberal discharge of matter or of water. His wealth doth warrant a liberal dower. Shak. 4. Not strict or rigorous; not confined or restricted to the literal sense; free; as, a liberal translation of a classic, or a liberal construction of law or of language. 5. Not narrow or contracted in mind; not selfish; enlarged in spirit; catholic. 6. Free to excess; regardless of law or moral restraint; licentious. \" Most like a liberal villain.\" Shak. 7. Not bound by orthodox tenets or established forms in political or religious philosophy; independent in opinion; not conservative; friendly to great freedom in the constitution or administration of government; having tendency toward democratic or republican, as distinguished from monarchical or aristocratic, forms; as, liberal thinkers; liberal Christians; the Liberal party. I confess I see nothing liberal in this \" order of thoughts,\" as Hobbes elsewhere expresses it. Hazlitt. Note: Liberal has of, sometimes with, before the thing bestowed, in before a word signifying action, and to before a person or object on which anything is bestowed; as, to be liberal of praise or censure; liberal with money; liberal in giving; liberal to the poor. The liberal arts. See under Art. -- Liberal education, education that enlarges and disciplines the mind and makes it master of its own powers, irrespective of the particular business or profession one may follow. Syn. -- Generous; bountiful; munificent; beneficent; ample; large; profuse; free. -- Liberal, Generous. Liberal is freeborn, and generous is highborn. The former is opposed to the ordinary feelings of a servile state, and implies largeness of spirit in giving, judging, acting, etc. The latter expresses that nobleness of soul which is peculiarly appropriate to those of high rank, -- a spirit that goes out of self, and finds its enjoyment in consulting the feelings and happiness of others. Generosity is measured by the extent of the sacrifices it makes; liberality, by the warmth of feeling which it manifests.\n\nOne who favors greater freedom in political or religious matters; an opponent of the established systems; a reformer; in English politics, a member of the Liberal party, so called. Cf. Whig."}