{"word":"liberty","definition":"1. The state of a free person; exemption from subjection to the will of another claiming ownership of the person or services; freedom; -- opposed to slavery, serfdom, bondage, or subjection. But ye . . . caused every man his servant, and every man his handmaid whom he had set at liberty at their pleasure, to return, and brought them into subjection. Jer. xxxiv. 16. Delivered fro the bondage of corruption into the glorious liberty of the sons of God. Bible, 1551. Rom. viii. 21. 2. Freedom from imprisonment, bonds, or other restraint upon locomotion. Being pent from liberty, as I am now. Shak. 3. A privilege conferred by a superior power; permission granted; leave; as, liberty given to a child to play, or to a witness to leave a court, and the like. 4. Privilege; exemption; franchise; immunity enjoyed by prescription or by grant; as, the liberties of the commercial cities of Europe. His majesty gave not an entire county to any; much less did he grant . . . any extraordinary liberties. Sir J. Davies. 5. The place within which certain immunities are enjoyed, or jurisdiction is exercised. [Eng.] Brought forth into some public or open place within the liberty of the city, and there . . . burned. Fuller. 6. A certain amount of freedom; permission to go freely within certain limits; also, the place or limits within which such freedom is exercised; as, the liberties of a prison. 7. A privilege or license in violation of the laws of etiquette or propriety; as, to permit, or take, a liberty. He was repeatedly provoked into striking those who had taken liberties with him. Macaulay. 8. The power of choice; freedom from necessity; freedom from compulsion or constraint in willing. The idea of liberty is the idea of a power in any agent to do or forbear any particular action, according to the determination or thought of the mind, whereby either of them is preferred to the other. Locke. This liberty of judgment did not of necessity lead to lawlessness. J. A. Symonds. 9. (Manege)  A curve or arch in a bit to afford room for the tongue of the horse. 10. (Naut.)  Leave of absence; permission to go on shore. At liberty. (a) Unconfined; free. (b) At leisure. -- Civil liberty, exemption from arbitrary interference with person, opinion, or property, on the part of the government under which one lives, and freedom to take part in modifying that government or its laws. -- Liberty bell. See under Bell. -- Liberty cap. (a) The Roman pileus which was given to a slave at his manumission. (b) A limp, close-fitting cap with which the head of representations of the goddess of liberty is often decked. It is sometimes represented on a spear or a liberty pole. -- Liberty of the press, freedom to print and publish without official supervision. Liberty party, the party, in the American Revolution, which favored independence of England; in more recent usage, a party which favored the emancipation of the slaves. -- Liberty pole, a tall flagstaff planted in the ground, often surmounted by a liberty cap. [U. S.] -- Moral liberty, that liberty of choice which is essential to moral responsibility. -- Religious liberty, freedom of religious opinion and worship. Syn. -- Leave; permission; license. -- Liberty, Freedom. These words, though often interchanged, are distinct in some of of their applications. Liberty has reference to previous restraint; freedom, to the simple, unrepressed exercise of our powers. A slave is set at liberty; his master had always been in a state of freedom. A prisoner under trial may ask liberty (exemption from restraint) to speak his sentiments with freedom (the spontaneous and bold utterance of his feelings), The liberty of the press is our great security for freedom of thought."}