{"word":"lie","definition":"See Lye.\n\n1. A falsehood uttered or acted for the purpose of deception; an intentional violation of truth; an untruth spoken with the intention to deceive. It is willful deceit that makes a lie. A man may act a lie, as by pointing his finger in a wrong direction when a traveler inquires of him his road. Paley. 2. A fiction; a fable; an untruth. Dryden. 3. Anything which misleads or disappoints. Wishing this lie of life was o'er. Trench. To give the lie to. (a) To charge with falsehood; as, the man gave him the lie. (b) To reveal to be false; as, a man's actions may give the lie to his words. -- White lie, a euphemism for such lies as one finds it convenient to tell, and excuses himself for telling. Syn. -- Untruth; falsehood; fiction; deception. -- lie, Untruth. A man may state what is untrue from ignorance or misconception; hence, to impute an untruth to one is not necessarily the same as charging him with a lie. Every lie is an untruth, but not every untruth is a lie. Cf. Falsity.\n\nTo utter falsehood with an intention to deceive; to say or do that which is intended to deceive another, when he a right to know the truth, or when morality requires a just representation.\n\n1. To rest extended on the ground, a bed, or any support; to be, or to put one's self, in an horizontal position, or nearly so; to be prostate; to be stretched out; -- often with down, when predicated of living creatures; as, the book lies on the table; the snow lies on the roof; he lies in his coffin. The watchful traveler . . . Lay down again, and closed his weary eyes. Dryden. 2. To be situated; to occupy a certain place; as, Ireland lies west of England; the meadows lie along the river; the ship lay in port. 3. To abide; to remain for a longer or shorter time; to be in a certain state or condition; as, to lie waste; to lie fallow; to lie open; to lie hid; to lie grieving; to lie under one's displeasure; to lie at the mercy of the waves; the paper does not lie smooth on the wall. 4. To be or exist; to belong or pertain; to have an abiding place; to consist; -- with in. Envy lies between beings equal in nature, though unequal in circumstances. Collier. He that thinks that diversion may not lie in hard labor, forgets the early rising and hard riding of huntsmen. Locke. 5. To lodge; to sleep. Whiles I was now trifling at home, I saw London, . . . where I lay one night only. Evelyn. Mr. Quinion lay at our house that night. Dickens. 6. To be still or quiet, like one lying down to rest. The wind is loud and will not lie. Shak. 7. (Law)  To be sustainable; to be capable of being maintained. \"An appeal lies in this case.\" Parsons. Note: Through ignorance or carelessness speakers and writers often confuse the forms of the two distinct verbs lay and lie. Lay is a transitive verb, and has for its preterit laid; as, he told me to lay it down, and I laid it down. Lie is intransitive, and has for its preterit lay; as, he told me to lie down, and I lay down. Some persons blunder by using laid for the preterit of lie; as, he told me to lie down, and I laid down. So persons often say incorrectly, the ship laid at anchor; they laid by during the storm; the book was laying on the shelf, etc. It is only necessary to remember, in all such cases, that laid is the preterit of lay, and not of lie. To lie along the shore (Naut.), to coast, keeping land in sight. -- To lie at the door of, to be imputable to; as, the sin, blame, etc., lies at your door. -- To lie at the heart, to be an object of affection, desire, or anxiety. Sir W. Temple. -- To lie at the mercy of, to be in the power of. -- To lie by. (a) To remain with; to be at hand; as, he has the manuscript lying by him. (b) To rest; to intermit labor; as, we lay by during the heat of the day. -- To lie hard or heavy, to press or weigh; to bear hard. -- To lie in, to be in childbed; to bring forth young. -- To lie in one, to be in the power of; to belong to. \"As much as lieth in you, live peaceably with all men.\" Rom. xii. 18. -- To lie in the way, to be an obstacle or impediment. -- To lie in wait , to wait in concealment; to lie in ambush. -- To lie on or upon. (a) To depend on; as, his life lies on the result. (b) To bear, rest, press, or weigh on. -- To lie low, to remain in concealment or inactive. [Slang] -- To lie on hand, To lie on one's hands, to remain unsold or unused; as, the goods are still lying on his hands; they have too much time lying on their hands. -- To lie on the head of, to be imputed to. What he gets more of her than sharp words, let it lie on my head. Shak. -- To lie over. (a) To remain unpaid after the time when payment is due, as a note in bank. (b) To be deferred to some future occasion, as a resolution in a public deliberative body. -- To lie to (Naut.), to stop or delay; especially, to head as near the wind as possible as being the position of greatest safety in a gale; -- said of a ship. Cf. To bring to, under Bring. -- To lie under, to be subject to; to suffer; to be oppressed by. -- To lie with. (a) To lodge or sleep with. (b) To have sexual intercourse with. (c) To belong to; as, it lies with you to make amends.\n\nThe position or way in which anything lies; the lay, as of land or country. J. H. Newman. He surveyed with his own eyes . . . the lie of the country on the side towards Thrace. Jowett (Thucyd.)."}