{"word":"life","definition":"1. The state of being which begins with generation, birth, or germination, and ends with death; also, the time during which this state continues; that state of an animal or plant in which all or any of its organs are capable of performing all or any of their functions; -- used of all animal and vegetable organisms. 2. Of human being: The union of the soul and body; also, the duration of their union; sometimes, the deathless quality or existence of the soul; as, man is a creature having an immortal life. She shows a body rather than a life. Shak. 3. (Philos)  The potential principle, or force, by which the organs of animals and plants are started and continued in the performance of their several and coöperative functions; the vital force, whether regarded as physical or spiritual. 4. Figuratively: The potential or animating principle, also, the period of duration, of anything that is conceived of as resembling a natural organism in structure or functions; as, the life of a state, a machine, or a book; authority is the life of government. 5. A certain way or manner of living with respect to conditions, circumstances, character, conduct, occupation, etc.; hence, human affairs; also, lives, considered collectively, as a distinct class or type; as, low life; a good or evil life; the life of Indians, or of miners. That which before us lies in daily life. Milton. By experience of life abroad in the world. Ascham. Lives of great men all remind us We can make our lives sublime. Longfellow. 'T is from high life high characters are drawn. Pope 6. Animation; spirit; vivacity; vigor; energy. No notion of life and fire in fancy and in words. Felton. That gives thy gestures grace and life. Wordsworth. 7. That which imparts or excites spirit or vigor; that upon which enjoyment or success depends; as, he was the life of the company, or of the enterprise. 8. The living or actual form, person, thing, or state; as, a picture or a description from, the life. 9. A person; a living being, usually a human being; as, many lives were sacrificed. 10. The system of animal nature; animals in general, or considered collectively. Full nature swarms with life. Thomson. 11. An essential constituent of life, esp: the blood. The words that I speak unto you . . . they are life. John vi. 63. The warm life came issuing through the wound. Pope 12. A history of the acts and events of a life; a biography; as, Johnson wrote the life of Milton. 13. Enjoyment in the right use of the powers; especially, a spiritual existence; happiness in the favor of God; heavenly felicity. 14. Something dear to one as one's existence; a darling; -- used as a term of endearment. Note: Life forms the first part of many compounds, for the most part of obvious meaning; as, life-giving, life-sustaining, etc. Life annuity, an annuity payable during one's life. -- Life arrow, Life rocket, Life shot, an arrow, rocket, or shot, for carrying an attached line to a vessel in distress in order to save life. -- Life assurance. See Life insurance, below. -- Life buoy. See Buoy. -- Life car, a water-tight boat or box, traveling on a line from a wrecked vessel to the shore. In it person are hauled through the waves and surf. -- Life drop, a drop of vital blood. Byron. -- Life estate (Law), an estate which is held during the term of some certain person's life, but does not pass by inheritance. -- Life everlasting (Bot.), a plant with white or yellow persistent scales about the heads of the flowers, as Antennaria, and Gnaphalium; cudweed. -- Life of an execution (Law), the period when an execution is in force, or before it expires. -- Life guard. (Mil.) See under Guard. -- Life insurance, the act or system of insuring against death; a contract by which the insurer undertakes, in consideration of the payment of a premium (usually at stated periods), to pay a stipulated sum in the event of the death of the insured or of a third person in whose life the insured has an interest. -- Life interest, an estate or interest which lasts during one's life, or the life of another person, but does not pass by inheritance. -- Life land (Law), land held by lease for the term of a life or lives. -- Life line. (a) (Naut.) A line along any part of a vessel for the security of sailors. (b) A line attached to a life boat, or to any life saving apparatus, to be grasped by a person in the water. -- Life rate, rate of premium for insuring a life. -- Life rent, the rent of a life estate; rent or property to which one is entitled during one's life. -- Life school, a school for artists in which they model, paint, or draw from living models. -- Lifetable, a table showing the probability of life at different ages. -- To lose one's life, to die. -- To seek the life of, to seek to kill. -- To the life, so as closely to resemble the living person or the subject; as, the portrait was drawn to the life."}