{"word":"lift","definition":"The sky; the atmosphere; the firmament. [Obs. or Scot.]\n\n1. To move in a direction opposite to that of gravitation; to raise; to elevate; to bring up from a lower place to a higher; to upheave; sometimes implying a continued support or holding in the higher place; -- said of material things; as, to lift the foot or the hand; to lift a chair or a burden. 2. To raise, elevate, exalt, improve, in rank, condition, estimation, character, etc.; -- often with up. The Roman virtues lift up mortal man. Addison. Lest, being lifted up with pride. I Tim. iii. 6. 3. To bear; to support. [Obs.] Spenser. 4. To collect, as moneys due; to raise. 5. Etym: [Perh. a different word, and akin to Goth. hliftus thief, hlifan to steal, L. clepere, Gr. Shoplifter.]  To steal; to carry off by theft (esp. cattle); as, to lift a drove of cattle. Note: In old writers, lift is sometimes used for lifted. He ne'er lift up his hand but conquered. Shak. To lift up, to raise or elevate; in the Scriptures, specifically, to elevate upon the cross. John viii. 28. -- To lift up the eyes. To look up; to raise the eyes, as in prayer. Ps. cxxi. 1. -- To lift up the feet, to come speedily to one's relief. Ps. lxxiv. 3. -- To lift up the hand. (a) To take an oath. Gen. xiv. 22. (b) To pray. Ps. xxviii. 2. (c) To engage in duty. Heb. xii. 12. -- To lift up the hand against, to rebel against; to assault; to attack; to injure; to oppress. Job xxxi. 21. -- To lift up one's head, to cause one to be exalted or to rejoice. Gen. xl. 13. Luke xxi. 28. -- To lift up the heel against, to treat with insolence or unkindness. John xiii.18. -- To lift up the voice, to cry aloud; to call out. Gen. xxi. 16.\n\n1. To try to raise something; to exert the strength for raising or bearing. Strained by lifting at a weight too heavy. Locke. 2. To rise; to become or appear raised or elevated; as, the fog lifts; the land lifts to a ship approaching it. 3. Etym: [See Lift, v. t., 5.]  To live by theft. Spenser.\n\n1. Act of lifting; also, that which is lifted. 2. The space or distance through which anything is lifted; as, a long lift. Bacon. 3. Help; assistance, as by lifting; as, to give one a lift in a wagon. [Colloq.] The goat gives the fox a lift. L'Estrange. 4. That by means of which a person or thing lifts or is lifted; as: (a) A hoisting machine; an elevator; a dumb waiter. (b) An exercising machine. 5. A rise; a degree of elevation; as, the lift of a lock in canals. 6. A lift gate. See Lift gate, below. [Prov. Eng.] 7. (Naut.)  A rope leading from the masthead to the extremity of a yard below; -- used for raising or supporting the end of the yard. 8. (Mach.)  One of the steps of a cone pulley. 9. (Shoemaking)  A layer of leather in the heel. 10. (Horology)  That portion of the vibration of a balance during which the impulse is given. Saunier. Dead lift. See under Dead. Swift. -- Lift bridge, a kind of drawbridge, the movable part of which is lifted, instead of being drawn aside. -- Lift gate, a gate that is opened by lifting. -- Lift hammer. See Tilt hammer. -- Lift lock, a canal lock. -- Lift pump, a lifting pump. -- Lift tenter (Windmills), a governor for regulating the speed by adjusting the sails, or for adjusting the action of grinding machinery according to the speed. -- Lift wall (Canal Lock), the cross wall at the head of the lock."}