{"word":"light","definition":"1. That agent, force, or action in nature by the operation of which upon the organs of sight, objects are rendered visible or luminous. Note: Light was regarded formerly as consisting of material particles, or corpuscules, sent off in all directions from luminous bodies, and traversing space, in right lines, with the known velocity of about 186,300 miles per second; but it is now generally understood to consist, not in any actual transmission of particles or substance, but in the propagation of vibrations or undulations in a subtile, elastic medium, or ether, assumed to pervade all space, and to be thus set in vibratory motion by the action of luminous bodies, as the atmosphere is by sonorous bodies. This view of the nature of light is known as the undulatory or wave theory; the other, advocated by Newton (but long since abandoned), as the corpuscular, emission, or Newtonian theory. A more recent theory makes light to consist in electrical oscillations, and is known as the electro-magnetic theory of light. 2. That which furnishes, or is a source of, light, as the sun, a star, a candle, a lighthouse, etc. Then he called for a light, and sprang in. Acts xvi. 29. And God made two great lights; the greater light to rule the day, and the lesser light to rule the night. Gen. i. 16. 3. The time during which the light of the sun is visible; day; especially, the dawn of day. The murderer, rising with the light, killeth the poor and needy. Job xxiv. 14. 4. The brightness of the eye or eyes. He seemed to find his way without his eyes; For out o'door he went without their helps, And, to the last, bended their light on me. Shak. 5. The medium through which light is admitted, as a window, or window pane; a skylight; in architecture, one of the compartments of a window made by a mullion or mullions. There were windows in three rows, and light was against light in three ranks. I Kings vii.4. 6. Life; existence. O, spring to light, auspicious Babe, be born ! Pope. 7. Open view; a visible state or condition; public observation; publicity. The duke yet would have dark deeds darkly answered; he would never bring them to light. Shak. 8. The power of perception by vision. My strength faileth me; as for the light of my eyes, it also is gone from me. Ps. xxxviii. 10. 9. That which illumines or makes clear to the mind; mental or spiritual illumination; enlightenment; knowledge; information. He shall never know That I had any light of this from thee. Shak. 10. Prosperity; happiness; joy; felicity. Then shall thy light break forth as the morning, and thy health shall spring forth speedily. Is. lviii. 8. 11. (Paint.)  The manner in which the light strikes upon a picture; that part of a picture which represents those objects upon which the light is supposed to fall; the more illuminated part of a landscape or other scene; -- opposed to shade. Cf. Chiaroscuro. 12. Appearance due to the particular facts and circumstances presented to view; point of view; as, to state things fairly and put them in the right light. Frequent consideration of a thing . . . shows it in its several lights and various ways of appearance. South. 13. One who is conspicuous or noteworthy; a model or example; as, the lights of the age or of antiquity. Joan of Are, A light of ancient France. Tennyson. 14. (Pyrotech.)  A firework made by filling a case with a substance which burns brilliantly with a white or colored flame; as, a Bengal light. Note: Light is used figuratively to denote that which resembles physical light in any respect, as illuminating, benefiting, enlightening, or enlivening mankind. Ancient lights (Law), Calcium light, Flash light, etc. See under Ancient, Calcium, etc. -- Light ball (Mil.), a ball of combustible materials, used to afford light; -- sometimes made so as to fired from a cannon or mortar, or to be carried up by a rocket. -- Light barrel (Mil.), an empty power barrel pierced with holes and filled with shavings soaked in pitch, used to light up a ditch or a breach. --Light dues (Com.), tolls levied on ships navigating certain waters, for the maintenance of lighthouses. -- Light iron, a candlestick. [Obs.] -- Light keeper, a person appointed to take care of a lighthouse or light-ship. -- Light money, charges laid by government on shipping entering a port, for the maintenance of lighthouses and light-ships. -- The light of the countenance, favor; kindness; smiles. Lord, lift thou up the light of thy countenance upon us. Ps. iv. 6. -- Northern lights. See Aurora borealis, under Aurora. -- To bring to light, to cause to be disclosed. -- To come to light, to be disclosed. -- To see the light, to come into the light; hence, to come into the world or public notice; as, his book never saw the light. -- To stand in one's own light, to take a position which is injurious to one's own interest.\n\n1. Having light; not dark or obscure; bright; clear; as, the apartment is light. 2. White or whitish; not intense or very marked; not of a deep shade; moderately colored; as, a light color; a light brown; a light complexion.\n\n1. To set fire to; to cause to burn; to set burning; to ignite; to kindle; as, to light a candle or lamp; to light the gas; -- sometimes with up. If a thousand candles be all lighted from one. Hakewill. And the largest lamp is lit. Macaulay. Absence might cure it, or a second mistress Light up another flame, and put out this. Addison. 2. To give light to; to illuminate; to fill with light; to spread over with light; -- often with up. Ah, hopeless, lasting flames I like those that burn To light the dead. Pope. One hundred years ago, to have lit this theater as brilliantly as it is now lighted would have cost, I suppose, fifty pounds. F. Harrison. The sun has set, and Vesper, to supply His absent beams, has lighted up the sky. Dryden. 3. To attend or conduct with a light; to show the way to by means of a light. His bishops lead him forth, and light him on. Landor. To light a fire, to kindle the material of a fire.\n\n1. To become ignited; to take fire; as, the match will not light. 2. To be illuminated; to receive light; to brighten; -- with up; as, the room light up very well.\n\n1. Having little, or comparatively little, weight; not tending to be the center of gravity with force; not heavy. These weights did not exert their natural gravity . . . insomuch that I could not guess which was light or heavy whilst I held them in my hand. Addison. 2. Not burdensome; easy to be lifted, borne, or carried by physical strength; as, a light burden, or load. Ye shall find rest unto your souls. For my yoke is easy, and my burden is light. Matt. xi. 29. 30. 3. Easy to be endured or performed; not severe; not difficult; as, a light affliction or task. Chaucer. Light sufferings give us leisure to complain. Dryden. 4. Easy to be digested; not oppressive to the stomach; as, light food; also, containing little nutriment. 5. Not heavily armed; armed with light weapons; as, light troops; a troop of light horse. 6. Not encumbered; unembarrassed; clear of impediments; hence, active; nimble; swift. Unmarried men are best friends, best masters . . . but not always best subjects, for they are light to run away. Bacon. 7. Not heavily burdened; not deeply laden; not sufficiently ballasted; as, the ship returned light. 8. Slight; not important; as, a light error. Shak. 9. Well leavened; not heavy; as, light bread. 10. Not copious or heavy; not dense; not inconsiderable; as, a light rain; a light snow; light vapors. 11. Not strong or violent; moderate; as, a light wind. 12. Not pressing heavily or hard upon; hence, having an easy graceful manner; delicate; as, a light touch; a light style of execution. 13. Easy to admit influence; inconsiderate; easily influenced by trifling considerations; unsteady; unsettled; volatile; as, a light, vain person; a light mind. There is no greater argument of a light and inconsiderate person than profanely to scoff at religion. Tillotson. 14. Indulging in, or inclined to, levity; wanting dignity or solemnity; trifling; gay; frivolous; airy; unsubstantial. Seneca can not be too heavy, nor Plautus too light. Shak. Specimens of New England humor laboriously light and lamentably mirthful. Hawthorne. 15. Not quite sound or normal; somewhat impaired or deranged; dizzy; giddy. Are his wits safe Is he not light of brain Shak. 16. Easily bestowed; inconsiderately rendered. To a fair semblance doth light annex. Spenser. 17. Wanton; unchaste; as, a woman of light character. A light wife doth make a heavy husband. Shak. 18. Not of the legal, standard, or usual weight; clipped; diminished; as, light coin. 19. Loose; sandy; easily pulverized; as, a light soil. Light cavalry, Light horse (Mil.), light-armed soldiers mounted on strong and active horses. -- Light eater, one who eats but little. -- Light infantry, infantry soldiers selected and trained for rapid evolutions. -- Light of foot. (a) Having a light step. (b) Fleet. -- Light of heart, gay, cheerful. -- Light oil (Chem.), the oily product, lighter than water, forming the chief part of the first distillate of coal tar, and consisting largely of benzene and toluene. -- Light sails (Naut.), all the sails above the topsails, with, also, the studding sails and flying jib. Dana. -- Light sleeper, one easily wakened. -- Light weight, a prize fighter, boxer, wrestler, or jockey, who is below a standard medium weight. Cf. Feather weight, under Feather. [Cant] -- To make light of, to treat as of little consequence; to slight; to disregard. -- To set light by, to undervalue; to slight; to treat as of no importance; to despise.\n\nLightly; cheaply. Hooker.\n\nTo lighten; to ease of a burden; to take off. [Obs.] From his head the heavy burgonet did light. Spenser.\n\n1. To dismount; to descend, as from a horse or carriage; to alight; - - with from, off, on, upon, at, in. When she saw Isaac, she lighted off the camel. Gen. xxiv. 64. Slowly rode across a withered heath, And lighted at a ruined inn. Tennyson. 2. To feel light; to be made happy. [Obs.] It made all their hearts to light. Chaucer. 3. To descend from flight, and rest, perch, or settle, as a bird or insect. [The bee] lights on that, and this, and tasteth all. Sir. J. Davies. On the tree tops a crested peacock lit. Tennyson. 4. To come down suddenly and forcibly; to fall; -- with on or upon. On me, me only, as the source and spring Of all corruption, all the blame light due. Milton. 5. To come by chance; to happen; -- with on or upon; formerly with into. The several degrees of vision, which the assistance of glasses (casually at first lit on) has taught us to conceive. Locke. They shall light into atheistical company. South. And here we lit on Aunt Elizabeth, And Lilia with the rest. Tennyson."}