{"word":"line","definition":"1. Flax; linen. [Obs.] \"Garments made of line.\" Spenser. 2. The longer and fiber of flax.\n\n1. To cover the inner surface of; as, to line a cloak with silk or fur; to line a box with paper or tin. The inside lined with rich carnation silk. W. Browne. 2. To put something in the inside of; to fill; to supply, as a purse with money. The charge amounteth very high for any one man's purse, except lined beyond ordinary, to reach unto. Carew. Till coffee has her stomach lined. Swift. 3. To place persons or things along the side of for security or defense; to strengthen by adding; to fortify; as, to line works with soldiers. Line and new repair our towns of war With men of courage and with means defendant. Shak. 4. To impregnate; -- applied to brute animals. Creech. Lined gold, gold foil having a lining of another metal.\n\n1. linen thread or string; a slender, strong cord; also, a cord of any thickness; a rope; a hawser; as, a fishing line; a line for snaring birds; a clothesline; a towline. Who so layeth lines for to latch fowls. Piers Plowman. 2. A more or less threadlike mark of pen, pencil, or graver; any long mark; as, a chalk line. 3. The course followed by anything in motion; hence, a road or route; as, the arrow descended in a curved line; the place is remote from lines of travel. 4. Direction; as, the line sight or vision. 5. A row of letters, words, etc., written or printed; esp., a row of words extending across a page or column. 6. A short letter; a note; as, a line from a friend. 7. (Poet.)  A verse, or the words which form a certain number of feet, according to the measure. In the preceding line Ulysses speaks of Nausicaa. Broome. 8. Course of conduct, thought, occupation, or policy; method of argument; department of industry, trade, or intellectual activity. He is uncommonly powerful in his own line, but it is not the line of a first-rate man. Coleridge. 9. (Math.)  That which has length, but not breadth or thickness. 10. The exterior limit of a figure, plat, or territory; boundary; contour; outline. Eden stretched her line From Auran eastward to the royal towers Of great Seleucia. Milton. 11. A threadlike crease marking the face or the hand; hence, characteristic mark. Though on his brow were graven lines austere. Byron. He tipples palmistry, and dines On all her fortune-telling lines. Cleveland. 12. Lineament; feature; figure. \"The lines of my boy's face.\" Shak. 13. A straight row; a continued series or rank; as, a line of houses, or of soldiers; a line of barriers. Unite thy forces and attack their lines. Dryden. 14. A series or succession of ancestors or descand ants of a given person; a family or race; as, the ascending or descending line; the line of descent; the male line; a line of kings. Of his lineage am I, and his offspring By very line, as of the stock real. Chaucer. 15. A connected series of public conveyances, and hence, an established arrangement for forwarding merchandise, etc. ; as, a line of stages; an express line. 16. (Geog.) (a) A circle of latitude or of longitude, as represented on a map. (b) The equator; -- usually called the line, or equinoctial line; as, to cross the line. 17. A long tape, or a narrow ribbon of steel, etc., marked with subdivisions, as feet and inches, for measuring; a tapeline. 18. (Script.) (a) A measuring line or cord. He marketh it out with a line. Is. xliv. 13. (b) That which was measured by a line, as a field or any piece of land set apart; hence, allotted place of abode. The lines are fallen unto me in pleasant places; yes. I have a goodly heritage. Ps. xvi. 6. (c) Instruction; doctrine. Their line is gone out through all the earth. Ps. xix. 4. 19. (Mach.)  The proper relative position or adjustment of parts, not as to design or proportion, but with reference to smooth working; as, the engine is in line or out of line or out of line. 20. The track and roadbed of a railway; railroad. 21. (Mil.) (a) A row of men who are abreast of one another, whether side by side or some distance apart; -- opposed to column. (b) The regular infantry of an army, as distinguished from militia, guards, volunteer corps, cavalry, artillery, etc. 22. (Fort.) (a) A trench or rampart. (b) pl.  Dispositions made to cover extended positions, and presenting a front in but one direction to an enemy. 23. pl. (Shipbuilding)  form of a vessel as shown by the outlines of vertical, horizontal, and obique sections. 24. (Mus.)  One of the straight horizontal and parallel prolonged strokes on and between which the notes are placed. 25. (Stock Exchange)  A number of shares taken by a jobber. 26. (Trade)  A series of various qualities and values of the same general class of articles; as, a full line of hosiery; a line of merinos, etc. McElrath. 27. The wire connecting one telegraphic station with another, or the whole of a system of telegraph wires under one management and name. 28. pl.  The reins with which a horse is guided by his driver. [U. S.] 29. A measure of length; one twelfth of an inch. Hard lines, hard lot. C. Kingsley. [See Def. 18.] -- Line breeding (Stockbreeding), breeding by a certain family line of descent, especially in the selection of the dam or mother. -- Line conch (Zoöl.), a spiral marine shell (Fasciolaria distans), of Florida and the West Indies. It is marked by narrow, dark, revolving lines. -- Line engraving. (a) Engraving in which the effects are produced by lines of different width and closeness, cut with the burin upon copper or similar material; also, a plate so engraved. (b) A picture produced by printing from such an engraving. -- Line of battle. (a) (Mil Tactics) The position of troops drawn up in their usual order without any determined maneuver. (b) (Naval) The line or arrangement formed by vessels of war in an engagement. -- Line of battle ship. See Ship of the line, below. -- Line of beauty (Fine Arts),an abstract line supposed to be beautiful in itself and absolutely; -- differently represented by different authors, often as a kind of elongated S (like the one drawn by Hogarth). -- Line of centers. (Mach.) (a) A line joining two centers, or fulcra, as of wheels or levers. (b) A line which determines a dead center. See Dead center, under Dead. -- Line of dip (Geol.), a line in the plane of a stratum, or part of a stratum, perpendicular to its intersection with a horizontal plane; the line of greatest inclination of a stratum to the horizon. -- Line of fire (Mil.), the direction of fire. -- Line of force (Physics), any line in a space in which forces are acting, so drawn that at every point of the line its tangent is the direction of the resultant of all the forces. It cuts at right angles every equipotential surface which it meets. Specifically (Magnetism), a line in proximity to a magnet so drawn that any point in it is tangential with the direction of a short compass needle held at that point. Faraday. -- Line of life (Palmistry), a line on the inside of the hand, curving about the base of the thumb, supposed to indicate, by its form or position, the length of a person's life. -- Line of lines. See Gunter's line. -- Line of march. (Mil.) (a) Arrangement of troops for marching. (b) Course or direction taken by an army or body of troops in marching. -- Line of operations, that portion of a theater of war which an army passes over in attaining its object. H. W. Halleck. -- Line of sight (Firearms), the line which passes through the front and rear sight, at any elevation, when they are sighted at an object. -- Line tub (Naut.), a tub in which the line carried by a whaleboat is coiled. -- Mason and Dixon's line, the boundary line between Pennsylvania and Maryland, as run before the Revolution (1764-1767) by two English astronomers named Charles Mason and Jeremiah Dixon. In an extended sense, the line between the free and the slave States. -- On the line, on a level with the eye of the spectator; -- said of a picture, as hung in an exhibition of pictures. -- Right line a picture, as hung in an exhibition of pictures. -- Right line, a straight line; the shortest line that can be drawn between two points. -- Ship of the line, formerly, a ship of war large enough to have a place in the line of battle; a vessel superior to a frigate; usually, a seventy-four, or three-decker; -- called also line of battle ship. Totten. -- To cross the line, to cross the equator, as a vessel at sea. -- To give a person line, to allow him more or less liberty until it is convenient to stop or check him, like a hooked fish that swims away with the line. -- Water line (Shipbuilding), the outline of a horizontal section of a vessel, as when floating in the water.\n\n1. To mark with a line or lines; to cover with lines; as, to line a copy book. He had a healthy color in his cheeks, and his face, though lined, bore few traces of anxiety. Dickens. 2. To represent by lines; to delineate; to portray. [R.] \"Pictures fairest lined.\" Shak. 3. To read or repeat line by line; as, to line out a hymn. This custom of reading or lining, or, as it was frequently called \"deaconing' the hymn or psalm in the churches, was brought about partly from necessity. N. D. Gould. 4. To form into a line; to align; as, to line troops. To line bees, to track wild bees to their nest by following their line of flight. -- To line up (Mach.), to put in alignment; to put in correct adjustment for smooth running. See 3d Line, 19."}