{"word":"list","definition":"A line inclosing or forming the extremity of a piece of ground, or field of combat; hence, in the plural (lists), the ground or field inclosed for a race or combat. Chaucer. In measured lists to toss the weighty lance. Pope. To enter the lists, to accept a challenge, or engage in contest.\n\nTo inclose for combat; as, to list a field.\n\nTo hearken; to attend; to listen. [Obs. except in poetry.] Stand close, and list to him. Shak.\n\nTo listen or hearken to. Then weigh what loss your honor may sustain, If with too credent ear you list his songs. Shak.\n\n1. To desire or choose; to please. The wind bloweth where it listeth. John iii. 8. Them that add to the Word of God what them listeth. Hooker. Let other men think of your devices as they list. Whitgift. 2. (Naut.)  To lean; to incline; as, the ship lists to port.\n\n1. Inclination; desire. [Obs.] Chaucer. 2. (Naut.)  An inclination to one side; as, the ship has a list to starboard.\n\n1. A strip forming the woven border or selvedge of cloth, particularly of broadcloth, and serving to strengthen it; hence, a strip of cloth; a fillet. \" Gartered with a red and blue list. \" Shak. 2. A limit or boundary; a border. The very list, the very utmost bound, Of all our fortunes. Shak. 3. The lobe of the ear; the ear itself. [Obs.] Chaucer. 4. A stripe. [Obs.] Sir T. Browne. 5. A roll or catalogue, that is row or line; a record of names; as, a list of names, books, articles; a list of ratable estate. He was the ablest emperor of all the list. Bacon. 6. (Arch.)  A little square molding; a fillet; -- called also listel. 7. (Carp.)  A narrow strip of wood, esp. sapwood, cut from the edge of a plank or board. 8. (Rope Making)  A piece of woolen cloth with which the yarns are grasped by a workman. 9. (Tin-plate Manuf.) (a) The first thin coat of tin. (b) A wirelike rim of tin left on an edge of the plate after it is coated. Civil list (Great Britain & U.S.), the civil officers of government, as judges, ambassadors, secretaries, etc. Hence, the revenues or appropriations of public money for the support of the civil officers. More recently, the civil list, in England, embraces only the expenses of the reigning monarch's household. Free list. (a) A list of articles admitted to a country free of duty. (b) A list of persons admitted to any entertainment, as a theater or opera, without payment, or to whom a periodical, or the like, is furnished without cost. Syn. -- Roll; catalogue; register; inventory; schedule. -- List, Boll, Catalogue, Register, Inventory, Schedule. Alist is properly a simple series of names, etc., in a brief form, such as might naturally be entered in a narrow strip of paper. A roll was originally a list containing the names of persons belonging to a public body (as Parliament, etc.), which was rolled up and laid aside among its archives. A catalogue is a list of persons or things arranged in order, and usually containing some description of the same, more or less extended. A register is designed for record or preservation. An inventory is a list of articles, found on hand in a store of goods, or in the estate of a deceased person, or under similar circumstances. A schedule is a formal list or inventory prepared for legal or business purposes.\n\n1. To sew together, as strips of cloth, so as to make a show of colors, or form a border. Sir H. Wotton. 2. To cover with list, or with strips of cloth; to put list on; as, to list a door; to stripe as if with list. The tree that stood white-listed through the gloom. Tennyson. 3. To enroll; to place or register in a list. Listed among the upper serving men. Milton. 4. To engage, as a soldier; to enlist. I will list you for my soldier. Sir W. Scott. 5. (Carp.)  To cut away a narrow strip, as of sapwood, from the edge of; as, to list a board. To list a stock (Stock Exchange), to put it in the list of stocks called at the meeting of the board.\n\nTo engage in public service by enrolling one's name; to enlist."}