{"word":"livery","definition":"1. (Eng. Law) (a) The act of delivering possession of lands or tenements. (b) The writ by which possession is obtained. Note: It is usual to say, livery of seizin, which is a feudal investiture, made by the delivery of a turf, of a rod, or twig, from the feoffor to the feoffee. In the United States, and now in Great Britain, no such ceremony is necessary, the delivery of a deed being sufficient. 2. Release from wardship; deliverance. It concerned them first to sue out their livery from the unjust wardship of his encroaching prerogative. Milton. 3. That which is delivered out statedly or formally, as clothing, food, etc.; especially: (a) The uniform clothing issued by feudal superiors to their retainers and serving as a badge when in military service. (b) The peculiar dress by which the servants of a nobleman or gentleman are distinguished; as, a claret-colored livery. (c) Hence, also, the peculiar dress or garb appropriated by any association or body of persons to their own use; as, the livery of the London tradesmen, of a priest, of a charity school, etc.; also, the whole body or company of persons wearing such a garb, and entitled to the privileges of the association; as, the whole livery of London. A Haberdasher and a Carpenter, A Webbe, a Dyer, and a Tapicer, And they were clothed all in one livery Of a solempne and a gret fraternite. Chaucer. From the periodical deliveries of these characteristic articles of servile costume (blue coats) came our word livery. De Quincey. (d) Hence, any characteristic dress or outward appearance. \" April's livery.\" Sir P. Sidney. Now came still evening on, and twilight gray Had in her sober livery all things clad. Milton. (e) An allowance of food statedly given out; a ration, as to a family, to servants, to horses, etc. The emperor's officers every night went through the town from house to house whereat any English gentleman did repast or lodge, and served their liveries for all night: first, the officers brought into the house a cast of fine manchet [white bread], and of silver two great post, and white wine, and sugar. Cavendish. (f) The feeding, stabling, and care of horses for compensation; boarding; as, to keep one's horses at livery. What livery is, we by common use in England know well enough, namely, that is, allowance of horse meat, as to keep horses at livery, the which word, I guess, is derived of livering or delivering forth their nightly food. Spenser. It need hardly be observed that the explanation of livery which Spenser offers is perfectly correct, but . . . it is no longer applied to the ration or stated portion of food delivered at stated periods. Trench. (g) The keeping of horses in readiness to be hired temporarily for riding or driving; the state of being so kept. Pegasus does not stand at livery even at the largest establishment in Moorfields. Lowell. 4. A low grade of wool. Livery gown, the gown worn by a liveryman in London.\n\nTo clothe in, or as in, livery. Shak."}