{"word":"live","definition":"1. To be alive; to have life; to have, as an animal or a plant, the capacity of assimilating matter as food, and to be dependent on such assimilation for a continuance of existence; as, animals and plants that live to a great age are long in reaching maturity. Thus saith the Lord God unto these bones; Behold, I will . . . lay sinews upon you, and will bring up flesh upon you, and cover you with skin, and put breath in you, and ye shall live. Ezek. xxxvii. 5, 6. 2. To pass one's time; to pass life or time in a certain manner, as to habits, conduct, or circumstances; as, to live in ease or affluence; to live happily or usefully. O death, how bitter is the remembrance of thee to a man that liveth at rest in his possessions! Ecclus. xli. 1. 3. To make one's abiding place or home; to abide; to dwell; to reside. Jacob lived in the land of Egypt seventeen years. Gen. xlvii. 28. 4. To be or continue in existence; to exist; to remain; to be permanent; to last; -- said of inanimate objects, ideas, etc. Men's evil manners live in brass; their virtues We write in water. Shak. 5. To enjoy or make the most of life; to be in a state of happiness. What greater curse could envious fortune give Than just to die when I began to live Dryden. 6. To feed; to subsist; to be nourished or supported; -- with on; as, horses live on grass and grain. 7. To have a spiritual existence; to be quickened, nourished, and actuated by divine influence or faith. The just shall live by faith. Gal. iii. ll. 8. To be maintained in life; to acquire a livelihood; to subsist; -- with on or by; as, to live on spoils. Those who live by labor. Sir W. Temple. 9. To outlast danger; to float; -- said of a ship, boat, etc.; as, no ship could live in such a storm. A strong mast that lived upon the sea. Shak. To live out, to be at service; to live away from home as a servant. [U. S.] -- To live with. (a) To dwell or to be a lodger with. (b) To cohabit with; to have intercourse with, as male with female.\n\n1. To spend, as one's life; to pass; to maintain; to continue in, constantly or habitually; as, to live an idle or a useful life. 2. To act habitually in conformity with; to practice. To live the Gospel. Foxe. To live down, to live so as to subdue or refute; as, to live down slander.\n\n1. Having life; alive; living; not dead. If one man's ox hurt another's, that he die; then they shall sell the live ox, and divide the money of it. Ex. xxi. 35. 2. Being in a state of ignition; burning; having active properties; as, a live coal; live embers. \" The live ether.\" Thomson. 3. Full of earnestness; active; wide awake; glowing; as, a live man, or orator. 4. Vivid; bright. \" The live carnation.\" Thomson. 5. (Engin.)  Imparting power; having motion; as, the live spindle of a lathe. Live birth, the condition of being born in such a state that acts of life are manifested after the extrusion of the whole body. Dunglison. -- Live box, a cell for holding living objects under microscopical examination. P. H. Gosse. -- Live feathers, feathers which have been plucked from the living bird, and are therefore stronger and more elastic. -- Live gang. (Sawing) See under Gang. -- Live grass (Bot.), a grass of the genus Eragrostis. -- Live load (Engin.), a suddenly applied load; a varying load; a moving load; as a moving train of cars on a bridge, or wind pressure on a roof. Live oak (Bot.), a species of oak (Quercus virens), growing in the Southern States, of great durability, and highly esteemed for ship timber. In California the Q. chrysolepis and some other species are also called live oaks. -- Live ring (Engin.), a circular train of rollers upon which a swing bridge, or turntable, rests, and which travels around a circular track when the bridge or table turns. -- Live steam , steam direct from the boiler, used for any purpose, in distinction from exhaust steam. -- Live stock, horses, cattle, and other domestic animals kept on a farm. whole body.\n\nLife. [Obs.] Chaucer. On live, in life; alive. [Obs.] See Alive. Chaucer."}