{"word":"lock","definition":"A tuft of hair; a flock or small quantity of wool, hay, or other like substance; a tress or ringlet of hair. These gray locks, the pursuivants of death. Shak.\n\n1. Anything that fastens; specifically, a fastening, as for a door, a lid, a trunk, a drawer, and the like, in which a bolt is moved by a key so as to hold or to release the thing fastened. 2. A fastening together or interlacing; a closing of one thing upon another; a state of being fixed or immovable. Albemarle Street closed by a lock of carriages. De Quincey. 3. A place from which egress is prevented, as by a lock. Dryden. 4. The barrier or works which confine the water of a stream or canal. 5. An inclosure in a canal with gates at each end, used in raising or lowering boats as they pass from one level to another; -- called also lift lock. 6. That part or apparatus of a firearm by which the charge is exploded; as, a matchlock, flintlock, percussion lock, etc. 7. A device for keeping a wheel from turning. 8. A grapple in wrestling. Milton. Detector lock, a lock containing a contrivance for showing whether it as has been tampered with. -- Lock bay (Canals), the body of water in a lock chamber. -- Lock chamber, the inclosed space between the gates of a canal lock. -- Lock nut. See Check nut, under Check. -- Lock plate, a plate to which the mechanism of a gunlock is attached. -- Lock rail (Arch.), in ordinary paneled doors, the rail nearest the lock. Lock rand (Masonry), a range of bond stone. Knight. -- Mortise lock, a door lock inserted in a mortise. -- Rim lock, a lock fastened to the face of a door, thus differing from a mortise lock.\n\n1. To fasten with a lock, or as with a lock; to make fast; to prevent free movement of; as, to lock a door, a carriage wheel, a river, etc. 2. To prevent ingress or access to, or exit from, by fastening the lock or locks of; -- often with up; as, to lock or lock up, a house, jail, room, trunk. etc. 3. To fasten in or out, or to make secure by means of, or as with, locks; to confine, or to shut in or out -- often with up; as, to lock one's self in a room; to lock up the prisoners; to lock up one's silver; to lock intruders out of the house; to lock money into a vault; to lock a child in one's arms; to lock a secret in one's breast. 4. To link together; to clasp closely; as, to lock arms. \" Lock hand in hand.\" Shak. 5. (Canals)  To furnish with locks; also, to raise or lower (a boat) in a lock. 6. (Fencing)  To seize, as the sword arm of an antagonist, by turning the left arm around it, to disarm him.\n\nTo become fast, as by means of a lock or by interlacing; as, the door locks close. When it locked none might through it pass. Spenser. To lock into, to fit or slide into; as, they lock into each other. Boyle."}