{"word":"lodge","definition":"1. A shelter in which one may rest; as: (a) A shed; a rude cabin; a hut; as, an Indian's lodge. Chaucer. Their lodges and their tentis up they gan bigge [to build]. Robert of Brunne. O for a lodge in some vast wilderness! Cowper. (b) A small dwelling house, as for a gamekeeper or gatekeeper of an estate. Shak. (c) A den or cave. (d) The meeting room of an association; hence, the regularly constituted body of members which meets there; as, a masonic lodge. (c) The chamber of an abbot, prior, or head of a college. 2. (Mining)  The space at the mouth of a level next the shaft, widened to permit wagons to pass, or ore to be deposited for hoisting; -- called also platt. Raymond. 3. A collection of objects lodged together. The Maldives, a famous lodge of islands. De Foe. 4. A family of North American Indians, or the persons who usually occupy an Indian lodge, -- as a unit of enumeration, reckoned from four to six persons; as, the tribe consists of about two hundred lodges, that is, of about a thousand individuals. Lodge gate, a park gate, or entrance gate, near the lodge. See Lodge, n., 1 (b).\n\n1. To rest or remain a lodge house, or other shelter; to rest; to stay; to abide; esp., to sleep at night; as, to lodge in York Street. Chaucer. Stay and lodge by me this night. Shak. Something holy lodges in that breast. Milton . 2. To fall or lie down, as grass or grain, when overgrown or beaten down by the wind. Mortimer. 3. To come to a rest; to stop and remain; as, the bullet lodged in the bark of a tree.\n\n1. To give shelter or rest to; especially, to furnish a sleeping place for; to harbor; to shelter; hence, to receive; to hold. Every house was proud to lodge a knight. Dryden. The memory can lodge a greater stone of images that all the senses can present at one time. Cheyne. 2. To drive to shelter; to track to covert. The deer is lodged; I have tracked her to her covert. Addison. 3. To deposit for keeping or preservation; as, the men lodged their arms in the arsenal. 4. To cause to stop or rest in; to implant. He lodged an arrow in a tender breast. Addison. 5. To lay down; to prostrate. Though bladed corn be lodged, and trees blown down. Shak. To lodge an information, to enter a formal complaint."}