{"word":"long","definition":"1. Drawn out in a line, or in the direction of length; protracted; extended; as, a long line; -- opposed to short, and distinguished from broad or wide. 2. Drawn out or extended in time; continued through a considerable tine, or to a great length; as, a long series of events; a long debate; a long drama; a long history; a long book. 3. Slow in passing; causing weariness by length or duration; lingering; as, long hours of watching. 4. Occurring or coming after an extended interval; distant in time; far away. The we may us reserve both fresh and strong Against the tournament, which is not long. Spenser. 5. Extended to any specified measure; of a specified length; as, a span long; a yard long; a mile long, that is, extended to the measure of a mile, etc. 6. Far-reaching; extensive. \" Long views.\" Burke. 7. (Phonetics)  Prolonged, or relatively more prolonged, in utterance; -- said of vowels and syllables. See Short, a., 13, and Guide to Pronunciation, §§ 22, 30. Note: Long is used as a prefix in a large number of compound adjectives which are mostly of obvious meaning; as, long-armed, long- beaked, long-haired, long-horned, long-necked, long-sleeved, long- tailed, long- worded, etc. In the long run, in the whole course of things taken together; in the ultimate result; eventually. -- Long clam (Zoöl.), the common clam (Mya arenaria) of the Northern United States and Canada; -- called also soft-shell clam and long- neck clam. See Mya. -- Long cloth, a kind of cotton cloth of superior quality. -- Long clothes, clothes worn by a young infant, extending below the feet. -- Long division. (Math.) See Division. -- Long dozen, one more than a dozen; thirteen. -- Long home, the grave. -- Long measure, Long mater. See under Measure, Meter. -- Long Parliament (Eng. Hist.), the Parliament which assembled Nov. 3, 1640, and was dissolved by Cromwell, April 20, 1653. -- Long price, the full retail price. -- Long purple (Bot.), a plant with purple flowers, supposed to be the Orchis mascula. Dr. Prior. -- Long suit (Whist), a suit of which one holds originally more than three cards. R. A. Proctor. -- Long tom. (a) A pivot gun of great length and range, on the dock of a vessel. (b) A long trough for washing auriferous earth. [Western U.S.] (c) (Zoöl.) The long-tailed titmouse. -- Long wall (Coal Mining), a working in which the whole seam is removed and the roof allowed to fall in, as the work progresses, except where passages are needed. -- Of long, a long time. [Obs.] Fairfax. -- To be, or go, long of the market, To be on the long side of the market, etc. (Stock Exchange), to hold stock for a rise in price, or to have a contract under which one can demand stock on or before a certain day at a stipulated price; -- opposed to short in such phrases as, to be short of stock, to sell short, etc. [Cant] See Short. -- To have a long head, to have a farseeing or sagacious mind.\n\n1. (Mus.)  A note formerly used in music, one half the length of a large, twice that of a breve. 2. (Phonetics)  A long sound, syllable, or vowel. 3. The longest dimension; the greatest extent; -- in the phrase, the long and the short of it, that is, the sum and substance of it. Addison.\n\n1. To a great extent in apace; as, a long drawn out line. 2. To a great extent in time; during a long time. They that tarry long at the wine. Prov. xxiii. 30. When the trumpet soundeth long. Ex. xix. 13. 3. At a point of duration far distant, either prior or posterior; as, not long before; not long after; long before the foundation of Rome; long after the Conquest. 4. Through the whole extent or duration. The bird of dawning singeth all night long. Shak. 5. Through an extent of time, more or less; -- only in question; as, how long will you be gone\n\nBy means of; by the fault of; because of. [Obs.] See Along of, under 3d Along.\n\n1. To feel a strong or morbid desire or craving; to wish for something with eagerness; -- followed by an infinitive, or by after or for. I long to see you. Rom. i. 11. I have longed after thy precepts. Ps. cxix. 40. I have longed for thy salvation. Ps. cxix. 174. Nicomedes, longing for herrings, was supplied with fresh ones . . . at a great distance from the sea. Arbuthnot. 2. To belong; -- used with to, unto, or for. [Obs.] The labor which that longeth unto me. Chaucer."}