{"word":"look","definition":"1. To direct the eyes for the purpose of seeing something; to direct the eyes toward an object; to observe with the eyes while keeping them directed; -- with various prepositions, often in a special or figurative sense. See Phrases below. 2. To direct the attention (to something); to consider; to examine; as, to look at an action. 3. To seem; to appear; to have a particular appearance; as, the patient looks better; the clouds look rainy. It would look more like vanity than gratitude. Addison. Observe how such a practice looks in another person. I. Watts. 4. To have a particular direction or situation; to face; to front. The inner gate that looketh to north. Ezek. viii. 3. The east gate . . . which looketh eastward. Ezek. xi. 1. 5. In the imperative: see; behold; take notice; take care; observe; - - used to call attention. Look, how much we thus expel of sin, so much we expel of virtue. Milton. Note: Look, in the imperative, may be followed by a dependent sentence, but see is oftener so used. Look that ye bind them fast. Shak. Look if it be my daughter. Talfourd. 6. To show one's self in looking, as by leaning out of a window; as, look out of the window while I speak to you. Sometimes used figuratively. My toes look through the overleather. Shak. 7. To await the appearance of anything; to expect; to anticipate. Looking each hour into death's mouth to fall. Spenser. To look about, to look on all sides, or in different directions. -- To look about one, to be on the watch; to be vigilant; to be circumspect or guarded. -- To look after. (a) To attend to; to take care of; as, to look after children. (b) To expect; to be in a state of expectation. Men's hearts failing them for fear, and for looking after those things which are coming on the earth. Luke xxi. 26. (c) To seek; to search. My subject does not oblige me to look after the water, or point forth the place where to it is now retreated. Woodward. -- To look at, to direct the eyes toward so that one sees, or as if to see; as, to look at a star; hence, to observe, examine, consider; as, to look at a matter without prejudice. -- To look black, to frown; to scowl; to have a threatening appearance. The bishops thereat repined, and looked black. Holinshed. -- To look down on or upon, to treat with indifference or contempt; to regard as an inferior; to despise. -- To look for. (a) To expect; as, to look for news by the arrival of a ship. \"Look now for no enchanting voice.\" Milton. (b) To seek for; to search for; as, to look for lost money, or lost cattle. -- To look forth. (a) To look out of something, as from a window. (b) To threaten to come out. Jer. vi. 1. (Rev. Ver.). -- To look into, to inspect closely; to observe narrowly; to examine; as, to look into the works of nature; to look into one's conduct or affairs. -- To look on. (a) To regard; to esteem. Her friends would look on her the worse. Prior. (b) To consider; to view; to conceive of; to think of. I looked on Virgil as a succinct, majestic writer. Dryden. (c) To be a mere spectator. I'll be a candleholder, and look on. Shak. -- To look out, to be on the watch; to be careful; as, the seaman looks out for breakers. -- To look through. (a) To see through. (b) To search; to examine with the eyes. -- To look to or unto. (a) To watch; to take care of. \"Look well to thy herds.\" Prov. xxvii. 23. (b) To resort to with expectation of receiving something; to expect to receive from; as, the creditor may look to surety for payment. \"Look unto me, and be ye saved.\" Is. xlv. 22. -- To look up, to search for or find out by looking; as, to look up the items of an account. -- To look up to, to respect; to regard with deference.\n\n1. To look at; to turn the eyes toward. 2. To seek; to search for. [Obs.] Looking my love, I go from place to place. Spenser. 3. To expect. [Obs.] Shak. 4. To influence, overawe, or subdue by looks or presence as, to look down opposition. A spirit fit to start into an empire, And look the world to law. Dryden. 5. To express or manifest by a look. Soft eyes looked love to eyes which spake again. Byron. To look daggers. See under Dagger. -- To look in the face, to face or meet with boldness or confidence; hence, sometimes, to meet for combat. -- To look out, to seek for; as, prudent persons look out associates good reputation.\n\n1. The act of looking; a glance; a sight; a view; -- often in certain phrases; as, to have, get, take, throw, or cast, a look. Threw many a northward look to see his father Bring up his powers; but he did long in vain. Shak. 2. Expression of the eyes and face; manner; as, a proud or defiant look. \"Gentle looks.\" Shak. Up ! up! my friends, and clear your looks. Wordsworth. 3. Hence; Appearance; aspect; as, the house has a gloomy look; the affair has a bad look. Pain, disgrace, and poverty have frighted looks. Locke. There was something that reminded me of Dante's Hell in the look of this. Carlyle."}