{"word":"loose","definition":"1. Unbound; untied; unsewed; not attached, fastened, fixed, or confined; as, the loose sheets of a book. Her hair, nor loose, nor tied in formal plat. Shak. 2. Free from constraint or obligation; not bound by duty, habit, etc. ; -- with from or of. Now I stand Loose of my vow; but who knows Cato's thoughts Addison. 3. Not tight or close; as, a loose garment. 4. Not dense, close, compact, or crowded; as, a cloth of loose texture. With horse and chariots ranked in loose array. Milton. 5. Not precise or exact; vague; indeterminate; as, a loose style, or way of reasoning. The comparison employed . . . must be considered rather as a loose analogy than as an exact scientific explanation. Whewel. 6. Not strict in matters of morality; not rigid according to some standard of right. The loose morality which he had learned. Sir W. Scott. 7. Unconnected; rambling. Vario spends whole mornings in running over loose and unconnected pages. I. Watts. 8. Lax; not costive; having lax bowels. Locke. 9. Dissolute; unchaste; as, a loose man or woman. Loose ladies in delight. Spenser. 10. Containing or consisting of obscene or unchaste language; as, a loose epistle. Dryden. At loose ends, not in order; in confusion; carelessly managed. -- Fast and loose. See under Fast. -- To break loose. See under Break. -- Loose pulley. (Mach.) See Fast and loose pulleys, under Fast. -- To let loose, to free from restraint or confinement; to set at liberty.\n\n1. Freedom from restraint. [Obs.] Prior. 2. A letting go; discharge. B. Jonson. To give a loose, to give freedom. Vent all its griefs, and give a loose to sorrow. Addison.\n\n1. To untie or unbind; to free from any fastening; to remove the shackles or fastenings of; to set free; to relieve. Canst thou . . . loose the bands of Orion Job. xxxviii. 31. Ye shall find an ass tied, and a colt with her; loose them, and bring them unto me. Matt. xxi. 2. 2. To release from anything obligatory or burdensome; to disengage; hence, to absolve; to remit. Art thou loosed from a wife seek not a wife. 1 Cor. vii. 27. Whatsoever thou shalt loose on earth shall be loosed in heaven. Matt. xvi. 19. 3. To relax; to loosen; to make less strict. The joints of his loins were loosed. Dan. v. 6. 4. To solve; to interpret. [Obs.] Spenser.\n\nTo set sail. [Obs.] Acts xiii. 13."}