{"word":"lord","definition":"A hump-backed person; -- so called sportively. [Eng.] Richardson (Dict.).\n\n1. One who has power and authority; a master; a ruler; a governor; a prince; a proprietor, as of a manor. But now I was the lord Of this fair mansion. Shak. Man over men He made not lord. Milton. 2. A titled nobleman., whether a peer of the realm or not; a bishop, as a member of the House of Lords; by courtesy; the son of a duke or marquis, or the eldest son of an earl; in a restricted sense, a boron, as opposed to noblemen of higher rank. [Eng.] 3. A title bestowed on the persons above named; and also, for honor, on certain official persons; as, lord advocate, lord chamberlain, lord chancellor, lord chief justice, etc. [Eng.] 4. A husband. \"My lord being old also.\" Gen. xviii. 12. Thou worthy lord Of that unworthy wife that greeteth thee. Shak. 5. (Feudal Law)  One of whom a fee or estate is held; the male owner of feudal land; as, the lord of the soil; the lord of the manor. 6. The Supreme Being; Jehovah. Note: When Lord, in the Old Testament, is printed in small capitals, it is usually equivalent to Jehovah, and might, with more propriety, be so rendered. 7. The Savior; Jesus Christ. House of Lords, one of the constituent parts of the British Parliament, consisting of the lords spiritual and temporal. -- Lord high chancellor, Lord high constable, etc. See Chancellor, Constable, etc. -- Lord justice clerk, the second in rank of the two highest judges of the Supreme Court of Scotland. -- Lord justice general, or Lord president, the highest in rank of the judges of the Supreme Court of Scotland. -- Lord keeper, an ancient officer of the English crown, who had the custody of the king's great seal, with authority to affix it to public documents. The office is now merged in that of the chancellor. -- Lord lieutenant, a representative of British royalty: the lord lieutenant of Ireland being the representative of royalty there, and exercising supreme administrative authority; the lord lieutenant of a county being a deputy to manage its military concerns, and also to nominate to the chancellor the justices of the peace for that county. -- Lord of misrule, the master of the revels at Christmas in a nobleman's or other great house. Eng. Cyc. -- Lords spiritual, the archbishops and bishops who have seats in the House of Lords. -- Lords temporal, the peers of England; also, sixteen representative peers of Scotland, and twenty-eight representatives of the Irish peerage. -- Our lord, Jesus Christ; the Savior. -- The Lord's Day, Sunday; the Christian Sabbath, on which the Lord Jesus rose from the dead. -- The Lord's Prayer, the prayer which Jesus taught his disciples. Matt. vi. 9-13. -- The Lord's Supper. (a) The paschal supper partaken of by Jesus the night before his crucifixion. (b) The sacrament of the eucharist; the holy communion. -- The Lord's Table. (a) The altar or table from which the sacrament is dispensed. (b) The sacrament itself.\n\n1. To invest with the dignity, power, and privileges of a lord. [R.] Shak. 2. To rule or preside over as a lord. [R.]\n\nTo play the lord; to domineer; to rule with arbitrary or despotic sway; -- sometimes with over; and sometimes with it in the manner of a transitive verb. The whiles she lordeth in licentious bliss. Spenser. I see them lording it in London streets. Shak. And lorded over them whom now they serve. Milton."}