{"word":"low","definition":", strong imp. of Laugh. Chaucer.\n\nTo make the calling sound of cows and other bovine animals; to moo. The lowing herd wind slowly o'er the lea. Gray.\n\nThe calling sound ordinarily made by cows and other bovine animals. Talking voices and the law of herds. Wordsworth.\n\nA hill; a mound; a grave. [Obs. except in place names.] Skeat.\n\nFire; a flame; a light. [Scot. & Prov. Eng.]\n\nTo burn; to blaze. [Prov. Eng. & Scot.] Burns.\n\n1. Occupying an inferior position or place; not high or elevated; depressed in comparison with something else; as, low ground; a low flight. 2. Not rising to the usual height; as, a man of low stature; a low fence. 3. Near the horizon; as, the sun is low at four o'clock in winter, and six in summer. 4. Sunk to the farthest ebb of the tide; as, low tide. 5. Beneath the usual or remunerative rate or amount, or the ordinary value; moderate; cheap; as, the low price of corn; low wages. 6. Not loud; as, a low voice; a low sound. 7. (Mus.)  Depressed in the scale of sounds; grave; as, a low pitch; a low note. 8. (Phon.)  Made, as a vowel, with a low position of part of the tongue in relation to the palate; as, . See Guide to Pronunciation, §§ 5, 10, 11. 9. Near, or not very distant from, the equator; as, in the low northern latitudes. 10. Numerically small; as, a low number. 11. Wanting strength or animation; depressed; dejected; as, low spirits; low in spirits. 12. Depressed in condition; humble in rank; as, men of low condition; the lower classes. Why but to keep ye low and ignorant Milton. 13. Mean; vulgar; base; dishonorable; as, a person of low mind; a low trick or stratagem. 14. Not elevated or sublime; not exalted or diction; as, a low comparison. In comparison of these divine writers, the noblest wits of the heathen world are low and dull. Felton. 15. Submissive; humble. \"Low reverence.\" Milton. 16. Deficient in vital energy; feeble; weak; as, a low pulse; made low by sickness. 17. Moderate; not intense; not inflammatory; as, low heat; a low temperature; a low fever. 18. Smaller than is reasonable or probable; as, a low estimate. 19. Not rich, high seasoned, or nourishing; plain; simple; as, a low diet. Note: Low is often used in the formation of compounds which require no special explanation; as, low-arched, low- browed, low-crowned, low-heeled, low-lying, low-priced, low-roofed, low-toned, low-voiced, and the like. Low Church. See High Church, under High. -- Low Countries, the Netherlands. -- Low German, Low Latin, etc. See under German, Latin, etc. -- Low life, humble life. -- Low milling, a process of making flour from grain by a single grinding and by siftings. -- Low relief. See Bas-relief. -- Low side window (Arch.), a peculiar form of window common in mediæval churches, and of uncertain use. Windows of this sort are narrow, near the ground, and out of the line of the windows, and in many different situations in the building. -- Low spirits, despondency. -- Low steam, steam having a low pressure. -- Low steel, steel which contains only a small proportion of carbon, and can not be hardened greatly by sudden cooling. -- Low Sunday, the Sunday next after Easter; -- popularly so called. -- Low tide, the farthest ebb of the tide; the tide at its lowest point; low water. -- Low water. (a) The lowest point of the ebb tide; a low stage of the in a river, lake, etc. (b) (Steam Boiler) The condition of an insufficient quantity of water in the boiler. -- Low water alarm or indicator (Steam Boiler), a contrivance of various forms attached to a boiler for giving warning when the water is low. -- Low water mark, that part of the shore to which the waters recede when the tide is the lowest. Bouvier. -- Low wine, a liquor containing about 20 percent of alcohol, produced by the first distillation of wash; the first run of the still; -- often in the plural.\n\nThe lowest trump, usually the deuce; the lowest trump dealt or drawn.\n\n1. In a low position or manner; not aloft; not on high; near the ground. 2. Under the usual price; at a moderate price; cheaply; as, he sold his wheat low. 3. In a low mean condition; humbly; meanly. 4. In time approaching our own. In that part of the world which was first inhabited, even as low down as Abraham's time, they wandered with their flocks and herds. Locke. 5. With a low voice or sound; not loudly; gently; as, to speak low. Addison. The . . . odorous wind Breathes low between the sunset and the moon. Tennyson. 6. With a low musical pitch or tone. Can sing both high and low. Shak. 7. In subjection, poverty, or disgrace; as, to be brought low by oppression, by want, or by vice. Spenser. 8. (Astron.)  In a path near the equator, so that the declination is small, or near the horizon, so that the altitude is small; -- said of the heavenly bodies with reference to the diurnal revolution; as, the moon runs low, that is, is comparatively near the horizon when on or near the meridian.\n\nTo depress; to lower. [Obs.] Swift."}