{"word":"machine","definition":"1. In general, any combination of bodies so connected that their relative motions are constrained, and by means of which force and motion may be transmitted and modified, as a screw and its nut, or a lever arranged to turn about a fulcrum or a pulley about its pivot, etc.; especially, a construction, more or less complex, consisting of a combination of moving parts, or simple mechanical elements, as wheels, levers, cams, etc., with their supports and connecting framework, calculated to constitute a prime mover, or to receive force and motion from a prime mover or from another machine, and transmit, modify, and apply them to the production of some desired mechanical effect or work, as weaving by a loom, or the excitation of electricity by an electrical machine. Note: The term machine is most commonly applied to such pieces of mechanism as are used in the industrial arts, for mechanically shaping, dressing, and combining materials for various purposes, as in the manufacture of cloth, etc. Where the effect is chemical, or other than mechanical, the contrivance is usually denominated an apparatus, not a machine; as, a bleaching apparatus. Many large, powerful, or specially important pieces of mechanism are called engines; as, a steam engine, fire engine, graduating engine, etc. Although there is no well-settled distinction between the terms engine and machine among practical men, there is a tendency to restrict the application of the former to contrivances in which the operating part is not distinct from the motor. 2. Any mechanical contrivance, as the wooden horse with which the Greeks entered Troy; a coach; a bicycle. Dryden. Southey. Thackeray. 3. A person who acts mechanically or at will of another. 4. A combination of persons acting together for a common purpose, with the agencies which they use; as, the social machine. The whole machine of government ought not to bear upon the people with a weight so heavy and oppressive. Landor. 5. A political organization arranged and controlled by one or more leaders for selfish, private or partisan ends. [Political Cant] 6. Supernatural agency in a poem, or a superhuman being introduced to perform some exploit. Addison. Elementary machine, a name sometimes given to one of the simple mechanical powers. See under Mechanical. -- Infernal machine. See under Infernal. -- Machine gun.See under Gun. -- Machine screw, a screw or bolt adapted for screwing into metal, in distinction from one which is designed especially to be screwed into wood. -- Machine shop, a workshop where machines are made, or where metal is shaped by cutting, filing, turning, etc. -- Machine tool, a machine for cutting or shaping wood, metal, etc., by means of a tool; especially, a machine, as a lathe, planer, drilling machine, etc., designed for a more or less general use in a machine shop, in distinction from a machine for producing a special article as in manufacturing. -- Machine twist, silken thread especially adapted for use in a sewing machine. -- Machine work, work done by a machine, in contradistinction to that done by hand labor.\n\nTo subject to the action of machinery; to effect by aid of machinery; to print with a printing machine."}