{"word":"magnetical","definition":"1. Pertaining to the magnet; possessing the properties of the magnet, or corresponding properties; as, a magnetic bar of iron; a magnetic needle. 2. Of or pertaining to, or characterized by,, the earth's magnetism; as, the magnetic north; the magnetic meridian. 3. Capable of becoming a magnet; susceptible to magnetism; as, the magnetic metals. 4. Endowed with extraordinary personal power to excite the feelings and to win the affections; attractive; inducing attachment. She that had all magnetic force alone. Donne. 5. Having, susceptible to, or induced by, animal magnetism, so called; as, a magnetic sleep. See Magnetism. Magnetic amplitude, attraction, dip, induction, etc. See under Amplitude, Attraction, etc. -- Magnetic battery, a combination of bar or horseshoe magnets with the like poles adjacent, so as to act together with great power. -- Magnetic compensator, a contrivance connected with a ship's compass for compensating or neutralizing the effect of the iron of the ship upon the needle. -- Magnetic curves, curves indicating lines of magnetic force, as in the arrangement of iron filings between the poles of a powerful magnet. -- Magnetic elements. (a) (Chem. Physics) Those elements, as iron, nickel, cobalt, chromium, manganese, etc., which are capable or becoming magnetic. (b) (Physics) In respect to terrestrial magnetism, the declination, inclination, and intensity. (c) See under Element. -- Magnetic equator, the line around the equatorial parts of the earth at which there is no dip, the dipping needle being horizontal. -- Magnetic field, or Field of magnetic force, any space through which magnet exerts its influence. -- Magnetic fluid, the hypothetical fluid whose existence was formerly assumed in the explanations of the phenomena of magnetism. -- Magnetic iron, or Magnetic iron ore. (Min.) Same as Magnetite. -- Magnetic needle, a slender bar of steel, magnetized and suspended at its center on a sharp-pointed pivot, or by a delicate fiber, so that it may take freely the direction of the magnetic meridian. It constitutes the essential part of a compass, such as the mariner's and the surveyor's. -- Magnetic poles, the two points in the opposite polar regions of the earth at which the direction of the dipping needle is vertical. -- Magnetic pyrites. See Pyrrhotite. -- Magnetic storm (Terrestrial Physics), a disturbance of the earth's magnetic force characterized by great and sudden changes. -- Magnetic telegraph, a telegraph acting by means of a magnet. See Telegraph."}