{"word":"major","definition":"1. Greater in number, quantity, or extent; as, the major part of the assembly; the major part of the revenue; the major part of the territory. 2. Of greater dignity; more important. Shak. 3. Of full legal age. [Obs.] 4. (Mus.)  Greater by a semitone, either in interval or in difference of pitch from another tone. Major axis (Geom.), the greater axis. See Focus, n., 2. -- Major key (Mus.), a key in which one and two, two and three, four and five, five and six and seven, make major seconds, and three and four, and seven and eight, make minor seconds. -- Major offense (Law), an offense of a greater degree which contains a lesser offense, as murder and robbery include assault. -- Major premise (Logic), that premise of a syllogism which contains the major term. -- Major scale (Mus.), the natural diatonic scale, which has semitones between the third and fourth, and seventh and fourth, and seventh and eighth degrees; the scale of the major mode, of which the third is major. See Scale, and Diatonic. -- Major second (Mus.), a second between whose tones is a difference in pitch of a step. -- Major sixth (Mus.), a sixth of four steps and a half step. In major keys the third and sixth from the key tone are major. Major keys and intervals, as distinguished from minors, are more cheerful. -- Major term (Logic), that term of a syllogism which forms the predicate of the conclusion. -- Major third (Mus.), a third of two steps.\n\n1. (Mil.)  An officer next in rank above a captain and next below a lieutenant colonel; the lowest field officer. 2. (Law)  A person of full age. 3. (Logic)  That premise which contains the major term. It its the first proposition of a regular syllogism; as: No unholy person is qualified for happiness in heaven [the major]. Every man in his natural state is unholy [minor]. Therefore, no man in his natural state is qualified for happiness in heaven [conclusion or inference]. Note: In hypothetical syllogisms, the hypothetical premise is called the major. 4. Etym: [LL. See Major.]  A mayor. [Obs.] Bacon."}