{"word":"man","definition":"1. A human being; -- opposed tobeast. These men went about wide, and man found they none, But fair country, and wild beast many [a] one. R. of Glouc. The king is but a man, as I am; the violet smells to him as it doth to me. Shak. 2. Especially: An adult male person; a grown-up male person, as distinguished from a woman or a child. When I became a man, I put away childish things. I Cor. xiii. 11. Ceneus, a woman once, and once a man. Dryden. 3. The human race; mankind. And God said, Let us make man in our image, after our likeness, and let them have dominion. Gen. i. 26. The proper study of mankind is man. Pope. 4. The male portion of the human race. Woman has, in general, much stronger propensity than man to the discharge of parental duties. Cowper. 5. One possessing in a high degree the distinctive qualities of manhood; one having manly excellence of any kind. Shak. This was the noblest Roman of them all . . . the elements So mixed in him that Nature might stand up And say to all the world \"This was a man! Shak. 6. An adult male servant; also, a vassal; a subject. Like master, like man. Old Proverb. The vassal, or tenant, kneeling, ungirt, uncovered, and holding up his hands between those of his lord, professed that he did become his man from that day forth, of life, limb, and earthly honor. Blackstone. 7. A term of familiar address often implying on the part of the speaker some degree of authority, impatience, or haste; as, Come, man, we 've no time to lose ! 8. A married man; a husband; -- correlative to wife. I pronounce that they are man and wife. Book of Com. Prayer. every wife ought to answer for her man. Addison. 9. One, or any one, indefinitely; -- a modified survival of the Saxon use of man, or mon, as an indefinite pronoun. A man can not make him laugh. Shak. A man would expect to find some antiquities; but all they have to show of this nature is an old rostrum of a Roman ship. Addison. 10. One of the piece with which certain games, as chess or draughts, are played. Note: Man is often used as a prefix in composition, or as a separate adjective, its sense being usually self-explaining; as, man child, man eater or maneater, man-eating, man hater or manhater, man-hating, manhunter, man-hunting, mankiller, man-killing, man midwife, man pleaser, man servant, man-shaped, manslayer, manstealer, man- stealing, manthief, man worship, etc. Man is also used as a suffix to denote a person of the male sex having a business which pertains to the thing spoken of in the qualifying part of the compound; ashman, butterman, laundryman, lumberman, milkman, fireman, showman, waterman, woodman. Where the combination is not familiar, or where some specific meaning of the compound is to be avoided, man is used as a separate substantive in the foregoing sense; as, apple man, cloth man, coal man, hardware man, wood man (as distinguished from woodman). Man ape (Zoöl.), a anthropoid ape, as the gorilla. -- Man at arms, a designation of the fourteenth and fifteenth centuries for a soldier fully armed. -- Man engine, a mechanical lift for raising or lowering people through considerable distances; specifically (Mining), a contrivance by which miners ascend or descend in a shaft. It consists of a series of landings in the shaft and an equal number of shelves on a vertical rod which has an up and down motion equal to the distance between the successive landings. A man steps from a landing to a shelf and is lifted or lowered to the next landing, upon which he them steps, and so on, traveling by successive stages. -- Man Friday, a person wholly subservient to the will of another, like Robinson Crusoe's servant Friday. -- Man of straw, a puppet; one who is controlled by others; also, one who is not responsible pecuniarily. -- Man-of-the earth (Bot.), a twining plant (Ipomoea pandurata) with leaves and flowers much like those of the morning-glory, but having an immense tuberous farinaceous root. -- Man of war. (a) A warrior; a soldier. Shak. (b) (Naut.) See in the Vocabulary. -- To be one's own man, to have command of one's self; not to be subject to another.\n\n1. To supply with men; to furnish with a sufficient force or complement of men, as for management, service, defense, or the like; to guard; as, to man a ship, boat, or fort. See how the surly Warwick mans the wall ! Shak. They man their boats, and all their young men arm. Waller. 2. To furnish with strength for action; to prepare for efficiency; to fortify. \"Theodosius having manned his soul with proper reflections.\" Addison. 3. To tame, as a hawk. [R.] Shak. 4. To furnish with a servants. [Obs.] Shak. 5. To wait on as a manservant. [Obs.] Shak. Note: In \"Othello,\" V. ii. 270, the meaning is uncertain, being, perhaps: To point, to aim, or to manage. To man a yard (Naut.), to send men upon a yard, as for furling or reefing a sail. -- To man the yards (Naut.), to station men on the yards as a salute or mark of respect."}