{"word":"march","definition":"The third month of the year, containing thirty-one days. The stormy March is come at last, With wind, and cloud, and changing skies. Bryant. As mad as a March Hare, an old English Saying derived from the fact that March is the rutting time of hares, when they are excitable and violent. Wright.\n\nA territorial border or frontier; a region adjacent to a boundary line; a confine; -- used chiefly in the plural, and in English history applied especially to the border land on the frontiers between England and Scotland, and England and Wales. Geneva is situated in the marches of several dominions -- France, Savoy, and Switzerland. Fuller. Lords of waste marches, kings of desolate isles. Tennyson.\n\nTo border; to be contiguous; to lie side by side. [Obs.] That was in a strange land Which marcheth upon Chimerie. Gower. To march with, to have the same boundary for a greater or less distance; -- said of an estate.\n\n1. To move with regular steps, as a soldier; to walk in a grave, deliberate, or stately manner; to advance steadily. Shak. 2. To proceed by walking in a body or in military order; as, the German army marched into France.\n\nTO cause to move with regular steps in the manner of a soldier; to cause to move in military array, or in a body, as troops; to cause to advance in a steady, regular, or stately manner; to cause to go by peremptory command, or by force. March them again in fair array. Prior.\n\n1. The act of marching; a movement of soldiers from one stopping place to another; military progress; advance of troops. These troops came to the army harassed with a long and wearisome march. Bacon. 2. Hence: Measured and regular advance or movement, like that of soldiers moving in order; stately or deliberate walk; steady onward movement. With solemn march Goes slow and stately by them. Shak. This happens merely because men will not bide their time, but will insist on precipitating the march of affairs. Buckle. 3. The distance passed over in marching; as, an hour's march; a march of twenty miles. 4. A piece of music designed or fitted to accompany and guide the movement of troops; a piece of music in the march form. The drums presently striking up a march. Knolles. To make a march, (Card Playing), to take all the tricks of a hand, in the game of euchre."}