{"word":"match","definition":"Anything used for catching and retaining or communicating fire, made of some substance which takes fire readily, or remains burning some time; esp., a small strip or splint of wood dipped at one end in a substance which can be easily ignited by friction, as a preparation of phosphorus or chlorate of potassium. Match box, a box for holding matches. -- Match tub, a tub with a perforated cover for holding slow matches for firing cannon, esp. on board ship. The tub contains a little water in the bottom, for extinguishing sparks from the lighted matches. -- Quick match, threads of cotton or cotton wick soaked in a solution of gunpowder mixed with gum arabic and boiling water and afterwards strewed over with mealed powder. It burns at the rate of one yard in thirteen seconds, and is used as priming for heavy mortars, fireworks, etc. -- Slow match, slightly twisted hempen rope soaked in a solution of limewater and saltpeter or washed in a lye of water and wood ashes. It burns at the rate of four or five inches an hour, and is used for firing cannon, fireworks, etc.\n\n1. A person or thing equal or similar to another; one able to mate or cope with another; an equal; a mate. Government . . . makes an innocent man, though of the lowest rank, a match for the mightiest of his fellow subjects. Addison. 2. A bringing together of two parties suited to one another, as for a union, a trial of skill or force, a contest, or the like; as, specifically: (a) A contest to try strength or skill, or to determine superiority; an emulous struggle. \"Many a warlike match.\" Drayton. A solemn match was made; he lost the prize. Dryden. (b) A matrimonial union; a marriage. 3. An agreement, compact, etc. \"Thy hand upon that match.\" Shak. Love doth seldom suffer itself to be confined by other matches than those of its own making. Boyle. 4. A candidate for matrimony; one to be gained in marriage. \"She . . . was looked upon as the richest match of the West.\" Clarendon. 5. Equality of conditions in contest or competition. It were no match, your nail against his horn. Shak. 6. Suitable combination or bringing together; that which corresponds or harmonizes with something else; as, the carpet and curtains are a match. 7. (Founding)  A perforated board, block of plaster, hardened sand, etc., in which a pattern is partly imbedded when a mold is made, for giving shape to the surfaces of separation between the parts of the mold. Match boarding (Carp.), boards fitted together with tongue and groove, or prepared to be so fitted. -- Match game, a game arranged as a test of superiority. -- Match plane (Carp.), either of the two planes used to shape the edges of boards which are joined by grooving and tonguing. -- Match plate (Founding), a board or plate on the opposite sides of which the halves of a pattern are fastened, to facilitate molding. Knight. -- Match wheel (Mach.), a cogwheel of suitable pitch to work with another wheel; specifically, one of a pair of cogwheels of equal size.\n\n1. To be a mate or match for; to be able to complete with; to rival successfully; to equal. No settled senses of the world can match The pleasure of that madness. Shak. 2. To furnish with its match; to bring a match, or equal, against; to show an equal competitor to; to set something in competition with, or in opposition to, as equal. No history or antiquity can matchis policies and his conduct. South. 3. To oppose as equal; to contend successfully against. Eternal might To match with their inventions they presumed So easy, and of his thunder made a scorn. Milton. 4. To make or procure the equal of, or that which is exactly similar to, or corresponds with; as, to match a vase or a horse; to match cloth. \"Matching of patterns and colors.\" Swift. 5. To make equal, proportionate, or suitable; to adapt, fit, or suit (one thing to another). Let poets match their subject to their strength. Roscommon. 6. To marry; to give in marriage. A senator of Rome survived, Would not have matched his daughter with a king. Addison. 7. To fit together, or make suitable for fitting together; specifically, to furnish with a tongue and a groove, at the edges; as, to match boards. Matching machine, a planing machine for forming a tongue or a groove on the edge of a board.\n\n1. To be united in marriage; to mate. I hold it a sin to match in my kindred. Shak. Let tigers match with hinds, and wolves with sheep. Dryden. 2. To be of equal, or similar, size, figure, color, or quality; to tally; to suit; to correspond; as, these vases match."}