{"word":"matter","definition":"1. That of which anything is composed; constituent substance; material; the material or substantial part of anything; the constituent elements of conception; that into which a notion may be analyzed; the essence; the pith; the embodiment. He is the matter of virtue. B. Jonson. 2. That of which the sensible universe and all existent bodies are composed; anything which has extension, occupies space, or is perceptible by the senses; body; substance. Note: Matter is usually divided by philosophical writers into three kinds or classes: solid, liquid, and aëriform. Solid substances are those whose parts firmly cohere and resist impression, as wood or stone. Liquids have free motion among their parts, and easily yield to impression, as water and wine. Aëriform substances are elastic fluids, called vapors and gases, as air and oxygen gas. 3. That with regard to, or about which, anything takes place or is done; the thing aimed at, treated of, or treated; subject of action, discussion, consideration, feeling, complaint, legal action, or the like; theme. \"If the matter should be tried by duel.\" Bacon. Son of God, Savior of men ! Thy name Shall be the copious matter of my song. Milton. Every great matter they shall bring unto thee, but every small matter they shall judge. Ex. xviii. 22. 4. That which one has to treat, or with which one has to do; concern; affair; business. To help the matter, the alchemists call in many vanities out of astrology. Bacon. Some young female seems to have carried matters so far, that she is ripe for asking advice. Spectator. 5. Affair worthy of account; thing of consequence; importance; significance; moment; -- chiefly in the phrases what matter no matter, and the like. A prophet some, and some a poet, cry; No matter which, so neither of them lie. Dryden. 6. Inducing cause or occasion, especially of anything disagreeable or distressing; difficulty; trouble. And this is the matter why interpreters upon that passage in Hosea will not consent it to be a true story, that the prophet took a harlot to wife. Milton. 7. Amount; quantity; portion; space; -- often indefinite. Away he goes, . . . a matter of seven miles. L' Estrange. I have thoughts to tarry a small matter. Congreve. No small matter of British forces were commanded over sea the year before. Mi lton. 8. Substance excreted from living animal bodies; that which is thrown out or discharged in a tumor, boil, or abscess; pus; purulent substance. 9. (Metaph.)  That which is permanent, or is supposed to be given, and in or upon which changes are effected by psychological or physical processes and relations; -- opposed to form. Mansel. 10. (Print.)  Written manuscript, or anything to be set in type; copy; also, type set up and ready to be used, or which has been used, in printing. Dead matter (Print.), type which has been used, or which is not to be used, in printing, and is ready for distribution. -- Live matter (Print.), type set up, but not yet printed from. -- Matter in bar, Matter of fact. See under Bar, and Fact. -- Matter of record, anything recorded. -- Upon the matter, or Upon the whole matter, considering the whole; taking all things into view. Waller, with Sir William Balfour, exceeded in horse, but were, upon the whole matter, equal in foot. Clarendon.\n\n1. To be of importance; to import; to signify. It matters not how they were called. Locke. 2. To form pus or matter, as an abscess; to maturate. [R.] \"Each slight sore mattereth.\" Sir P. Sidney.\n\nTo regard as important; to take account of; to care for. [Obs.] He did not matter cold nor hunger. H. Brooke."}