{"word":"may","definition":"An auxiliary verb qualifyng the meaning of another verb, by expressing: (a) Ability, competency, or possibility; -- now oftener expressed by can. How may a man, said he, with idle speech, Be won to spoil the castle of his health ! Spenser. For what he [the king] may do is of two kinds; what he may do as just, and what he may do as possible. Bacon. For of all sad words of tongue or pen The saddest are these: \"It might have been.\" Whittier. (b) Liberty; permission; allowance. Thou mayst be no longer steward. Luke xvi. 2. (c) Contingency or liability; possibility or probability. Though what he learns he speaks, and may advance Some general maxims, or be right by chance. Pope. (d) Modesty, courtesy, or concession, or a desire to soften a question or remark. How old may Phillis be, you ask. Prior. (e) Desire or wish, as in prayer, imprecation, benediction, and the like. \"May you live happily.\" Dryden. May be, and It may be, are used as equivalent to possibly, perhaps, by chance, peradventure. See 1st Maybe.\n\nA maiden. [Obs.] Chaucer.\n\n1. The fifth month of the year, containing thirty-one days. Chaucer. 2. The early part or springtime of life. His May of youth, and bloom of lustihood. Shak. 3. (Bot.)  The flowers of the hawthorn; -- so called from their time of blossoming; also, the hawthorn. The palm and may make country houses gay. Nash. Plumes that micked the may. Tennyson. 4. The merrymaking of May Day. Tennyson. Italian may (Bot.), a shrubby species of Spiræa (S. hypericifolia) with many clusters of small white flowers along the slender branches. -- May apple (Bot.), the fruit of an American plant (Podophyllum peltatum). Also, the plant itself (popularly called mandrake), which has two lobed leaves, and bears a single egg-shaped fruit at the forking. The root and leaves, used in medicine, are powerfully drastic. -- May beetle, May bug (Zoöl.), any one of numerous species of large lamellicorn beetles that appear in the winged state in May. They belong to Melolontha, and allied genera. Called also June beetle. -- May Day, the first day of May; -- celebrated in the rustic parts of England by the crowning of a May queen with a garland, and by dancing about a May pole. -- May dew, the morning dew of the first day of May, to which magical properties were attributed. -- May flower (Bot.), a plant that flowers in May; also, its blossom. See Mayflower, in the vocabulary. -- May fly (Zoöl.), any species of Ephemera, and allied genera; -- so called because the mature flies of many species appear in May. See Ephemeral fly, under Ephemeral. -- May game, any May-day sport. -- May lady, the queen or lady of May, in old May games. -- May lily (Bot.), the lily of the valley (Convallaria majalis). -- May pole. See Maypole in the Vocabulary. -- May queen, a girl or young woman crowned queen in the sports of May Day. -- May thorn, the hawthorn."}