{"word":"mean","definition":"1. To have in the mind, as a purpose, intention, etc.; to intend; to purpose; to design; as, what do you mean to do What mean ye by this service Ex. xii. 26. Ye thought evil against me; but God meant it unto good. Gen. 1. 20. I am not a Spaniard To say that it is yours and not to mean it. Longfellow. 2. To signify; to indicate; to import; to denote. What mean these seven ewe lambs Gen. xxi. 29. Go ye, and learn what that me. Matt. ix. 13.\n\nTo have a purpose or intention. [Rare, except in the phrase to mean well, or ill.] Shak.\n\n1. Destitute of distinction or eminence; common; low; vulgar; humble. \"Of mean parentage.\" Sir P. Sidney. The mean man boweth down, and the great man humbleth himself. Is. ii. 9. 2. Wanting dignity of mind; low-minded; base; destitute of honor; spiritless; as, a mean motive. Can you imagine I so mean could prove, To save my life by changing of my love Dryden. 3. Of little value or account; worthy of little or no regard; contemptible; despicable. The Roman legions and great Cæsar found Our fathers no mean foes. J. Philips. 4. Of poor quality; as, mean fare. 5. Penurious; stingy; close-fisted; illiberal; as, mean hospitality. Note: Mean is sometimes used in the formation of compounds, the sense of which is obvious without explanation; as, meanborn, mean-looking, etc. Syn. -- Base; ignoble; abject; beggarly; wretched; degraded; degenerate; vulgar; vile; servile; menial; spiritless; groveling; slavish; dishonorable; disgraceful; shameful; despicable; contemptible; paltry; sordid. See Base.\n\n1. Occupying a middle position; middle; being about midway between extremes. Being of middle age and a mean stature. Sir. P. Sidney. 2. Intermediate in excellence of any kind. According to the fittest style of lofty, mean, or lowly. Milton. 3. (Math.)  Average; having an intermediate value between two extremes, or between the several successive values of a variable quantity during one cycle of variation; as, mean distance; mean motion; mean solar day. Mean distance (of a planet from the sun) (Astron.), the average of the distances throughout one revolution of the planet, equivalent to the semi-major axis of the orbit. -- Mean error (Math. Phys.), the average error of a number of observations found by taking the mean value of the positive and negative errors without regard to sign. -- Mean-square error, or Error of the mean square (Math. Phys.), the error the square of which is the mean of the squares of all the errors; -- called also, especially by European writers, mean error. -- Mean line. (Crystallog.) Same as Bisectrix. -- Mean noon, noon as determined by mean time. -- Mean proportional (between two numbers) (Math.), the square root of their product. -- Mean sun, a fictitious sun supposed to move uniformly in the equator so as to be on the meridian each day at mean noon. -- Mean time, time as measured by an equable motion, as of a perfect clock, or as reckoned on the supposition that all the days of the year are of a mean or uniform length, in contradistinction from apparent time, or that actually indicated by the sun, and from sidereal time, or that measured by the stars.\n\n1. That which is mean, or intermediate, between two extremes of place, time, or number; the middle point or place; middle rate or degree; mediocrity; medium; absence of extremes or excess; moderation; measure. But to speak in a mean, the virtue of prosperity is temperance; the virtue of adversity is fortitude. Bacon. There is a mean in all things. Dryden. The extremes we have mentioned, between which the wellinstracted Christian holds the mean, are correlatives. I. Taylor. 2. (Math.)  A quantity having an intermediate value between several others, from which it is derived, and of which it expresses the resultant value; usually, unless otherwise specified, it is the simple average, formed by adding the quantities together and dividing by their number, which is called an arithmetical mean. A geometrical mean is the square root of the product of the quantities. 3. That through which, or by the help of which, an end is attained; something tending to an object desired; intermediate agency or measure; necessary condition or coagent; instrument. Their virtuous conversation was a mean to work the conversion of the heathen to Christ. Hooker. You may be able, by this mean, to review your own scientific acquirements. Coleridge. Philosophical doubt is not an end, but a mean. Sir W. Hamilton. Note: In this sense the word is usually employed in the plural form means, and often with a singular attribute or predicate, as if a singular noun. By this means he had them more at vantage. Bacon. What other means is left unto us. Shak. 4. pl.  Hence: Resources; property, revenue, or the like, considered as the condition of easy livelihood, or an instrumentality at command for effecting any purpose; disposable force or substance. Your means are very slender, and your waste is great. Shak. 5. (Mus.)  A part, whether alto or tenor, intermediate between the soprano and base; a middle part. [Obs.] The mean is drowned with your unruly base. Shak. 6. Meantime; meanwhile. [Obs.] Spenser. 7. A mediator; a go-between. [Obs.] Piers Plowman. He wooeth her by means and by brokage. Chaucer. By all means, certainly; without fail; as, go, by all means. -- By any means, in any way; possibly; at all. If by any means I might attain to the resurrection of the dead. Phil. iii. ll. -- By no means, or By no manner of means, not at all; certainly not; not in any degree. The wine on this side of the lake is by no means so good as that on the other. Addison."}