{"word":"measure","definition":"1. A standard of dimension; a fixed unit of quantity or extent; an extent or quantity in the fractions or multiples of which anything is estimated and stated; hence, a rule by which anything is adjusted or judged. 2. An instrument by means of which size or quantity is measured, as a graduated line, rod, vessel, or the like. False ells and measures be brought all clean adown. R. of Gloucester. 3. The dimensions or capacity of anything, reckoned according to some standard; size or extent, determined and stated; estimated extent; as, to take one's measure for a coat. The measure thereof is longer than the earth, and broader than the sea. Job xi. 9. 4. The contents of a vessel by which quantity is measured; a quantity determined by a standard; a stated or limited quantity or amount. It is like leaven which a woman took and hid in three measures of meal. Luke xiii. 21. 5. Extent or degree not excessive or beyong bounds; moderation; due restraint; esp. in the phrases, in measure; with measure; without or beyond measure. Hell hath enlarged herself, and opened her mouth without measure. Is. v. 14. 6. Determined extent, not to be exceeded; limit; allotted share, as of action, influence, ability, or the like; due proportion. Lord, make me to know mine end, and the measure of my days. Ps. xxxix. 4. 7. The quantity determined by measuring, especially in buying and selling; as, to give good or full measure. 8. Undefined quantity; extent; degree. There is a great measure of discretion to be used in the performance of confession. Jer. Taylor. 9. Regulated division of movement: (a) (Dancing) A regulated movement corresponding to the time in which the accompanying music is performed; but, especially, a slow and stately dane, like the minuet. (b) (Mus.) (1) The group or grouping of beats, caused by the regular recurrence of accented beats. (2)  The space between two bars. See Beat, Triple, Quadruple, Sextuple, Compound time, under Compound, a., and Figure. (c) (Poetry) The manner of ordering and combining the quantities, or long and short syllables; meter; rhythm; hence, a foot; as, a poem in iambic measure. 10. (Arith.)  A number which is contained in a given number a number of times without a remainder; as in the phrases, the common measure, the greatest common measure, etc., of two or more numbers. 11. A step or definite part of a progressive course or policy; a means to an end; an act designed for the accomplishment of an object; as, political measures; prudent measures; an inefficient measure. His majesty found what wrong measures he had taken in the conferring that trust, and lamented his error. Clarendon. 12. The act of measuring; measurement. Shak. 13. pl. (Geol.)  Beds or strata; as, coal measures; lead measures. Lineal, or Long, measure, measure of length; the measure of lines or distances. -- Liquid measure, the measure of liquids. -- Square measure, the measure of superficial area of surfaces in square units, as inches, feet, miles, etc. -- To have hard measure, to have harsh treatment meted out to one; to be harshly or oppressively dealt with. -- To take measures, to make preparations; to provide means. -- To take one's measure, to measure one, as for a garment; hence, to form an opinion of one's disposition, character, ability, etc. -- To tread a measure, to dance in the style so called. See 9 (a). Say to her, we have measured many miles To tread a measure with her on this grass. Shak.\n\n1. To ascertain by use of a measuring instrument; to compute or ascertain the extent, quantity, dimensions, or capacity of, by a certain rule or standard; to take the dimensions of; hence, to estimate; to judge of; to value; to appraise. Great are thy works, Jehovah, infinite Thy power! what thought can measure thee Milton. 2. To serve as the measure of; as, the thermometer measures changes of temperature. 3. To pass throught or over in journeying, as if laying off and determining the distance. A true devoted pilgrim is not weary To measure kingdoms with his feeble steps. Shak. 4. To adjust by a rule or standard. To secure a contented spirit, measure your desires by your fortunes, not your fortunes by your desires. Jer. Taylor. 5. To allot or distribute by measure; to set off or apart by measure; -- often with out or off. With what measure ye mete, it shall be measured to you again. Matt. vii. 2. That portion of eternity which is called time, measured out by the sun. Addison. To measure swords with one, to try another's skill in the use of the sword; hence, figuratively, to match one's abilities against an antagonist's.\n\n1. To make a measurement or measurements. 2. To result, or turn out, on measuring; as, the grain measures well; the pieces measure unequally. 3. To be of a certain size or quantity, or to have a certain length, breadth, or thickness, or a certain capacity according to a standard measure; as, cloth measures three fourths of a yard; a tree measures three feet in diameter."}