{"word":"meet","definition":"1. To join, or come in contact with; esp., to come in contact with by approach from an opposite direction; to come upon or against, front to front, as distinguished from contact by following and overtaking. 2. To come in collision with; to confront in conflict; to encounter hostilely; as, they met the enemy and defeated them; the ship met opposing winds and currents. 3. To come into the presence of without contact; to come close to; to intercept; to come within the perception, influence, or recognition of; as, to meet a train at a junction; to meet carriages or persons in the street; to meet friends at a party; sweet sounds met the ear. His daughter came out to meet him. Judg. xi. 34. 4. To perceive; to come to a knowledge of; to have personal acquaintance with; to experience; to suffer; as, the eye met a horrid sight; he met his fate. Of vice or virtue, whether blest or curst, Which meets contempt, or which compassion first. Pope. 5. To come up to; to be even with; to equal; to match; to satisfy; to ansver; as, to meet one's expectations; the supply meets the demand. To meet half way, literally, to go half the distance between in order to meet (one); hence, figuratively, to yield or concede half of the difference in order to effect a compromise or reconciliation with.\n\n1. To come together by mutual approach; esp., to come in contact, or into proximity, by approach from opposite directions; to join; to come face to face; to come in close relationship; as, we met in the street; two lines meet so as to form an angle. O, when meet now Such pairs in love and mutual honor joined ! Milton. 2. To come together with hostile purpose; to have an encounter or conflict. Weapons more violent, when next we meet, May serve to better us and worse our foes. Milton. 3. To assemble together; to congregate; as, Congress meets on the first Monday of December. They . . . appointed a day to meet together. 2. Macc. xiv. 21. 4. To come together by mutual concessions; hence, to agree; to harmonize; to unite. To meet with. (a) To light upon; to find; to come to; -- often with the sense of unexpectedness. We met with many things worthy of observation. Bacon. (b) To join; to unite in company. Shak. (c) To suffer unexpectedly; as, to meet with a fall; to meet with a loss. (d) To encounter; to be subjected to. Prepare to meet with more than brutal fury From the fierce prince. Rowe. (e) To obviate. [Obs.] Bacon.\n\nAn assembling together; esp., the assembling of huntsmen for the hunt; also, the persons who so assemble, and the place of meeting.\n\nSuitable; fit; proper; appropriate; qualified; convenient. It was meet that we should make merry. Luke xv. 32. To be meet with, to be even with; to be equal to. [Obs.]\n\nMeetly. [Obs.] Shak."}