{"word":"memory","definition":"1. The faculty of the mind by which it retains the knowledge of previous thoughts, impressions, or events. Memory is the purveyor of reason. Rambler. 2. The reach and positiveness with which a person can remember; the strength and trustworthiness of one's power to reach and represent or to recall the past; as, his memory was never wrong. 3. The actual and distinct retention and recognition of past ideas in the mind; remembrance; as, in memory of youth; memories of foreign lands. 4. The time within which past events can be or are remembered; as, within the memory of man. And what, before thy memory, was done From the begining. Milton. 5. Something, or an aggregate of things, remembered; hence, character, conduct, etc., as preserved in remembrance, history, or tradition; posthumous fame; as, the war became only a memory. The memory of the just is blessed. Prov. x. 7. That ever-living man of memory, Henry the Fifth. Shak. The Nonconformists . . . have, as a body, always venerated her [Elizabeth's] memory. Macaulay. 6. A memorial. [Obs.] These weeds are memories of those worser hours. Shak. Syn. -- Memory, Remembrance, Recollection, Reminiscence. Memory is the generic term, denoting the power by which we reproduce past impressions. Remembrance is an exercise of that power when things occur spontaneously to our thoughts. In recollection we make a distinct effort to collect again, or call back, what we know has been formerly in the mind. Reminiscence is intermediate between remembrance and recollection, being a conscious process of recalling past occurrences, but without that full and varied reference to particular things which characterizes recollection. \"When an idea again recurs without the operation of the like object on the external sensory, it is remembrance; if it be sought after by the mind, and with pain and endeavor found, and brought again into view, it is recollection.\" Locke. To draw to memory, to put on record; to record. [Obs.] Chaucer. Gower."}