{"word":"mercury","definition":"1. (Rom. Myth.)  A Latin god of commerce and gain; -- treated by the poets as identical with the Greek Hermes, messenger of the gods, conductor of souls to the lower world, and god of eloquence. 2. (Chem.)  A metallic element mostly obtained by reduction from cinnabar, one of its ores. It is a heavy, opaque, glistening liquid (commonly called quicksilver), and is used in barometers, thermometers, ect. Specific gravity 13.6. Symbol Hg (Hydrargyrum). Atomic weight 199.8. Mercury has a molecule which consists of only one atom. It was named by the alchemists after the god Mercury, and designated by his symbol, mercury. Note: Mercury forms alloys, called amalgams, with many metals, and is thus used in applying tin foil to the backs of mirrors, and in extracting gold and silver from their ores. It is poisonous, and is used in medicine in the free state as in blue pill, and in its compounds as calomel, corrosive sublimate, etc. It is the only metal which is liquid at ordinary temperatures, and it solidifies at about -39ยบ Centigrade to a soft, malleable, ductile metal. 3. (Astron.)  One of the planets of the solar system, being the one nearest the sun, from which its mean distance is about 36,000,000 miles. Its period is 88 days, and its diameter 3,000 miles. 4. A carrier of tidings; a newsboy; a messenger; hence, also, a newspaper. Sir J. Stephen. \"The monthly Mercuries.\" Macaulay. 5. Sprightly or mercurial quality; spirit; mutability; fickleness. [Obs.] He was so full of mercury that he could not fix long in any friendship, or to any design. Bp. Burnet. 6. (Bot.)  A plant (Mercurialis annua), of the Spurge family, the leaves of which are sometimes used for spinach, in Europe. Note: The name is also applied, in the United States, to certain climbing plants, some of which are poisonous to the skin, esp. to the Rhus Toxicodendron, or poison ivy. Dog's mercury (Bot.), Mercurialis perennis, a perennial plant differing from M. annua by having the leaves sessile. -- English mercury (Bot.), a kind of goosefoot formerly used as a pot herb; -- called Good King Henry. -- Horn mercury (Min.), a mineral chloride of mercury, having a semitranslucent, hornlike appearance.\n\nTo wash with a preparation of mercury. [Obs.] B. Jonson."}