{"word":"middle","definition":"1. Equally distant from the extreme either of a number of things or of one thing; mean; medial; as, the middle house in a row; a middle rank or station in life; flowers of middle summer; men of middle age. 2. Intermediate; intervening. Will, seeking good, finds many middle ends. Sir J. Davies. Note: Middle is sometimes used in the formation of selfexplaining compounds; as, middle-sized, middle-witted. Middle Ages, the period of time intervening between the decline of the Roman Empire and the revival of letters. Hallam regards it as beginning with the sixth and ending with the fifteenth century. -- Middle class, in England, people who have an intermediate position between the aristocracy and the artisan class. It includes professional men, bankers, merchants, and small landed proprietors The middle-class electorate of Great Britain. M. Arnold. -- Middle distance. (Paint.) See Middle-ground. -- Middle English. See English, n., 2. -- Middle Kingdom, China. -- Middle oil (Chem.), that part of the distillate obtained from coal tar which passes over between 170ยบ and 230ยบ Centigrade; -- distinguished from the light, and the heavy or dead, oil. -- Middle passage, in the slave trade, that part of the Atlantic Ocean between Africa and the West Indies. -- Middle post. (Arch.) Same as King-post. -- Middle States, New York, New Jersey, Pennsylvania, and Delaware; which, at the time of the formation of the Union, occupied a middle position between the Eastern States (or New England) and the Southern States. [U.S.] -- Middle term (Logic), that term of a syllogism with which the two extremes are separately compared, and by means of which they are brought together in the conclusion. Brande. -- Middle tint (Paint.), a subdued or neutral tint. Fairholt. -- Middle voice. (Gram.) See under Voice. -- Middle watch, the period from midnight to four A. M.; also, the men on watch during that time. Ham. Nav. Encyc. -- Middle weight, a pugilist, boxer, or wrestler classed as of medium weight, i. e., over 140 and not over 160 lbs., in distinction from those classed as light weights, heavy weights, etc.\n\nThe point or part equally distant from the extremities or exterior limits, as of a line, a surface, or a solid; an intervening point or part in space, time, or order of series; the midst; central portion; specif., the waist. Chaucer. \"The middle of the land.\" Judg. ix. 37. In this, as in most questions of state, there is a middle. Burke. Syn. -- See Midst."}