{"word":"milk","definition":"1. (Physiol.)  A white fluid secreted by the mammary glands of female mammals for the nourishment of their young, consisting of minute globules of fat suspended in a solution of casein, albumin, milk sugar, and inorganic salts. \"White as morne milk.\" Chaucer. 2. (Bot.)  A kind of juice or sap, usually white in color, found in certain plants; latex. See Latex. 3. An emulsion made by bruising seeds; as, the milk of almonds, produced by pounding almonds with sugar and water. 4. (Zoöl.)  The ripe, undischarged spat of an oyster. Condensed milk. See under Condense, v. t. -- Milk crust (Med.), vesicular eczema occurring on the face and scalp of nursing infants. See Eczema. -- Milk fever. (a) (Med.) A fever which accompanies or precedes the first lactation. It is usually transitory. (b) (Vet. Surg.) A form puerperal peritonitis in cattle; also, a variety of meningitis occurring in cows after calving. -- Milk glass, glass having a milky appearance. -- Milk knot (Med.), a hard lump forming in the breast of a nursing woman, due to obstruction to the flow of milk and congestion of the mammary glands. -- Milk leg (Med.), a swollen condition of the leg, usually in puerperal women, caused by an inflammation of veins, and characterized by a white appearance occasioned by an accumulation of serum and sometimes of pus in the cellular tissue. -- Milk meats, food made from milk, as butter and cheese. [Obs.] Bailey. -- Milk mirror. Same as Escutcheon, 2. -- Milk molar (Anat.), one of the deciduous molar teeth which are shed and replaced by the premolars. -- Milk of lime (Chem.), a watery emulsion of calcium hydrate, produced by macerating quicklime in water. -- Milk parsley (Bot.), an umbelliferous plant (Peucedanum palustre) of Europe and Asia, having a milky juice. -- Milk pea (Bot.), a genus (Galactia) of leguminous and, usually, twining plants. -- Milk sickness (Med.), a peculiar malignant disease, occurring in some parts of the Western United States, and affecting certain kinds of farm stock (esp. cows), and persons who make use of the meat or dairy products of infected cattle. Its chief symptoms in man are uncontrollable vomiting, obstinate constipation, pain, and muscular tremors. Its origin in cattle has been variously ascribed to the presence of certain plants in their food, and to polluted drinking water. -- Milk snake (Zoöl.), a harmless American snake (Ophibolus triangulus, or O. eximius). It is variously marked with white, gray, and red. Called also milk adder, chicken snake, house snake, etc. -- Milk sugar. (Physiol. Chem.) See Lactose, and Sugar of milk (below). -- Milk thistle (Bot.), an esculent European thistle (Silybum marianum), having the veins of its leaves of a milky whiteness. -- Milk thrush. (Med.) See Thrush. -- Milk tooth (Anat.), one of the temporary first set of teeth in young mammals; in man there are twenty. -- Milk tree (Bot.), a tree yielding a milky juice, as the cow tree of South America (Brosimum Galactodendron), and the Euphorbia balsamifera of the Canaries, the milk of both of which is wholesome food. -- Milk vessel (Bot.), a special cell in the inner bark of a plant, or a series of cells, in which the milky juice is contained. See Latex. -- Rock milk. See Agaric mineral, under Agaric. -- Sugar of milk. The sugar characteristic of milk; a hard white crystalline slightly sweet substance obtained by evaporation of the whey of milk. It is used in pellets and powder as a vehicle for homeopathic medicines, and as an article of diet. See Lactose.\n\n1. To draw or press milk from the breasts or udder of, by the hand or mouth; to withdraw the milk of. \"Milking the kine.\" Gay. I have given suck, and know How tender 't is to love the babe that milks me. Shak. 2. To draw from the breasts or udder; to extract, as milk; as, to milk wholesome milk from healthy cows. 3. To draw anything from, as if by milking; to compel to yield profit or advantage; to plunder. Tyndale. They [the lawyers] milk an unfortunate estate as regularly as a dairyman does his stock. London Spectator. To milk the street, to squeeze the smaller operators in stocks and extract a profit from them, by alternately raising and depressing prices within a short range; -- said of the large dealers. [Cant] -- To milk a telegram, to use for one's own advantage the contents of a telegram belonging to another person. [Cant]\n\nTo draw or to yield milk."}