{"word":"mill","definition":"A money of account of the United States, having the value of the tenth of a cent, or the thousandth of a dollar.\n\n1. A machine for grinding or commuting any substance, as grain, by rubbing and crushing it between two hard, rough, or intented surfaces; as, a gristmill, a coffee mill; a bone mill. 2. A machine used for expelling the juice, sap, etc., from vegetable tissues by pressure, or by pressure in combination with a grinding, or cutting process; as, a cider mill; a cane mill. 3. A machine for grinding and polishing; as, a lapidary mill. 4. A common name for various machines which produce a manufactured product, or change the form of a raw material by the continuous repetition of some simple action; as, a sawmill; a stamping mill, etc. 5. A building or collection of buildings with machinery by which the processes of manufacturing are carried on; as, a cotton mill; a powder mill; a rolling mill. 6. (Die Sinking)  A hardened steel roller having a design in relief, used for imprinting a reversed copy of the design in a softer metal, as copper. 7. (Mining) (a) An excavation in rock, transverse to the workings, from which material for filling is obtained. (b) A passage underground through which ore is shot. 8. A milling cutter. See Illust. under Milling. 9. A pugilistic. [Cant] R. D. Blackmore. Edge mill, Flint mill, etc. See under Edge, Flint, etc. -- Mill bar (Iron Works), a rough bar rolled or drawn directly from a bloom or puddle bar for conversion into merchant iron in the mill. -- Mill cinder, slag from a puddling furnace. -- Mill head, the head of water employed to turn the wheel of a mill. -- Mill pick, a pick for dressing millstones. -- Mill pond, a pond that supplies the water for a mill. -- Mill race, the canal in which water is conveyed to a mill wheel, or the current of water which drives the wheel. -- Mill tail, the water which flows from a mill wheel after turning it, or the channel in which the water flows. -- Mill tooth, a grinder or molar tooth. -- Mill wheel, the water wheel that drives the machinery of a mill. -- Roller mill, a mill in which flour or meal is made by crushing grain between rollers. -- Stamp mill (Mining), a mill in which ore is crushed by stamps. -- To go through the mill, to experience the suffering or discipline necessary to bring one to a certain degree of knowledge or skill, or to a certain mental state.\n\n1. To reduce to fine particles, or to small pieces, in a mill; to grind; to comminute. 2. To shape, finish, or transform by passing through a machine; specifically, to shape or dress, as metal, by means of a rotary cutter. 3. To make a raised border around the edges of, or to cut fine grooves or indentations across the edges of, as of a coin, or a screw head; also, to stamp in a coining press; to coin. 4. To pass through a fulling mill; to full, as cloth. 5. To beat with the fists. [Cant] Thackeray. 6. To roll into bars, as steel. To mill chocolate, to make it frothy, as by churning.\n\nTo swim under water; -- said of air-breathing creatures."}