{"word":"mind","definition":"1. The intellectual or rational faculty in man; the understanding; the intellect; the power that conceives, judges, or reasons; also, the entire spiritual nature; the soul; -- often in distinction from the body. By the mind of man we understand that in him which thinks, remembers, reasons, wills. Reid. What we mean by mind is simply that which perceives, thinks, feels, wills, and desires. Sir W. Hamilton. Let every man be fully persuaded in his own mind. Rom. xiv. 5. The mind shall banquet, though the body pine. Shak. 2. The state, at any given time, of the faculties of thinking, willing, choosing, and the like; psychical activity or state; as: (a) Opinion; judgment; belief. A fool uttereth all his mind. Prov. xxix. 11. Being so hard to me that brought your mind, I fear she'll prove as hard to you in telling her mind. Shak. (b) Choice; inclination; liking; intent; will. If it be your minds, then let none go forth. 2 Kings ix. 15. (c) Courage; spirit. Chapman. 3. Memory; remembrance; recollection; as, to have or keep in mind, to call to mind, to put in mind, etc. To have a mind or great mind, to be inclined or strongly inclined in purpose; -- used with an infinitive. \"Sir Roger de Coverly... told me that he had a great mind to see the new tragedy with me.\" Addison. -- To lose one's mind, to become insane, or imbecile. -- To make up one's mind, to come to an opinion or decision; to determine. -- To put in mind, to remind. \"Regard us simply as putting you in mind of what you already know to be good policy.\" Jowett (Thucyd. ).\n\n1. To fix the mind or thoughts on; to regard with attention; to treat as of consequence; to consider; to heed; to mark; to note. \"Mind not high things, but condescend to men of low estate.\" Rom. xii. 16. My lord, you nod: you do not mind the play. Shak. 2. To occupy one's self with; to employ one's self about; to attend to; as, to mind one's business. Bidding him be a good child, and mind his book. Addison. 3. To obey; as, to mind parents; the dog minds his master. 4. To have in mind; to purpose. Beaconsfield. I mind to tell him plainly what I think. Shak. 5. To put in mind; to remind. [Archaic] M. Arnold. He minded them of the mutability of all earthly things. Fuller. I do thee wrong to mind thee of it. Shak. Never mind, do not regard it; it is of no consequence; no matter. Syn. -- To notice; mark; regard; obey. See Attend.\n\nTo give attention or heed; to obey; as, the dog minds well."}