{"word":"mineral","definition":"1. An inorganic species or substance occurring in nature, having a definite chemical composition and usually a distinct crystalline form. Rocks, except certain glassy igneous forms, are either simple minerals or aggregates of minerals. 2. A mine. [Obs.] Shak. 3. Anything which is neither animal nor vegetable, as in the most general classification of things into three kingdoms (animal, vegetable, and mineral).\n\n1. Of or pertaining to minerals; consisting of a mineral or of minerals; as, a mineral substance. 2. Impregnated with minerals; as, mineral waters. Mineral acids (Chem.), inorganic acids, as sulphuric, nitric, phosphoric, hydrochloric, acids, etc., as distinguished from the organic acids. -- Mineral blue, the name usually given to azurite, when reduced to an impalpable powder for coloring purposes. -- Mineral candle, a candle made of paraffine. -- Mineral caoutchouc, an elastic mineral pitch, a variety of bitumen, resembling caoutchouc in elasticity and softness. See Caoutchouc, and Elaterite. -- Mineral chameleon (Chem.) See Chameleon mineral, under Chameleon. -- Mineral charcoal. See under Charcoal. -- Mineral cotton. See Mineral wool (below). -- Mineral green, a green carbonate of copper; malachite. -- Mineral kingdom (Nat. Sci.), that one of the three grand divisions of nature which embraces all inorganic objects, as distinguished from plants or animals. -- Mineral oil. See Naphtha, and Petroleum. -- Mineral paint, a pigment made chiefly of some natural mineral substance, as red or yellow iron ocher. -- Mineral patch. See Bitumen, and Asphalt. -- Mineral right, the right of taking minerals from land. -- Mineral salt (Chem.), a salt of a mineral acid. -- Mineral tallow, a familiar name for hatchettite, from its fatty or spermaceti-like appearance. -- Mineral water. See under Water. -- Mineral wax. See Ozocerite. -- Mineral wool, a fibrous wool-like material, made by blowing a powerful jet of air or steam through melted slag. It is a poor conductor of heat."}