{"word":"minor","definition":"1. Inferior in bulk, degree, importance, etc.; less; smaller; of little account; as, minor divisions of a body. 2. (Mus.)  Less by a semitone in interval or difference of pitch; as, a minor third. Asia Minor (Geog.), the Lesser Asia; that part of Asia which lies between the Euxine, or Black Sea, on the north, and the Mediterranean on the south. -- Minor mode (Mus.), that mode, or scale, in which the third and sixth are minor, -- much used for mournful and solemn subjects. -- Minor orders (Eccl.), the rank of persons employed in ecclesiastical offices who are not in holy orders, as doorkeepers, acolytes, etc. -- Minor scale (Mus.) The form of the minor scale is various. The strictly correct form has the third and sixth minor, with a semitone between the seventh and eighth, which involves an augmented second interval, or three semitones, between the sixth and seventh, as, 6/F, 7/G#, 8/A. But, for melodic purposes, both the sixth and the seventh are sometimes made major in the ascending, and minor in the descending, scale, thus: --See Major. -- Minor term of syllogism (Logic), the subject of the conclusion.\n\n1. A person of either sex who has not attained the age at which full civil rights are accorded; an infant; in England and the United States, one under twenty-one years of age. Note: In hereditary monarchies, the minority of a sovereign ends at an earlier age than of a subject. The minority of a sovereign of Great Britain ends upon the completion of the eighteenth year of his age. 2. (Logic)  The minor term, that is, the subject of the conclusion; also, the minor premise, that is, that premise which contains the minor term; in hypothetical syllogisms, the categorical premise. It is the second proposition of a regular syllogism, as in the following: Every act of injustice partakes of meanness; to take money from another by gaming is an act of injustice; therefore, the taking of money from another by gaming partakes of meanness. 3. A Minorite; a Franciscan friar."}