{"word":"miss","definition":"1. A title of courtesy prefixed to the name of a girl or a woman who has not been married. See Mistress, 5. Note: There is diversity of usage in the application of this title to two or more persons of the same name. We may write either the Miss Browns or the Misses Brown. 2. A young unmarried woman or a girl; as, she is a miss of sixteen. Gay vanity, with smiles and kisses, Was busy 'mongst the maids and misses. Cawthorn. 3. A kept mistress. See Mistress, 4. [Obs.] Evelyn. 4. (Card Playing)  In the game of three-card loo, an extra hand, dealt on the table, which may be substituted for the hand dealt to a player.\n\n1. To fail of hitting, reaching, getting, finding, seeing, hearing, etc.; as, to miss the mark one shoots at; to miss the train by being late; to miss opportunites of getting knowledge; to miss the point or meaning of something said. When a man misses his great end, happiness, he will acknowledge he judged not right. Locke. 2. To omit; to fail to have or to do; to get without; to dispense with; -- now seldom applied to persons. She would never miss, one day, A walk so fine, a sight so gay. Prior. We cannot miss him; he does make our fire, Fetch in our wood. Shak. 3. To discover the absence or omission of; to feel the want of; to mourn the loss of; to want. Shak. Neither missed we anything ... Nothing was missed of all that pertained unto him. 1 Sam. xxv. 15, 21. What by me thou hast lost, thou least shalt miss. Milton. To miss stays. (Naut.) See under Stay.\n\n1. To fail to hit; to fly wide; to deviate from the true direction. Men observe when things hit, and not when they miss. Bacon. Flying bullets now, To execute his rage, appear too slow; They miss, or sweep but common souls away. Waller. 2. To fail to obtain, learn, or find; -- with of. Upon the least reflection, we can not miss of them. Atterbury. 3. To go wrong; to err. [Obs.] Amongst the angels, a whole legion Of wicked sprites did fall from happy bliss; What wonder then if one, of women all, did miss Spenser. 4. To be absent, deficient, or wanting. [Obs.] See Missing, a. What here shall miss, our toil shall strive to mend. Shak.\n\n1. The act of missing; failure to hit, reach, find, obtain, etc. 2. Loss; want; felt absence. [Obs.] There will be no great miss of those which are lost. Locke. 3. Mistake; error; fault. Shak. He did without any great miss in the hardest points of grammar. Ascham. 4. Harm from mistake. [Obs.] Spenser."}