{"word":"mold","definition":"A spot; a blemish; a mole. [Obs.] Spenser.\n\n1. Crumbling, soft, friable earth; esp., earth containing the remains or constituents of organic matter, and suited to the growth of plants; soil. 2. Earthy material; the matter of which anything is formed; composing substance; material. The etherial mold, Incapable of stain. Milton. Nature formed me of her softest mold. Addison.\n\nTo cover with mold or soil. [R.]\n\nA growth of minute fungi of various kinds, esp. those of the great groups Hyphomycetes, and Physomycetes, forming on damp or decaying organic matter. Note: The common blue mold of cheese, the brick-red cheese mold, and the scarlet or orange strata which grow on tubers or roots stored up for use, when commencing to decay, are familiar examples. M. J. Berkley.\n\nTo cause to become moldy; to cause mold to grow upon.\n\nTo become moldy; to be covered or filled, in whole or in part, with a mold.\n\n1. The matrix, or cavity, in which anything is shaped, and from which it takes its form; also, the body or mass containing the cavity; as, a sand mold; a jelly mold. Milton. 2. That on which, or in accordance with which, anything is modeled or formed; anything which serves to regulate the size, form, etc., as the pattern or templet used by a shipbuilder, carpenter, or mason. The glass of fashion and the mold of form. Shak. 3. Cast; form; shape; character. Crowned with an architrave of antique mold. Pope. 4. (Arch.)  A group of moldings; as, the arch mold of a porch or doorway; the pier mold of a Gothic pier, meaning the whole profile, section, or combination of parts. 5. (Anat.)  A fontanel. 6. (Paper Making)  A frame with a wire cloth bottom, on which the pump is drained to form a sheet, in making paper by hand.\n\n1. To form into a particular shape; to shape; to model; to fashion. He forgeth and moldeth metals. Sir M. Hale. Did I request thee, Maker, from my clay To mold me man Milton. 2. To ornament by molding or carving the material of; as, a molded window jamb. 3. To knead; as, to mold dough or bread. 4. (Founding)  To form a mold of, as in sand, in which a casting may be made."}