{"word":"monkey","definition":"1. (Zoöl.) (a) In the most general sense, any one of the Quadrumana, including apes, baboons, and lemurs. (b) Any species of Quadrumana, except the lemurs. (c) Any one of numerous species of Quadrumana (esp. such as have a long tail and prehensile feet) exclusive of apes and baboons. Note: The monkeys are often divided into three groups: (a) Catarrhines, or Simidæ. These have an oblong head, with the oblique flat nostrils near together. Some have no tail, as the apes. All these are natives of the Old World. (b) Platyrhines, or Cebidæ. These have a round head, with a broad nasal septum, so that the nostrils are wide apart and directed downward. The tail is often prehensile, and the thumb is short and not opposable. These are natives of the New World. (c) Strepsorhines, or Lemuroidea. These have a pointed head with curved nostrils. They are natives of Southern Asia, Africa, and Madagascar. 2. A term of disapproval, ridicule, or contempt, as for mischievous child. This is the monkey's own giving out; she is persuaded I will marry her. Shak. 3. The weight or hammer of a pile driver, that is, a very heavy mass of iron, which, being raised on high, falls on the head of the pile, and drives it into the earth; the falling weight of a drop hammer used in forging. 4. A small trading vessel of the sixteenth century. Monkey boat. (Naut.) (a) A small boat used in docks. (b) A half-decked boat used on the River Thames. -- Monkey block (Naut.), a small single block strapped with a swivel. R. H. Dana, Jr. -- Monkey flower (Bot.), a plant of the genus Mimulus; -- so called from the appearance of its gaping corolla. Gray. -- Monkey gaff (Naut.), a light gaff attached to the topmast for the better display of signals at sea. -- Monkey jacket, a short closely fitting jacket, worn by sailors. -- Monkey rail (Naut.), a second and lighter rail raised about six inches above the quarter rail of a ship. -- Monkey shine, monkey trick. [Slang, U.S.] -- Monkey trick, a mischievous prank. Saintsbury. -- Monkey wheel. See Gin block, under 5th Gin. -- Monkey wrench, a wrench or spanner having a movable jaw.\n\nTo act or treat as a monkey does; to ape; to act in a grotesque or meddlesome manner. To monkey with, to handle in a meddlesome manner. [Colloq.]"}