{"word":"moral","definition":"1. Relating to duty or obligation; pertaining to those intentions and actions of which right and wrong, virtue and vice, are predicated, or to the rules by which such intentions and actions ought to be directed; relating to the practice, manners, or conduct of men as social beings in relation to each other, as respects right and wrong, so far as they are properly subject to rules. Keep at the least within the compass of moral actions, which have in them vice or virtue. Hooker. Mankind is broken loose from moral bands. Dryden. She had wandered without rule or guidance in a moral wilderness. Hawthorne. 2. Conformed to accepted rules of right; acting in conformity with such rules; virtuous; just; as, a moral man. Used sometimes in distinction from religious; as, a moral rather than a religious life. The wiser and more moral part of mankind. Sir M. Hale. 3. Capable of right and wrong action or of being governed by a sense of right; subject to the law of duty. A moral agent is a being capable of those actions that have a moral quality, and which can properly be denominated good or evil in a moral sense. J. Edwards. 4. Acting upon or through one's moral nature or sense of right, or suited to act in such a manner; as, a moral arguments; moral considerations. Sometimes opposed to material and physical; as, moral pressure or support. 5. Supported by reason or probability; practically sufficient; -- opposed to legal or demonstrable; as, a moral evidence; a moral certainty. 6. Serving to teach or convey a moral; as, a moral lesson; moral tales. Moral agent, a being who is capable of acting with reference to right and wrong. -- Moral certainty, a very high degree or probability, although not demonstrable as a certainty; a probability of so high a degree that it can be confidently acted upon in the affairs of life; as, there is a moral certainty of his guilt. -- Moral insanity, insanity, so called, of the moral system; badness alleged to be irresponsible. -- Moral philosophy, the science of duty; the science which treats of the nature and condition of man as a moral being, of the duties which result from his moral relations, and the reasons on which they are founded. -- Moral play, an allegorical play; a morality. [Obs.] -- Moral sense, the power of moral judgment and feeling; the capacity to perceive what is right or wrong in moral conduct, and to approve or disapprove, independently of education or the knowledge of any positive rule or law. -- Moral theology, theology applied to morals; practical theology; casuistry.\n\n1. The doctrine or practice of the duties of life; manner of living as regards right and wrong; conduct; behavior; -- usually in the plural. Corrupt in their morals as vice could make them. South. 2. The inner meaning or significance of a fable, a narrative, an occurrence, an experience, etc.; the practical lesson which anything is designed or fitted to teach; the doctrine meant to be inculcated by a fiction; a maxim. Thus may we gather honey from the weed, And make a moral of the devil himself. Shak. To point a moral, or adorn a tale. Johnson. We protest against the principle that the world of pure comedy is one into which no moral enters. Macaulay. 3. A morality play. See Morality, 5.\n\nTo moralize. [Obs.] Shak."}