{"word":"moss","definition":"1. (Bot.)  A cryptogamous plant of a cellular structure, with distinct stem and simple leaves. The fruit is a small capsule usually opening by an apical lid, and so discharging the spores. There are many species, collectively termed Musci, growing on the earth, on rocks, and trunks of trees, etc., and a few in running water. Note: The term moss is also popularly applied to many other small cryptogamic plants, particularly lichens, species of which are called tree moss, rock moss, coral moss, etc. Fir moss and club moss are of the genus Lycopodium. See Club moss, under Club, and Lycopodium. 2. A bog; a morass; a place containing peat; as, the mosses of the Scottish border. Note: Moss is used with participles in the composition of words which need no special explanation; as, moss-capped, moss-clad, moss- covered, moss-grown, etc. Black moss. See under Black, and Tillandsia. -- Bog moss. See Sphagnum. -- Feather moss, any moss branched in a feathery manner, esp. several species of the genus Hypnum. -- Florida moss, Long moss, or Spanish moss. See Tillandsia. -- Iceland moss, a lichen. See Iceland Moss. -- Irish moss, a seaweed. See Carrageen. -- Moss agate (Min.), a variety of agate, containing brown, black, or green mosslike or dendritic markings, due in part to oxide of manganese. Called also Mocha stone. -- Moss animal (Zoöl.), a bryozoan. -- Moss berry (Bot.), the small cranberry (Vaccinium Oxycoccus). -- Moss campion (Bot.), a kind of mosslike catchfly (Silene acaulis), with mostly purplish flowers, found on the highest mountains of Europe and America, and within the Arctic circle. -- Moss land, land produced accumulation of aquatic plants, forming peat bogs of more or less consistency, as the water is grained off or retained in its pores. -- Moss pink (Bot.), a plant of the genus Phlox (P. subulata), growing in patches on dry rocky hills in the Middle United States, and often cultivated for its handsome flowers. Gray. -- Moss rose (Bot.), a variety of rose having a mosslike growth on the stalk and calyx. It is said to be derived from the Provence rose. -- Moss rush (Bot.), a rush of the genus Juncus (J. squarrosus). -- Scale moss. See Hepatica.\n\nTo cover or overgrow with moss. An oak whose boughs were mossed with age. Shak."}