{"word":"mother","definition":"1. A female parent; especially, one of the human race; a woman who has borne a child. 2. That which has produced or nurtured anything; source of birth or origin; generatrix. Alas! poor country! ... it can not Be called our mother, but our grave. Shak. I behold ... the solitary majesty of Crete, mother of a religion, it is said, that lived two thousand years. Landor. 3. An old woman or matron. [Familiar] 4. The female superior or head of a religious house, as an abbess, etc. 5. Hysterical passion; hysteria. [Obs.] Shak. Mother Carey's chicken (Zoöl.), any one of several species of small petrels, as the stormy petrel (Procellaria pelagica), and Leach's petrel (Oceanodroma leucorhoa), both of the Atlantic, and O. furcata of the North Pacific. -- Mother Carey's goose (Zoöl.), the giant fulmar of the Pacific. See Fulmar. -- Mother's mark (Med.), a congenital mark upon the body; a nævus.\n\nReceived by birth or from ancestors; native, natural; as, mother language; also acting the part, or having the place of a mother; producing others; originating. It is the mother falsehood from which all idolatry is derived. T. Arnold. Mother cell (Biol.), a cell which, by endogenous divisions, gives rise to other cells (daughter cells); a parent cell. -- Mother church, the original church; a church from which other churches have sprung; as, the mother church of a diocese. -- Mother country, the country of one's parents or ancestors; the country from which the people of a colony derive their origin. -- Mother liquor (Chem.), the impure or complex residual solution which remains after the salts readily or regularly crystallizing have been removed. -- Mother queen, the mother of a reigning sovereign; a queen mother. -- Mother tongue. (a) A language from which another language has had its origin. (b) The language of one's native land; native tongue. -- Mother water. See Mother liquor (above). -- Mother wit, natural or native wit or intelligence.\n\nTo adopt as a son or daughter; to perform the duties of a mother to. The queen, to have put lady Elizabeth besides the crown, would have mothered another body's child. Howell.\n\nA film or membrane which is developed on the surface of fermented alcoholic liquids, such as vinegar, wine, etc., and acts as a means of conveying the oxygen of the air to the alcohol and other combustible principles of the liquid, thus leading to their oxidation. Note: The film is composed of a mass of rapidly developing microörganisms of the genus Mycoderma, and in the mother of vinegar the microörganisms (Mycoderma aceti) composing the film are the active agents in the Conversion of the alcohol into vinegar. When thickened by growth, the film may settle to the bottom of the fluid. See Acetous fermentation, under Fermentation.\n\nTo become like, or full of, mother, or thick matter, as vinegar."}