{"word":"motion","definition":"1. The act, process, or state of changing place or position; movement; the passing of a body from one place or position to another, whether voluntary or involuntary; -- opposed to rest. Speaking or mute, all comeliness and grace attends thee, and each word, each motion, forms. Milton. 2. Power of, or capacity for, motion. Devoid of sense and motion. Milton. 3. Direction of movement; course; tendency; as, the motion of the planets is from west to east. In our proper motion we ascend. Milton. 4. Change in the relative position of the parts of anything; action of a machine with respect to the relative movement of its parts. This is the great wheel to which the clock owes its motion. Dr. H. More. 5. Movement of the mind, desires, or passions; mental act, or impulse to any action; internal activity. Let a good man obey every good motion rising in his heart, knowing that every such motion proceeds from God. South. 6. A proposal or suggestion looking to action or progress; esp., a formal proposal made in a deliberative assembly; as, a motion to adjourn. Yes, I agree, and thank you for your motion. Shak. 7. (Law)  An application made to a court or judge orally in open court. Its object is to obtain an order or rule directing some act to be done in favor of the applicant. Mozley & W. 8. (Mus.)  Change of pitch in successive sounds, whether in the same part or in groups of parts. The independent motions of different parts sounding together constitute counterpoint. Grove. Note: Conjunct motion is that by single degrees of the scale. Contrary motion is that when parts move in opposite directions. Disjunct motion is motion by skips. Oblique motion is that when one part is stationary while another moves. Similar or direct motion is that when parts move in the same direction. 9. A puppet show or puppet. [Obs.] What motion's this the model of Nineveh Beau. & Fl. Note: Motion, in mechanics, may be simple or compound. Simple motions are: (a) straight translation, which, if of indefinite duration, must be reciprocating. (b) Simple rotation, which may be either continuous or reciprocating, and when reciprocating is called oscillating. (c) Helical, which, if of indefinite duration, must be reciprocating. Compound motion consists of combinations of any of the simple motions. Center of motion, Harmonic motion, etc. See under Center, Harmonic, etc. -- Motion block (Steam Engine), a crosshead. -- Perpetual motion (Mech.), an incessant motion conceived to be attainable by a machine supplying its own motive forces independently of any action from without. Syn. -- See Movement.\n\n1. To make a significant movement or gesture, as with the hand; as, to motion to one to take a seat. 2. To make proposal; to offer plans. [Obs.] Shak.\n\n1. To direct or invite by a motion, as of the hand or head; as, to motion one to a seat. 2. To propose; to move. [Obs.] I want friends to motion such a matter. Burton."}