{"word":"mountain","definition":"1. A large mass of earth and rock, rising above the common level of the earth or adjacent land; earth and rock forming an isolated peak or a ridge; an eminence higher than a hill; a mount. 2. pl.  A range, chain, or group of such elevations; as, the White Mountains. 3. A mountainlike mass; something of great bulk. I should have been a mountain of mummy. Shak. The Mountain (La montagne) (French Hist.), a popular name given in 1793 to a party of extreme Jacobins in the National Convention, who occupied the highest rows of seats.\n\n1. Of or pertaining to a mountain or mountains; growing or living on a mountain; found on or peculiar to mountains; among mountains; as, a mountain torrent; mountain pines; mountain goats; mountain air; mountain howitzer. 2. Like a mountain; mountainous; vast; very great. The high, the mountain majesty of worth. Byron. Mountain anthelope (Zoöl.), the goral. -- Mountain ash (Bot.), an ornamental tree, the Pyrus (Sorbus) Americana, producing beautiful bunches of red berries. Its leaves are pinnate, and its flowers white, growing in fragrant clusters. The European species is the P. aucuparia, or rowan tree. -- Mountain barometer, a portable barometer, adapted for safe transportation, used in measuring the heights of mountains. -- Mountain beaver (Zoöl.), the sewellel. -- Mountain blue (Min.), blue carbonate of copper; azurite. -- Mountain cat (Zoöl.), the catamount. See Catamount. -- Mountain chain, a series of contiguous mountain ranges, generally in parallel or consecutive lines or curves. -- Mountain cock (Zoöl.), capercailzie. See Capercailzie. -- Mountain cork (Min.), a variety of asbestus, resembling cork in its texture. -- Mountain crystal. See under Crystal. -- Mountain damson (Bot.), a large tree of the genus Simaruba (S. amarga) growing in the West Indies, which affords a bitter tonic and astringent, sometimes used in medicine. -- Mountain dew, Scotch whisky, so called because often illicitly distilled among the mountains. [Humorous] -- Mountain ebony (Bot.), a small leguminous tree (Bauhinia variegata) of the East and West Indies; -- so called because of its dark wood. The bark is used medicinally and in tanning. -- Mountain flax (Min.), a variety of asbestus, having very fine fibers; amianthus. See Amianthus. -- Mountain fringe (Bot.), climbing fumitory. See under Fumitory. -- Mountain goat. (Zoöl.) See Mazama. -- Mountain green. (Min.) (a) Green malachite, or carbonate of copper. (b) See Green earth, under Green, a. -- Mountain holly (Bot.), a branching shrub (Nemopanthes Canadensis), having smooth oblong leaves and red berries. It is found in the Northern United States. -- Mountain laurel (Bot.), an American shrub (Kalmia latifolia) with glossy evergreen leaves and showy clusters of rose-colored or white flowers. The foliage is poisonous. Called also American laurel, ivy bush, and calico bush. See Kalmia. -- Mountain leather (Min.), a variety of asbestus, resembling leather in its texture. -- Mountain licorice (Bot.), a plant of the genus Trifolium (T. Alpinum). -- Mountain limestone (Geol.), a series of marine limestone strata below the coal measures, and above the old red standstone of Great Britain. See Chart of Geology. -- Mountain linnet (Zoöl.), the twite. -- Mountain magpie. (Zoöl.) (a) The yaffle, or green woodpecker. (b) The European gray shrike. -- Mountain mahogany (Bot.) See under Mahogany. -- Mountain meal (Min.), a light powdery variety of calcite, occurring as an efflorescence. -- Mountain milk (Min.), a soft spongy variety of carbonate of lime. -- Mountain mint. (Bot.) See Mint. -- Mountain ousel (Zoöl.), the ring ousel; -- called also mountain thrush and mountain colley. See Ousel. -- Mountain pride, or Mountain green (Bot.), a tree of Jamaica (Spathelia simplex), which has an unbranched palmlike stem, and a terminal cluster of large, pinnate leaves. -- Mountain quail (Zoöl.), the plumed partridge (Oreortyx pictus) of California. It has two long, slender, plumelike feathers on the head. The throat and sides are chestnut; the belly is brown with transverse bars of black and white; the neck and breast are dark gray. -- Mountain range, a series of mountains closely related in position and direction. -- Mountain rice. (Bot.) (a) An upland variety of rice, grown without irrigation, in some parts of Asia, Europe, and the United States. (b) An American genus of grasses (Oryzopsis). -- Mountain rose (Bot.), a species of rose with solitary flowers, growing in the mountains of Europe (Rosa alpina). -- Mountain soap (Min.), a soft earthy mineral, of a brownish color, used in crayon painting; saxonite. -- Mountain sorrel (Bot.), a low perennial plant (Oxyria digyna with rounded kidney-form leaves, and small greenish flowers, found in the White Mountains of New Hampshire, and in high northern latitudes. Gray. -- Mountain sparrow (Zoöl.), the European tree sparrow. -- Mountain spinach. (Bot.) See Orach. -- Mountain tobacco (Bot.), a composite plant (Arnica montana) of Europe; called also leopard's bane. -- Mountain witch (Zoöl.), a ground pigeon of Jamaica, of the genus Geotrygon."}