{"word":"mount","definition":"1. A mass of earth, or earth and rock, rising considerably above the common surface of the surrounding land; a mountain; a high hill; -- used always instead of mountain, when put before a proper name; as, Mount Washington; otherwise, chiefly in poetry. 2. A bulwark for offense or defense; a mound. [Obs.] Hew ye down trees, and cast a mount against Jerusalem. Jer. vi. 6. 3. Etym: [See Mont de piété.]  A bank; a fund. Mount of piety. See Mont de piété.\n\n1. To rise on high; to go up; to be upraised or uplifted; to tower aloft; to ascend; -- often with up. Though Babylon should mount up to heaven. Jer. li. 53. The fire of trees and houses mounts on high. Cowley. 2. To get up on anything, as a platform or scaffold; especially, to seat one's self on a horse for riding. 3. To attain in value; to amount. Bring then these blessings to a strict account, Make fair deductions, see to what they mount. Pope.\n\n1. To get upon; to ascend; to climb. Shall we mount again the rural throne Dryden. 2. To place one's self on, as a horse or other animal, or anything that one sits upon; to bestride. 3. To cause to mount; to put on horseback; to furnish with animals for riding; to furnish with horses. \"To mount the Trojan troop.\" Dryden. 4. Hence: To put upon anything that sustains and fits for use, as a gun on a carriage, a map or picture on cloth or paper; to prepare for being worn or otherwise used, as a diamond by setting, or a sword blade by adding the hilt, scabbard, etc. 5. To raise aloft; to lift on high. What power is it which mounts my love so high Shak. Note: A fort or ship is said to mount cannon, when it has them arranged for use in or about it. To mount guard (Mil.), to go on guard; to march on guard; to do duty as a guard. -- To mount a play, to prepare and arrange the scenery, furniture, etc., used in the play.\n\nThat upon which a person or thing is mounted, as: (a) A horse. She had so good a seat and hand, she might be trusted with any mount. G. Eliot. (b) The cardboard or cloth on which a drawing, photograph, or the like is mounted; a mounting."}