{"word":"move","definition":"1. To cause to change place or posture in any manner; to set in motion; to carry, convey, draw, or push from one place to another; to impel; to stir; as, the wind moves a vessel; the horse moves a carriage. 2. (Chess, Checkers, etc.)  To transfer (a piece or man) from one space or position to another, according to the rules of the game; as, to move a king. 3. To excite to action by the presentation of motives; to rouse by representation, persuasion, or appeal; to influence. Minds desirous of revenge were not moved with gold. Knolles. No female arts his mind could move. Dryden. 4. To arouse the feelings or passions of; especially, to excite to tenderness or compassion; to touch pathetically; to excite, as an emotion. Shak. When he saw the multitudes, he was moved with compassion on them. Matt. ix. 36. [The use of images] in orations and poetry is to move pity or terror. Felton. 5. To propose; to recommend; specifically, to propose formally for consideration and determination, in a deliberative assembly; to submit, as a resolution to be adopted; as, to move to adjourn. Let me but move one question to your daughter. Shak. They are to be blamed alike who move and who decline war upon particular respects. Hayward. 6. To apply to, as for aid. [Obs.] Shak. Syn. -- To stir; agitate; trouble; affect; persuade; influence; actuate; impel; rouse; prompt; instigate; incite; induce; incline; propose; offer.\n\n1. To change place or posture; to stir; to go, in any manner, from one place or position to another; as, a ship moves rapidly. The foundations also of the hills moved and were shaken, because he was wroth. Ps. xviii. 7. On the green bank I sat and listened long, ... Nor till her lay was ended could I move. Dryden. 2. To act; to take action; to stir; to begin to act; as, to move in a matter. 3. To change residence; to remove, as from one house, town, or state, to another. 4. (Chess, Checkers, etc.)  To change the place of a piece in accordance with the rules of the game.\n\n1. The act of moving; a movement. 2. (Chess, Checkers, etc.)  The act of moving one of the pieces, from one position to another, in the progress of the game. 3. An act for the attainment of an object; a step in the execution of a plan or purpose. To make a move. (a) To take some action. (b) To move a piece, as in a game. -- To be on the move, to bustle or stir about. [Colloq.]"}