{"word":"music","definition":"1. The science and the art of tones, or musical sounds, i.e., sounds of higher or lower pitch, begotten of uniform and synchronous vibrations, as of a string at various degrees of tension; the science of harmonical tones which treats of the principles of harmony, or the properties, dependences, and relations of tones to each other; the art of combining tones in a manner to please the ear. Note: Not all sounds are tones. Sounds may be unmusical and yet please the ear. Music deals with tones, and with no other sounds. See Tone. 2. (a) Melody; a rhythmical and otherwise agreeable succession of tones. (b) Harmony; an accordant combination of simultaneous tones. 3. The written and printed notation of a musical composition; the score. 4. Love of music; capacity of enjoying music. The man that hath ni music in himself Nor is not moved with concord of sweet sounds, Is fit for treasons, stratagems, and spoils. Shak. 5. (Zoöl.)  A more or less musical sound made by many of the lower animals. See Stridulation. Magic music, a game in which a person is guided in finding a hidden article, or in doing a specific art required, by music which is made more loud or rapid as he approaches success, and slower as he recedes. Tennyson. -- Music box. See Musical box, under Musical. -- Music hall, a place for public musical entertainments. -- Music loft, a gallery for musicians, as in a dancing room or a church. -- Music of the spheres, the harmony supposed to be produced by the accordant movement of the celestial spheres. -- Music paper, paper ruled with the musical staff, for the use of composers and copyists. -- Music pen, a pen for ruling at one time the five lines of the musical staff. -- Music shell (Zoöl.), a handsomely colored marine gastropod shell (Voluta musica) found in the East Indies; -- so called because the color markings often resemble printed music. Sometimes applied to other shells similarly marked. -- To face the music, to meet any disagreeable necessity without flinching. [Colloq. or Slang]"}