{"word":"nail","definition":"1. (Anat.)  the horny scale of plate of epidermis at the end of the fingers and toes of man and many apes. His nayles like a briddes claws were. Chaucer. Note: The nails are strictly homologous with hoofs and claws. When compressed, curved, and pointed, they are called talons or claws, and the animal bearing them is said to be unguiculate; when they incase the extremities of the digits they are called hoofs, and the animal is ungulate. 2. (Zoöl.) (a) The basal thickened portion of the anterior wings of certain hemiptera. (b) The terminal horny plate on the beak of ducks, and other allied birds. 3. A slender, pointed piece of metal, usually with a head, used for fastening pieces of wood or other material together, by being driven into or through them. Note: The different sorts of nails are named either from the use to which they are applied, from their shape, from their size, or from some other characteristic, as shingle, floor, ship-carpenters', and horseshoe nails, roseheads, diamonds, fourpenny, tenpenny (see Penny), chiselpointed, cut, wrought, or wire nails, etc. 4. A measure of length, being two inches and a quarter, or the sixteenth of a yard. Nail ball (Ordnance), a round projectile with an iron bolt protruding to prevent it from turning in the gun. -- Nail plate, iron in plates from which cut nails are made. -- On the nail, in hand; on the spot; immediately; without delay or time of credit; as, to pay money on the nail. \"You shall have ten thousand pounds on the nail.\" Beaconsfield. -- To hit the nail on the head, to hit most effectively; to do or say a thing in the right way.\n\n1. To fasten with a nail or nails; to close up or secure by means of nails; as, to nail boards to the beams. He is now dead, and nailed in his chest. Chaucer. 2. To stud or boss with nails, or as with nails. The rivets of your arms were nailed with gold. Dryden. 3. To fasten, as with a nail; to bind or hold, as to a bargain or to acquiescence in an argument or assertion; hence, to catch; to trap. When they came to talk of places in town, you saw at once how I nailed them. Goldsmith. 4. To spike, as a cannon. [Obs.] Crabb. To nail a lie or an assertion, etc., to detect and expose it, so as to put a stop to its currency; -- an expression probably derived from the former practice of shopkeepers, who were accustomed to nail bad or counterfeit pieces of money to the counter."}