{"word":"name","definition":"1. The title by which any person or thing is known or designated; a distinctive specific appellation, whether of an individual or a class. Whatsoever Adam called every living creature, that was the name thereof. Gen. ii. 19. What's in a name That which we call a rose By any other name would smell as sweet. Shak. 2. A descriptive or qualifying appellation given to a person or thing, on account of a character or acts. His name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace. Is. ix. 6. 3. Reputed character; reputation, good or bad; estimation; fame; especially, illustrious character or fame; honorable estimation; distinction. What men of name resort to him Shak. Far above ... every name that is named, not only in this world, but also in that which is to come. Eph. i. 21. I will get me a name and honor in the kingdom. 1 Macc. iii. 14. He hath brought up an evil name upon a virgin. Deut. xxii. 19. The king's army ...had left no good name behind. Clarendon. 4. Those of a certain name; a race; a family. The ministers of the republic, mortal enemies of his name, came every day to pay their feigned civilities. Motley. 5. A person, an individual. [Poetic] They list with women each degenerate name. Dryden. Christian name. (a) The name a person receives at baptism, as distinguished from surname; baptismal name. (b) A given name, whether received at baptism or not. -- Given name. See under Given. -- In name, in profession, or by title only; not in reality; as, a friend in name. -- In the name of. (a) In behalf of; by the authority of. \" I charge you in the duke's name to obey me.\" Shak. (b) In the represented or assumed character of. \" I'll to him again in name of Brook.\" Shak. -- Name plate, a plate as of metal, glass, etc., having a name upon it, as a sign; a doorplate. -- Pen name, a name assumed by an author; a pseudonym or nom de plume. Bayard Taylor. -- Proper name (Gram.), a name applied to a particular person, place, or thing. -- To call names, to apply opprobrious epithets to; to call by reproachful appellations. -- To take a name in vain, to use a name lightly or profanely; to use a name in making flippant or dishonest oaths. Ex. xx. 7. Syn. -- Appellation; title; designation; cognomen; denomination; epithet. -- Name, Appellation, Title, Denomination. Name is generic, denoting that combination of sounds or letters by which a person or thing is known and distinguished. Appellation, although sometimes put for name simply, denotes, more properly, a descriptive term, used by way of marking some individual peculiarity or characteristic; as, Charles the Bold, Philip the Stammerer. A title is a term employed to point out one's rank, office, etc.; as, the Duke of Bedford, Paul the Apostle, etc. Denomination is to particular bodies what appellation is to individuals; thus, the church of Christ is divided into different denominations, as Congregationalists, Episcopalians, Presbyterians, etc.\n\n1. To give a distinctive name or appellation to; to entitle; to denominate; to style; to call. She named the child Ichabod. 1 Sam. iv. 21. Thus was the building left Ridiculous, and the work Confusion named. Milton. 2. To mention by name; to utter or publish the name of; to refer to by distinctive title; to mention. None named thee but to praise. Halleck. Old Yew, which graspest at the stones That name the underlying dead. Tennyson. 3. To designate by name or specifically for any purpose; to nominate; to specify; to appoint; as, to name a day for the wedding. Whom late you have named for consul. Shak. 4. (House of Commons)  To designate (a member) by name, as the Speaker does by way of reprimand. Syn. -- To denominate; style; term; call; mention; specify; designate; nominate."}