{"word":"narrow","definition":"1. Of little breadth; not wide or broad; having little distance from side to side; as, a narrow board; a narrow street; a narrow hem. Hath passed in safety through the narrow seas. Shak. 2. Of little extent; very limited; circumscribed. The Jews were but a small nation, and confined to a narrow compass in the world. Bp. Wilkins. 3. Having but a little margin; having barely sufficient space, time, or number, etc.; close; near; -- with special reference to some peril or misfortune; as, a narrow shot; a narrow escape; a narrow majority. Dryden. 4. Limited as to means; straitened; pinching; as, narrow circumstances. 5. Contracted; of limited scope; illiberal; bigoted; as, a narrow mind; narrow views. \"A narrow understanding.\" Macaulay. 6. Parsimonious; niggardly; covetous; selfish. A very narrow and stinted charity. Smalridge. 7. Scrutinizing in detail; close; accurate; exact. But first with narrow search I must walk round This garden, and no corner leave unspied. Milton. 8. (Phon.)  Formed (as a vowel) by a close position of some part of the tongue in relation to the palate; or (according to Bell) by a tense condition of the pharynx; -- distinguished from wide; as e (eve) and oo (food), etc., from ì (ìll) and oo (foot), etc. See Guide to Pronunciation, § 13. Note: Narrow is not unfrequently prefixed to words, especially to participles and adjectives, forming compounds of obvious signification; as, narrow-bordered, narrow-brimmed, narrow-breasted, narrow-edged, narrow-faced, narrow-headed, narrow-leaved, narrow- pointed, narrow-souled, narrow-sphered, etc. Narrow gauge. (Railroad) See Note under Gauge, n., 6.\n\nA narrow passage; esp., a contracted part of a stream, lake, or sea; a strait connecting two bodies of water; -- usually in the plural; as, The Narrows of New York harbor. Near the island lay on one side the jaws of a dangerous narrow. Gladstone.\n\n1. To lessen the breadth of; to contract; to draw into a smaller compass; to reduce the width or extent of. Sir W. Temple. 2. To contract the reach or sphere of; to make less liberal or more selfish; to limit; to confine; to restrict; as, to narrow one's views or knowledge; to narrow a question in discussion. Our knowledge is much more narrowed if we confine ourselves to our own solitary reasonings. I. Watts. 3. (Knitting)  To contract the size of, as a stocking, by taking two stitches into one.\n\n1. To become less broad; to contract; to become narrower; as, the sea narrows into a strait. 2. (Man.)  Not to step out enough to the one hand or the other; as, a horse narrows. Farrier's Dict. 3. (Knitting)  To contract the size of a stocking or other knit article, by taking two stitches into one."}