{"word":"nature","definition":"1. The existing system of things; the world of matter, or of matter and mind; the creation; the universe. But looks through nature up to nature's God. Pope. Nature has caprices which art can not imitate. Macaulay. 2. The personified sum and order of causes and effects; the powers which produce existing phenomena, whether in the total or in detail; the agencies which carry on the processes of creation or of being; -- often conceived of as a single and separate entity, embodying the total of all finite agencies and forces as disconnected from a creating or ordering intelligence. I oft admire How Nature, wise and frugal, could commit Such disproportions. Milton. 3. The established or regular course of things; usual order of events; connection of cause and effect. 4. Conformity to that which is natural, as distinguished from that which is artifical, or forced, or remote from actual experience. One touch of nature makes the whole world kin. Shak. 5. The sum of qualities and attributes which make a person or thing what it is, as distinct from others; native character; inherent or essential qualities or attributes; peculiar constitution or quality of being. Thou, therefore, whom thou only canst redeem, Their nature also to thy nature join, And be thyself man among men on earth. Milton. 6. Hence: Kind, sort; character; quality. A dispute of this nature caused mischief. Dryden. 7. Physical constitution or existence; the vital powers; the natural life. \"My days of nature.\" Shak. Oppressed nature sleeps. Shak. 8. Natural affection or reverence. Have we not seen The murdering son ascend his parent's bed, Through violated nature foce his way Pope. 9. Constitution or quality of mind or character. A born devil, on whose nature Nurture can never stick. Shak. That reverence which is due to a superior nature. Addison. Good nature, Ill nature. see under Good and Ill. -- In a state of nature. (a) Naked as when born; nude. (b) In a condition of sin; unregenerate. (c) Untamed; uncvilized. -- Nature printng, a process of printing from metallic or other plates which have received an impression, as by heavy pressure, of an object such as a leaf, lace, or the like. -- Nature worship, the worship of the personified powers of nature. -- To pay the debt of nature, to die.\n\nTo endow with natural qualities. [Obs.] He [God] which natureth every kind. Gower."}