{"word":"natural","definition":"1. Fixed or determined by nature; pertaining to the constitution of a thing; belonging to native character; according to nature; essential; characteristic; not artifical, foreign, assumed, put on, or acquired; as, the natural growth of animals or plants; the natural motion of a gravitating body; natural strength or disposition; the natural heat of the body; natural color. With strong natural sense, and rare force of will. Macaulay. 2. Conformed to the order, laws, or actual facts, of nature; consonant to the methods of nature; according to the stated course of things, or in accordance with the laws which govern events, feelings, etc.; not exceptional or violent; legitimate; normal; regular; as, the natural consequence of crime; a natural death. What can be more natural than the circumstances in the behavior of those women who had lost their husbands on this fatal day Addison. 3. Having to do with existing system to things; dealing with, or derived from, the creation, or the world of matter and mind, as known by man; within the scope of human reason or experience; not supernatural; as, a natural law; natural science; history, theology. I call that natural religion which men might know ... by the mere principles of reason, improved by consideration and experience, without the help of revelation. Bp. Wilkins. 4. Conformed to truth or reality; as: (a) Springing from true sentiment; not artifical or exaggerated; -- said of action, delivery, etc.; as, a natural gesture, tone, etc. (b) Resembling the object imitated; true to nature; according to the life; -- said of anything copied or imitated; as, a portrait is natural. 5. Having the character or sentiments properly belonging to one's position; not unnatural in feelings. To leave his wife, to leave his babes, ... He wants the natural touch. Shak. 6. Connected by the ties of consanguinity. \"Natural friends.\" J. H. Newman. 7. Begotten without the sanction of law; born out of wedlock; illegitimate; bastard; as, a natural child. 8. Of or pertaining to the lower or animal nature, as contrasted with the higher or moral powers, or that which is spiritual; being in a state of nature; unregenerate. The natural man receiveth not the things of the Spirit of God. 1 Cor. ii. 14. 9. (Math.)  Belonging to, to be taken in, or referred to, some system, in which the base is 1; -- said or certain functions or numbers; as, natural numbers, those commencing at 1; natural sines, cosines, etc., those taken in arcs whose radii are 1. 10. (Mus.) (a) Produced by natural organs, as those of the human throat, in distinction from instrumental music. (b) of or pertaining to a key which has neither a flat nor a sharp for its signature, as the key of C major. (c) Applied to an air or modulation of harmony which moves by easy and smooth transitions, digressing but little from the original key. Moore (Encyc. of Music). Natural day, the space of twenty-four hours. Chaucer. -- Natural fats, Natural gas, etc. See under Fat, Gas. etc. -- Natural Harmony (Mus.), the harmony of the triad or common chord. -- Natural history, in its broadest sense, a history or description of nature as a whole, incuding the sciences of botany, zoölogy, geology, mineralogy, paleontology, chemistry, and physics. In recent usage the term is often restricted to the sciences of botany and zoölogy collectively, and sometimes to the science of zoology alone. -- Natural law, that instinctive sense of justice and of right and wrong, which is native in mankind, as distinguished from specifically revealed divine law, and formulated human law. -- Natural modulation (Mus.), transition from one key to its relative keys. -- Natural order. (Nat. Hist.) See under order. -- Natural person. (Law) See under person, n. -- Natural philosophy, originally, the study of nature in general; in modern usage, that branch of physical science, commonly called physics, which treats of the phenomena and laws of matter and considers those effects only which are unaccompanied by any change of a chemical nature; -- contrasted with mental and moral philosophy. -- Natural scale (Mus.), a scale which is written without flats or sharps. Model would be a preferable term, as less likely to mislead, the so-called artificial scales (scales represented by the use of flats and sharps) being equally natural with the so-called natural scale -- Natural science, natural history, in its broadest sense; -- used especially in contradistinction to mental or moral science. -- Natural selection (Biol.), a supposed operation of natural laws analogous, in its operation and results, to designed selection in breeding plants and animals, and resulting in the survival of the fittest. The theory of natural selection supposes that this has been brought about mainly by gradual changes of environment which have led to corresponding changes of structure, and that those forms which have become so modified as to be best adapted to the changed environment have tended to survive and leave similarly adapted descendants, while those less perfectly adapted have tended to die out though lack of fitness for the environment, thus resulting in the survival of the fittest. See Darwinism. -- Natural system (Bot. & Zoöl.), a classification based upon real affinities, as shown in the structure of all parts of the organisms, and by their embryology. It should be borne in mind that the natural system of botany is natural only in the constitution of its genera, tribes, orders, etc., and in its grand divisions. Gray. -- Natural theology, or Natural religion, that part of theological science which treats of those evidences of the existence and attributes of the Supreme Being which are exhibited in nature; -- distinguished from revealed religion. See Quotation under Natural, a., 3. -- Natural vowel, the vowel sound heard in urn, furl, sir, her, etc.; -- so called as being uttered in the easiest open position of the mouth organs. See Neutral vowel, under Neutral and Guide to Pronunciation, § 17. Syn. -- See Native.\n\n1. A native; an aboriginal. [Obs.] Sir W. Raleigh. 2. pl.  Natural gifts, impulses, etc. [Obs.] Fuller. 3. One born without the usual powers of reason or understanding; an idiot. \"The minds of naturals.\" Locke. 4. (Mus.)  A character [] used to contradict, or to remove the effect of, a sharp or flat which has preceded it, and to restore the unaltered note."}