{"word":"neck","definition":"1. The part of an animal which connects the head and the trunk, and which, in man and many other animals, is more slender than the trunk. 2. Any part of an inanimate object corresponding to or resembling the neck of an animal; as: (a) The long slender part of a vessel, as a retort, or of a fruit, as a gourd. (b) A long narrow tract of land projecting from the main body, or a narrow tract connecting two larger tracts. (c) (Mus.) That part of a violin, guitar, or similar instrument, which extends from the head to the body, and on which is the finger board or fret board. 3. (Mech.)  A reduction in size near the end of an object, formed by a groove around it; as, a neck forming the journal of a shaft. 4. (Bot.)  the point where the base of the stem of a plant arises from the root. Neck and crop, completely; wholly; altogether; roughly and at once. [Colloq.] -- Neck and neck (Racing), so nearly equal that one cannot be said to be before the other; very close; even; side by side. -- Neck of a capital. (Arch.) See Gorgerin. -- Neck of a cascabel (Gun.), the part joining the knob to the base of the breech. -- Neck of a gun, the small part of the piece between the chase and the swell of the muzzle. -- Neck of a tooth (Anat.), the constriction between the root and the crown. -- Neck or nothing (Fig.), at all risks. -- Neck verse. (a) The verse formerly read to entitle a party to the benefit of clergy, said to be the first verse of the fifty-first Psalm, \"Miserere mei,\" etc. Sir W. Scott. (b) Hence, a verse or saying, the utterance of which decides one's fate; a shibboleth. These words, \"bread and cheese,\" were their neck verse or shibboleth to distinguish them; all pronouncing \"broad and cause,\" being presently put to death. Fuller. -- Neck yoke. (a) A bar by which the end of the tongue of a wagon or carriage is suspended from the collars of the harnesses. (b) A device with projecting arms for carrying things (as buckets of water or sap) suspended from one's shoulders. -- On the neck of, immediately after; following closely. \"Commiting one sin on the neck of another.\" W. Perkins. -- Stiff neck, obstinacy in evil or wrong; inflexible obstinacy; contumacy. \"I know thy rebellion, and thy stiff neck.\" Deut. xxxi. 27. -- To break the neck of, to destroy the main force of. \"What they presume to borrow from her sage and virtuous rules... breaks the neck of their own cause.\" Milton. -- To harden the neck, to grow obstinate; to be more and more perverse and rebellious. Neh. ix. 17. -- To tread on the neck of, to oppress; to tyrannize over.\n\nTo reduce the diameter of (an object) near its end, by making a groove around it; -- used with down; as, to neck down a shaft. v. t. & i. To kiss and caress amorously. n. necking"}