{"word":"new","definition":"1. Having existed, or having been made, but a short time; having originated or occured lately; having recently come into existence, or into one's possession; not early or long in being; of late origin; recent; fresh; modern; -- opposed to old, as, a new coat; a new house; a new book; a new fashion. \"Your new wife.\" Chaucer. 2. Not before seen or known, although existing before; lately manifested; recently discovered; as, a new metal; a new planet; new scenes. 3. Newly beginning or recurring; starting anew; now commencing; different from has been; as, a new year; a new course or direction. 4. As if lately begun or made; having the state or quality of original freshness; also, changed for the better; renovated; unworn; untried; unspent; as, rest and travel made him a new man. Steadfasty purposing to lead a new life. Bk. of Com. Prayer. Men after long emaciating diets, fat, and almost new. Bacon. 5. Not of ancient extraction, or of a family of ancient descent; not previously kniwn or famous. Addison. 6. Not habituated; not familiar; unaccustomed. New to the plow, unpracticed in the trace. Pope. 7. Fresh from anything; newly come. New from her sickness to that northern air. Dryden. New birth. See under Birth. -- New Church, or New Jerusalem Church, the church holding the doctrines taught by Emanuel Swedenborg. See Swedenborgian. -- New heart (Theol.), a heart or character changed by the power of God, so as to be governed by new and holy motives. -- New land, land ckeared and cultivated for the first time. -- New light. (Zoöl.) See Crappie. -- New moon. (a) The moon in its first quarter, or when it first appears after being invisible. (b) The day when the new moon is first seen; the first day of the lunar month, which was a holy day among the Jews. 2 Kings iv. 23. -- New Red Sandstone (Geol.), an old name for the formation immediately above the coal measures or strata, now divided into the Permian and Trias. See Sandstone. -- New style. See Style. -- New testament. See under Testament. -- New world, the land of the Western Hemisphere; -- so called because not known to the inhabitants of the Eastern Hemisphere until recent times. Syn. -- Novel; recent; fresh; modern. See Novel.\n\nNewly; recently. Chaucer. Note: New is much used in composition, adverbially, in the sense of newly, recently, to quality other words, as in new-born, new-formed, new-found, new-mown. Of new, anew. [Obs.] Chaucer.\n\nTo make new; to renew. [Obs.]"}