{"word":"normal","definition":"1. According to an established norm, rule, or principle; conformed to a type, standard, or regular form; performing the proper functions; not abnormal; regular; natural; analogical. Deviations from the normal type. Hallam. 2. (Geom.)  According to a square or rule; perpendicular; forming a right angle. Specifically: Of or pertaining to a normal. 3. (Chem.)  Standard; original; exact; typical. Specifically: (a) (Quantitative Analysis) Denoting a solution of such strength that every cubic centimeter contains the same number of milligrams of the element in question as the number of its molecular weight. (b) (Chem.)  Denoting certain hypothetical compounds, as acids from which the real acids are obtained by dehydration; thus, normal sulphuric acid and normal nitric acid are respectively S(OH)6, and N(OH)5. (c) (Organ. Chem.) Denoting that series of hydrocarbons in which no carbon atom is united with more than two other carbon atoms; as, normal pentane, hexane, etc. Cf. Iso-. Normal equations (Method of Least Squares), a set of equations of the first degree equal in number to the number of unknown quantities, and derived from the observations by a specified process. The solution of the normal equations gives the most probable values of the unknown quantities. -- Normal group (Geol.), a group of rocks taken as a standard. Lyell. -- Normal place (of a planet or comet) (Astron.), the apparent place in the heavens of a planet or comet at a specified time, the place having been determined by a considerable number of observations, extending perhaps over many days, and so combined that the accidental errors of observation have largely balanced each other. -- Normal school, a school whose methods of instruction are to serve as a model for imitation; an institution for the training of teachers. Syn. -- Normal, Regular, Ordinary. Regular and ordinary are popular terms of well-known signification; normal has now a more specific sense, arising out of its use in science. A thing is normal, or in its normal state, when strictly conformed to those principles of its constitution which mark its species or to the standard of a healthy and natural condition. It is abnormal when it departs from those principles.\n\n1. (Geom.) Any perpendicular. 2. (Geom.)  A straight line or plane drawn from any point of a curve or surface so as to be perpendicular to the curve or surface at that point. Note: The term normal is also used to denote the distance along the normal line from the curve to the axis of abscissas or to the center of curvature."}