{"word":"note","definition":"To butt; to push with the horns. [Prov. Eng.]\n\nKnow not; knows not. [Obs.]\n\nNut. [Obs.] Chaucer.\n\nNeed; needful business. [Obs.] Chaucer.\n\n1. A mark or token by which a thing may be known; a visible sign; a character; a distinctive mark or feature; a characteristic quality. Whosoever appertain to the visible body of the church, they have also the notes of external profession. Hooker. She [the Anglican church] has the note of possession, the note of freedom from party titles,the note of life -- a tough life and a vigorous. J. H. Newman. What a note of youth, of imagination, of impulsive eagerness, there was through it all ! Mrs. Humphry Ward. 2. A mark, or sign, made to call attention, to point out something to notice, or the like; a sign, or token, proving or giving evidence. 3. A brief remark; a marginal comment or explanation; hence, an annotation on a text or author; a comment; a critical, explanatory, or illustrative observation. The best writers have been perplexed with notes, and obscured with illustrations. Felton. 4. A brief writing intended to assist the memory; a memorandum; a minute. 5. pl.  Hence, a writing intended to be used in speaking; memoranda to assist a speaker, being either a synopsis, or the full text of what is to be said; as, to preach from notes; also, a reporter's memoranda; the original report of a speech or of proceedings. 6. A short informal letter; a billet. 7. A diplomatic missive or written communication. 8. A written or printed paper acknowledging a debt, and promising payment; as, a promissory note; a note of hand; a negotiable note. 9. A list of items or of charges; an account. [Obs.] Here is now the smith's note for shoeing. Shak. 10. (Mus.) (a) A character, variously formed, to indicate the length of a tone, and variously placed upon the staff to indicate its pitch. Hence: (b) A musical sound; a tone; an utterance; a tune. (c) A key of the piano or organ. The wakeful bird . . . tunes her nocturnal note. Milton. That note of revolt against the eighteenth century, which we detect in Goethe, was struck by Winckelmann. W. Pater. 11. Observation; notice; heed. Give orders to my servants that they take No note at all of our being absent hence. Shak. 12. Notification; information; intelligence. [Obs.] The king . . . shall have note of this. Shak. 13. State of being under observation. [Obs.] Small matters . . . continually in use and in note. Bacon. 14. Reputation; distinction; as, a poet of note. There was scarce a family of note which had not poured out its blood on the field or the scaffold. Prescott. 15. Stigma; brand; reproach. [Obs.] Shak. Note of hand, a promissory note.\n\n1. To notice with care; to observe; to remark; to heed; to attend to. Pope. No more of that; I have noted it well. Shak. 2. To record in writing; to make a memorandum of. Every unguarded word . . . was noted down. Maccaulay. 3. To charge, as with crime (with of or for before the thing charged); to brand. [Obs.] They were both noted of incontinency. Dryden. 4. To denote; to designate. Johnson. 5. To annotate. [R.] W. H. Dixon. 6. To set down in musical characters. To note a bill or draft, to record on the back of it a refusal of acceptance, as the ground of a protest, which is done officially by a notary."}