{"word":"notwithstanding","definition":"Without prevention, or obstruction from or by; in spite of. We gentil women bee Loth to displease any wight, Notwithstanding our great right. Chaucer's Dream. Those on whom Christ bestowed miraculous cures were so transported that their gratitude made them, notwithstanding his prohibition, proclaim the wonders he had done. Dr. H. More. Note: Notwithstanding was, by Johnson and Webster, viewed as a participle absolute, an English equivalent of the Latin non obstante. Its several meanings, either as preposition, adverb, or conjunction, are capable of being explained in this view. Later grammarians, while admitting that the word was originally a participle, and can be treated as such, prefer to class it as a preposition or disjunctive conjunction. Syn. -- In spite of; despite. -- Notwithstanding, In spite of, Despite. These words and phrases are often interchanged, but there is a difference between them, chiefly in strength. Notwithstanding is the weaker term, and simply points to some obstacle that may exist; as, I shall go, notwithstanding the rain. In spite or despite of has reference primarily to active opposition to be encountered from others; as, \"I'll be, in man's despite, a monarch; \" \"I'll keep mine own, despite of all the world.\" Shak. Hence, these words, when applied to things, suppose greater opposition than notwithstanding. We should say. \"He was thrust rudely out of doors in spite of his entreaties,\" rather than \"notwithstanding\". On the other hand, it would be more civil to say, \"Notwithstanding all you have said, I must still differ with you.\"\n\nNevertheless; however; although; as, I shall go, notwithstanding it rains. I will surely rend the kingdom from thee, and will give it to thy servant. Notwithstanding, in thy days I will not do it. 1 Kings xi. 11, 12. They which honor the law as an image of the wisdom of God himself, are, notwithstanding, to know that the same had an end in Christ. Hooker. You did wisely and honestly too, notwithstanding She is the greatest beauty in the parish. Fielding. Notwithstanding that, notwithstanding; although. These days were ages to him, notwithstanding that he was basking in the smiles of the pretty Mary. W. Irving."}