{"word":"nurse","definition":"1. One who nourishes; a person who supplies food, tends, or brings up; as: (a) A woman who has the care of young children; especially, one who suckles an infant not her own. (b) A person, especially a woman, who has the care of the sick or infirm. 2. One who, or that which, brings up, rears, causes to grow, trains, fosters, or the like. The nurse of manly sentiment and heroic enterprise. Burke. 3. (Naut.)  A lieutenant or first officer, who is the real commander when the captain is unfit for his place. 4. (Zoöl.) (a) A peculiar larva of certain trematodes which produces cercariæ by asexual reproduction. See Cercaria, and Redia. (b) Either one of the nurse sharks. Nurse shark. (Zoöl.) (a) A large arctic shark (Somniosus microcephalus), having small teeth and feeble jaws; -- called also sleeper shark, and ground shark. (b) A large shark (Ginglymostoma cirratum), native of the West Indies and Gulf of Mexico, having the dorsal fins situated behind the ventral fins. -- To put to nurse, or To put out to nurse, to send away to be nursed; to place in the care of a nurse. -- Wet nurse, Dry nurse. See Wet nurse, and Dry nurse, in the Vocabulary.\n\n1. To nourish; to cherish; to foster; as: (a) To nourish at the breast; to suckle; to feed and tend, as an infant. (b) To take care of or tend, as a sick person or an invalid; to attend upon. Sons wont to nurse their parents in old age. Milton. Him in Egerian groves Aricia bore, And nursed his youth along the marshy shore. Dryden. 2. To bring up; to raise, by care, from a weak or invalid condition; to foster; to cherish; -- applied to plants, animals, and to any object that needs, or thrives by, attention. \"To nurse the saplings tall.\" Milton. By what hands [has vice] been nursed into so uncontrolled a dominion Locke. 3. To manage with care and economy, with a view to increase; as, to nurse our national resources. 4. To caress; to fondle, as a nurse does. A. Trollope. To nurse billiard balls, to strike them gently and so as to keep them in good position during a series of caroms."}