{"word":"nutmeg","definition":"The kernel of the fruit of the nutmeg tree (Myristica fragrans), a native of the Molucca Islands, but cultivated elsewhere in the tropics. Note: This fruit is a nearly spherical drupe, of the size of a pear, of a yellowish color without and almost white within. This opens into two nearly equal longitudinal valves, inclosing the nut surrounded by its aril, which is mace The nutmeg is an aromatic, very grateful to the taste and smell, and much used in cookery. Other species of Myristica yield nutmegs of inferior quality. American, Calabash, or Jamaica, nutmeg, the fruit of a tropical shrub (Monodora Myristica). It is about the size of an orange, and contains many aromatic seeds imbedded in pulp. -- Brazilian nutmeg, the fruit of a lauraceous tree, Cryptocarya moschata. -- California nutmeg, tree of the Yew family (Torreya Californica), growing in the Western United States, and having a seed which resembles a nutmeg in appearance, but is strongly impregnated with turpentine. -- Clove nutmeg, the Ravensara aromatica, a laura ceous tree of Madagascar. The foliage is used as a spice, but the seed is acrid and caustic. -- Jamaica nutmeg. See American nutmeg (above). -- Nutmeg bird (Zoöl.), an Indian finch (Munia punctularia). -- Nutmeg butter, a solid oil extracted from the nutmeg by expression. -- Nutmeg flower (Bot.), a ranunculaceous herb (Nigella sativa) with small black aromatic seeds, which are used medicinally and for excluding moths from furs and clothing. -- Nutmeg liver (Med.), a name applied to the liver, when, as the result of heart or lung disease, it undergoes congestion and pigmentation about the central veins of its lobules, giving it an appearance resembling that of a nutmeg. -- Nutmeg melon (Bot.), a small variety of muskmelon of a rich flavor. -- Nutmeg pigeon (Zoöl.), any one of several species of pigeons of the genus Myristicivora, native of the East Indies and Australia. The color is usually white, or cream-white, with black on the wings and tail. -- Nutmeg wood (Bot.), the wood of the Palmyra palm. -- Peruvian nutmeg, the aromatic seed of a South American tree (Laurelia sempervirens). -- Plume nutmeg (Bot.), a spicy tree of Australia (Atherosperma moschata)."}