{"word":"o","definition":"1. O, the fifteenth letter of the English alphabet, derives its form, value, and name from the Greek O, through the Latin. The letter came into the Greek from the Phoenician, which possibly derived it ultimately from the Egyptian. Etymologically, the letter o is most closely related to a, e, and u; as in E. bone, AS. ban; E. stone, AS. stan; E. broke, AS. brecan to break; E. bore, AS. beran to bear; E. dove, AS. dufe; E. toft, tuft; tone, tune; number, F. nombre. The letter o has several vowel sounds, the principal of which are its long sound, as in bone, its short sound, as in nod, and the sounds heard in the words orb, son, do (feod), and wolf (book). In connection with the other vowels it forms several digraphs and diphthongs. See Guide to Pronunciation, §§ 107-129. 2. Among the ancients, O was a mark of triple time, from the notion that the ternary, or number 3, is the most perfect of numbers, and properly expressed by a circle, the most perfect figure. O was also anciently used to represent 11: with a dash over it (O O, n.; pl. O's or Oes (. 1. The letter O, or its sound. \"Mouthing out his hollow oes and aes.\" Tennyson. 2. Something shaped like the letter O; a circle or oval. \"This wooden O [Globe Theater]\". Shak. 3. A cipher; zero. [R.] Thou art an O without a figure. Shak. O' O', Etym: [Ir. of a descendant.]  A prefix to Irish family names, which signifies grandson or descendant of, and is a character of dignity; as, O'Neil, O'Carrol. O' O', prep.  A shortened form of of or on. \"At the turning o' the tide.\" Shak.\n\nOne. [Obs.] Chaucer. \"Alle thre but o God.\" Piers Plowman.\n\nAn exclamation used in calling or directly addressing a person or personified object; also, as an emotional or impassioned exclamation expressing pain, grief, surprise, desire, fear, etc. For ever, O Lord, thy word is settled in heaven. Ps. cxix. 89. O how love I thy law ! it is my meditation all the day. Ps. cxix. 97. Note: O is frequently followed by an ellipsis and that, an in expressing a wish: \"O [I wish] that Ishmael might live before thee !\" Gen. xvii. 18; or in expressions of surprise, indignation, or regret: \"O [it is sad] that such eyes should e'er meet other object !\" Sheridan Knowles. Note: A distinction between the use of O and oh is insisted upon by some, namely, that O should be used only in direct address to a person or personified object, and should never be followed by the exclamation point, while Oh (or oh) should be used in exclamations where no direct appeal or address to an object is made, and may be followed by the exclamation point or not, according to the nature or construction of the sentence. Some insist that oh should be used only as an interjection expressing strong feeling. The form O, however, is, it seems, the one most commonly employed for both uses by modern writers and correctors for the press. \"O, I am slain !\" Shak. \"O what a fair and ministering angel !\" \"O sweet angel !\" Longfellow. O for a kindling touch from that pure flame ! Wordsworth. But she is in her grave, -- and oh The difference to me ! Wordsworth. Oh for a lodge in some vast wilderness ! Cowper. We should distinguish between the sign of the vocative and the emotional interjection, writing O for the former, and oh for the latter. Earle. O dear, and O dear me! Etym: [corrupted fr. F. O Dieu! or It. O Dio! O God! O Dio mio! O my God! Wyman], exclamations expressive of various emotions, but usually promoted by surprise, consternation, grief, pain, etc."}