{"word":"object","definition":"1. To set before or against; to bring into opposition; to oppose. [Obs.] Of less account some knight thereto object, Whose loss so great and harmful can not prove. Fairfax. Some strong impediment or other objecting itself. Hooker. Pallas to their eyes The mist objected, and condensed the skies. Pope. 2. To offer in opposition as a criminal charge or by way of accusation or reproach; to adduce as an objection or adverse reason. He gave to him to object his heinous crime. Spencer. Others object the poverty of the nation. Addison. The book ... giveth liberty to object any crime against such as are to be ordered. Whitgift.\n\nTo make opposition in words or argument; -- usually followed by to. Sir. T. More.\n\n1. That which is put, or which may be regarded as put, in the way of some of the senses; something visible or tangible; as, he observed an object in the distance; all the objects in sight; he touched a strange object in the dark. 2. That which is set, or which may be regarded as set, before the mind so as to be apprehended or known; that of which the mind by any of its activities takes cognizance, whether a thing external in space or a conception formed by the mind itself; as, an object of knowledge, wonder, fear, thought, study, etc. Object is a term for that about which the knowing subject is conversant; what the schoolmen have styled the \"materia circa quam.\" Sir. W. Hamilton. The object of their bitterest hatred. Macaulay. 3. That by which the mind, or any of its activities, is directed; that on which the purpose are fixed as the end of action or effort; that which is sought for; end; aim; motive; final cause. Object, beside its proper signification, came to be abusively applied to denote motive, end, final cause.... This innovation was probably borrowed from the French. Sir. W. Hamilton. Let our object be, our country, our whole country, and nothing but our country. D. Webster. 4. Sight; show; appearance; aspect. [Obs.] Shak. He, advancing close Up to the lake, past all the rest, arose In glorious object. Chapman. 5. (Gram.)  A word, phrase, or clause toward which an action is directed, or is considered to be directed; as, the object of a transitive verb. Object glass, the lens, or system of lenses, placed at the end of a telescope, microscope, etc., which is toward the object. Its office is to form an image of the object, which is then viewed by the eyepiece. Called also objective. See Illust. of Microscope. -- Object lesson, a lesson in which object teaching is made use of. -- Object staff. (Leveling) Same as Leveling staff. -- Object teaching, a method of instruction, in which illustrative objects are employed, each new word or idea being accompanied by a representation of that which it signifies; -- used especially in the kindergarten, for young children.\n\nOpposed; presented in opposition; also, exposed. [Obs.]"}