{"word":"obtain","definition":"1. To hold; to keep; to possess. [Obs.] His mother, then, is mortal, but his Sire He who obtains the monarchy of heaven. Milton. 2. To get hold of by effort; to gain possession of; to procure; to acquire, in any way. Some pray for riches; riches they obtain. Dryden. By guileful fair words peace may be obtained. Shak. It may be that I may obtain children by her. Gen. xvi. 2. Syn. -- To attain; gain; procure; acquire; win; earn. See Attain. -- To Obtain, Get, Gain, Earn, Acquire. The idea of getting is common to all these terms. We may, indeed, with only a slight change of sense, substitute get for either of them; as, to get or to gain a prize; to get or to obtain an employment; to get or to earn a living; to get or to acquire a language. To gain is to get by striving; and as this is often a part of our good fortune, the word gain is peculiarly applicable to whatever comes to us fortuitously. Thus, we gain a victory, we gain a cause, we gain an advantage, etc. To earn is to deserve by labor or service; as, to earn good wages; to earn a triumph. Unfortunately, one does not always get or obtain what he has earned. To obtain implies desire for possession, and some effort directed to the attainment of that which is not immediately within our reach. Whatever we thus seek and get, we obtain, whether by our own exertions or those of others; whether by good or bad means; whether permanently, or only for a time. Thus, a man obtains an employment; he obtains an answer to a letter, etc. To acquire is more limited and specific. We acquire what comes to us gradually in the regular exercise of our abilities, while we obtain what comes in any way, provided we desire it. Thus, we acquire knowledge, property, honor, reputation, etc. What we acquire becomes, to a great extent, permanently our own; as, to acquire a language; to acquire habits of industry, etc.\n\n1. To become held; to gain or have a firm footing; to be recognized or established; to subsist; to become prevalent or general; to prevail; as, the custom obtains of going to the seashore in summer. Sobriety hath by use obtained to signify temperance in drinking. Jer. Taylor. The Theodosian code, several hundred years after Justinian's time, did obtain in the western parts of Europe. Baker. 2. To prevail; to succeed. [R.] Evelyn. So run that ye may obtain. 1 Cor. ix. 24. There is due from the judge to the advocate, some commendation, where causes are fair pleaded; especially towards the side which obtaineth not. Bacon."}