{"word":"of","definition":"In a general sense, from, or out from; proceeding from; belonging to; relating to; concerning; -- used in a variety of applications; as: 1. Denoting that from which anything proceeds; indicating origin, source, descent, and the like; as, he is of a race of kings; he is of noble blood. That holy thing which shall be born of thee shall be called the Son of God. Luke i. 35. I have received of the Lord that which also I delivered unto you. 1 Cor. xi. 23. 2. Denoting possession or ownership, or the relation of subject to attribute; as, the apartment of the consul: the power of the king; a man of courage; the gate of heaven. \"Poor of spirit.\" Macaulay. 3. Denoting the material of which anything is composed, or that which it contains; as, a throne of gold; a sword of steel; a wreath of mist; a cup of water. 4. Denoting part of an aggregate or whole; belonging to a number or quantity mentioned; out of; from amongst; as, of this little he had some to spare; some of the mines were unproductive; most of the company. It is of the Lord's mercies that we are not consumed. Lam. iii. 22. It is a duty to communicate of those blessings we have received. Franklin. 5. Denoting that by which a person or thing is actuated or impelled; also, the source of a purpose or action; as, they went of their own will; no body can move of itself; he did it of necessity. For it was of the Lord to harden their hearts. Josh. xi. 20. 6. Denoting reference to a thing; about; concerning; relating to; as, to boast of one's achievements. Knew you of this fair work Shak. 7. Denoting nearness or distance, either in space or time; from; as, within a league of the town; within an hour of the appointed time. 8. Denoting identity or equivalence; -- used with a name or appellation, and equivalent to the relation of apposition; as, the continent of America; the city of Rome; the Island of Cuba. 9. Denoting the agent, or person by whom, or thing by which, anything is, or is done; by. And told to her of [by] some. Chaucer. He taught in their synagogues, being glorified of all. Luke iv. 15. [Jesus] being forty days tempted of the devil. Luke iv. 1, 2. Note: The use of the word in this sense, as applied to persons, is nearly obsolete. 10. Denoting relation to place or time; belonging to, or connected with; as, men of Athens; the people of the Middle Ages; in the days of Herod. 11. Denoting passage from one state to another; from. [Obs.] \"O miserable of happy.\" Milton. 12. During; in the course of. Not be seen to wink of all the day. Shak. My custom always of the afternoon. Shak. Note: Of may be used in a subjective or an objective sense. \"The love of God\" may mean, our love for God, or God's love for us. Note: From is the primary sense of this preposition; a sense retained in off, the same word differently written for distinction. But this radical sense disappears in most of its application; as, a man of genius; a man of rare endowments; a fossil of a red color, or of an hexagonal figure; he lost all hope of relief; an affair of the cabinet; he is a man of decayed fortune; what is the price of corn In these and similar phrases, of denotes property or possession, or a relation of some sort involving connection. These applications, however all proceeded from the same primary sense. That which proceeds from, or is produced by, a person or thing, either has had, or still has, a close connection with the same; and hence the word was applied to cases of mere connection, not involving at all the idea of separation. Of consequence, of importance, value, or influence. -- Of late, recently; in time not long past. -- Of old, formerly; in time long past. -- Of one's self, by one's self; without help or prompting; spontaneously. Why, knows not Montague, that of itself England is safe, if true within itself Shak."}