{"word":"off","definition":"In a general sense, denoting from or away from; as: 1. Denoting distance or separation; as, the house is a mile off. 2. Denoting the action of removing or separating; separation; as, to take off the hat or cloak; to cut off, to pare off, to clip off, to peel off, to tear off, to march off, to fly off, and the like. 3. Denoting a leaving, abandonment, departure, abatement, interruption, or remission; as, the fever goes off; the pain goes off; the game is off; all bets are off. 4. Denoting a different direction; not on or towards: away; as, to look off. 5. Denoting opposition or negation. [Obs.] The questions no way touch upon puritanism, either off or on. Bp. Sanderson. From off, off from; off. \"A live coal...taken with the tongs from off the altar.\" Is. vi. 6. -- Off and on. (a) Not constantly; not regularly; now and then; occasionally. (b) (Naut.) On different tacks, now toward, and now away from, the land. -- To be off. (a) To depart; to escape; as, he was off without a moment's warning. (b) To be abandoned, as an agreement or purpose; as, the bet was declared to be off. [Colloq.] -- To come off, To cut off, To fall off, To go off, etc. See under Come, Cut, Fall, Go, etc. -- To get off. (a) To utter; to discharge; as, to get off a joke. (b) To go away; to escape; as, to get off easily from a trial. [Colloq.] -- To take off, to mimic or personate. -- To tell off (Mil.), to divide and practice a regiment or company in the several formations, preparatory to marching to the general parade for field exercises. Farrow. -- To be well off, to be in good condition. -- To be ill off, To be badly off, to be in poor condition.\n\nAway; begone; -- a command to depart.\n\nNot on; away from; as, to be off one's legs or off the bed; two miles off the shore. Addison. Off hand. See Offhand. -- Off side (Football), out of play; -- said when a player has got in front of the ball in a scrimmage, or when the ball has been last touched by one of his own side behind him. -- To be off color, to be of a wrong color. -- To be off one's food, to have no appetite. (Colloq.)\n\n1. On the farther side; most distant; on the side of an animal or a team farthest from the driver when he is on foot; in the United States, the right side; as, the off horse or ox in a team, in distinction from the Ant: nigh or Ant: near horse or ox; the off leg. 2. Designating a time when one is not strictly attentive to business or affairs, or is absent from his post, and, hence, a time when affairs are not urgent; as, he took an off day for fishing: an off year in politics. \"In the off season.\" Thackeray. Off side. (a) The right hand side in driving; the farther side. See Gee. (b) (Cricket) See Off, n.\n\nThe side of the field that is on the right of the wicket keeper."}