{"word":"office","definition":"1. That which a person does, either voluntarily or by appointment, for, or with reference to, others; customary duty, or a duty that arises from the relations of man to man; as, kind offices, pious offices. I would I could do a good office between you. Shak. 2. A special duty, trust, charge, or position, conferred by authority and for a public purpose; a position of trust or authority; as, an executive or judical office; a municipal office. 3. A charge or trust, of a sacred nature, conferred by God himself; as, the office of a priest under the old dispensation, and that of the apostles in the new. Inasmuch as I am the apostle of the Gentiles, I magnify mine office. Rom. xi. 13. 4. That which is performed, intended, or assigned to be done, by a particular thing, or that which anything is fitted to perform; a function; -- answering to duty in intelligent beings. They [the eyes] resign their office and their light. Shak. Hesperus, whose office is to bring Twilight upon the earth. Milton. In this experiment the several intervals of the teeth of the comb do the office of so many prisms. Sir I. Newton. 5. The place where a particular kind of business or service for others is transacted; a house or apartment in which public officers and others transact business; as, the register's office; a lawyer's office. 6. The company or corporation, or persons collectively, whose place of business is in an office; as, I have notified the office. 7. pl.  The apartments or outhouses in which the domestics discharge the duties attached to the service of a house, as kitchens, pantries, stables, etc. [Eng.] As for the offices, let them stand at distance. Bacon. 8. (Eccl.)  Any service other than that of ordination and the Mass; any prescribed religious service. This morning was read in the church, after the office was done, the declaration setting forth the late conspiracy against the king's person. Evelyn. Holy office. Same as Inquisition, n., 3. -- Houses of office. Same as def. 7 above. Chaucer. -- Little office (R.C.Ch.), an office recited in honor of the Virgin Mary. -- Office bearer, an officer; one who has a specific office or duty to perform. -- Office copy (Law), an authenticated or certified copy of a record, from the proper office. See Certified copies, under Copy. Abbott. -- Office-found (Law), the finding of an inquest of office. See under Inquest. -- Office holder. See Officeholder in the Vocabulary\n\nTo perform, as the duties of an office; to discharge. [Obs.] Shak."}