{"word":"old","definition":"Open country. [Obs.] See World. Shak.\n\n1. Not young; advanced far in years or life; having lived till toward the end of the ordinary term of living; as, an old man; an old age; an old horse; an old tree. Let not old age disgrace my high desire. Sir P. Sidney. The melancholy news that we grow old. Young. 2. Not new or fresh; not recently made or produced; having existed for a long time; as, old wine; an old friendship. \"An old acquaintance.\" Camden. 3. Formerly existing; ancient; not modern; preceding; original; as, an old law; an old custom; an old promise. \"The old schools of Greece.\" Milton. \"The character of the old Ligurians.\" Addison. 4. Continued in life; advanced in the course of existence; having (a certain) length of existence; -- designating the age of a person or thing; as, an infant a few hours old; a cathedral centuries old. And Pharaoh said unto Jacob, How old art thou Cen. xlvii. 8. Note: In this use old regularly follows the noun that designates the age; as, she was eight years old. 5. Long practiced; hence, skilled; experienced; cunning; as, an old offender; old in vice. Vane, young in years, but in sage counsel old. Milton. 6. Long cultivated; as, an old farm; old land, as opposed to Ant: new land, that is, to land lately cleared. 7. Worn out; weakened or exhausted by use; past usefulness; as, old shoes; old clothes. 8. More than enough; abundant. [Obs.] If a man were porter of hell gate, he should have old turning the key. Shak. 9. Aged; antiquated; hence, wanting in the mental vigor or other qualities belonging to youth; -- used disparagingly as a term of reproach. 10. Old-fashioned; wonted; customary; as of old; as, the good old times; hence, colloquially, gay; jolly. 11. Used colloquially as a term of cordiality and familiarity. \"Go thy ways, old lad.\" Shak. Old age, advanced years; the latter period of life. -- Old bachelor. See Bachelor, 1. -- Old Catholics. See under Catholic. -- Old English. See under English. n., 2. -- Old Nick, Old Scratch, the devil. -- Old lady (Zoöl.), a large European noctuid moth (Mormo maura). -- Old maid. (a) A woman, somewhat advanced in years, who has never been married; a spinster. (b) (Bot.) A West Indian name for the pink- flowered periwinkle (Vinca rosea). (c) A simple game of cards, played by matching them. The person with whom the odd card is left is the old maid. -- Old man's beard. (Bot.) (a) The traveler's joy (Clematis Vitalba). So named from the abundant long feathery awns of its fruit. (b) The Tillandsia usneoides. See Tillandsia. -- Old man's head (Bot.), a columnar cactus (Pilocereus senilis), native of Mexico, covered towards the top with long white hairs. -- Old red sandstone (Geol.), a series of red sandstone rocks situated below the rocks of the Carboniferous age and comprising various strata of siliceous sandstones and conglomerates. See Sandstone, and the Chart of Geology. -- Old school, a school or party belonging to a former time, or preserving the character, manner, or opinious of a former time; as, a gentleman of the old school; -- used also adjectively; as, Old-School Presbyterians. -- Old sledge, an old and well-known game of cards, called also all fours, and high, low, Jack, and the game. -- Old squaw (Zoöl.), a duck (Clangula hyemalis) inhabiting the northern parts of both hemispheres. The adult male is varied with black and white and is remarkable for the length of its tail. Called also longtailed duck, south southerly, callow, hareld, and old wife. -- Old style. (Chron.) See the Note under Style. -- Old Testament. See under Testament. -- Old wife. [In the senses b and cwritten also oldwife.] (a) A prating old woman; a gossip. Refuse profane and old wives' fables. 1 Tim. iv. 7. (b) (Zoöl.) The local name of various fishes, as the European black sea bream (Cantharus lineatus), the American alewife, etc. (c) (Zoöl.) A duck; the old squaw. -- Old World, the Eastern Hemisphere. Syn. -- Aged; ancient; pristine; primitive; antique; antiquated; old- fashioned; obsolete. See Ancient."}