{"word":"one","definition":"1. Being a single unit, or entire being or thing, and no more; not multifold; single; individual. The dream of Pharaoh is one. Gen. xli. 25. O that we now had here But one ten thousand of those men in England. Shak. 2. Denoting a person or thing conceived or spoken of indefinitely; a certain. \"I am the sister of one Claudio\" [Shak.], that is, of a certain man named Claudio. 3. Pointing out a contrast, or denoting a particular thing or person different from some other specified; -- used as a correlative adjective, with or without the. From the one side of heaven unto the other. Deut. iv. 32. 4. Closely bound together; undivided; united; constituting a whole. The church is therefore one, though the members may be many. Bp. Pearson 5. Single in kind; the same; a common. One plague was on you all, and on your lords. 1 Sam. vi. 4. 6. Single; inmarried. [Obs.] Men may counsel a woman to be one. Chaucer. Note: One is often used in forming compound words, the meaning of which is obvious; as, one-armed, one-celled, one-eyed, one-handed, one-hearted, one-horned, one-idead, one-leaved, one-masted, one- ribbed, one-story, one-syllable, one-stringed, one-winged, etc. All one, of the same or equal nature, or consequence; as, he says that it is all one what course you take. Shak. -- One day. (a) On a certain day, not definitely specified, referring to time past. One day when Phoebe fair, With all her band, was following the chase. Spenser. (b) Referring to future time: At some uncertain day or period; some day. Well, I will marry one day. Shak.\n\n1. A single unit; as, one is the base of all numbers. 2. A symbol representing a unit, as 1, or i. 3. A single person or thing. \"The shining ones.\" Bunyan. \"Hence, with your little ones.\" Shak. He will hate the one, and love the other. Matt. vi. 24. That we may sit, one on thy right hand, and the other on thy left hand, in thy glory. Mark x. 37. After one, after one fashion; alike. [Obs.] Chaucer. -- At one, in agreement or concord. See At one, in the Vocab. -- Ever in one, continually; perpetually; always. [Obs.] Chaucer. -- In one, in union; in a single whole. -- One and one, One by one, singly; one at a time; one after another.\"Raising one by one the suppliant crew.\" Dryden.\n\nAny person, indefinitely; a person or body; as, what one would have well done, one should do one's self. It was well worth one's while. Hawthorne. Against this sort of condemnation one must steel one's self as one best can. G. Eliot. Note: One is often used with some, any, no, each, every, such, a, many a, another, the other, etc. It is sometimes joined with another, to denote a reciprocal relation. When any one heareth the word. Matt. xiii. 19. She knew every one who was any one in the land of Bohemia. Compton Reade. The Peloponnesians and the Athenians fought against one another. Jowett (Thucyd. ). The gentry received one another. Thackeray.\n\nTo cause to become one; to gather into a single whole; to unite; to assimilite. [Obs.] The rich folk that embraced and oned all their heart to treasure of the world. Chaucer."}