{"word":"open","definition":"1. Free of access; not shut up; not closed; affording unobstructed ingress or egress; not impeding or preventing passage; not locked up or covered over; -- applied to passageways; as, an open door, window, road, etc.; also, to inclosed structures or objects; as, open houses, boxes, baskets, bottles, etc.; also, to means of communication or approach by water or land; as, an open harbor or roadstead. Through the gate, Wide open and unquarded, Satan passed. Milton Note: Also, figuratively, used of the ways of communication of the mind, as by the senses; ready to hear, see, etc.; as, to keep one's eyes and ears open. His ears are open unto their cry. Ps. xxxiv. 15. 2. Free to be used, enjoyed, visited, or the like; not private; public; unrestricted in use; as, an open library, museum, court, or other assembly; liable to the approach, trespass, or attack of any one; unprotected; exposed. If Demetrius . . . have a matter against any man, the law is open and there are deputies. Acts xix. 33. The service that I truly did his life, Hath left me open to all injuries. Shak. 3. Free or cleared of obstruction to progress or to view; accessible; as, an open tract; the open sea. 4. Not drawn together, closed, or contracted; extended; expanded; as, an open hand; open arms; an open flower; an open prospect. Each, with open arms, embraced her chosen knight. Dryden. 5. Hence: (a) Without reserve or false pretense; sincere; characterized by sincerity; unfeigned; frank; also, generous; liberal; bounteous; -- applied to personal appearance, or character, and to the expression of thought and feeling, etc. With aspect open, shall erect his head. Pope. The Moor is of a free and open nature. Shak. The French are always open, familiar, and talkative. Addison. (b) Not concealed or secret; not hidden or disguised; exposed to view or to knowledge; revealed; apparent; as, open schemes or plans; open shame or guilt. His thefts are too open. Shak. That I may find him, and with secret gaze Or open admiration him behold. Milton. 6. Not of a quality to prevent communication, as by closing water ways, blocking roads, etc.; hence, not frosty or inclement; mild; -- used of the weather or the climate; as, an open season; an open winter. Bacon. 7. Not settled or adjusted; not decided or determined; not closed or withdrawn from consideration; as, an open account; an open question; to keep an offer or opportunity open. 8. Free; disengaged; unappropriated; as, to keep a day open for any purpose; to be open for an engagement. 9. (Phon.) (a) Uttered with a relatively wide opening of the articulating organs; -- said of vowels; as, the än fär is open as compared with the a in say. (b) Uttered, as a consonant, with the oral passage simply narrowed without closure, as in uttering s. 10. (Mus.) (a) Not closed or stopped with the finger; -- said of the string of an instrument, as of a violin, when it is allowed to vibrate throughout its whole length. (b) Produced by an open string; as, an open tone. The open air, the air out of doors. -- Open chain. (Chem.) See Closed chain, under Chain. -- Open circuit (Elec.), a conducting circuit which is incomplete, or interrupted at some point; -- opposed to an uninterrupted, or Ant: closed circuit. -- Open communion, communion in the Lord's supper not restricted to persons who have been baptized by immersion. Cf. Close communion, under Close, a. -- Open diapason (Mus.), a certain stop in an organ, in which the pipes or tubes are formed like the mouthpiece of a flageolet at the end where the wind enters, and are open at the other end. -- Open flank (Fort.), the part of the flank covered by the orillon. -- Open-front furnace (Metal.), a blast furnace having a forehearth. -- Open harmony (Mus.), harmony the tones of which are widely dispersed, or separated by wide intervals. -- Open hawse (Naut.), a hawse in which the cables are parallel or slightly divergent. Cf. Foul hawse, under Hawse. -- Open hearth (Metal.), the shallow hearth of a reverberatory furnace. -- Open-hearth furnace, a reverberatory furnace; esp., a kind of reverberatory furnace in which the fuel is gas, used in manufacturing steel. -- Open-hearth process (Steel Manuf.), a process by which melted cast iron is converted into steel by the addition of wrought iron, or iron ore and manganese, and by exposure to heat in an open-hearth furnace; -- also called the Siemens-Martin process, from the inventors. -- Open-hearth steel, steel made by an open-hearth process; -- also called Siemens-Martin steel. -- Open newel. (Arch.) See Hollow newel, under Hollow. -- Open pipe (Mus.), a pipe open at the top. It has a pitch about an octave higher than a closed pipe of the same length. -- Open-timber roof (Arch.), a roof of which the constructional parts, together with the under side of the covering, or its lining, are treated ornamentally, and left to form the ceiling of an apartment below, as in a church, a public hall, and the like. -- Open vowel or consonant. See Open, a., 9. Note: Open is used in many compounds, most of which are self- explaining; as, open-breasted, open-minded. Syn. -- Unclosed; uncovered; unprotected; exposed; plain; apparent; obvious; evident; public; unreserved; frank; sincere; undissembling; artless. See Candid, and Ingenuous.\n\nOpen or unobstructed space; clear land, without trees or obstructions; open ocean; open water. \"To sail into the open.\" Jowett (Thucyd. ). Then we got into the open. W. Black. In open, in full view; without concealment; openly. [Obs.] Beau. & Fl.\n\n1. To make or set open; to render free of access; to unclose; to unbar; to unlock; to remove any fastening or covering from; as, to open a door; to open a box; to open a room; to open a letter. And all the windows of my heart I open to the day. Whittier. 2. To spread; to expand; as, to open the hand. 3. To disclose; to reveal; to interpret; to explain. The king opened himself to some of his council, that he was sorry for the earl's death. Bacon. Unto thee have I opened my cause. Jer. xx. 12. While he opened to us the Scriptures. Luke xxiv. 32. 4. To make known; to discover; also, to render available or accessible for settlements, trade, etc. The English did adventure far for to open the North parts of America. Abp. Abbot. 5. To enter upon; to begin; as, to open a discussion; to open fire upon an enemy; to open trade, or correspondence; to open a case in court, or a meeting. 6. To loosen or make less compact; as, to open matted cotton by separating the fibers. To open one's mouth, to speak. -- To open up, to lay open; to discover; to disclose. Poetry that had opened up so many delightful views into the character and condition of our \"bold peasantry, their country's pride.\" Prof. Wilson.\n\n1. To unclose; to form a hole, breach, or gap; to be unclosed; to be parted. The earth opened and swallowed up Dathan, and covered the company of Abiram. Ps. cvi. 17. 2. To expand; to spread out; to be disclosed; as, the harbor opened to our view. 3. To begin; to commence; as, the stock opened at par; the battery opened upon the enemy. 4. (Sporting)  To bark on scent or view of the game."}