{"word":"order","definition":"1. Regular arrangement; any methodical or established succession or harmonious relation; method; system; as: (a) Of material things, like the books in a library. (b) Of intellectual notions or ideas, like the topics of a discource. (c) Of periods of time or occurrences, and the like. The side chambers were . . . thirty in order. Ezek. xli. 6. Bright-harnessed angels sit in order serviceable. Milton. Good order is the foundation of all good things. Burke. 2. Right arrangement; a normal, correct, or fit condition; as, the house is in order; the machinery is out of order. Locke. 3. The customary mode of procedure; established system, as in the conduct of debates or the transaction of business; usage; custom; fashion. Dantiel. And, pregnant with his grander thought, Brought the old order into doubt. Emerson. 4. Conformity with law or decorum; freedom from disturbance; general tranquillity; public quiet; as, to preserve order in a community or an assembly. 5. That which prescribes a method of procedure; a rule or regulation made by competent authority; as, the rules and orders of the senate. The church hath authority to establish that for an order at one time which at another time it may abolish. Hooker. 6. A command; a mandate; a precept; a direction. Upon this new fright, an order was made by both houses for disarming all the papists in England. Clarendon. 7. Hence: A commission to purchase, sell, or supply goods; a direction, in writing, to pay money, to furnish supplies, to admit to a building, a place of entertainment, or the like; as, orders for blankets are large. In those days were pit orders -- beshrew the uncomfortable manager who abolished them. Lamb. 8. A number of things or persons arranged in a fixed or suitable place, or relative position; a rank; a row; a grade; especially, a rank or class in society; a group or division of men in the same social or other position; also, a distinct character, kind, or sort; as, the higher or lower orders of society; talent of a high order. They are in equal order to their several ends. Jer. Taylor. Various orders various ensigns bear. Granville. Which, to his order of mind, must have seemed little short of crime. Hawthorne. 9. A body of persons having some common honorary distinction or rule of obligation; esp., a body of religious persons or aggregate of convents living under a common rule; as, the Order of the Bath; the Franciscan order. Find a barefoot brother out, One of our order, to associate me. Shak. The venerable order of the Knights Templars. Sir W. Scott. 10. An ecclesiastical grade or rank, as of deacon, priest, or bishop; the office of the Christian ministry; -- often used in the plural; as, to take orders, or to take holy orders, that is, to enter some grade of the ministry. 11. (Arch.)  The disposition of a column and its component parts, and of the entablature resting upon it, in classical architecture; hence (as the column and entablature are the characteristic features of classical architecture) a style or manner of architectural designing. Note: The Greeks used three different orders, easy to distinguish, Doric, Ionic, and Corinthian. The Romans added the Tuscan, and changed the Doric so that it is hardly recognizable, and also used a modified Corinthian called Composite. The Renaissance writers on architecture recognized five orders as orthodox or classical, -- Doric (the Roman sort), Ionic, Tuscan, Corinthian, and Composite. See Illust. of Capital. 12. (Nat. Hist.)  An assemblage of genera having certain important characters in common; as, the Carnivora and Insectivora are orders of Mammalia. Note: The Linnæan artificial orders of plants rested mainly on identity in the numer of pistils, or agreement in some one character. Natural orders are groups of genera agreeing in the fundamental plan of their flowers and fruit. A natural order is usually (in botany) equivalent to a family, and may include several tribes. 13. (Rhet.)  The placing of words and members in a sentence in such a manner as to contribute to force and beauty or clearness of expression. 14. (Math.)  Rank; degree; thus, the order of a curve or surface is the same as the degree of its equation. Artificial order or system. See Artificial classification, under Artificial, and Note to def. 12 above. -- Close order (Mil.), the arrangement of the ranks with a distance of about half a pace between them; with a distance of about three yards the ranks are in Ant: open order. -- The four Orders, The Orders four, the four orders of mendicant friars. See Friar. Chaucer. -- General orders (Mil.), orders issued which concern the whole command, or the troops generally, in distinction from special orders. -- Holy orders. (a) (Eccl.) The different grades of the Christian ministry; ordination to the ministry. See def. 10 above. (b) (R. C. Ch.) A sacrament for the purpose of conferring a special grace on those ordained. -- In order to, for the purpose of; to the end; as means to. The best knowledge is that which is of greatest use in order to our eternal happiness. Tillotson. -- Minor orders (R. C. Ch.), orders beneath the diaconate in sacramental dignity, as acolyte, exorcist, reader, doorkeeper. -- Money order. See under Money. -- Natural order. (Bot.) See def. 12, Note. -- Order book. (a) A merchant's book in which orders are entered. (b) (Mil.) A book kept at headquarters, in which all orders are recorded for the information of officers and men. (c) A book in the House of Commons in which proposed orders must be entered. [Eng.] -- Order in Council, a royal order issed with and by the advice of the Privy Council. [Great Britain] -- Order of battle (Mil.), the particular disposition given to the troops of an army on the field of battle. -- Order of the day, in legislative bodies, the special business appointed for a specified day. -- Order of a differential equation (Math.), the greatest index of differentiation in the equation. -- Sailing orders (Naut.), the final instructions given to the commander of a ship of war before a cruise. -- Sealed orders, orders sealed, and not to be opended until a certain time, or arrival at a certain place, as after a ship is at sea. -- Standing order. (a) A continuing regulation for the conduct of parliamentary business. (b) (Mil.) An order not subject to change by an officer temporarily in command. -- To give order, to give command or directions. Shak. -- To take order for, to take charge of; to make arrangements concerning. Whiles I take order for mine own affairs. Shak. Syn. -- Arrangement; management. See Direction.\n\n1. To put in order; to reduce to a methodical arrangement; to arrange in a series, or with reference to an end. Hence, to regulate; to dispose; to direct; to rule. To him that ordereth his conversation aright. Ps. 1. 23. Warriors old with ordered spear and shield. Milton. 2. To give an order to; to command; as, to order troops to advance. 3. To give an order for; to secure by an order; as, to order a carriage; to order groceries. 4. (Eccl.)  To admit to holy orders; to ordain; to receive into the ranks of the ministry. These ordered folk be especially titled to God. Chaucer. Persons presented to be ordered deacons. Bk. of Com. Prayer. Order arms (Mil.), the command at which a rifle is brought to a position with its but resting on the ground; also, the position taken at such a command.\n\nTo give orders; to issue commands."}