{"word":"out","definition":"In its original and strict sense, out means from the interior of something; beyond the limits or boundary of somethings; in a position or relation which is exterior to something; -- opposed to in or into. The something may be expressed after of, from, etc. (see Out of, below); or, if not expressed, it is implied; as, he is out; or, he is out of the house, office, business, etc.; he came out; or, he came out from the ship, meeting, sect, party, etc. Out is used in a variety of applications, as: -- 1. Away; abroad; off; from home, or from a certain, or a usual, place; not in; not in a particular, or a usual, place; as, the proprietor is out, his team was taken out. \"My shoulder blade is out.\" Shak. He hath been out (of the country) nine years. Shak. 2. Beyond the limits of concealment, confinement, privacy, constraint, etc., actual of figurative; hence, not in concealment, constraint, etc., in, or into, a state of freedom, openness, disclosure, publicity, etc.; as, the sun shines out; he laughed out, to be out at the elbows; the secret has leaked out, or is out; the disease broke out on his face; the book is out. Leaves are out and perfect in a month. Bacon. She has not been out [in general society] very long. H. James. 3. Beyond the limit of existence, continuance, or supply; to the end; completely; hence, in, or into, a condition of extinction, exhaustion, completion; as, the fuel, or the fire, has burned out. \"Hear me out.\" Dryden. Deceitiful men shall not live out half their days. Ps. iv. 23. When the butt is out, we will drink water. Shak. 4. Beyond possession, control, or occupation; hence, in, or into, a state of want, loss, or deprivation; -- used of office, business, property, knowledge, etc.; as, the Democrats went out and the Whigs came in; he put his money out at interest. \"Land that is out at rack rent.\" Locke. \"He was out fifty pounds.\" Bp. Fell. I have forgot my part, and I am out. Shak. 5. Beyond the bounds of what is true, reasonable, correct, proper, common, etc.; in error or mistake; in a wrong or incorrect position or opinion; in a state of disagreement, opposition, etc.; in an inharmonious relation. \"Lancelot and I are out.\" Shak. Wicked men are strangely out in the calculating of their own interest. South. Very seldom out, in these his guesses. Addison. 6. Not in the position to score in playing a game; not in the state or turn of the play for counting or gaining scores. Note: Out is largely used in composition as a prefix, with the same significations that it has as a separate word; as outbound, outbreak, outbuilding, outcome, outdo, outdoor, outfield. See also the first Note under Over, adv. Day in, day out, from the beginning to the limit of each of several days; day by day; every day. -- Out and out. (a) adv. Completely; wholly; openly. (b) adj. Without any reservation or disguise; absolute; as, an out and out villain. [As an adj. written also out-and-out.] -- Out at, Out in, Out on, etc., elliptical phrases, that to which out refers as a source, origin, etc., being omitted; as, out (of the house and) at the barn; out (of the house, road, fields, etc., and) in the woods. Three fishers went sailing out into the west, Out into the west, as the sun went down. C. Kingsley. Note: In these lines after out may be understood, \"of the harbor,\" \"from the shore,\" \"of sight,\" or some similar phrase. The complete construction is seen in the saying: \"Out of the frying pan into the fire.\" -- Out from, a construction similar to out of (below). See Of and From. Out of, a phrase which may be considered either as composed of an adverb and a preposition, each having its appropriate office in the sentence, or as a compound preposition. Considered as a preposition, it denotes, with verbs of movement or action, from the interior of; beyond the limit: from; hence, origin, source, motive, departure, separation, loss, etc.; -- opposed to in or into; also with verbs of being, the state of being derived, removed, or separated from. Examples may be found in the phrases below, and also under Vocabulary words; as, out of breath; out of countenance. Out of cess, beyond measure, excessively. Shak. -- Out of character, unbecoming; improper. -- Out of conceit with, not pleased with. See under Conceit. -- Out of date, not timely; unfashionable; antiquated. -- Out of door, Out of doors, beyond the doors; from the house; in, or into, the open air; hence, figuratively, shut out; dismissed. See under Door, also, Out-of-door, Outdoor, Outdoors, in the Vocabulary. \"He 's quality, and the question's out of door,\" Dryden. -- Out of favor, disliked; under displeasure. -- Out of frame, not in correct order or condition; irregular; disarranged. Latimer. -- Out of hand, immediately; without delay or preparation. \"Ananias . . . fell down and died out of hand.\" Latimer. -- Out of harm's way, beyond the danger limit; in a safe place. -- Out of joint, not in proper connection or adjustment; unhinged; disordered. \"The time is out of joint.\" Shak. -- Out of mind, not in mind; forgotten; also, beyond the limit of memory; as, time out of mind. -- Out of one's head, beyond commanding one's mental powers; in a wandering state mentally; delirious. [Colloq.] -- Out of one's time, beyond one's period of minority or apprenticeship. -- Out of order, not in proper order; disarranged; in confusion. -- Out of place, not in the usual or proper place; hence, not proper or becoming. -- Out of pocket, in a condition of having expended or lost more money than one has received. -- Out of print, not in market, the edition printed being exhausted; -- said of books, pamphlets, etc. -- Out of the question, beyond the limits or range of consideration; impossible to be favorably considered. -- Out of reach, beyond one's reach; inaccessible. -- Out of season, not in a proper season or time; untimely; inopportune. -- Out of sorts, wanting certain things; unsatisfied; unwell; unhappy; cross. See under Sort, n. -- Out of temper, not in good temper; irritated; angry. -- Out of time, not in proper time; too soon, or too late. -- Out of time, not in harmony; discordant; hence, not in an agreeing temper; fretful. -- Out of twist, winding, or wind, not in warped condition; perfectly plain and smooth; -- said of surfaces. -- Out of use, not in use; unfashionable; obsolete. -- Out of the way. (a) On one side; hard to reach or find; secluded. (b) Improper; unusual; wrong. -- Out of the woods, not in a place, or state, of obscurity or doubt; free from difficulty or perils; safe. [Colloq.] -- Out to out, from one extreme limit to another, including the whole length, breadth, or thickness; -- applied to measurements. -- Out West, in or towards, the West; specifically, in some Western State or Territory. [U. S.] -- To come out, To cut out, To fall out, etc. See under Come, Cut, Fall, etc. -- To put out of the way, to kill; to destroy. -- Week in, week out. See Day in, day out (above).\n\n1. One who, or that which, is out; especially, one who is out of office; -- generally in the plural. 2. A place or space outside of something; a nook or corner; an angle projecting outward; an open space; -- chiefly used in the phrase ins and outs; as, the ins and outs of a question. See under In. 3. (Print.)  A word or words omitted by the compositor in setting up copy; an omission. To make an out (Print.), to omit something, in setting or correcting type, which was in the copy.\n\n1. To cause to be out; to eject; to expel. A king outed from his country. Selden. The French have been outed of their holds. Heylin. 2. To come out with; to make known. [Obs.] Chaucer. 3. To give out; to dispose of; to sell. [Obs.] Chaucer.\n\nTo come or go out; to get out or away; to become public. \"Truth will out.\" Shak.\n\nExpressing impatience, anger, a desire to be rid of; -- with the force of command; go out; begone; away; off. Out, idle words, servants to shallow fools ! Shak. Out upon or on! equivalent to \"shame upon!\" \"away with!\" as, out upon you!"}