{"word":"oyster","definition":"1. (Zoöl.)  Any marine bivalve mollusk of the genus Ostrea. They are usually found adhering to rocks or other fixed objects in shallow water along the seacoasts, or in brackish water in the mouth of rivers. The common European oyster (Ostrea edulis), and the American oyster (Ostrea Virginiana), are the most important species. 2. A name popularly given to the delicate morsel contained in a small cavity of the bone on each side of the lower part of the back of a fowl. Fresh-water oyster (Zoöl.), any species of the genus Etheria, and allied genera, found in rivers of Africa and South America. They are irregular in form, and attach themselves to rocks like oysters, but they have a pearly interior, and are allied to the fresh-water mussels. -- Oyster bed, a breeding place for oysters; a place in a tidal river or other water on or near the seashore, where oysters are deposited to grow and fatten for market. See lst Scalp, n. -- Oyster catcher (Zoöl.), any one of several species of wading birds of the genus Hæmatopus, which frequent seashores and feed upon shellfish. The European species (H. ostralegus), the common American species (H. palliatus), and the California, or black, oyster catcher (H. Bachmani) are the best known. -- Oyster crab (Zoöl.) a small crab (Pinnotheres ostreum) which lives as a commensal in the gill cavity of the oyster. -- Oyster dredge, a rake or small dragnet of bringing up oyster from the bottom of the sea. -- Oyster fish. (Zoöl.) (a) The tautog. (b) The toadfish. -- Oyster plant. (Bot.) (a) A plant of the genus Tragopogon (T. porrifolius), the root of which, when cooked, somewhat resembles the oyster in taste; salsify; -- called also vegetable oyster. (b) A plant found on the seacoast of Northern Europe, America and Asia (Mertensia maritima), the fresh leaves of which have a strong flavor of oysters. -- Oyster plover. (Zoöl.) Same as Oyster catcher, above. -- Oyster shell (Zoöl.), the shell of an oyster. -- Oyster wench, Oyster wife, Oyster women, a women who deals in oysters. -- Pearl oyster. (Zoöl.) See under Pearl. -- Thorny oyster (Zoöl.), any spiny marine shell of the genus Spondylus."}