{"word":"pack","definition":"1. To make a pack of; to arrange closely and securely in a pack; hence, to place and arrange compactly as in a pack; to press into close order or narrow compass; as to pack goods in a box; to pack fish. Strange materials packed up with wonderful art. Addison. Where . . . the bones Of all my buried ancestors are packed. Shak. 2. To fill in the manner of a pack, that is, compactly and securely, as for transportation; hence, to fill closely or to repletion; to stow away within; to cause to be full; to crowd into; as, to pack a trunk; the play, or the audience, packs the theater. 3. To sort and arrange (the cards) in a pack so as to secure the game unfairly. And mighty dukes pack cards for half a crown. Pope. 4. Hence: To bring together or make up unfairly and fraudulently, in order to secure a certain result; as, to pack a jury or a causes. The expected council was dwindling into . . . a packed assembly of Italian bishops. Atterbury. 5. To contrive unfairly or fraudulently; to plot. [Obs.] He lost life . . . upon a nice point subtilely devised and packed by his enemies. Fuller. 6. To load with a pack; hence, to load; to encumber; as, to pack a horse. Our thighs packed with wax, our mouths with honey. Shack. 7. To cause to go; to send away with baggage or belongings; esp., to send away peremptorily or suddenly; -- sometimes with off; as, to pack a boy off to school. He . . . must not die Till George be packed with post horse up to heaven. Shak. 8. To transport in a pack, or in the manner of a pack (i. e., on the backs of men or beasts). [Western U.S.] 9. (Hydropathy)  To envelop in a wet or dry sheet, within numerous coverings. See Pack, n., 5. 10. (Mech.)  To render impervious, as by filling or surrounding with suitable material, or to fit or adjust so as to move without giving passage to air, water, or steam; as, to pack a joint; to pack the piston of a steam engine.\n\n1. To make up packs, bales, or bundles; to stow articles securely for transportation. 2. To admit of stowage, or of making up for transportation or storage; to become compressed or to settle together, so as to form a compact mass; as, the goods pack conveniently; wet snow packs well. 3. To gather in flocks or schools; as, the grouse or the perch begin to pack. [Eng.] 4. To depart in haste; -- generally with off or away. Poor Stella must pack off to town Swift. You shall pack, And never more darken my doors again. Tennyson. 5. To unite in bad measures; to confederate for ill purposes; to join in collusion. [Obs.] \"Go pack with him.\" Shak. To send packing, to drive away; to send off roughly or in disgrace; to dismiss unceremoniously. \"The parliament . . . presently sent him packing. South."}