{"word":"paddle","definition":"1. To use the hands or fingers in toying; to make caressing strokes. [Obs.] Shak. 2. To dabble in water with hands or feet; to use a paddle, or something which serves as a paddle, in swimming, in paddling a boat, etc. As the men were paddling for their lives. L'Estrange. While paddling ducks the standing lake desire. Gay.\n\n1. To pat or stroke amorously, or gently. To be paddling palms and pinching fingers. Shak. 2. To propel with, or as with, a paddle or paddles. 3. To pad; to tread upon; to trample. [Prov. Eng.]\n\n1. An implement with a broad blade, which is used without a fixed fulcrum in propelling and steering canoes and boats. 2. The broad part of a paddle, with which the stroke is made; hence, any short, broad blade, resembling that of a paddle. Thou shalt have a paddle upon thy weapon. Deut. xxiii. 13. 3. One of the broad boards, or floats, at the circumference of a water wheel, or paddle wheel. 4. A small gate in sluices or lock gates to admit or let off water; - - also called clough. 5. (Zoöl.)  A paddle-shaped foot, as of the sea turtle. 6. A paddle-shaped implement for string or mixing. 7. Etym: [In this sense prob. for older spaddle, a dim. of spade.]  See Paddle staff (b), below. [Prov. Eng.] Paddle beam (Shipbuilding), one of two large timbers supporting the spring beam and paddle box of a steam vessel. -- Paddle board. See Paddle, n., 3. -- Paddle box, the structure inclosing the upper part of the paddle wheel of a steam vessel. -- Paddle shaft, the revolving shaft which carries the paddle wheel of a steam vessel. -- Paddle staff. (a) A staff tipped with a broad blade, used by mole catchers. [Prov. Eng.] (b) A long-handled spade used to clean a plowshare; -- called also plow staff. [Prov. Eng.] -- Paddle steamer, a steam vessel propelled by paddle wheels, in distinction from a screw propeller. -- Paddle wheel, the propelling wheel of a steam vessel, having paddles (or floats) on its circumference, and revolving in a vertical plane parallel to the vessel's length."}