{"word":"pair","definition":"1. A number of things resembling one another, or belonging together; a set; as, a pair or flight of stairs. \"A pair of beads.\" Chaucer. Beau. & Fl. \"Four pair of stairs.\" Macaulay. Note: [Now mostly or quite disused, except as to stairs.] Two crowns in my pocket, two pair of cards. Beau. & Fl. 2. Two things of a kind, similar in form, suited to each other, and intended to be used together; as, a pair of gloves or stockings; a pair of shoes. 3. Two of a sort; a span; a yoke; a couple; a brace; as, a pair of horses; a pair of oxen. 4. A married couple; a man and wife. \"A happy pair.\" Dryden. \"The hapless pair.\" Milton. 5. A single thing, composed of two pieces fitted to each other and used together; as, a pair of scissors; a pair of tongs; a pair of bellows. 6. Two members of opposite parties or opinion, as in a parliamentary body, who mutually agree not to vote on a given question, or on issues of a party nature during a specified time; as, there were two pairs on the final vote. [Parliamentary Cant] 7. (Kinematics)  In a mechanism, two elements, or bodies, which are so applied to each other as to mutually constrain relative motion. Note: Pairs are named in accordance with the kind of motion they permit; thus, a journal and its bearing form a turning pair, a cylinder and its piston a sliding pair, a screw and its nut a twisting pair, etc. Any pair in which the constraining contact is along lines or at points only (as a cam and roller acting together), is designated a higher pair; any pair having constraining surfaces which fit each other (as a cylindrical pin and eye, a screw and its nut, etc.), is called a lower pair. Pair royal (pl. Pairs Royal) three things of a sort; -- used especially of playing cards in some games, as cribbage; as three kings, three \"eight spots\" etc. Four of a kind are called a double pair royal. \"Something in his face gave me as much pleasure as a pair royal of naturals in my own hand.\" Goldsmith. \"That great pair royal of adamantine sisters [the Fates].\" Quarles. [Written corruptly parial and prial.] Syn. -- Pair, Flight, Set. Originally, pair was not confined to two things, but was applied to any number of equal things (pares), that go together. Ben Jonson speaks of a pair (set) of chessmen; also, he and Lord Bacon speak of a pair (pack) of cards. A \"pair of stairs\" is still in popular use, as well as the later expression, \"flight of stairs.\"\n\n1. To be joined in paris; to couple; to mate, as for breeding. 2. To suit; to fit, as a counterpart. My heart was made to fit and pair with thine. Rowe. 3. Same as To pair off. See phrase below. To pair off, to separate from a company in pairs or couples; specif. (Parliamentary Cant), to agree with one of the opposite party or opinion to abstain from voting on specified questions or issues. See Pair, n., 6.\n\n1. To unite in couples; to form a pair of; to bring together, as things which belong together, or which complement, or are adapted to one another. Glossy jet is paired with shining white. Pope. 2. To engage (one's self) with another of opposite opinions not to vote on a particular question or class of questions. [Parliamentary Cant] Paired fins. (Zoöl.) See under Fin.\n\nTo impair. [Obs.] Spenser."}