{"word":"paper","definition":"1. A substance in the form of thin sheets or leaves intended to be written or printed on, or to be used in wrapping. It is made of rags, straw, bark, wood, or other fibrous material, which is first reduced to pulp, then molded, pressed, and dried. 2. A sheet, leaf, or piece of such substance. 3. A printed or written instrument; a document, essay, or the like; a writing; as, a paper read before a scientific society. They brought a paper to me to be signed. Dryden. 4. A printed sheet appearing periodically; a newspaper; a journal; as, a daily paper. 5. Negotiable evidences of indebtedness; notes; bills of exchange, and the like; as, the bank holds a large amount of his paper. 6. Decorated hangings or coverings for walls, made of paper. See Paper hangings, below. 7. A paper containing (usually) a definite quantity; as, a paper of pins, tacks, opium, etc. 8. A medicinal preparation spread upon paper, intended for external application; as, cantharides paper. Note: Paper is manufactured in sheets, the trade names of which, together with the regular sizes in inches, are shown in the following table. But paper makers vary the size somewhat. Note: In the manufacture of books, etc., a sheet, of whatever size originally, is termed, when folded once, a folio; folded twice, a quarto, or 4to; three times, an octavo, or 8vo; four times, a sextodecimo, or 16mo; five times, a 32mo; three times, with an offcut folded twice and set in, a duodecimo, or 12mo; four times, with an offcut folded three times and set in, a 24mo. Note: Paper is often used adjectively or in combination, having commonly an obvious signification; as, paper cutter or paper-cutter; paper knife, paper-knife, or paperknife; paper maker, paper-maker, or papermaker; paper mill or paper-mill; paper weight, paper-weight, or paperweight, etc. Business paper, checks, notes, drafts, etc., given in payment of actual indebtedness; -- opposed to accommodation paper. -- Fly paper, paper covered with a sticky preparation, -- used for catching flies. -- Laid paper. See under Laid. -- Paper birch (Bot.), the canoe birch tree (Betula papyracea). -- Paper blockade, an ineffective blockade, as by a weak naval force. -- Paper boat (Naut.), a boat made of water-proof paper. -- Paper car wheel (Railroad), a car wheel having a steel tire, and a center formed of compressed paper held between two plate-iron disks. Forney. -- Paper credit, credit founded upon evidences of debt, such as promissory notes, duebills, etc. -- Paper hanger, one who covers walls with paper hangings. -- Paper hangings, paper printed with colored figures, or otherwise made ornamental, prepared to be pasted against the walls of apartments, etc.; wall paper. -- Paper house, an audience composed of people who have come in on free passes. [Cant] -- Paper money, notes or bills, usually issued by government or by a banking corporation, promising payment of money, and circulated as the representative of coin. -- Paper mulberry. (Bot.) See under Mulberry. -- Paper muslin, glazed muslin, used for linings, etc. -- Paper nautilus. (Zoöl.) See Argonauta. -- Paper reed (Bot.), the papyrus. -- Paper sailor. (Zoöl.) See Argonauta. -- Paper stainer, one who colors or stamps wall paper. De Colange. -- Paper wasp (Zoöl.), any wasp which makes a nest of paperlike material, as the yellow jacket. -- Paper weight, any object used as a weight to prevent loose papers from being displaced by wind, or otherwise. -- Parchment paper. See Papyrine. -- Tissue paper, thin, gauzelike paper, such as is used to protect engravings in books. -- Wall paper. Same as Paper hangings, above. -- Waste paper, paper thrown aside as worthless or useless, except for uses of little account. -- Wove paper, a writing paper with a uniform surface, not ribbed or watermarked.\n\nOf or pertaining to paper; made of paper; resembling paper; existing only on paper; unsubstantial; as, a paper box; a paper army.\n\n1. To cover with paper; to furnish with paper hangings; as, to paper a room or a house. 2. To fold or inclose in paper. 3. To put on paper; to make a memorandum of. [Obs.]"}