{"word":"parallel","definition":"1. (Geom.)  Extended in the same direction, and in all parts equally distant; as, parallel lines; parallel planes. Revolutions . . . parallel to the equinoctial. Hakluyt. Note: Curved lines or curved planes are said to be parallel when they are in all parts equally distant. 2. Having the same direction or tendency; running side by side; being in accordance (with); tending to the same result; -- used with to and with. When honor runs parallel with the laws of God and our country, it can not be too much cherished. Addison. 3. Continuing a resemblance through many particulars; applicable in all essential parts; like; similar; as, a parallel case; a parallel passage. Addison. Parallel bar. (a) (Steam Eng.) A rod in a parallel motion which is parallel with the working beam. (b) One of a pair of bars raised about five feet above the floor or ground, and parallel to each other, -- used for gymnastic exercises. -- Parallel circles of a sphere, those circles of the sphere whose planes are parallel to each other. -- Parallel columns, or Parallels (Printing), two or more passages of reading matter printed side by side, for the purpose of emphasizing the similarity or discrepancy between them. -- Parallel forces (Mech.), forces which act in directions parallel to each other. -- Parallel motion. (a) (Mach.) A jointed system of links, rods, or bars, by which the motion of a reciprocating piece, as a piston rod, may be guided, either approximately or exactly in a straight line. Rankine. (b) (Mus.) The ascending or descending of two or more parts at fixed intervals, as thirds or sixths. -- Parallel rod (Locomotive Eng.), a metal rod that connects the crank pins of two or more driving wheels; -- called also couping rod, in distinction from the connecting rod. See Illust. of Locomotive, in App. -- Parallel ruler, an instrument for drawing parallel lines, so constructed as to have the successive positions of the ruling edge parallel to each other; also, one consisting of two movable parts, the opposite edges of which are always parallel. -- Parallel sailing (Naut.), sailing on a parallel of latitude. -- Parallel sphere (Astron. & Geog.), that position of the sphere in which the circles of daily motion are parallel to the horizon, as to an observer at either pole. -- Parallel vise, a vise having jaws so guided as to remain parallel in all positions.\n\n1. A line which, throughout its whole extent, is equidistant from another line; a parallel line, a parallel plane, etc. Who made the spider parallels design, Sure as De Moivre, without rule or line Pope. 2. Direction conformable to that of another line, Lines that from their parallel decline. Garth. 3. Conformity continued through many particulars or in all essential points; resemblance; similarity. Twixt earthly females and the moon All parallels exactly run. Swift. 4. A comparison made; elaborate tracing of similarity; as, Johnson's parallel between Dryden and Pope. 5. Anything equal to, or resembling, another in all essential particulars; a counterpart. None but thyself can be thy parallel. Pope. 6. (Geog.)  One of the imaginary circles on the surface of the earth, parallel to the equator, marking the latitude; also, the corresponding line on a globe or map. 7. (Mil.)  One of a series of long trenches constructed before a besieged fortress, by the besieging force, as a cover for troops supporting the attacking batteries. They are roughly parallel to the line of outer defenses of the fortress. 8. (Print.)  A character consisting of two parallel vertical lines (thus, ) used in the text to direct attention to a similarly marked note in the margin or at the foot of a page. Limiting parallels. See under Limit, v. t. -- Parallel of altitude (Astron.), one of the small circles of the sphere, parallel to the horizon; an almucantar. -- Parallel of declination (Astron.), one of the small circles of the sphere, parallel to the equator. -- Parallel of latitude. (a) (Geog.) See def. 6. above. (b) (Astron.) One of the small circles of the sphere, parallel to the ecliptic.\n\n1. To place or set so as to be parallel; to place so as to be parallel to, or to conform in direction with, something else. The needle . . . doth parallel and place itself upon the true meridian. Sir T. Browne. 2. Fig.: To make to conform to something else in character, motive, aim, or the like. His life is paralleled Even with the stroke and line of his great justice. Shak. 3. To equal; to match; to correspond to. Shak. 4. To produce or adduce as a parallel. [R.] Locke. My young remembrance can not parallel A fellow to it. Shak.\n\nTo be parallel; to correspond; to be like. [Obs.] Bacon."}