{"word":"pardon","definition":"1. The act of pardoning; forgiveness, as of an offender, or of an offense; release from penalty; remission of punishment; absolution. Pardon, my lord, for me and for my tidings. Shak. But infinite in pardon was my judge. Milton. Used in expressing courteous denial or contradiction; as, I crave your pardon; or in indicating that one has not understood another; as, I beg pardon. 2. An official warrant of remission of penalty. Sign me a present pardon for my brother. Shak. 3. The state of being forgiven. South. 4. (Law)  A release, by a sovereign, or officer having jurisdiction, from the penalties of an offense, being distinguished from amenesty, which is a general obliteration and canceling of a particular line of past offenses. Syn. -- Forgiveness; remission. See Forgiveness.\n\n1. To absolve from the consequences of a fault or the punishment of crime; to free from penalty; -- applied to the offender. In this thing the Lord pardon thy servant. 2 Kings v. 18. I pray you, pardon me; pray heartily, pardom me. Shak. 2. To remit the penalty of; to suffer to pass without punishment; to forgive; -- applied to offenses. I pray thee, pardon my sin. 1 S Apollo, pardon My great profaneness 'gainst thine oracle Shak. 3. To refrain from exacting as a penalty. I pardon thee thy life before thou ask it. Shak. 4. To give leave (of departure) to. [Obs.] Even now about it! I will pardon you. Shak. Pardon me, forgive me; excuse me; -- a phrase used also to express courteous denial or contradiction. Syn. -- To forgive; absolve; excuse; overlook; remit; asquit. See Excuse.\n\n-- Forgiveness, Pardon. Forgiveness is Anglo-Saxon, and pardon Norman French, both implying a giving back. The word pardon, being early used in our Bible, has, in religious matters, the same sense as forgiveness; but in the language of common life there is a difference between them, such as we often find between corresponding Anglo-Saxon and Norman words. Forgive points to inward feeling, and suppose alienated affection; when we ask forgiveness, we primarily seek the removal of anger. Pardon looks more to outward things or consequences, and is often applied to trifling matters, as when we beg pardon for interrupting a man, or for jostling him in a crowd. The civil magistrate also grants a pardon, and not forgiveness. The two words are, therefore, very clearly distinguished from each other in most cases which relate to the common concerns of life."}