{"word":"part","definition":"1. One of the portions, equal or unequal, into which anything is divided, or regarded as divided; something less than a whole; a number, quantity, mass, or the like, regarded as going to make up, with others, a larger number, quantity, mass, etc., whether actually separate or not; a piece; a fragment; a fraction; a division; a member; a constituent. And kept back part of the price, . . . and brought a certain part and laid it at the apostles'feet. Acts v. 2. Our ideas of extension and number -- do they not contain a secret relation of the parts Locke. I am a part of all that I have met. Tennyson. 2. Hence, specifically: (a) An equal constituent portion; one of several or many like quantities, numbers, etc., into which anything is divided, or of which it is composed; proportional division or ingredient. An homer is the tenth part of an ephah. Ex. xvi. 36. A thought which, quartered, hath but one part wisdom, And ever three parts coward. Shak. (b) A constituent portion of a living or spiritual whole; a member; an organ; an essential element. All the parts were formed . . . into one harmonious body. Locke. The pulse, the glow of every part. Keble. (c) A constituent of character or capacity; quality; faculty; talent; -- usually in the plural with a collective sense. \"Men of considerable parts.\" Burke. \"Great quickness of parts.\" Macaulay. Which maintained so politic a state of evil, that they will not admit any good part to intermingle with them. Shak. (d) Quarter; region; district; -- usually in the plural. \"The uttermost part of the heaven.\" Neh. i. 9. All parts resound with tumults, plaints, and fears. Dryden. (e) (Math.)  Such portion of any quantity, as when taken a certain number of times, will exactly make that quantity; as, 3 is a part of 12; -- the opposite of multiple. Also, a line or other element of a geometrical figure. 3. That which belongs to one, or which is assumed by one, or which falls to one, in a division or apportionment; share; portion; lot; interest; concern; duty; office. We have no part in David. 2 Sam. xx. 1. Accuse not Nature! she hath done her part; Do thou but thine. Milton. Let me bear My part of danger with an equal share. Dryden. 4. Hence, specifically: (a) One of the opposing parties or sides in a conflict or a controversy; a faction. For he that is not against us is on our part. Mark ix. 40. Make whole kingdoms take her brother's part. Waller. (b) A particular character in a drama or a play; an assumed personification; also, the language, actions, and influence of a character or an actor in a play; or, figuratively, in real life. See To act a part, under Act. That part Was aptly fitted and naturally performed. Shak. It was a brute part of him to kill so capital a calf. Shak. Honor and shame from no condition rise; Act well your part, there all the honor lies. Pope. (c) (Mus.)  One of the different melodies of a concerted composition, which heard in union compose its harmony; also, the music for each voice or instrument; as, the treble, tenor, or bass part; the violin part, etc. For my part, so far as concerns me; for my share. -- For the most part. See under Most, a. -- In good part, as well done; favorably; acceptably; in a friendly manner. Hooker. In ill part, unfavorably; with displeasure. -- In part, in some degree; partly. -- Part and parcel, an essential or constituent portion; -- a reduplicative phrase. Cf. might and main, kith and kin, etc. \"She was . . . part and parcel of the race and place.\" Howitt. -- Part of speech (Gram.), a sort or class of words of a particular character; thus, the noun is a part of speech denoting the name of a thing; the verb is a part of speech which asserts something of the subject of a sentence. -- Part owner (Law), one of several owners or tenants in common. See Joint tenant, under Joint. -- Part singing, singing in which two or more of the harmonic parts are taken. -- Part song, a song in two or more (commonly four) distinct vocal parts. \"A part song differs from a madrigal in its exclusion of contrapuntual devices; from a glee, in its being sung by many voices, instead of by one only, to each part.\" Stainer & Barrett. Syn. -- Portion; section; division; fraction; fragment; piece; share; constituent. See Portion, and Section.\n\n1. To divide; to separate into distinct parts; to break into two or more parts or pieces; to sever. \"Thou shalt part it in pieces.\" Lev. ii. 6. There, [celestial love] parted into rainbow hues. Keble. 2. To divide into shares; to divide and distribute; to allot; to apportion; to share. To part his throne, and share his heaven with thee. Pope. They parted my raiment among them. John xix. 24. 3. To separate or disunite; to cause to go apart; to remove from contact or contiguity; to sunder. The Lord do so to me, and more also, if aught but death part thee and me. Ruth i. 17. While he blessed them, he was parted from them, and carried up into heaven. Luke xxiv. 51. The narrow seas that part The French and English. Shak. 4. Hence: To hold apart; to stand between; to intervene betwixt, as combatants. The stumbling night did part our weary powers. Shak. 5. To separate by a process of extraction, elimination, or secretion; as, to part gold from silver. The liver minds his own affair, . . . And parts and strains the vital juices. Prior. 6. To leave; to quit. [Obs.] Since presently your souls must part your bodies. Shak. To part a cable (Naut.), to break it. -- To part company, to separate, as travelers or companions.\n\n1. To be broken or divided into parts or pieces; to break; to become separated; to go asunder; as, rope parts; his hair parts in the middle. 2. To go away; to depart; to take leave; to quit each other; hence, to die; -- often with from. He wrung Bassanio's hand, and so they parted. Shak. He owned that he had parted from the duke only a few hours before. Macaulay. His precious bag, which he would by no means part from. G. Eliot. 3. To perform an act of parting; to relinquish a connection of any kind; -- followed by with or from. Celia, for thy sake, I part With all that grew so near my heart. Waller. Powerful hands . . . will not part Easily from possession won with arms. Milton. It was strange to him that a father should feel no tenderness at parting with an only son. A. Trollope. 4. To have a part or share; to partake. [Obs.] \"They shall part alike.\" 1 Sam. xxx. 24.\n\nPartly; in a measure. [R.] Shak."}