{"word":"particular","definition":"1. Relating to a part or portion of anything; concerning a part separated from the whole or from others of the class; separate; sole; single; individual; specific; as, the particular stars of a constellation. Shak. [/Make] each particular hair to stand an end, Like quills upon the fretful porpentine. Shak. Seken in every halk and every herne Particular sciences for to lerne. Chaucer. 2. Of or pertaining to a single person, class, or thing; belonging to one only; not general; not common; hence, personal; peculiar; singular. \"Thine own particular wrongs.\" Shak. Wheresoever one plant draweth such a particular juice out of the earth. Bacon. 3. Separate or distinct by reason of superiority; distinguished; important; noteworthy; unusual; special; as, he brought no particular news; she was the particular belle of the party. 4. Concerned with, or attentive to, details; minute; circumstantial; precise; as, a full and particular account of an accident; hence, nice; fastidious; as, a man particular in his dress. 5. (Law) (a) Containing a part only; limited; as, a particular estate, or one precedent to an estate in remainder. (b) Holding a particular estate; as, a particular tenant. Blackstone. 6. (Logic)  Forming a part of a genus; relatively limited in extension; affirmed or denied of a part of a subject; as, a particular proposition; -- opposed to universal: e. g. (particular affirmative) Some men are wise; (particular negative) Some men are not wise. Particular average. See under Average. -- Particular Baptist, one of a branch of the Baptist denomination the members of which hold the doctrine of a particular or individual election and reprobation. -- Particular lien (Law), a lien, or a right to retain a thing, for some charge or claim growing out of, or connected with, that particular thing. -- Particular redemption, the doctrine that the purpose, act, and provisions of redemption are restricted to a limited number of the human race. See Calvinism. Syn. -- Minute; individual; respective; appropriate; peculiar; especial; exact; specific; precise; critical; circumstantial. See Minute.\n\n1. A separate or distinct member of a class, or part of a whole; an individual fact, point, circumstance, detail, or item, which may be considered separately; as, the particulars of a story. Particulars which it is not lawful for me to reveal. Bacon. It is the greatest interest of particulars to advance the good of the community. L'Estrange. 2. Special or personal peculiarity, trait, or character; individuality; interest, etc. [Obs.] For his particular I'll receive him gladly. Shak. If the particulars of each person be considered. Milton. Temporal blessings, whether such as concern the public . . . or such as concern our particular. Whole Duty of Man. 3. (Law)  One of the details or items of grounds of claim; -- usually in the pl.; also, a bill of particulars; a minute account; as, a particular of premises. The reader has a particular of the books wherein this law was written. Ayliffe. Bill of particulars. See under Bill. -- In particular, specially; peculiarly. \"This, in particular, happens to the lungs.\" Blackmore. -- To go into particulars, to relate or describe in detail or minutely."}