{"word":"passage","definition":"1. The act of passing; transit from one place to another; movement from point to point; a going by, over, across, or through; as, the passage of a man or a carriage; the passage of a ship or a bird; the passage of light; the passage of fluids through the pores or channels of the body. What! are my doors opposed against my passage! Shak. 2. Transit by means of conveyance; journey, as by water, carriage, car, or the like; travel; right, liberty, or means, of passing; conveyance. The ship in which he had taken passage. Macaulay. 3. Price paid for the liberty to pass; fare; as, to pay one's passage. 4. Removal from life; decease; departure; death. [R.] \"Endure thy mortal passage.\" Milton. When he is fit and season'd for his passage. Shak. 5. Way; road; path; channel or course through or by which one passes; way of exit or entrance; way of access or transit. Hence, a common avenue to various apartments in a building; a hall; a corridor. And with his pointed dart Explores the nearest passage to his heart. Dryden. The Persian army had advanced into the . . . passages of Cilicia. South. 6. A continuous course, process, or progress; a connected or continuous series; as, the passage of time. The conduct and passage of affairs. Sir J. Davies. The passage and whole carriage of this action. Shak. 7. A separate part of a course, process, or series; an occurrence; an incident; an act or deed. \"In thy passages of life.\" Shak. The . . . almost incredible passage of their unbelief. South. 8. A particular portion constituting a part of something continuous; esp., a portion of a book, speech, or musical composition; a paragraph; a clause. How commentators each dark passage shun. Young. 9. Reception; currency. [Obs.] Sir K. Digby. 10. A pass or en encounter; as, a passage at arms. No passages of love Betwixt us twain henceforward evermore. Tennyson. 11. A movement or an evacuation of the bowels. 12. In parliamentary proceedings: (a) The course of a proposition (bill, resolution, etc.) through the several stages of consideration and action; as, during its passage through Congress the bill was amended in both Houses. (b) The advancement of a bill or other proposition from one stage to another by an affirmative vote; esp., the final affirmative action of the body upon a proposition; hence, adoption; enactment; as, the passage of the bill to its third reading was delayed. \"The passage of the Stamp Act.\" D. Hosack. The final question was then put upon its passage. Cushing. In passage, in passing; cursorily. \"These . . . have been studied but in passage.\" Bacon. -- Middle passage, Northeast passage, Northwest passage. See under Middle, Northeast, etc. -- Of passage, passing from one place, region, or climate, to another; migratory; -- said especially of birds \"Birds of passage.\" Longfellow. -- Passage hawk, a hawk taken on its passage or migration. -- Passage money, money paid for conveyance of a passenger, -- usually for carrying passengers by water. Syn. -- Vestibule; hall; corridor. See Vestibule."}