{"word":"pea","definition":"The sliding weight on a steelyard. [Written also pee.]\n\nSee Peak, n., 3.\n\n1. (Bot.)  A plant, and its fruit, of the genus Pisum, of many varieties, much cultivated for food. It has a papilionaceous flower, and the pericarp is a legume, popularly called a pod. Note: When a definite number, more than one, is spoken of, the plural form peas is used; as, the pod contained nine peas; but, in a collective sense, the form pease is preferred; as, a bushel of pease; they had pease at dinner. This distinction is not always preserved, the form peas being used in both senses. 2. A name given, especially in the Southern States, to the seed of several leguminous plants (species of Dolichos, Cicer, Abrus, etc.) esp. those having a scar (hilum) of a different color from the rest of the seed. Note: The name pea is given to many leguminous plants more or less closely related to the common pea. See the Phrases, below. Beach pea (Bot.), a seashore plant, Lathyrus maritimus. -- Black-eyed pea, a West Indian name for Dolichos sphærospermus and its seed. -- Butterfly pea, the American plant Clitoria Mariana, having showy blossoms. -- Chick pea. See Chick-pea. -- Egyptian pea. Same as Chick-pea. -- Everlasting pea. See under Everlasting. -- Glory pea. See under Glory, n. -- Hoary pea, any plant of the genus Tephrosia; goat's rue. -- Issue pea, Orris pea. (Med.) See under Issue, and Orris. -- Milk pea. (Bot.) See under Milk. -- Pea berry, a kind of a coffee bean or grain which grows single, and is round or pea-shaped; often used adjectively; as, pea-berry coffee. -- Pea bug. (Zoöl.) Same as Pea weevil. -- Pea coal, a size of coal smaller than nut coal. -- Pea crab (Zoöl.), any small crab of the genus Pinnotheres, living as a commensal in bivalves; esp., the European species (P. pisum) which lives in the common mussel and the cockle. -- Pea dove (Zoöl.), the American ground dove. -- Pea-flower tribe (Bot.), a suborder (Papilionaceæ) of leguminous plants having blossoms essentially like that of the pea. G. Bentham. -- Pea maggot (Zoöl.), the larva of a European moth (Tortrix pisi), which is very destructive to peas. -- Pea ore (Min.), argillaceous oxide of iron, occurring in round grains of a size of a pea; pisolitic ore. -- Pea starch, the starch or flour of the common pea, which is sometimes used in adulterating wheat flour, pepper, etc. -- Pea tree (Bot.), the name of several leguminous shrubs of the genus Caragana, natives of Siberia and China. -- Pea vine. (Bot.) (a) Any plant which bears peas. (b) A kind of vetch or tare, common in the United States (Lathyrus Americana, and other similar species). -- Pea weevil (Zoöl.), a small weevil (Bruchus pisi) which destroys peas by eating out the interior. -- Pigeon pea. (Bot.) See Pigeon pea. -- Sweet pea (Bot.), the annual plant Lathyrus odoratus; also, its many-colored, sweet-scented blossoms."}