{"word":"pepper","definition":"1. A well-known, pungently aromatic condiment, the dried berry, either whole or powdered, of the Piper nigrum. Note: Common, or black, pepper is made from the whole berry, dried just before maturity; white pepper is made from the ripe berry after the outer skin has been removed by maceration and friction. It has less of the peculiar properties of the plant than the black pepper. Pepper is used in medicine as a carminative stimulant. 2. (Bot.)  The plant which yields pepper, an East Indian woody climber (Piper nigrum), with ovate leaves and apetalous flowers in spikes opposite the leaves. The berries are red when ripe. Also, by extension, any one of the several hundred species of the genus Piper, widely dispersed throughout the tropical and subtropical regions of the earth. 3. Any plant of the genus Capsicum, and its fruit; red pepper; as, the bell pepper. Note: The term pepper has been extended to various other fruits and plants, more or less closely resembling the true pepper, esp. to the common varieties of Capsicum. See Capsicum, and the Phrases, below. African pepper, the Guinea pepper. See under Guinea. -- Cayenne pepper. See under Cayenne. -- Chinese pepper, the spicy berries of the Xanthoxylum piperitum, a species of prickly ash found in China and Japan. -- Guinea pepper. See under Guinea, and Capsicum. -- Jamaica pepper. See Allspice. -- Long pepper. (a) The spike of berries of Piper longum, an East Indian shrub. (b) The root of Piper, or Macropiper, methysticum. See Kava. -- Malaguetta, or Meleguetta, pepper, the aromatic seeds of the Amomum Melegueta, an African plant of the Ginger family. They are sometimes used to flavor beer, etc., under the name of grains of Paradise. -- Red pepper. See Capsicum. -- Sweet pepper bush (Bot.), an American shrub (Clethra alnifolia), with racemes of fragrant white flowers; -- called also white alder. -- Pepper box or caster, a small box or bottle, with a perforated lid, used for sprinkling ground pepper on food, etc. -- Pepper corn. See in the Vocabulary. -- Pepper elder (Bot.), a West Indian name of several plants of the Pepper family, species of Piper and Peperomia. -- Pepper moth (Zoöl.), a European moth (Biston betularia) having white wings covered with small black specks. -- Pepper pot, a mucilaginous soup or stew of vegetables and cassareep, much esteemed in the West Indies. -- Pepper root. (Bot.). See Coralwort. -- pepper sauce, a condiment for the table, made of small red peppers steeped in vinegar. -- Pepper tree (Bot.), an aromatic tree (Drimys axillaris) of the Magnolia family, common in New Zealand. See Peruvian mastic tree, under Mastic.\n\n1. To sprinkle or season with pepper. 2. Figuratively: To shower shot or other missiles, or blows, upon; to pelt; to fill with shot, or cover with bruises or wounds. \"I have peppered two of them.\" \"I am peppered, I warrant, for this world.\" Shak.\n\nTo fire numerous shots (at)."}