{"word":"personal","definition":"1. Pertaining to human beings as distinct from things. Every man so termed by way of personal difference. Hooker. 2. Of or pertaining to a particular person; relating to, or affecting, an individual, or each of many individuals; peculiar or proper to private concerns; not public or general; as, personal comfort; personal desire. The words are conditional, -- If thou doest well, -- and so personal to Cain. Locke. 3. Pertaining to the external or bodily appearance; corporeal; as, personal charms. Addison. 4. Done in person; without the intervention of another. \"Personal communication.\" Fabyan. The immediate and personal speaking of God. White. 5. Relating to an individual, his character, conduct, motives, or private affairs, in an invidious and offensive manner; as, personal reflections or remarks. 6. (Gram.)  Denoting person; as, a personal pronoun. Personal action (Law), a suit or action by which a man claims a debt or personal duty, or damages in lieu of it; or wherein he claims satisfaction in damages for an injury to his person or property, or the specific recovery of goods or chattels; -- opposed to real action. -- Personal equation. (Astron.) See under Equation. -- Personal estate or property (Law), movables; chattels; -- opposed to real estate or property. It usually consists of things temporary and movable, including all subjects of property not of a freehold nature. -- Personal identity (Metaph.), the persistent and continuous unity of the individual person, which is attested by consciousness. -- Personal pronoun (Gram.), one of the pronouns I, thou, he, she, it, and their plurals. -- Personal representatives (Law), the executors or administrators of a person deceased. -- Personal rights, rights appertaining to the person; as, the rights of a personal security, personal liberty, and private property. -- Personal tithes. See under Tithe. -- Personal verb (Gram.), a verb which is modified or inflected to correspond with the three persons.\n\nA movable; a chattel."}