{"word":"person","definition":"1. A character or part, as in a play; a specific kind or manifestation of individual character, whether in real life, or in literary or dramatic representation; an assumed character. [Archaic] His first appearance upon the stage in his new person of a sycophant or juggler. Bacon. No man can long put on a person and act a part. Jer. Taylor. To bear rule, which was thy part And person, hadst thou known thyself aright. Milton. How different is the same man from himself, as he sustains the person of a magistrate and that of a friend! South. 2. The bodily form of a human being; body; outward appearance; as, of comely person. A fair persone, and strong, and young of age. Chaucer. If it assume my noble father's person. Shak. Love, sweetness, goodness, in her person shined. Milton. 3. , self-conscious being, as distinct from an animal or a thing; a moral agent; a human being; a man, woman, or child. Consider what person stands for; which, I think, is a thinking, intelligent being, that has reason and reflection. Locke. 4. A human being spoken of indefinitely; one; a man; as, any person present. 5. A parson; the parish priest. [Obs.] Chaucer. 6. (Theol.)  Among Trinitarians, one of the three subdivisions of the Godhead (the Father, the Son, and the Holy Ghost); an hypostasis. \"Three persons and one God.\" Bk. of Com. Prayer. 7. (Gram.)  One of three relations or conditions (that of speaking, that of being spoken to, and that of being spoken of) pertaining to a noun or a pronoun, and thence also to the verb of which it may be the subject. Note: A noun or pronoun, when representing the speaker, is said to be in the first person; when representing what is spoken to, in the second person; when representing what is spoken of, in the third person. 8. (Biol.)  A shoot or bud of a plant; a polyp or zooid of the compound Hydrozoa Anthozoa, etc.; also, an individual, in the narrowest sense, among the higher animals. Haeckel. True corms, composed of united personæ . . . usually arise by gemmation, . . . yet in sponges and corals occasionally by fusion of several originally distinct persons. Encyc. Brit. Artificial, or Fictitious, person (Law), a corporation or body politic. blackstone. -- Natural person (Law), a man, woman, or child, in distinction from a corporation. -- In person, by one's self; with bodily presence; not by representative. \"The king himself in person is set forth.\" Shak. -- In the person of, in the place of; acting for. Shak.\n\nTo represent as a person; to personify; to impersonate. [Obs.] Milton."}