{"word":"philosophy","definition":"1. Literally, the love of, including the search after, wisdom; in actual usage, the knowledge of phenomena as explained by, and resolved into, causes and reasons, powers and laws. Note: When applied to any particular department of knowledge, philosophy denotes the general laws or principles under which all the subordinate phenomena or facts relating to that subject are comprehended. Thus philosophy, when applied to God and the divine government, is called theology; when applied to material objects, it is called physics; when it treats of man, it is called anthropology and psychology, with which are connected logic and ethics; when it treats of the necessary conceptions and relations by which philosophy is possible, it is called metaphysics. Note: \"Philosophy has been defined: tionscience of things divine and human, and the causes in which they are contained; -- the science of effects by their causes; -- the science of sufficient reasons; -- the science of things possible, inasmuch as they are possible; -- the science of things evidently deduced from first principles; -- the science of truths sensible and abstract; -- the application of reason to its legitimate objects; -- the science of the relations of all knowledge to the necessary ends of human reason; -- the science of the original form of the ego, or mental self; -- the science of science; -- the science of the absolute; -- the scienceof the absolute indifference of the ideal and real.\" Sir W. Hamilton. 2. A particular philosophical system or theory; the hypothesis by which particular phenomena are explained. [Books] of Aristotle and his philosophie. Chaucer. We shall in vain interpret their words by the notions of our philosophy and the doctrines in our school. Locke. 3. Practical wisdom; calmness of temper and judgment; equanimity; fortitude; stoicism; as, to meet misfortune with philosophy. Then had he spent all his philosophy. Chaucer. 4. Reasoning; argumentation. Of good and evil much they argued then, . . . Vain wisdom all, and false philosophy. Milton. 5. The course of sciences read in the schools. Johnson. 6. A treatise on philosophy. Philosophy of the Academy, that of Plato, who taught his disciples in a grove in Athens called the Academy. -- Philosophy of the Garden, that of Epicurus, who taught in a garden in Athens. -- Philosophy of the Lyceum, that of Aristotle, the founder of the Peripatetic school, who delivered his lectures in the Lyceum at Athens. -- Philosophy of the Porch, that of Zeno and the Stoics; -- so called because Zeno of Citium and his successors taught in the porch of the Poicile, a great hall in Athens."}