{"word":"pile","definition":"1. A hair; hence, the fiber of wool, cotton, and the like; also, the nap when thick or heavy, as of carpeting and velvet. Velvet soft, or plush with shaggy pile. Cowper. 2. (Zoöl.)  A covering of hair or fur.\n\nThe head of an arrow or spear. [Obs.] Chapman.\n\n1. A large stake, or piece of timber, pointed and driven into the earth, as at the bottom of a river, or in a harbor where the ground is soft, for the support of a building, a pier, or other superstructure, or to form a cofferdam, etc. Note: Tubular iron piles are now much used. 2. Etym: [Cf. F. pile.] (Her.)  One of the ordinaries or subordinaries having the form of a wedge, usually placed palewise, with the broadest end uppermost. Pile bridge, a bridge of which the roadway is supported on piles. -- Pile cap, a beam resting upon and connecting the heads of piles. -- Pile driver, or Pile engine, an apparatus for driving down piles, consisting usually of a high frame, with suitable appliances for raising to a height (by animal or steam power, the explosion of gunpowder, etc.) a heavy mass of iron, which falls upon the pile. -- Pile dwelling. See Lake dwelling, under Lake. -- Pile plank (Hydraul. Eng.), a thick plank used as a pile in sheet piling. See Sheet piling, under Piling. -- Pneumatic pile. See under Pneumatic. -- Screw pile, one with a screw at the lower end, and sunk by rotation aided by pressure.\n\nTo drive piles into; to fill with piles; to strengthen with piles. To sheet-pile, to make sheet piling in or around. See Sheet piling, under 2nd Piling.\n\n1. A mass of things heaped together; a heap; as, a pile of stones; a pile of wood. 2. A mass formed in layers; as, a pile of shot. 3. A funeral pile; a pyre. Dryden. 4. A large building, or mass of buildings. The pile o'erlooked the town and drew the fight. Dryden. 5. (Iron Manuf.)  Same as Fagot, n., 2. 6. (Elec.)  A vertical series of alternate disks of two dissimilar metals, as copper and zinc, laid up with disks of cloth or paper moistened with acid water between them, for producing a current of electricity; -- commonly called Volta's pile, voltaic pile, or galvanic pile. Note: The term is sometimes applied to other forms of apparatus designed to produce a current of electricity, or as synonymous with battery; as, for instance, to an apparatus for generating a current of electricity by the action of heat, usually called a thermopile. 7. Etym: [F. pile pile, an engraved die, L. pila a pillar.]  The reverse of a coin. See Reverse. Cross and pile. See under Cross. -- Dry pile. See under Dry.\n\n1. To lay or throw into a pile or heap; to heap up; to collect into a mass; to accumulate; to amass; -- often with up; as, to pile up wood. \"Hills piled on hills.\" Dryden. \"Life piled on life.\" Tennyson. The labor of an age in piled stones. Milton. 2. To cover with heaps; or in great abundance; to fill or overfill; to load. To pile arms or muskets (Mil.), to place three guns together so that they may stand upright, supporting each other; to stack arms."}