{"word":"pine","definition":"Woe; torment; pain. [Obs.] \"Pyne of hell.\" Chaucer.\n\n1. To inflict pain upon; to torment; to torture; to afflict. [Obs.] Chaucer. Shak. That people that pyned him to death. Piers Plowman. One is pined in prison, another tortured on the rack. Bp. Hall. 2. To grieve or mourn for. [R.] Milton.\n\n1. To suffer; to be afflicted. [Obs.] 2. To languish; to lose flesh or wear away, under any distress or anexiety of mind; to droop; -- often used with away. \"The roses wither and the lilies pine.\" Tickell. 3. To languish with desire; to waste away with longing for something; -- usually followed by for. For whom, and not for Tybalt, Juliet pined. Shak. Syn. -- To languish; droop; flag; wither; decay.\n\n1. (Bot.)  Any tree of the coniferous genus Pinus. See Pinus. Note: There are about twenty-eight species in the United States, of which the white pine (P. Strobus), the Georgia pine (P. australis), the red pine (P. resinosa), and the great West Coast sugar pine (P. Lambertiana) are among the most valuable. The Scotch pine or fir, also called Norway or Riga pine (Pinus sylvestris), is the only British species. The nut pine is any pine tree, or species of pine, which bears large edible seeds. See Pinon. The spruces, firs, larches, and true cedars, though formerly considered pines, are now commonly assigned to other genera. 2. The wood of the pine tree. 3. A pineapple. Ground pine. (Bot.) See under Ground. -- Norfolk Island pine (Bot.), a beautiful coniferous tree, the Araucaria excelsa. -- Pine barren, a tract of infertile land which is covered with pines. [Southern U.S.] -- Pine borer (Zoöl.), any beetle whose larvæ bore into pine trees. -- Pine finch. (Zoöl.) See Pinefinch, in the Vocabulary. -- Pine grosbeak (Zoöl.), a large grosbeak (Pinicola enucleator), which inhabits the northern parts of both hemispheres. The adult male is more or less tinged with red. -- Pine lizard (Zoöl.), a small, very active, mottled gray lizard (Sceloporus undulatus), native of the Middle States; -- called also swift, brown scorpion, and alligator. -- Pine marten. (Zoöl.) (a) A European weasel (Mustela martes), called also sweet marten, and yellow-breasted marten. (b) The American sable. See Sable. -- Pine moth (Zoöl.), any one of several species of small tortricid moths of the genus Retinia, whose larvæ burrow in the ends of the branchlets of pine trees, often doing great damage. -- Pine mouse (Zoöl.), an American wild mouse (Arvicola pinetorum), native of the Middle States. It lives in pine forests. -- Pine needle (Bot.), one of the slender needle-shaped leaves of a pine tree. See Pinus. -- Pine-needle wool. See Pine wool (below). -- Pine oil, an oil resembling turpentine, obtained from fir and pine trees, and used in making varnishes and colors. -- Pine snake (Zoöl.), a large harmless North American snake (Pituophis melanoleucus). It is whitish, covered with brown blotches having black margins. Called also bull snake. The Western pine snake (P. Sayi) is chestnut-brown, mottled with black and orange. -- Pine tree (Bot.), a tree of the genus Pinus; pine. -- Pine-tree money, money coined in Massachusetts in the seventeenth century, and so called from its bearing a figure of a pine tree. -- Pine weevil (Zoöl.), any one of numerous species of weevils whose larvæ bore in the wood of pine trees. Several species are known in both Europe and America, belonging to the genera Pissodes, Hylobius, etc. -- Pine wool, a fiber obtained from pine needles by steaming them. It is prepared on a large scale in some of the Southern United States, and has many uses in the economic arts; -- called also pine- needle wool, and pine-wood wool."}