{"word":"pink","definition":"A vessel with a very narrow stern; -- called also pinky. Sir W. Scott. Pink stern (Naut.), a narrow stern.\n\nTo wink; to blink. [Obs.] L'Estrange.\n\nHalf-shut; winking. [Obs.] Shak.\n\n1. To pierce with small holes; to cut the edge of, as cloth or paper, in small scallops or angles. 2. To stab; to pierce as with a sword. Addison. 3. To choose; to cull; to pick out. [Obs.] Herbert.\n\nA stab. Grose.\n\n1. (Bot.)  A name given to several plants of the caryophyllaceous genus Dianthus, and to their flowers, which are sometimes very fragrant and often double in cultivated varieties. The species are mostly perennial herbs, with opposite linear leaves, and handsome five- petaled flowers with a tubular calyx. 2. A color resulting from the combination of a pure vivid red with more or less white; -- so called from the common color of the flower. Dryden. 3. Anything supremely excellent; the embodiment or perfection of something. \"The very pink of courtesy.\" Shak. 4. (Zoöl.)  The European minnow; -- so called from the color of its abdomen in summer. [Prov. Eng.] Bunch pink is Dianthus barbatus. -- China, or Indian, pink. See under China. -- Clove pink is Dianthus Caryophyllus, the stock from which carnations are derived. -- Garden pink. See Pheasant's eye. -- Meadow pink is applied to Dianthus deltoides; also, to the ragged robin. -- Maiden pink, Dianthus deltoides. -- Moss pink. See under Moss. -- Pink needle, the pin grass; -- so called from the long, tapering points of the carpels. See Alfilaria. -- Sea pink. See Thrift.\n\nResembling the garden pink in color; of the color called pink (see 6th Pink, 2); as, a pink dress; pink ribbons. Pink eye (Med.), a popular name for an epidemic variety of ophthalmia, associated with early and marked redness of the eyeball. -- Pink salt (Chem. & Dyeing), the double chlorides of (stannic) tin and ammonium, formerly much used as a mordant for madder and cochineal. -- Pink saucer, a small saucer, the inner surface of which is covered with a pink pigment."}