{"word":"pipe","definition":"1. A wind instrument of music, consisting of a tube or tubes of straw, reed, wood, or metal; any tube which produces musical sounds; as, a shepherd's pipe; the pipe of an organ. \"Tunable as sylvan pipe.\" Milton. Now had he rather hear the tabor and the pipe. Shak. 2. Any long tube or hollow body of wood, metal, earthenware, or the like: especially, one used as a conductor of water, steam, gas, etc. 3. A small bowl with a hollow steam, -- used in smoking tobacco, and, sometimes, other substances. 4. A passageway for the air in speaking and breathing; the windpipe, or one of its divisions. 5. The key or sound of the voice. [R.] Shak. 6. The peeping whistle, call, or note of a bird. The earliest pipe of half-awakened birds. Tennyson. 7. pl.  The bagpipe; as, the pipes of Lucknow. 8. (Mining)  An elongated body or vein of ore. 9. A roll formerly used in the English exchequer, otherwise called the Great Roll, on which were taken down the accounts of debts to the king; -- so called because put together like a pipe. Mozley & W. 10. (Naut.)  A boatswain's whistle, used to call the crew to their duties; also, the sound of it. 11. Etym: [Cf. F. pipe, fr. pipe a wind instrument, a tube, fr. L. pipare to chirp. See Etymol. above.]  A cask usually containing two hogsheads, or 126 wine gallons; also, the quantity which it contains. Pipe fitter, one who fits pipes together, or applies pipes, as to an engine or a building. -- Pipe fitting, a piece, as a coupling, an elbow, a valve, etc., used for connecting lengths of pipe or as accessory to a pipe. -- Pipe office, an ancient office in the Court of Exchequer, in which the clerk of the pipe made out leases of crown lands, accounts of cheriffs, etc. [Eng.] -- Pipe tree (Bot.), the lilac and the mock orange; -- so called because their were formerly used to make pipe stems; -- called also pipe privet. -- Pipe wrench, or Pipetongs, a jawed tool for gripping a pipe, in turning or holding it. -- To smoke the pipe of peace, to smoke from the same pipe in token of amity or preparatory to making a treaty of peace, -- a custom of the American Indians.\n\n1. To play on a pipe, fife, flute, or other tubular wind instrument of music. We have piped unto you, and ye have not danced. Matt. xi. 17. 2. (Naut.)  To call, convey orders, etc., by means of signals on a pipe or whistle carried by a boatswain. 3. To emit or have a shrill sound like that of a pipe; to whistle. \"Oft in the piping shrouds.\" Wordsworth. 4. (Metal.)  To become hollow in the process of solodifying; -- said of an ingot, as of steel.\n\n1. To perform, as a tune, by playing on a pipe, flute, fife, etc.; to utter in the shrill tone of a pipe. A robin . . . was piping a few querulous notes. W. Irving. 2. (Naut.)  To call or direct, as a crew, by the boatswain's whistle. As fine a ship's company as was ever piped aloft. Marryat. 3. To furnish or equip with pipes; as, to pipe an engine, or a building."}