{"word":"place","definition":"1. Any portion of space regarded as measured off or distinct from all other space, or appropriated to some definite object or use; position; ground; site; spot; rarely, unbounded space. Here is the place appointed. Shak. What place can be for us Within heaven's bound Milton. The word place has sometimes a more confused sense, and stands for that space which any body takes up; and so the universe is a place. Locke. 2. A broad way in a city; an open space; an area; a court or short part of a street open only at one end. \"Hangman boys in the market place.\" Shak. 3. A position which is occupied and held; a dwelling; a mansion; a village, town, or city; a fortified town or post; a stronghold; a region or country. Are you native of this place Shak. 4. Rank; degree; grade; order of priority, advancement, dignity, or importance; especially, social rank or position; condition; also, official station; occupation; calling. \"The enervating magic of place.\" Hawthorne. Men in great place are thrice servants. Bacon. I know my place as I would they should do theirs. Shak. 5. Vacated or relinquished space; room; stead (the departure or removal of another being or thing being implied). \"In place of Lord Bassanio.\" Shak. 6. A definite position or passage of a document. The place of the scripture which he read was this. Acts viii. 32. 7. Ordinal relation; position in the order of proceeding; as, he said in the first place. 8. Reception; effect; -- implying the making room for. My word hath no place in you. John viii. 37. 9. (Astron.)  Position in the heavens, as of a heavenly body; -- usually defined by its right ascension and declination, or by its latitude and longitude. Place of arms (Mil.), a place calculated for the rendezvous of men in arms, etc., as a fort which affords a safe retreat for hospitals, magazines, etc. Wilhelm. -- High place (Script.), a mount on which sacrifices were offered. \"Him that offereth in the high place.\" Jer. xlviii. 35. -- In place, in proper position; timely. -- Out of place, inappropriate; ill-timed; as, his remarks were out of place. -- Place kick (Football), the act of kicking the ball after it has been placed on the ground. -- Place name, the name of a place or locality. London Academy. -- To give place, to make room; to yield; to give way; to give advantage. \"Neither give place to the devil.\" Eph. iv. 27. \"Let all the rest give place.\" Shak. -- To have place, to have a station, room, or seat; as, such desires can have no place in a good heart. -- To take place. (a) To come to pass; to occur; as, the ceremony will not take place. (b) To take precedence or priority. Addison. (c) To take effect; to prevail. \"If your doctrine takes place.\" Berkeley. \"But none of these excuses would take place.\" Spenser. -- To take the place of, to be substituted for. Syn. -- Situation; seat; abode; position; locality; location; site; spot; office; employment; charge; function; trust; ground; room; stead.\n\n1. To assign a place to; to put in a particular spot or place, or in a certain relative position; to direct to a particular place; to fix; to settle; to locate; as, to place a book on a shelf; to place balls in tennis. Upon my head they placed a fruitless crown. Shak. 2. To put or set in a particular rank, office, or position; to surround with particular circumstances or relations in life; to appoint to certain station or condition of life; as, in whatever sphere one is placed. Place such over them to be rulers. Ex. xviii. 21. 3. To put out at interest; to invest; to loan; as, to place money in a bank. 4. To set; to fix; to repose; as, to place confidence in a friend. \"My resolution 's placed.\" Shak. 5. To attribute; to ascribe; to set down. Place it for her chief virtue. Shak. To place (a person), to identify him. [Colloq. U.S.] Syn. -- See Put."}