{"word":"plate","definition":"1. A flat, or nearly flat, piece of metal, the thickness of which is small in comparison with the other dimensions; a thick sheet of metal; as, a steel plate. 2. Metallic armor composed of broad pieces. Mangled . . . through plate and mail. Milton. 3. Domestic vessels and utensils, as flagons, dishes, cups, etc., wrought in gold or silver. 4. Metallic ware which is plated, in distinction from that which is genuine silver or gold. 5. A small, shallow, and usually circular, vessel of metal or wood, or of earth glazed and baked, from which food is eaten at table. 6. Etym: [Cf. Sp. plata silver.]  A piece of money, usually silver money. [Obs.] \"Realms and islands were as plates dropp'd from his pocket.\" Shak. 7. A piece of metal on which anything is engraved for the purpose of being printed; hence, an impression from the engraved metal; as, a book illustrated with plates; a fashion plate. 8. A page of stereotype, electrotype, or the like, for printing from; as, publisher's plates. 9. That part of an artificial set of teeth which fits to the mouth, and holds the teeth in place. It may be of gold, platinum, silver, rubber, celluloid, etc. 10. (Arch.)  A horizontal timber laid upon a wall, or upon corbels projecting from a wall, and supporting the ends of other timbers; also used specifically of the roof plate which supports the ends of the roof trusses or, in simple work, the feet of the rafters. 11. (Her.)  A roundel of silver or tinctured argent. 12. (Photog.)  A sheet of glass, porcelain, metal, etc., with a coating that is sensitive to light. 13. A prize giving to the winner in a contest. Note: Plate is sometimes used in an adjectival sense or in combination, the phrase or compound being in most cases of obvious signification; as, plate basket or plate-basket, plate rack or plate- rack. Home plate. (Baseball) See Home base, under Home. -- Plate armor. (a) See Plate, n., 2. (b) Strong metal plates for protecting war vessels, fortifications, and the like. -- Plate bone, the shoulder blade, or scapula. -- Plate girder, a girder, the web of which is formed of a single vertical plate, or of a series of such plates riveted together. -- Plate glass. See under Glass. -- Plate iron, wrought iron plates. -- Plate layer, a workman who lays down the rails of a railway and fixes them to the sleepers or ties. -- Plate mark, a special mark or emblematic figure stamped upon gold or silver plate, to indicate the place of manufacture, the degree of purity, and the like; thus, the local mark for London is a lion. -- Plate paper, a heavy spongy paper, for printing from engraved plates. Fairholt. -- Plate press, a press with a flat carriage and a roller, -- used for printing from engraved steel or copper plates. -- Plate printer, one who prints from engraved plates. -- Plate printing, the act or process of printing from an engraved plate or plates. -- Plate tracery. (Arch.) See under Tracery. -- Plate wheel (Mech.), a wheel, the rim and hub of which are connected by a continuous plate of metal, instead of by arms or spokes.\n\n1. To cover or overlay with gold, silver, or other metals, either by a mechanical process, as hammering, or by a chemical process, as electrotyping. 2. To cover or overlay with plates of metal; to arm with metal for defense. Thus plated in habiliments of war. Shak. 3. To adorn with plated metal; as, a plated harness. 4. To beat into thin, flat pieces, or laminæ. 5. To calender; as, to plate paper."}