{"word":"play","definition":"1. To engage in sport or lively recreation; to exercise for the sake of amusement; to frolic; to spot. As Cannace was playing in her walk. Chaucer. The lamb thy riot dooms to bleed to-day, Had he thy reason, would he skip and play! Pope. And some, the darlings of their Lord, Play smiling with the flame and sword. Keble. 2. To act with levity or thoughtlessness; to trifle; to be careless. \"Nay,\" quod this monk, \"I have no lust to pleye.\" Chaucer. Men are apt to play with their healths. Sir W. Temple. 3. To contend, or take part, in a game; as, to play ball; hence, to gamble; as, he played for heavy stakes. 4. To perform on an instrument of music; as, to play on a flute. One that . . . can play well on an instrument. Ezek. xxxiii. 32. Play, my friend, and charm the charmer. Granville. 5. To act; to behave; to practice deception. His mother played false with a smith. Shak. 6. To move in any manner; especially, to move regularly with alternate or reciprocating motion; to operate; to act; as, the fountain plays. The heart beats, the blood circulates, the lungs play. Cheyne. 7. To move gayly; to wanton; to disport. Even as the waving sedges play with wind. Shak. The setting sun Plays on their shining arms and burnished helmets. Addison. All fame is foreign but of true desert, Plays round the head, but comes not to the heart. Pope. 8. To act on the stage; to personate a character. A lord will hear your play to-night. Shak. Courts are theaters where some men play. Donne. To play into a person's hands, to act, or to manage matters, to his advantage or benefit. -- To play off, to affect; to feign; to practice artifice. -- To play upon. (a) To make sport of; to deceive. Art thou alive Or is it fantasy that plays upon our eyesight. Shak. (b) To use in a droll manner; to give a droll expression or application to; as, to play upon words.\n\n1. To put in action or motion; as, to play cannon upon a fortification; to play a trump. First Peace and Silence all disputes control, Then Order plays the soul. Herbert. 2. To perform music upon; as, to play the flute or the organ. 3. To perform, as a piece of music, on an instrument; as, to play a waltz on the violin. 4. To bring into sportive or wanton action; to exhibit in action; to execute; as, to play tricks. Nature here Wantoned as in her prime, and played at will Her virgin fancies. Milton. 5. To act or perform (a play); to represent in music action; as, to play a comedy; also, to act in the character of; to represent by acting; to simulate; to behave like; as, to play King Lear; to play the woman. Thou canst play the rational if thou wilt. Sir W. Scott. 6. To engage in, or go together with, as a contest for amusement or for a wager or prize; as, to play a game at baseball. 7. To keep in play, as a hooked fish, in order to land it. To play off, to display; to show; to put in exercise; as, to play off tricks. -- To play one's cards, to manage one's means or opportunities; to contrive. -- Played out, tired out; exhausted; at the end of one's resources. [Colloq.]\n\n1. Amusement; sport; frolic; gambols. 2. Any exercise, or series of actions, intended for amusement or diversion; a game. John naturally loved rough play. Arbuthnot. 3. The act or practice of contending for victory, amusement, or a prize, as at dice, cards, or billiards; gaming; as, to lose a fortune in play. 4. Action; use; employment; exercise; practice; as, fair play; sword play; a play of wit. \"The next who comes in play.\" Dryden. 5. A dramatic composition; a comedy or tragedy; a composition in which characters are represented by dialogue and action. A play ought to be a just image of human nature. Dryden. 6. The representation or exhibition of a comedy or tragedy; as, he attends ever play. 7. Performance on an instrument of music. 8. Motion; movement, regular or irregular; as, the play of a wheel or piston; hence, also, room for motion; free and easy action. \"To give them play, front and rear.\" Milton. The joints are let exactly into one another, that they have no play between them. Moxon. 9. Hence, liberty of acting; room for enlargement or display; scope; as, to give full play to mirth. Play actor, an actor of dramas. Prynne. -- Play debt, a gambling debt. Arbuthnot. -- Play pleasure, idle amusement. [Obs.] Bacon. -- A play upon words, the use of a word in such a way as to be capable of double meaning; punning. -- Play of colors, prismatic variation of colors. -- To bring into play, To come into play, to bring or come into use or exercise. -- To hold in play, to keep occupied or employed. I, with two more to help me, Will hold the foe in play. Macaulay."}