{"word":"plough","definition":"See Plow.\n\n1. A well-known implement, drawn by horses, mules, oxen, or other power, for turning up the soil to prepare it for bearing crops; also used to furrow or break up the soil for other purposes; as, the subsoil plow; the draining plow. Where fern succeeds ungrateful to the plow. Dryden. 2. Fig.: Agriculture; husbandry. Johnson. 3. A carucate of land; a plowland. [Obs.] [Eng.] Johan, mine eldest son, shall have plowes five. Tale of Gamelyn. 4. A joiner's plane for making grooves; a grooving plane. 5. (Bookbinding)  An implement for trimming or shaving off the edges of books. 6. (Astron.)  Same as Charles's Wain. Ice plow, a plow used for cutting ice on rivers, ponds, etc., into cakes suitable for storing. [U. S.] -- Mackerel plow. See under Mackerel. -- Plow alms, a penny formerly paid by every plowland to the church. Cowell. -- Plow beam, that part of the frame of a plow to which the draught is applied. See Beam, n., 9. -- Plow Monday, the Monday after Twelth Day, or the end of Christmas holidays. -- Plow staff. (a) A kind of long-handled spade or paddle for cleaning the plowshare; a paddle staff. (b) A plow handle. -- Snow plow, a structure, usually\n\n1. To turn up, break up, or trench, with a plow; to till with, or as with, a plow; as, to plow the ground; to plow a field. 2. To furrow; to make furrows, grooves, or ridges in; to run through, as in sailing. Let patient Octavia plow thy visage up With her prepared nails. Shak. With speed we plow the watery way. Pope. 3. (Bookbinding)  To trim, or shave off the edges of, as a book or paper, with a plow. See Plow, n., 5. 4. (Joinery)  To cut a groove in, as in a plank, or the edge of a board; especially, a rectangular groove to receive the end of a shelf or tread, the edge of a panel, a tongue, etc. To plow in, to cover by plowing; as, to plow in wheat. -- To plow up, to turn out of the ground by plowing.plow ahead, to continue in spite of obstacles or resistence by others. Note: Often used in a bad sense, meaning to continue obstinately in spite of the contrary advice of others. plow through, to execute a difficult or laborious task steadily, esp. one containing many parts; as, he plowed through the stack of correspondence until all had been answered.\n\nTo labor with, or as with, a plow; to till or turn up the soil with a plow; to till or turn up the soil with a plow; to prepare the soil or bed for anything. Shak. Doth the plowman plow all day to sow Isa. xxviii. 24."}