{"word":"plume","definition":"1. A feather; esp., a soft, downy feather, or a long, conspicuous, or handsome feather. Wings . . . of many a colored plume. Milton. 2. (Zoöl.)  An ornamental tuft of feathers. 3. A feather, or group of feathers, worn as an ornament; a waving ornament of hair, or other material resembling feathers. His high plume, that nodded o'er his head. Dryden. 4. A token of honor or prowess; that on which one prides himself; a prize or reward. \"Ambitious to win from me some plume.\" Milton. 5. (Bot.)  A large and flexible panicle of inflorescence resembling a feather, such as is seen in certain large ornamental grasses. Plume bird (Zoöl.), any bird that yields ornamental plumes, especially the species of Epimarchus from New Guinea, and some of the herons and egrets, as the white heron of Florida (Ardea candidissima). -- Plume grass. (Bot) (a) A kind of grass (Erianthus saccharoides) with the spikelets arranged in great silky plumes, growing in swamps in the Southern United States. (b) The still finer E. Ravennæ from the Mediterranean region. The name is sometimes extended to the whole genus. -- Plume moth (Zoöl.), any one of numerous small, slender moths, belonging to the family Pterophoridæ. Most of them have the wings deeply divided into two or more plumelike lobes. Some species are injurious to the grapevine. -- Plume nutmeg (Bot.), an aromatic Australian tree (Atherosperma moschata), whose numerous carpels are tipped with long plumose persistent styles.\n\n1. To pick and adjust the plumes or feathers of; to dress or prink. Pluming her wings among the breezy bowers. W. Irving. 2. To strip of feathers; to pluck; to strip; to pillage; also, to peel. [Obs.] Bacon. Dryden. 3. To adorn with feathers or plumes. \"Farewell the plumed troop.\" Shak. 4. To pride; to vaunt; to boast; -- used reflexively; as, he plumes himself on his skill. South. Plumed adder (Zoöl.), an African viper (Vipera, or Clotho, cornuta), having a plumelike structure over each eye. It is venomous, and is related to the African puff adder. Called also horned viper and hornsman. -- Plumed partridge (Zoöl.), the California mountain quail (Oreortyx pictus). See Mountain quail, under Mountain."}