{"word":"plunge","definition":"1. To thrust into water, or into any substance that is penetrable; to immerse; to cause to penetrate or enter quickly and forcibly; to thrust; as, to plunge the body into water; to plunge a dagger into the breast. Also used figuratively; as, to plunge a nation into war. \"To plunge the boy in pleasing sleep.\" Dryden. Bound and plunged him into a cell. Tennyson. We shall be plunged into perpetual errors. I. Watts. 2. To baptize by immersion. 3. To entangle; to embarrass; to overcome. [Obs.] Plunged and graveled with three lines of Seneca. Sir T. Browne.\n\n1. To thrust or cast one's self into water or other fluid; to submerge one's self; to dive, or to rush in; as, he plunged into the river. Also used figuratively; as, to plunge into debt. Forced to plunge naked in the raging sea. Dryden. To plunge into guilt of a murther. Tillotson. 2. To pitch or throw one's self headlong or violently forward, as a horse does. Some wild colt, which . . . flings and plunges. Bp. Hall. 3. To bet heavily and with seeming recklessness on a race, or other contest; in an extended sense, to risk large sums in hazardous speculations. [Cant] Plunging fire (Gun.), firing directed upon an enemy from an elevated position.\n\n1. The act of thrusting into or submerging; a dive, leap, rush, or pitch into, or as into, water; as, to take the water with a plunge. 2. Hence, a desperate hazard or act; a state of being submerged or overwhelmed with difficulties. [R.] She was brought to that plunge, to conceal her husband's murder or accuse her son. Sir P. Sidney. And with thou not reach out a friendly arm, To raise me from amidst this plunge of sorrows Addison. 3. The act of pitching or throwing one's self headlong or violently forward, like an unruly horse. 4. Heavy and reckless betting in horse racing; hazardous speculation. [Cant] Plunge bath, an immersion by plunging; also, a large bath in which the bather can wholly immerse himself. -- Plunge, or plunging, battery (Elec.), a voltaic battery so arranged that the plates can be plunged into, or withdrawn from, the exciting liquid at pleasure."}