{"word":"pocket","definition":"1. A bag or pouch; especially; a small bag inserted in a garment for carrying small articles, particularly money; hence, figuratively, money; wealth. 2. One of several bags attached to a billiard table, into which the balls are driven. 3. A large bag or sack used in packing various articles, as ginger, hops, cowries, etc. Note: In the wool or hop trade, the pocket contains half sack, or about 168 Ibs.; but it is a variable quantity, the articles being sold by actual weight. 4. (Arch.)  A hole or space covered by a movable piece of board, as in a floor, boxing, partitions, or the like. 5. (Mining.) (a) A cavity in a rock containing a nugget of gold, or other mineral; a small body of ore contained in such a cavity. (b) A hole containing water. 6. (Nat.)  A strip of canvas, sewn upon a sail so that a batten or a light spar can placed in the interspace. 7. (Zoöl.)  Same as Pouch. Note: Pocket is often used adjectively, or in the formation of compound words usually of obvious signification; as, pocket comb, pocket compass, pocket edition, pocket handkerchief, pocket money, pocket picking, or pocket-picking, etc. Out of pocket. See under Out, prep. -- Pocket borough, a borough \"owned\" by some person. See under Borough. [Eng.] -- Pocket gopher (Zoöl.), any one of several species of American rodents of the genera Geomys, and Thomomys, family Geomydæ. They have large external cheek pouches, and are fossorial in their habits. they inhabit North America, from the Mississippi Valley west to the Pacific. Called also pouched gopher. -- Pocket mouse (Zoöl.), any species of American mice of the family Saccomyidæ. They have external cheek pouches. Some of them are adapted for leaping (genus Dipadomys), and are called kangaroo mice. They are native of the Southwestern United States, Mexico, etc. -- Pocket piece, a piece of money kept in the pocket and not spent. -- Pocket pistol, a pistol to be carried in the pocket. -- Pocket sheriff (Eng. Law), a sheriff appointed by the sole authority of the crown, without a nomination by the judges in the exchequer. Burrill. deep pocket, or deep pockets, wealth or substantial financial assets. Note: Used esp. in legal actions, where plaintiffs desire to find a defendant with \"deep pockets\", so as to be able to actually obtain the sum of damages which may be judged due to him. This contrasts with a \"judgment-proof\" defendant, one who has neither assets nor insurance, and against whom a judgment for monetary damages would be worthless.\n\n1. To put, or conceal, in the pocket; as, to pocket the change. He would pocket the expense of the license. Sterne. 2. To take clandestinely or fraudulently. He pocketed pay in the names of men who had long been dead. Macaulay. To pocket a ball (Billiards), to drive a ball into a pocket of the table. -- To pocket an insult, affront, etc., to receive an affront without open resentment, or without seeking redress. \"I must pocket up these wrongs.\" Shak."}