{"word":"point","definition":"To appoint. [Obs.] Spenser.\n\n1. That which pricks or pierces; the sharp end of anything, esp. the sharp end of a piercing instrument, as a needle or a pin. 2. An instrument which pricks or pierces, as a sort of needle used by engravers, etchers, lace workers, and others; also, a pointed cutting tool, as a stone cutter's point; -- called also pointer. 3. Anything which tapers to a sharp, well-defined termination. Specifically: A small promontory or cape; a tract of land extending into the water beyond the common shore line. 4. The mark made by the end of a sharp, piercing instrument, as a needle; a prick. 5. An indefinitely small space; a mere spot indicated or supposed. Specifically: (Geom.) That which has neither parts nor magnitude; that which has position, but has neither length, breadth, nor thickness, -- sometimes conceived of as the limit of a line; that by the motion of which a line is conceived to be produced. 6. An indivisible portion of time; a moment; an instant; hence, the verge. When time's first point begun Made he all souls. Sir J. Davies. 7. A mark of punctuation; a character used to mark the divisions of a composition, or the pauses to be observed in reading, or to point off groups of figures, etc.; a stop, as a comma, a semicolon, and esp. a period; hence, figuratively, an end, or conclusion. And there a point, for ended is my tale. Chaucer. Commas and points they set exactly right. Pope. 8. Whatever serves to mark progress, rank, or relative position, or to indicate a transition from one state or position to another, degree; step; stage; hence, position or condition attained; as, a point of elevation, or of depression; the stock fell off five points; he won by tenpoints. \"A point of precedence.\" Selden. \"Creeping on from point to point.\" Tennyson. A lord full fat and in good point. Chaucer. 9. That which arrests attention, or indicates qualities or character; a salient feature; a characteristic; a peculiarity; hence, a particular; an item; a detail; as, the good or bad points of a man, a horse, a book, a story, etc. He told him, point for point, in short and plain. Chaucer. In point of religion and in point of honor. Bacon. Shalt thou dispute With Him the points of liberty Milton. 10. Hence, the most prominent or important feature, as of an argument, discourse, etc.; the essential matter; esp., the proposition to be established; as, the point of an anecdote. \"Here lies the point.\" Shak. They will hardly prove his point. Arbuthnot. 11. A small matter; a trifle; a least consideration; a punctilio. This fellow doth not stand upon points. Shak. [He] cared not for God or man a point. Spenser. 12. (Mus.)  A dot or mark used to designate certain tones or time; as: (a) (Anc. Mus.) A dot or mark distinguishing or characterizing certain tones or styles; as, points of perfection, of augmentation, etc.; hence, a note; a tune. \"Sound the trumpet -- not a levant, or a flourish, but a point of war.\" Sir W. Scott. (b) (Mod. Mus.) A dot placed at the right hand of a note, to raise its value, or prolong its time, by one half, as to make a whole note equal to three half notes, a half note equal to three quarter notes. 13. (Astron.)  A fixed conventional place for reference, or zero of reckoning, in the heavens, usually the intersection of two or more great circles of the sphere, and named specifically in each case according to the position intended; as, the equinoctial points; the solstitial points; the nodal points; vertical points, etc. See Equinoctial Nodal. 14. (Her.)  One of the several different parts of the escutcheon. See Escutcheon. 15. (Naut.) (a) One of the points of the compass (see Points of the compass, below); also, the difference between two points of the compass; as, to fall off a point. (b) A short piece of cordage used in reefing sails. See Reef point, under Reef. 16. (Anc. Costume)  A a string or lace used to tie together certain parts of the dress. Sir W. Scott. 17. Lace wrought the needle; as, point de Venise; Brussels point. See Point lace, below. 18. pl. (Railways)  A switch. [Eng.] 19. An item of private information; a hint; a tip; a pointer. [Cant, U. S.] 20. (Cricket)  A fielder who is stationed on the off side, about twelve or fifteen yards from, and a little in advance of, the batsman. 21. The attitude assumed by a pointer dog when he finds game; as, the dog came to a point. See Pointer. 22. (Type Making)  A standard unit of measure for the size of type bodies, being one twelfth of the thickness of pica type. See Point system of type, under Type. 23. A tyne or snag of an antler. 24. One of the spaces on a backgammon board. 25. (Fencing)  A movement executed with the saber or foil; as, tierce point. Note: The word point is a general term, much used in the sciences, particularly in mathematics, mechanics, perspective, and physics, but generally either in the geometrical sense, or in that of degree, or condition of change, and with some accompanying descriptive or qualifying term, under which, in the vocabulary, the specific uses are explained; as, boiling point, carbon point, dry point, freezing point, melting point, vanishing point, etc. At all points, in every particular, completely; perfectly. Shak. -- At point, In point, At, In, or On, the point, as near as can be; on the verge; about (see About, prep., 6); as, at the point of death; he was on the point of speaking. \"In point to fall down.\" Chaucer. \"Caius Sidius Geta, at point to have been taken, recovered himself so valiantly as brought day on his side.\" Milton. -- Dead point. (Mach.) Same as Dead center, under Dead. -- Far point (Med.), in ophthalmology, the farthest point at which objects are seen distinctly. In normal eyes the nearest point at which objects are seen distinctly; either with the two eyes together (binocular near point), or with each eye separately (monocular near point). -- Nine points of the law, all but the tenth point; the greater weight of authority. -- On the point. See At point, above. -- Point lace, lace wrought with the needle, as distinguished from that made on the pillow. -- Point net, a machine-made lace imitating a kind of Brussels lace (Brussels ground). -- Point of concurrence (Geom.), a point common to two lines, but not a point of tangency or of intersection, as, for instance, that in which a cycloid meets its base. -- Point of contrary flexure, a point at which a curve changes its direction of curvature, or at which its convexity and concavity change sides. -- Point of order, in parliamentary practice, a question of order or propriety under the rules. -- Point of sight (Persp.), in a perspective drawing, the point assumed as that occupied by the eye of the spectator. -- Point of view, the relative position from which anything is seen or any subject is considered. -- Points of the compass (Naut.), the thirty-two points of division of the compass card in the mariner's compass; the corresponding points by which the circle of the horizon is supposed to be divided, of which the four marking the directions of east, west, north, and south, are called cardinal points, and the rest are named from their respective directions, as N. by E., N. N. E., N. E. by N., N. E., etc. See Illust. under Compass. -- Point paper, paper pricked through so as to form a stencil for transferring a design. -- Point system of type. See under Type. -- Singular point (Geom.), a point of a curve which possesses some property not possessed by points in general on the curve, as a cusp, a point of inflection, a node, etc. -- To carry one's point, to accomplish one's object, as in a controversy. -- To make a point of, to attach special importance to. -- To make, or gain, a point, accomplish that which was proposed; also, to make advance by a step, grade, or position. -- To mark, or score, a point, as in billiards, cricket, etc., to note down, or to make, a successful hit, run, etc. -- To strain a point, to go beyond the proper limit or rule; to stretch one's authority or conscience. -- Vowel point, in Hebrew, and certain other Eastern and ancient languages, a mark placed above or below the consonant, or attached to it, representing the vowel, or vocal sound, which precedes or follows the consonant.\n\n1. To give a point to; to sharpen; to cut, forge, grind, or file to an acute end; as, to point a dart, or a pencil. Used also figuratively; as, to point a moral. 2. To direct toward an abject; to aim; as, to point a gun at a wolf, or a cannon at a fort. 3. Hence, to direct the attention or notice of. Whosoever should be guided through his battles by Minerva, and pointed to every scene of them. Pope. 4. To supply with punctuation marks; to punctuate; as, to point a composition. 5. To mark (as Hebrew) with vowel points. 6. To give particular prominence to; to designate in a special manner; to indicate, as if by pointing; as, the error was pointed out. Pope. He points it, however, by no deviation from his straightforward manner of speech. Dickens. 7. To indicate or discover by a fixed look, as game. 8. (Masonry)  To fill up and finish the joints of (a wall), by introducing additional cement or mortar, and bringing it to a smooth surface. 9. (Stone Cutting)  To cut, as a surface, with a pointed tool. To point a rope (Naut.), to taper and neatly finish off the end by interweaving the nettles. -- To point a sail (Naut.), to affix points through the eyelet holes of the reefs. -- To point off, to divide into periods or groups, or to separate, by pointing, as figures. -- To point the yards (of a vessel) (Naut.), to brace them so that the wind shall strike the sails obliquely. Totten.\n\n1. To direct the point of something, as of a finger, for the purpose of designating an object, and attracting attention to it; -- with at. Now must the world point at poor Katharine. Shak. Point at the tattered coat and ragged shoe. Dryden. 2. To indicate the presence of game by fixed and steady look, as certain hunting dogs do. He treads with caution, and he points with fear. Gay. 3. (Med.)  To approximate to the surface; to head; -- said of an abscess. To point at, to treat with scorn or contempt by pointing or directing attention to. -- To point well (Naut.), to sail close to the wind; -- said of a vessel."}