{"word":"poison","definition":"1. Any agent which, when introduced into the animal organism, is capable of producing a morbid, noxious, or deadly effect upon it; as, morphine is a deadly poison; the poison of pestilential diseases. 2. That which taints or destroys moral purity or health; as, the poison of evil example; the poison of sin. Poison ash. (Bot.) (a) A tree of the genus Amyris (A. balsamifera) found in the West Indies, from the trunk of which a black liquor distills, supposed to have poisonous qualities. (b) The poison sumac (Rhus venenata). [U. S.] -- Poison dogwood (Bot.), poison sumac. -- Poison fang (Zoöl.), one of the superior maxillary teeth of some species of serpents, which, besides having the cavity for the pulp, is either perforated or grooved by a longitudinal canal, at the lower end of which the duct of the poison gland terminates. See Illust. under Fang. -- Poison gland (Biol.), a gland, in animals or plants, which secretes an acrid or venomous matter, that is conveyed along an organ capable of inflicting a wound. -- Poison hemlock (Bot.), a poisonous umbelliferous plant (Conium maculatum). See Hemlock. -- Poison ivy (Bot.), a poisonous climbing plant (Rhus Toxicodendron) of North America. It is common on stone walls and on the trunks of trees, and has trifoliate, rhombic-ovate, variously notched leaves. Many people are poisoned by it, if they touch the leaves. See Poison sumac. Called also poison oak, and mercury. -- Poison nut. (Bot.) (a) Nux vomica. (b) The tree which yields this seed (Strychnos Nuxvomica). It is found on the Malabar and Coromandel coasts. -- Poison oak (Bot.), the poison ivy; also, the more shrubby Rhus diversiloba of California and Oregon. Poison sac. (Zoöl.) Same as Poison gland, above. See Illust. under Fang. -- Poison sumac (Bot.), a poisonous shrub of the genus Rhus (R. venenata); -- also called poison ash, poison dogwood, and poison elder. It has pinnate leaves on graceful and slender common petioles, and usually grows in swampy places. Both this plant and the poison ivy (Rhus Toxicodendron) have clusters of smooth greenish white berries, while the red-fruited species of this genus are harmless. The tree (Rhus vernicifera) which yields the celebrated Japan lacquer is almost identical with the poison sumac, and is also very poisonous. The juice of the poison sumac also forms a lacquer similar to that of Japan. Syn. -- Venom; virus; bane; pest; malignity. -- Poison, Venom. Poison usually denotes something received into the system by the mouth, breath, etc. Venom is something discharged from animals and received by means of a wound, as by the bite or sting of serpents, scorpions, etc. Hence, venom specifically implies some malignity of nature or purpose.\n\n1. To put poison upon or into; to infect with poison; as, to poison an arrow; to poison food or drink. \"The ingredients of our poisoned chalice.\" Shak. 2. To injure or kill by poison; to administer poison to. If you poison us, do we not die Shak. 3. To taint; to corrupt; to vitiate; as, vice poisons happiness; slander poisoned his mind. Whispering tongues can poison truth. Coleridge.\n\nTo act as, or convey, a poison. Tooth that poisons if it bite. Shak."}