{"word":"pole","definition":"A native or inhabitant of Poland; a Polander.\n\n1. A long, slender piece of wood; a tall, slender piece of timber; the stem of a small tree whose branches have been removed; as, specifically: (a) A carriage pole, a wooden bar extending from the front axle of a carriage between the wheel horses, by which the carriage is guided and held back. (b) A flag pole, a pole on which a flag is supported. (c) A Maypole. See Maypole. (d) A barber's pole, a pole painted in stripes, used as a sign by barbers and hairdressers. (e) A pole on which climbing beans, hops, or other vines, are trained. 2. A measuring stick; also, a measure of length equal to 5 Bacon. Pole bean (Bot.), any kind of bean which is customarily trained on poles, as the scarlet runner or the Lima bean. -- Pole flounder (Zoöl.), a large deep-water flounder (Glyptocephalus cynoglossus), native of the northern coasts of Europe and America, and much esteemed as a food fish; -- called also craig flounder, and pole fluke. -- Pole lathe, a simple form of lathe, or a substitute for a lathe, in which the work is turned by means of a cord passing around it, one end being fastened to the treadle, and the other to an elastic pole above. -- Pole mast (Naut.), a mast formed from a single piece or from a single tree. -- Pole of a lens (Opt.), the point where the principal axis meets the surface. -- Pole plate (Arch.), a horizontal timber resting on the tiebeams of a roof and receiving the ends of the rafters. It differs from the plate in not resting on the wall.\n\n1. To furnish with poles for support; as, to pole beans or hops. 2. To convey on poles; as, to pole hay into a barn. 3. To impel by a pole or poles, as a boat. 4. To stir, as molten glass, with a pole.\n\n1. Either extremity of an axis of a sphere; especially, one of the extremities of the earth's axis; as, the north pole. 2. (Spherics)  A point upon the surface of a sphere equally distant from every part of the circumference of a great circle; or the point in which a diameter of the sphere perpendicular to the plane of such circle meets the surface. Such a point is called the pole of that circle; as, the pole of the horizon; the pole of the ecliptic; the pole of a given meridian. 3. (Physics)  One of the opposite or contrasted parts or directions in which a polar force is manifested; a point of maximum intensity of a force which has two such points, or which has polarity; as, the poles of a magnet; the north pole of a needle. 4. The firmament; the sky. [Poetic] Shoots against the dusky pole. Milton. 5. (Geom.)  See Polarity, and Polar, n. Magnetic pole. See under Magnetic. -- Poles of the earth, or Terrestrial poles (Geog.), the two opposite points on the earth's surface through which its axis passes. -- Poles of the heavens, or Celestial poles, the two opposite points in the celestial sphere which coincide with the earth's axis produced, and about which the heavens appear to revolve."}