{"word":"policy","definition":"1. Civil polity. [Obs.] 2. The settled method by which the government and affairs of a nation are, or may be, administered; a system of public or official administration, as designed to promote the external or internal prosperity of a state. 3. The method by which any institution is administered; system of management; course. 4. Management or administration based on temporal or material interest, rather than on principles of equity or honor; hence, worldly wisdom; dexterity of management; cunning; stratagem. 5. Prudence or wisdom in the management of public and private affairs; wisdom; sagacity; wit. The very policy of a hostess, finding his purse so far above his clothes, did detect him. Fuller. 6. Motive; object; inducement. [Obs.] What policy have you to bestow a benefit where it is counted an injury Sir P. Sidney. Syn. -- See Polity.\n\nTo regulate by laws; to reduce to order. [Obs.] \"Policying of cities.\" Bacon.\n\n1. A ticket or warrant for money in the public funds. 2. The writing or instrument in which a contract of insurance is embodied; an instrument in writing containing the terms and conditions on which one party engages to indemnify another against loss arising from certain hazards, perils, or risks to which his person or property may be exposed. See Insurance. 3. A method of gambling by betting as to what numbers will be drawn in a lottery; as, to play policy. Interest policy, a policy that shows by its form that the assured has a real, substantial interest in the matter insured. -- Open policy, one in which the value of the goods or property insured is not mentioned. -- Policy book, a book to contain a record of insurance policies. -- Policy holder, one to whom an insurance policy has been granted. -- Policy shop, a gambling place where one may bet on the numbers which will be drawn in lotteries. -- Valued policy, one in which the value of the goods, property, or interest insured is specified. -- Wager policy, a policy that shows on the face of it that the contract it embodies is a pretended insurance, founded on an ideal risk, where the insured has no interest in anything insured."}