{"word":"poor","definition":"1. Destitute of property; wanting in material riches or goods; needy; indigent. Note: It is often synonymous with indigent and with necessitous denoting extreme want. It is also applied to persons who are not entirely destitute of property, but who are not rich; as, a poor man or woman; poor people. 2. (Law)  So completely destitute of property as to be entitled to maintenance from the public. 3. Hence, in very various applications:  Destitute of such qualities as are desirable, or might naturally be expected; as: (a) Wanting in fat, plumpness, or fleshiness; lean; emaciated; meager; as, a poor horse, ox, dog, etc. \"Seven other kine came up after them, poor and very ill-favored and lean-fleshed.\" Gen. xli. 19. (b) Wanting in strength or vigor; feeble; dejected; as, poor health; poor spirits. \"His genius . . . poor and cowardly.\" Bacon. (c) Of little value or worth; not good; inferior; shabby; mean; as, poor clothes; poor lodgings. \"A poor vessel.\" Clarendon. (d) Destitute of fertility; exhausted; barren; sterile; -- said of land; as, poor soil. (e) Destitute of beauty, fitness, or merit; as, a poor discourse; a poor picture. (f) Without prosperous conditions or good results; unfavorable; unfortunate; unconformable; as, a poor business; the sick man had a poor night. (g) Inadequate; insufficient; insignificant; as, a poor excuse. That I have wronged no man will be a poor plea or apology at the last day. Calamy. 4. Worthy of pity or sympathy; -- used also sometimes as a term of endearment, or as an expression of modesty, and sometimes as a word of contempt. And for mine own poor part, Look you, I'll go pray. Shak. Poor, little, pretty, fluttering thing. Prior. 5. Free from self-assertion; not proud or arrogant; meek. \"Blessed are the poor in spirit.\" Matt. v. 3. Poor law, a law providing for, or regulating, the relief or support of the poor. -- Poor man's treacle (Bot.), garlic; -- so called because it was thought to be an antidote to animal poison. [Eng] Dr. Prior. -- Poor man's weatherglass (Bot.), the red-flowered pimpernel (Anagallis arvensis), which opens its blossoms only in fair weather. -- Poor rate, an assessment or tax, as in an English parish, for the relief or support of the poor. -- Poor soldier (Zoöl.), the friar bird. -- The poor, those who are destitute of property; the indigent; the needy. In a legal sense, those who depend on charity or maintenance by the public. \"I have observed the more public provisions are made for the poor, the less they provide for themselves.\" Franklin.\n\nA small European codfish (Gadus minutus); -- called also power cod."}