{"word":"port","definition":"A dark red or purple astringent wine made in Portugal. It contains a large percentage of alcohol.\n\n1. A place where ships may ride secure from storms; a sheltered inlet, bay, or cove; a harbor; a haven. Used also figuratively. Peering in maps for ports and piers and roads. Shak. We are in port if we have Thee. Keble. 2. In law and commercial usage, a harbor where vessels are admitted to discharge and receive cargoes, from whence they depart and where they finish their voyages. Free port. See under Free. -- Port bar. (Naut,) (a) A boom. See Boom, 4, also Bar, 3. (b) A bar, as of sand, at the mouth of, or in, a port. -- Port charges (Com.), charges, as wharfage, etc., to which a ship or its cargo is subjected in a harbor. -- Port of entry, a harbor where a customhouse is established for the legal entry of merchandise. -- Port toll (Law), a payment made for the privilege of bringing goods into port. -- Port warden, the officer in charge of a port; a harbor master.\n\n1. A passageway; an opening or entrance to an inclosed place; a gate; a door; a portal. [Archaic] Him I accuse The city ports by this hath entered. Shak. Form their ivory port the cherubim Forth issuing. Milton. 2. (Naut.)  An opening in the side of a vessel; an embrasure through which cannon may be discharged; a porthole; also, the shutters which close such an opening. Her ports being within sixteen inches of the water. Sir W. Raleigh. 3. (Mach.)  A passageway in a machine, through which a fluid, as steam, water, etc., may pass, as from a valve to the interior of the cylinder of a steam engine; an opening in a valve seat, or valve face. Air port, Bridle port, etc. See under Air, Bridle, etc. -- Port bar (Naut.), a bar to secure the ports of a ship in a gale. -- Port lid (Naut.), a lid or hanging for closing the portholes of a vessel. -- Steam port, and Exhaust port (Steam Engine), the ports of the cylinder communicating with the valve or valves, for the entrance or exit of the steam, respectively.\n\n1. To carry; to bear; to transport. [Obs.] They are easily ported by boat into other shires. Fuller. 2. (Mil.)  To throw, as a musket, diagonally across the body, with the lock in front, the right hand grasping the small of the stock, and the barrel sloping upward and crossing the point of the left shoulder; as, to port arms. Began to hem him round with ported spears. Milton. Port arms, a position in the manual of arms, executed as above.\n\nThe manner in which a person bears himself; deportment; carriage; bearing; demeanor; hence, manner or style of living; as, a proud port. Spenser. And of his port as meek as is a maid. Chaucer. The necessities of pomp, grandeur, and a suitable port in the world. South.\n\nThe larboard or left side of a ship (looking from the stern toward the bow); as, a vessel heels to port. See Note under Larboard. Also used adjectively.\n\nTo turn or put to the left or larboard side of a ship; -- said of the helm, and used chiefly in the imperative, as a command; as, port your helm."}