{"word":"positive","definition":"1. Having a real position, existence, or energy; existing in fact; real; actual; -- opposed to negative. \"Positive good.\" Bacon. 2. Derived from an object by itself; not dependent on changing circumstances or relations; absolute; -- opposed to relative; as, the idea of beauty is not positive, but depends on the different tastes individuals. 3. Definitely laid down; explicitly stated; clearly expressed; -- opposed to implied; as, a positive declaration or promise. Positive words, that he would not bear arms against King Edward's son. Bacon. 4. Hence: Not admitting of any doubt, condition, qualification, or discretion; not dependent on circumstances or probabilities; not speculative; compelling assent or obedience; peremptory; indisputable; decisive; as, positive instructions; positive truth; positive proof. \"'T is positive 'gainst all exceptions.\" Shak. 5. Prescribed by express enactment or institution; settled by arbitrary appointment; said of laws. In laws, that which is natural bindeth universally; that which is positive, not so. Hooker. 6. Fully assured; confident; certain; sometimes, overconfident; dogmatic; overbearing; -- said of persons. Some positive, persisting fops we know, That, if once wrong, will needs be always. Pope. 7. Having the power of direct action or influence; as, a positive voice in legislation. Swift. 8. (Photog.)  Corresponding with the original in respect to the position of lights and shades, instead of having the lights and shades reversed; as, a positive picture. 9. (Chem.) (a) Electro-positive. (b) Hence, basic; metallic; not acid; -- opposed to negative, and said of metals, bases, and basic radicals. Positive crystals (Opt.), a doubly refracting crystal in which the index of refraction for the extraordinary ray is greater than for the ordinary ray, and the former is refracted nearer to the axis than the latter, as quartz and ice; -- opposed to negative crystal, or one in which this characteristic is reversed, as Iceland spar, tourmaline, etc. -- Positive degree (Gram.), that state of an adjective or adverb which denotes simple quality, without comparison or relation to increase or diminution; as, wise, noble. -- Positive electricity (Elec), the kind of electricity which is developed when glass is rubbed with silk, or which appears at that pole of a voltaic battery attached to the plate that is not attacked by the exciting liquid; -- formerly called vitreous electricity; -- opposed to Ant: negative electricity. -- Positive eyepiece. See under Eyepiece. -- Positive law. See Municipal law, under Law. -- Positive motion (Mach.), motion which is derived from a driver through unyielding intermediate pieces, or by direct contact, and not through elastic connections, nor by means of friction, gravity, etc.; definite motion. -- Positive philosophy. See Positivism. -- Positive pole. (a) (Elec.) The pole of a battery or pile which yields positive or vitreous electricity; -- opposed to Ant: negative pole. (b) (Magnetism) The north pole. [R.] -- Positive quantity (Alg.), an affirmative quantity, or one affected by the sign plus [+]. -- Positive rotation (Mech.), left-handed rotation. -- Positive sign (Math.), the sign [+] denoting plus, or more, or addition.\n\n1. That which is capable of being affirmed; reality. South. 2. That which settles by absolute appointment. 3. (Gram.)  The positive degree or form. 4. (Photog.)  A picture in which the lights and shades correspond in position with those of the original, instead of being reversed, as in a negative. R. Hunt. 5. (Elec.)  The positive plate of a voltaic or electrolytic cell."}