{"word":"post","definition":"Hired to do what is wrong; suborned. [Obs.] Sir E. Sandys.\n\n1. A piece of timber, metal, or other solid substance, fixed, or to be fixed, firmly in an upright position, especially when intended as a stay or support to something else; a pillar; as, a hitching post; a fence post; the posts of a house. They shall take of the blood, and strike it on the two side posts and on the upper doorpost of the houses. Ex. xii. 7. Then by main force pulled up, and on his shoulders bore, The gates of Azza, post and massy bar. Milton. Unto his order he was a noble post. Chaucer. Note: Post, in the sense of an upright timber or strut, is used in composition, in such words as king-post, queen-post, crown-post, gatepost, etc. 2. The doorpost of a victualer's shop or inn, on which were chalked the scores of customers; hence, a score; a debt. [Obs.] When God sends coin I will discharge your post. S. Rowlands. From pillar to post. See under Pillar. -- Knight of the post. See under Knight. -- Post hanger (Mach.), a bearing for a revolving shaft, adapted to be fastened to a post. -- Post hole, a hole in the ground to set the foot of a post in. -- Post mill, a form of windmill so constructed that the whole fabric rests on a vertical axis firmly fastened to the ground, and capable of being turned as the direction of the wind varies. -- Post and stall (Coal Mining), a mode of working in which pillars of coal are left to support the roof of the mine.\n\n1. The place at which anything is stopped, placed, or fixed; a station. Specifically: (a) A station, or one of a series of stations, established for the refreshment and accommodation of travelers on some recognized route; as, a stage or railway post. (b) A military station; the place at which a soldier or a body of troops is stationed; also, the troops at such a station. (c) The piece of ground to which a sentinel's walk is limited. 2. A messenger who goes from station; an express; especially, one who is employed by the government to carry letters and parcels regularly from one place to another; a letter carrier; a postman. In certain places there be always fresh posts, to carry that further which is brought unto them by the other. Abp. Abbot. I fear my Julia would not deign my lines, Receiving them from such a worthless post. Shak. 3. An established conveyance for letters from one place or station to another; especially, the governmental system in any country for carrying and distributing letters and parcels; the post office; the mail; hence, the carriage by which the mail is transported. I send you the fair copy of the poem on dullness, which I should not care to hazard by the common post. Pope. 4. Haste or speed, like that of a messenger or mail carrier. [Obs.] \"In post he came.\" Shak. 5. One who has charge of a station, especially of a postal station. [Obs.] He held office of postmaster, or, as it was then called, post, for several years. Palfrey. 6. A station, office, or position of service, trust, or emolument; as, the post of duty; the post of danger. The post of honor is a private station. Addison. 7. A size of printing and writing paper. See the Table under Paper. Post and pair, an old game at cards, in which each player a hand of three cards. B. Jonson. -- Post bag, a mail bag. -- Post bill, a bill of letters mailed by a postmaster. -- Post chaise, or Post coach, a carriage usually with four wheels, for the conveyance of travelers who travel post. Post day, a day on which the mall arrives or departs. -- Post hackney, a hired post horse. Sir H. Wotton. -- Post horn, a horn, or trumpet, carried and blown by a carrier of the public mail, or by a coachman. -- Post horse, a horse stationed, intended, or used for the post. -- Post hour, hour for posting letters. Dickens. -- Post office. (a) An office under governmental superintendence, where letters, papers, and other mailable matter, are received and distributed; a place appointed for attending to all business connected with the mail. (b) The governmental system for forwarding mail matter. -- Postoffice order. See Money order, under Money. -- Post road, or Post route, a road or way over which the mail is carried. -- Post town. (a) A town in which post horses are kept. (b) A town in which a post office is established by law. -- To ride post, to ride, as a carrier of dispatches, from place to place; hence, to ride rapidly, with as little delay as possible. -- To travel post, to travel, as a post does, by relays of horses, or by keeping one carriage to which fresh horses are attached at each stopping place.\n\n1. To attach to a post, a wall, or other usual place of affixing public notices; to placard; as, to post a notice; to post playbills. Note: Formerly, a large post was erected before the sheriff's office, or in some public place, upon which legal notices were displayed. This way of advertisement has not entirely gone of use. 2. To hold up to public blame or reproach; to advertise opprobriously; to denounce by public proclamation; as, to post one for cowardice. On pain of being posted to your sorrow Fail not, at four, to meet me. Granville. 3. To enter (a name) on a list, as for service, promotion, or the like. 4. To assign to a station; to set; to place; as, to post a sentinel. \"It might be to obtain a ship for a lieutenant, . . . or to get him posted.\" De Quincey. 5. (Bookkeeping)  To carry, as an account, from the journal to the ledger; as, to post an account; to transfer, as accounts, to the ledger. You have not posted your books these ten years. Arbuthnot. 6. To place in the care of the post; to mail; as, to post a letter. 7. To inform; to give the news to; to make (one) acquainted with the details of a subject; -- often with up. Thoroughly posted up in the politics and literature of the day. Lond. Sat. Rev. To post off, to put off; to delay. [Obs.] \"Why did I, venturously, post off so great a business\" Baxter. -- To post over, to hurry over. [Obs.] Fuller.\n\n1. To travel with post horses; figuratively, to travel in haste. \"Post seedily to my lord your husband.\" Shak. And post o'er land and ocean without rest. Milton. 2. (Man.)  To rise and sink in the saddle, in accordance with the motion of the horse, esp. in trotting. [Eng.]\n\nWith post horses; hence, in haste; as, to travel post."}