{"word":"power","definition":"Same as Poor, the fish.\n\n1. Ability to act, regarded as latent or inherent; the faculty of doing or performing something; capacity for action or performance; capability of producing an effect, whether physical or moral: potency; might; as, a man of great power; the power of capillary attraction; money gives power. \"One next himself in power, and next in crime.\" Milton. 2. Ability, regarded as put forth or exerted; strength, force, or energy in action; as, the power of steam in moving an engine; the power of truth, or of argument, in producing conviction; the power of enthusiasm. \"The power of fancy.\" Shak. 3. Capacity of undergoing or suffering; fitness to be acted upon; susceptibility; -- called also passive power; as, great power of endurance. Power, then, is active and passive; faculty is active power or capacity; capacity is passive power. Sir W. Hamilton. 4. The exercise of a faculty; the employment of strength; the exercise of any kind of control; influence; dominion; sway; command; government. Power is no blessing in itself but when it is employed to protect the innocent. Swift. 5. The agent exercising an ability to act; an individual invested with authority; an institution, or government, which exercises control; as, the great powers of Europe; hence, often, a superhuman agent; a spirit; a divinity. \"The powers of darkness.\" Milton. And the powers of the heavens shall be shaken. Matt. xxiv. 29. 6. A military or naval force; an army or navy; a great host. Spenser. Never such a power . . . Was levied in the body of a land. Shak. 7. A large quantity; a great number; as, a power o. [Colloq.] Richardson. 8. (Mech.) (a) The rate at which mechanical energy is exerted or mechanical work performed, as by an engine or other machine, or an animal, working continuously; as, an engine of twenty horse power. Note: The English unit of power used most commonly is the horse power. See Horse power. (b) A mechanical agent; that from which useful mechanical energy is derived; as, water power; steam power; hand power, etc. (c) Applied force; force producing motion or pressure; as, the power applied at one and of a lever to lift a weight at the other end. Note: This use in mechanics, of power as a synonym for force, is improper and is becoming obsolete. (d) A machine acted upon by an animal, and serving as a motor to drive other machinery; as, a dog power. Note: Power is used adjectively, denoting, driven, or adapted to be driven, by machinery, and not actuated directly by the hand or foot; as, a power lathe; a power loom; a power press. 9. (Math.)  The product arising from the multiplication of a number into itself; as, a square is the second power, and a cube is third power, of a number. 10. ( (Metaph.)  Mental or moral ability to act; one of the faculties which are possessed by the mind or soul; as, the power of thinking, reasoning, judging, willing, fearing, hoping, etc. I. Watts. The guiltiness of my mind, the sudden surprise of my powers, drove the grossness . . . into a received belief. Shak. 11. (Optics)  The degree to which a lens, mirror, or any optical instrument, magnifies; in the telescope, and usually in the microscope, the number of times it multiplies, or augments, the apparent diameter of an object; sometimes, in microscopes, the number of times it multiplies the apparent surface. 12. (Law)  An authority enabling a person to dispose of an interest vested either in himself or in another person; ownership by appointment. Wharton. 13. Hence, vested authority to act in a given case; as, the business was referred to a committee with power. Note: Power may be predicated of inanimate agents, like the winds and waves, electricity and magnetism, gravitation, etc., or of animal and intelligent beings; and when predicated of these beings, it may indicate physical, mental, or moral ability or capacity. Mechanical powers. See under Mechanical. -- Power loom, or Power press. See Def. 8 (d), note. -- Power of attorney. See under Attorney. -- Power of a point (relative to a given curve) (Geom.), the result of substituting the coördinates of any point in that expression which being put equal to zero forms the equation of the curve; as, x2 + y2 - 100 is the power of the point x, y, relative to the circle x2 + y2 - 100 = 0."}