{"word":"prairie","definition":"1. An extensive tract of level or rolling land, destitute of trees, covered with coarse grass, and usually characterized by a deep, fertile soil. They abound throughout the Mississippi valley, between the Alleghanies and the Rocky mountains. From the forests and the prairies, From the great lakes of the northland. Longfellow. 2. A meadow or tract of grass; especially, a so called natural meadow. Prairie chicken (Zoöl.), any American grouse of the genus Tympanuchus, especially T. Americanus (formerly T. cupido), which inhabits the prairies of the central United States. Applied also to the sharp-tailed grouse. -- Prairie clover (Bot.), any plant of the leguminous genus Petalostemon, having small rosy or white flowers in dense terminal heads or spikes. Several species occur in the prairies of the United States. -- Prairie dock (Bot.), a coarse composite plant (Silphium terebinthaceum) with large rough leaves and yellow flowers, found in the Western prairies. -- Prairie dog (Zoöl.), a small American rodent (Cynomys Ludovicianus) allied to the marmots. It inhabits the plains west of the Mississippi. The prairie dogs burrow in the ground in large warrens, and have a sharp bark like that of a dog. Called also prairie marmot. -- Prairie grouse. Same as Prairie chicken, above. -- Prairie hare (Zoöl.), a large long-eared Western hare (Lepus campestris). See Jack rabbit, under 2d Jack. -- Prairie hawk, Prairie falcon (Zoöl.), a falcon of Western North America (Falco Mexicanus). The upper parts are brown. The tail has transverse bands of white; the under parts, longitudinal streaks and spots of brown. -- Prairie hen. (Zoöl.) Same as Prairie chicken, above. -- Prairie itch (Med.), an affection of the skin attended with intense itching, which is observed in the Northern and Western United States; -- also called swamp itch, winter itch. -- Prairie marmot. (Zoöl.) Same as Prairie dog, above. -- Prairie mole (Zoöl.), a large American mole (Scalops argentatus), native of the Western prairies. -- Prairie pigeon, plover, or snipe (Zoöl.), the upland plover. See Plover, n., 2. -- Prairie rattlesnake (Zoöl.), the massasauga. -- Prairie snake (Zoöl.), a large harmless American snake (Masticophis flavigularis). It is pale yellow, tinged with brown above. -- Prairie squirrel (Zoöl.), any American ground squirrel of the genus Spermophilus, inhabiting prairies; -- called also gopher. -- Prairie turnip (Bot.), the edible turnip-shaped farinaceous root of a leguminous plant (Psoralea esculenta) of the Upper Missouri region; also, the plant itself. Called also pomme blanche, and pomme de prairie. -- Prairie warbler (Zoöl.), a bright-colored American warbler (Dendroica discolor). The back is olive yellow, with a group of reddish spots in the middle; the under parts and the parts around the eyes are bright yellow; the sides of the throat and spots along the sides, black; three outer tail feathers partly white. -- Prairie wolf. (Zoöl.) See Coyote."}