{"word":"precipitate","definition":"1. Overhasty; rash; as, the king was too precipitate in declaring war. Clarendon. 2. Lacking due deliberation or care; hurried; said or done before the time; as, a precipitate measure. \"The rapidity of our too precipitate course.\" Landor. 3. Falling, flowing, or rushing, with steep descent; headlong. Precipitate the furious torrent flows. Prior. 4. Ending quickly in death; brief and fatal; as, a precipitate case of disease. [Obs.] Arbuthnot.\n\nAn insoluble substance separated from a solution in a concrete state by the action of some reagent added to the solution, or of some force, such as heat or cold. The precipitate may fall to the bottom (whence the name), may be diffused through the solution, or may float at or near the surface. Red precipitate (Old. Chem), mercuric oxide (HgO) a heavy red crystalline powder obtained by heating mercuric nitrate, or by heating mercury in the air. Prepared in the latter manner, it was the precipitate per se of the alchemists. -- White precipitate (Old Chem.) (a) A heavy white amorphous powder (NH2.HgCl) obtained by adding ammonia to a solution of mercuric chloride or corrosive sublimate; -- formerly called also infusible white precipitate, and now amido-mercuric chloride. (b) A white crystalline substance obtained by adding a solution of corrosive sublimate to a solution of sal ammoniac (ammonium chloride); -- formerly called also fusible white precipitate.\n\n1. To throw headlong; to cast down from a precipice or height. She and her horse had been precipitated to the pebbled region of the river. W. Irving. 2. To urge or press on with eager haste or violence; to cause to happen, or come to a crisis, suddenly or too soon; as, precipitate a journey, or a conflict. Back to his sight precipitates her steps. Glover. If they be daring, it may precipitate their designs, and prove dangerous. Bacon. 3. (Chem.)  To separate from a solution, or other medium, in the form of a precipitate; as, water precipitates camphor when in solution with alcohol. The light vapor of the preceding evening had been precipitated by the cold. W. Irving.\n\n1. To dash or fall headlong. [R.] So many fathom down precipitating. Shak. 2. To hasten without preparation. [R.] 3. (Chem.)  To separate from a solution as a precipitate. See Precipitate, n."}