{"word":"press","definition":"An East Indian insectivore (Tupaia ferruginea). It is arboreal in its habits, and has a bushy tail. The fur is soft, and varies from rusty red to maroon and to brownish black.\n\nTo force into service, particularly into naval service; to impress. To peaceful peasant to the wars is pressed. Dryden.\n\nA commission to force men into public service, particularly into the navy. I have misused the king's press. Shak. Press gang, or Pressgang, a detachment of seamen under the command of an officer empowered to force men into the naval service. See Impress gang, under Impress. -- Press money, money paid to a man enlisted into public service. See Prest money, under Prest, a.\n\n1. To urge, or act upon, with force, as weight; to act upon by pushing or thrusting, in distinction from pulling; to crowd or compel by a gradual and continued exertion; to bear upon; to squeeze; to compress; as, we press the ground with the feet when we walk; we press the couch on which we repose; we press substances with the hands, fingers, or arms; we are pressed in a crowd. Good measure, pressed down, and shaken together. Luke vi. 38. 2. To squeeze, in order to extract the juice or contents of; to squeeze out, or express, from something. From sweet kernels pressed, She tempers dulcet creams. Milton. And I took the grapes, and pressed them into Pharaoh's cup, and I gave the cup into Pharaoh's hand. Gen. xl. 11. 3. To squeeze in or with suitable instruments or apparatus, in order to compact, make dense, or smooth; as, to press cotton bales, paper, etc.; to smooth by ironing; as, to press clothes. 4. To embrace closely; to hug. Leucothoe shook at these alarms, And pressed Palemon closer in her arms. Pope. 5. To oppress; to bear hard upon. Press not a falling man too far. Shak. 6. To straiten; to distress; as, to be pressed with want or hunger. 7. To exercise very powerful or irresistible influence upon or over; to constrain; to force; to compel. Paul was pressed in the spirit, and testified to the Jews that Jesus was Christ. Acts xviii. 5. 8. To try to force (something upon some one); to urge or inculcate with earnestness or importunity; to enforce; as, to press divine truth on an audience. He pressed a letter upon me within this hour. Dryden. Be sure to press upon him every motive. Addison. 9. To drive with violence; to hurry; to urge on; to ply hard; as, to press a horse in a race. The posts . . . went cut, being hastened and pressed on, by the king's commandment. Esther viii. 14. Note: Press differs from drive and strike in usually denoting a slow or continued application of force; whereas drive and strike denote a sudden impulse of force. Pressed brick. See under Brick.\n\n1. To exert pressure; to bear heavily; to push, crowd, or urge with steady force. 2. To move on with urging and crowding; to make one's way with violence or effort; to bear onward forcibly; to crowd; to throng; to encroach. They pressed upon him for to touch him. Mark iii. 10. 3. To urge with vehemence or importunity; to exert a strong or compelling influence; as, an argument presses upon the judgment.\n\n1. An apparatus or machine by which any substance or body is pressed, squeezed, stamped, or shaped, or by which an impression of a body is taken; sometimes, the place or building containing a press or presses. Note: Presses are differently constructed for various purposes in the arts, their specific uses being commonly designated; as, a cotton press, a wine press, a cider press, a copying press, etc. See Drill press. 2. Specifically, a printing press. 3. The art or business of printing and publishing; hence, printed publications, taken collectively, more especially newspapers or the persons employed in writing for them; as, a free press is a blessing, a licentious press is a curse. 4. An upright case or closet for the safe keeping of articles; as, a clothes press. Shak. 5. The act of pressing or thronging forward. In their throng and press to that last hold. Shak. 6. Urgent demands of business or affairs; urgency; as, a press of engagements. 7. A multitude of individuals crowded together; They could not come nigh unto him for the press. Mark ii. 4. Cylinder press, a printing press in which the impression is produced by a revolving cylinder under which the form passes; also, one in which the form of type or plates is curved around a cylinder, instead of resting on a flat bed. Hydrostatic press. See under Hydrostatic. -- Liberty of the press, the free right of publishing books, pamphlets, or papers, without previous restraint or censorship, subject only to punishment for libelous, seditious, or morally pernicious matters. -- Press bed, a bed that may be folded, and inclosed, in a press or closet. Boswell. -- Press of sail, (Naut.), as much sail as the state of the wind will permit."}