{"word":"principal","definition":"1. Highest in rank, authority, character, importance, or degree; most considerable or important; chief; main; as, the principal officers of a Government; the principal men of a state; the principal productions of a country; the principal arguments in a case. Wisdom is the principal thing. Prov. iv. 7. 2. Of or pertaining to a prince; princely. [A Latinism] [Obs.] Spenser. Principal axis. See Axis of a curve, under Axis. -- Principal axes of a quadric (Geom.), three lines in which the principal planes of the solid intersect two and two, as in an ellipsoid. -- Principal challenge. (Law) See under Challenge. -- Principal plane. See Plane of projection (a), under Plane. -- Principal of a quadric (Geom.), three planes each of which is at right angles to the other two, and bisects all chords of the quadric perpendicular to the plane, as in an ellipsoid. -- Principal point (Persp.), the projection of the point of sight upon the plane of projection. -- Principal ray (Persp.), the line drawn through the point of sight perpendicular to the perspective plane. -- Principal section (Crystallog.), a plane passing through the optical axis of a crystal.\n\n1. A leader, chief, or head; one who takes the lead; one who acts independently, or who has controlling authority or influence; as, the principal of a faction, a school, a firm, etc.; -- distinguished from a subordinate, abettor, auxiliary, or assistant. 2. Hence: (Law) (a) The chief actor in a crime, or an abettor who is present at it, - - as distinguished from an accessory. (b) A chief obligor, promisor, or debtor, -- as distinguished from a surety. (c) One who employs another to act for him, -- as distinguished from an agent. Wharton. Bouvier. Burrill. 3. A thing of chief or prime importance; something fundamental or especially conspicuous. Specifically: (a) (Com.) A capital sum of money, placed out at interest, due as a debt or used as a fund; -- so called in distinction from interest or profit. (b) (Arch. & Engin.) The construction which gives shape and strength to a roof, -- generally a truss of timber or iron, but there are roofs with stone principals. Also, loosely, the most important member of a piece of framing. (c) (Mus.) In English organs the chief open metallic stop, an octave above the open diapason. On the manual it is four feet long, on the pedal eight feet. In Germany this term corresponds to the English open diapason. (d) (O. Eng. Law) A heirloom; a mortuary. Cowell. (e) pl.  The first two long feathers of a hawk's wing. Spenser. J. H. Walsh. (f) One of turrets or pinnacles of waxwork and tapers with which the posts and center of a funeral hearse were formerly crowned. Oxf. Gloss. (g) A principal or essential point or rule; a principle. [Obs.]"}