{"word":"print","definition":"1. To fix or impress, as a stamp, mark, character, idea, etc., into or upon something. A look will print a thought that never may remove. Surrey. Upon his breastplate he beholds a dint, Which in that field young Edward's sword did print. Sir John Beaumont. Perhaps some footsteps printed in the clay. Roscommon. 2. To stamp something in or upon; to make an impression or mark upon by pressure, or as by pressure. Forth on his fiery steed betimes he rode, That scarcely prints the turf on which he trod. Dryden. 3. Specifically:  To strike off an impression or impressions of, from type, or from stereotype, electrotype, or engraved plates, or the like; in a wider sense, to do the typesetting, presswork, etc., of (a book or other publication); as, to print books, newspapers, pictures; to print an edition of a book. 4. To stamp or impress with colored figures or patterns; as, to print calico. 5. (Photog.)  To take (a copy, a positive picture, etc.), from a negative, a transparent drawing, or the like, by the action of light upon a sensitized surface. Printed goods, textile fabrics printed in patterns, especially cotton cloths, or calicoes.\n\n1. To use or practice the art of typography; to take impressions of letters, figures, or electrotypes, engraved plates, or the like. 2. To publish a book or an article. From the moment he prints, he must except to hear no more truth. Pope.\n\n1. A mark made by impression; a line, character, figure, or indentation, made by the pressure of one thing on another; as, the print of teeth or nails in flesh; the print of the foot in sand or snow. Where print of human feet was never seen. Dryden. 2. A stamp or die for molding or impressing an ornamental design upon an object; as, a butter print. 3. That which receives an impression, as from a stamp or mold; as, a print of butter. 4. Printed letters; the impression taken from type, as to excellence, form, size, etc.; as, small print; large print; this line is in print. 5. That which is produced by printing. Specifically: (a) An impression taken from anything, as from an engraved plate. \"The prints which we see of antiquities.\" Dryden. (b) A printed publication, more especially a newspaper or other periodical. Addison. (c) A printed cloth; a fabric figured by stamping, especially calico or cotton cloth. (d) A photographic copy, or positive picture, on prepared paper, as from a negative, or from a drawing on transparent paper. 6. (Founding)  A core print. See under Core. Blue print, a copy in white lines on a blue ground, of a drawing, plan, tracing, etc., or a positive picture in blue and white, from a negative, produced by photographic printing on peculiarly prepared paper.blueprint for action -- In print. (a) In a printed form; issued from the press; published. Shak. (b) To the letter; with accurateness. \"All this I speak in print.\" Shak. -- Out of print. See under Out. -- Print works, a factory where cloth, as calico, is printed."}