{"word":"privilege","definition":"1. A peculiar benefit, advantage, or favor; a right or immunity not enjoyed by others or by all; special enjoyment of a good, or exemption from an evil or burden; a prerogative; advantage; franchise. He pleads the legal privilege of a Roman. Kettlewell. The privilege birthright was a double portion. Locke. A people inheriting privileges, franchises, and liberties. Burke. 2. (Stockbroker's Cant)  See Call, Put, Spread, etc. Breach of privilege. See under Breach. -- Question of privilege (Parliamentary practice), a question which concerns the security of a member of a legislative body in his special privileges as such. -- Water privilege, the advantage of having machinery driven by a stream, or a place affording such advantage. [ U. S.] -- Writ of privilege (Law), a writ to deliver a privileged person from custody when arrested in a civil suit. Blackstone. Syn. -- Prerogative; immunity; franchise; right; claim; liberty. -- Privilege, Prerogative. Privilege, among the Romans, was something conferred upon an individual by a private law; and hence, it denotes some peculiar benefit or advantage, some right or immunity, not enjoyed by the world at large. Prerogative, among the Romans, was the right of voting first; and, hence, it denotes a right of precedence, or of doing certain acts, or enjoying certain privileges, to the exclusion of others. It is the privilege of a member of Congress not to be called in question elsewhere for words uttered in debate. It is the prerogative of the president to nominate judges and executive officers. It is the privilege of a Christian child to be instructed in the true religion. It is the prerogative of a parent to govern and direct his children.\n\n1. To grant some particular right or exemption to; to invest with a peculiar right or immunity; to authorize; as, to privilege representatives from arrest. To privilege dishonor in thy name. Shak. 2. To bring or put into a condition of privilege or exemption from evil or danger; to exempt; to deliver. He took this place for sanctuary, And it shall privilege him from your hands. Shak."}