{"word":"process","definition":"1. The act of proceeding; continued forward movement; procedure; progress; advance. \"Long process of time.\" Milton. The thoughts of men are widened with the process of the suns. Tennyson. 2. A series of actions, motions, or occurrences; progressive act or transaction; continuous operation; normal or actual course or procedure; regular proceeding; as, the process of vegetation or decomposition; a chemical process; processes of nature. Tell her the process of Antonio's end. Shak. 3. A statement of events; a narrative. [Obs.] Chaucer. 4. (Anat. & Zoöl.)  Any marked prominence or projecting part, especially of a bone; anapophysis. 5. (Law)  The whole course of proceedings in a cause real or personal, civil or criminal, from the beginning to the end of the suit; strictly, the means used for bringing the defendant into court to answer to the action; -- a generic term for writs of the class called judicial. Deacon's process Etym: [from H. Deacon, who introduced it] (Chem.), a method of obtaining chlorine gas by passing hydrochloric acid gas over heated slag which has been previously saturated with a solution of some metallic salt, as sulphate of copper. -- Final process (Practice), a writ of execution in an action at law. Burrill. -- In process, in the condition of advance, accomplishment, transaction, or the like; begun, and not completed. -- Jury process (Law), the process by which a jury is summoned in a cause, and by which their attendance is enforced. Burrill. -- Leblanc's process (Chem.), the process of manufacturing soda by treating salt with sulphuric acid, reducing the sodium sulphate so formed to sodium sulphide by roasting with charcoal, and converting the sodium sulphide to sodium carbonate by roasting with lime. -- Mesne process. See under Mesne. -- Process milling, the process of high milling for grinding flour. See under Milling. -- Reversible process (Thermodynamics), any process consisting of a cycle of operations such that the different operations of the cycle can be performed in reverse order with a reversal of their effects."}