{"word":"projection","definition":"1. The act of throwing or shooting forward. 2. A jutting out; also, a part jutting out, as of a building; an extension beyond something else. 3. The act of scheming or planning; also, that which is planned; contrivance; design; plan. Davenant. 4. (Persp.)  The representation of something; delineation; plan; especially, the representation of any object on a perspective plane, or such a delineation as would result were the chief points of the object thrown forward upon the plane, each in the direction of a line drawn through it from a given point of sight, or central point; as, the projection of a sphere. The several kinds of projection differ according to the assumed point of sight and plane of projection in each. 5. (Geog.)  Any method of representing the surface of the earth upon a plane. Conical projection, a mode of representing the sphere, the spherical surface being projected upon the surface of a cone tangent to the sphere, the point of sight being at the center of the sphere. -- Cylindric projection, a mode of representing the sphere, the spherical surface being projected upon the surface of a cylinder touching the sphere, the point of sight being at the center of the sphere. -- Globular, Gnomonic, Orthographic, projection,etc. See under Globular, Gnomonic, etc. -- Mercator's projection, a mode of representing the sphere in which the meridians are drawn parallel to each other, and the parallels of latitude are straight lines whose distance from each other increases with their distance from the equator, so that at all places the degrees of latitude and longitude have to each other the same ratio as on the sphere itself. -- Oblique projection, a projection made by parallel lines drawn from every point of a figure and meeting the plane of projection obliquely. -- Polar projection, a projection of the sphere in which the point of sight is at the center, and the plane of projection passes through one of the polar circles. -- Powder of projection (Alchemy.), a certain powder cast into a crucible or other vessel containing prepared metal or other matter which is to be thereby transmuted into gold. -- Projection of a point on a plane (Descriptive Geom.), the foot of a perpendicular to the plane drawn through the point. -- Projection of a straight line of a plane, the straight line of the plane connecting the feet of the perpendiculars let fall from the extremities of the given line. Syn. -- See Protuberance."}