{"word":"proof","definition":"1. Any effort, process, or operation designed to establish or discover a fact or truth; an act of testing; a test; a trial. For whatsoever mother wit or art Could work, he put in proof. Spenser. You shall have many proofs to show your skill. Ford. Formerly, a very rude mode of ascertaining the strength of spirits was practiced, called the proof. Ure. 2. That degree of evidence which convinces the mind of any truth or fact, and produces belief; a test by facts or arguments that induce, or tend to induce, certainty of the judgment; conclusive evidence; demonstration. I'll have some proof. Shak. It is no proof of a man's understanding to be able to confirm whatever he pleases. Emerson. Note: Properly speaking, proof is the effect or result of evidence, evidence is the medium of proof. Cf. Demonstration, 1. 3. The quality or state of having been proved or tried; firmness or hardness that resists impression, or does not yield to force; impenetrability of physical bodies. 4. Firmness of mind; stability not to be shaken. 5. (Print.)  A trial impression, as from type, taken for correction or examination; -- called also proof sheet. 6. (Math.)  A process for testing the accuracy of an operation performed. Cf. Prove, v. t., 5. 7. Armor of excellent or tried quality, and deemed impenetrable; properly, armor of proof. [Obs.] Shak. Artist's proof, a very early proof impression of an engraving, or the like; -- often distinguished by the artist's signature. -- Proof reader, one who reads, and marks correction in, proofs. See def. 5, above. Syn. -- Testimony; evidence; reason; argument; trial; demonstration. See Testimony.\n\n1. Used in proving or testing; as, a proof load, or proof charge. 2. Firm or successful in resisting; as, proof against harm; waterproof; bombproof. I . . . have found thee Proof against all temptation. Milton. This was a good, stout proof article of faith. Burke. 3. Being of a certain standard as to strength; -- said of alcoholic liquors. Proof charge (Firearms), a charge of powder and ball, greater than the service charge, fired in an arm, as a gun or cannon, to test its strength. -- Proof impression. See under Impression. -- Proof load (Engin.), the greatest load than can be applied to a piece, as a beam, column, etc., without straining the piece beyond the elastic limit. -- Proof sheet. See Proof, n., 5. -- Proof spirit (Chem.), a strong distilled liquor, or mixture of alcohol and water, containing not less than a standard amount of alcohol. In the United States \"proof spirit is defined by law to be that mixture of alcohol and water which contains one half of its volume of alcohol, the alcohol when at a temperature of 60ยบ Fahrenheit being of specific gravity 0.7939 referred to water at its maximum density as unity. Proof spirit has at 60ยบ Fahrenheit a specific gravity of 0.93353, 100 parts by volume of the same consisting of 50 parts of absolute alcohol and 53.71 parts of water,\" the apparent excess of water being due to contraction of the liquids on mixture. In England proof spirit is defined by Act 58, George III., to be such as shall at a temperature of 51ยบ Fahrenheit weigh exactly the second, third, and fourth proof spirits respectively. -- Proof staff, a straight-edge used by millers to test the flatness of a stone. -- Proof stick (Sugar Manuf.), a rod in the side of a vacuum pan, for testing the consistency of the sirup. -- Proof text, a passage of Scripture used to prove a doctrine. proof coin or proof, a coin which has been specially struck, to produce the finest specimen of its type. Note: Usually such coins are double-struck from polished dies, and the raised features are sometimes frosted. They thus have sharper features and more mirror-like fields than production coins (i.e. those coins struck for circulation); they are considered by coin collectors as the most desirable specimens of each coin, and usually sell at a premium to their corresponding production coins."}