{"word":"property","definition":"1. That which is proper to anything; a peculiar quality of a thing; that which is inherent in a subject, or naturally essential to it; an attribute; as, sweetness is a property of sugar. Property is correctly a synonym for peculiar quality; but it is frequently used as coextensive with quality in general. Sir W. Hamilton. Note: In physical science, the properties of matter are distinguished to the three following classes: 1. Physical properties, or those which result from the relations of bodies to the physical agents, light, heat, electricity, gravitation, cohesion, adhesion, etc., and which are exhibited without a change in the composition or kind of matter acted on. They are color, luster, opacity, transparency, hardness, sonorousness, density, crystalline form, solubility, capability of osmotic diffusion, vaporization, boiling, fusion, etc. 2. Chemical properties, or those which are conditioned by affinity and composition; thus, combustion, explosion, and certain solutions are reactions occasioned by chemical properties. Chemical properties are identical when there is identity of composition and structure, and change according as the composition changes. 3. Organoleptic properties, or those forming a class which can not be included in either of the other two divisions. They manifest themselves in the contact of substances with the organs of taste, touch, and smell, or otherwise affect the living organism, as in the manner of medicines and poisons. 2. An acquired or artificial quality; that which is given by art, or bestowed by man; as, the poem has the properties which constitute excellence. 3. The exclusive right of possessing, enjoying, and disposing of a thing; ownership; title. Here I disclaim all my paternal care, Propinquity and property of blood. Shak. Shall man assume a property in man Wordsworth. 4. That to which a person has a legal title, whether in his possession or not; thing owned; an estate, whether in lands, goods, or money; as, a man of large property, or small property. 5. pl.  All the adjuncts of a play except the scenery and the dresses of the actors; stage requisites. I will draw a bill of properties. Shak. 6. Propriety; correctness. [Obs.] Camden. Literary property. (Law) See under Literary. -- Property man, one who has charge of the \"properties\" of a theater.\n\n1. To invest which properties, or qualities. [Obs.] Shak. 2. To make a property of; to appropriate. [Obs.] They have here propertied me. Shak."}