{"word":"puff","definition":"1. A sudden and single emission of breath from the mouth; hence, any sudden or short blast of wind; a slight gust; a whiff. \" To every puff of wind a slave.\" Flatman. 2. Anything light and filled with air. Specifically: (a) A puffball. (b) kind of light pastry. (c) A utensil of the toilet for dusting the skin or hair with powder. 3. An exaggerated or empty expression of praise, especially one in a public journal. Puff adder. (Zoöl.) (a) Any South African viper belonging to Clotho and allied genera. They are exceedingly venomous, and have the power of greatly distending their bodies when irritated. The common puff adder (Vipera, or Clotho, arietans) is the largest species, becoming over four feet long. The plumed puff adder (C. cornuta) has a plumelike appendage over each eye. (b) A North American harmless snake (Heterodon platyrrhinos) which has the power of puffing up its body. Called also hog-nose snake, flathead, spreading adder, and blowing adder. Puff bird (Zoöl.), any bird of the genus Bucco, or family Bucconidæ. They are small birds, usually with dull-colored and loose plumage, and have twelve tail feathers. See Barbet (b).\n\n1. To blow in puffs, or with short and sudden whiffs. 2. To blow, as an expression of scorn; -- with at. It is really to defy Heaven to puff at damnation. South. 3. To breathe quick and hard, or with puffs, as after violent exertion. The ass comes back again, puffing and blowing, from the chase. L' Estrange. 4. To swell with air; to be dilated or inflated. Boyle. 5. To breathe in a swelling, inflated, or pompous manner; hence, to assume importance. Then came brave Glory puffing by. Herbert.\n\n1. To drive with a puff, or with puffs. The clearing north will puff the clouds away. Dryden. 2. To repel with words; to blow at contemptuously. I puff the prostitute away. Dryden. 3. To cause to swell or dilate; to inflate; to ruffle with puffs; -- often with up; as a bladder puffed with air. The sea puffed up with winds. Shak. 4. To inflate with pride, flattery, self-esteem, or the like; -- often with up. Puffed up with military success. Jowett (Thucyd. ) 5. To praise with exaggeration; to flatter; to call public attention to by praises; to praise unduly. \" Puffed with wonderful skill.\" Macaulay.\n\nPuffed up; vain. [R.] Fanshawe."}