{"word":"pull","definition":"1. To draw, or attempt to draw, toward one; to draw forcibly. Ne'er pull your hat upon your brows. Shak. He put forth his hand . . . and pulled her in. Gen. viii. 9. 2. To draw apart; to tear; to rend. He hath turned aside my ways, and pulled me in pieces; he hath made me desolate. Lam. iii. 11. 3. To gather with the hand, or by drawing toward one; to pluck; as, to pull fruit; to pull flax; to pull a finch. 4. To move or operate by the motion of drawing towards one; as, to pull a bell; to pull an oar. 5. (Horse Racing)  To hold back, and so prevent from winning; as, the favorite was pulled. 6. (Print.)  To take or make, as a proof or impression; -- hand presses being worked by pulling a lever. 7. (Cricket)  To strike the ball in a particular manner. See Pull, n., 8. Never pull a straight fast ball to leg. R. H. Lyttelton. To pull and haul, to draw hither and thither. \" Both are equally pulled and hauled to do that which they are unable to do. \" South. -- To pull down, to demolish; to destroy; to degrade; as, to pull down a house. \" In political affairs, as well as mechanical, it is easier to pull down than build up.\" Howell. \" To raise the wretched, and pull down the proud.\" Roscommon. To pull a finch. See under Finch. To pull off, take or draw off.\n\nTo exert one's self in an act or motion of drawing or hauling; to tug; as, to pull at a rope. To pull apart, to become separated by pulling; as, a rope will pull apart. -- To pull up, to draw the reins; to stop; to halt. To pull through, to come successfully to the end of a difficult undertaking, a dangerous sickness, or the like.\n\n1. The act of pulling or drawing with force; an effort to move something by drawing toward one. I awakened with a violent pull upon the ring which was fastened at the top of my box. Swift. 2. A contest; a struggle; as, a wrestling pull. Carew. 3. A pluck; loss or violence suffered. [Poetic] Two pulls at once; His lady banished, and a limb lopped off. Shak. 4. A knob, handle, or lever, etc., by which anything is pulled; as, a drawer pull; a bell pull. 5. The act of rowing; as, a pull on the river. [Colloq.] 6. The act of drinking; as, to take a pull at the beer, or the mug. [Slang] Dickens. 7. Something in one's favor in a comparison or a contest; an advantage; means of influencing; as, in weights the favorite had the pull. [Slang] 8. (Cricket)  A kind of stroke by which a leg ball is sent to the off side, or an off ball to the side. The pull is not a legitimate stroke, but bad cricket. R. A. Proctor."}