{"word":"punch","definition":"A beverage composed of wine or distilled liquor, water (or milk), sugar, and the juice of lemon, with spice or mint; -- specifically named from the kind of spirit used; as rum punch, claret punch, champagne punch, etc. Milk punch, a sort of punch made with spirit, milk, sugar, spice, etc. -- Punch bowl, a large bowl in which punch is made, or from which it is served. -- Roman punch, a punch frozen and served as an ice.\n\nThe buffoon or harlequin of a puppet show. Punch and Judy, a puppet show in which a comical little hunchbacked Punch, with a large nose, engages in altercation with his wife Judy.\n\n1. A short, fat fellow; anything short and thick. I . . . did hear them call their fat child punch, which pleased me mightily, that word being become a word of common use for all that is thick and short. Pepys. 2. One of a breed of large, heavy draught horses; as, the Suffolk punch.\n\nTo thrust against; to poke; as, to punch one with the end of a stick or the elbow.\n\nA thrust or blow. [Colloq.]\n\n1. A tool, usually of steel, variously shaped at one end for different uses, and either solid, for stamping or for perforating holes in metallic plates and other substances, or hollow and sharpedged, for cutting out blanks, as for buttons, steel pens, jewelry, and the like; a die. 2. (Pile Driving)  An extension piece applied to the top of a pile; a dolly. 3. A prop, as for the roof of a mine. Bell punch. See under Bell. -- Belt punch (Mach.), a punch, or punch pliers, for making holes for lacings in the ends of driving belts. -- Punch press. See Punching machine, under Punch, v. i. -- Punch pliers, pliers having a tubular, sharp-edged steel punch attached to one of the jaws, for perforating leather, paper, and the like.\n\nTo perforate or stamp with an instrument by pressure, or a blow; as, to punch a hole; to punch ticket. Punching machine, or Punching press, a machine tool for punching holes in metal or other material; -- called also punch press."}