{"word":"purchase","definition":"1. To pursue and obtain; to acquire by seeking; to gain, obtain, or acquire. Chaucer. That loves the thing he can not purchase. Spenser. Your accent is Something finer than you could purchase in so removed a dwelling. Shak. His faults . . . hereditary Rather than purchased. Shak. 2. To obtain by paying money or its equivalent; to buy for a price; as, to purchase land, or a house. The field which Abraham purchased of the sons of Heth. Gen. xxv. 10. 3. To obtain by any outlay, as of labor, danger, or sacrifice, etc.; as, to purchase favor with flattery. One poor retiring minute . . . Would purchase thee a thousand thousand friends. Shak. A world who would not purchase with a bruise Milton. 4. To expiate by a fine or forfeit. [Obs.] Not tears nor prayers shall purchase out abuses. Shak. 5. (Law) (a) To acquire by any means except descent or inheritance. Blackstone. (b) To buy for a price. 6. To apply to (anything) a device for obtaining a mechanical advantage; to get a purchase upon, or apply a purchase to; as, to purchase a cannon.\n\n1. To put forth effort to obtain anything; to strive; to exert one's self. [Obs.] Duke John of Brabant purchased greatly that the Earl of Flanders should have his daughter in marriage. Ld. Berners. 2. To acquire wealth or property. [Obs.] Sure our lawyers Would not purchase half so fast. J. Webster.\n\n1. The act of seeking, getting, or obtaining anything. [Obs.] I'll . . . get meat to have thee, Or lose my life in the purchase. Beau. & Fl. 2. The act of seeking and acquiring property. 3. The acquisition of title to, or properly in, anything for a price; buying for money or its equivalent. It is foolish to lay out money in the purchase of repentance. Franklin. 4. That which is obtained, got, or acquired, in any manner, honestly or dishonestly; property; possession; acquisition. Chaucer. B. Jonson. We met with little purchase upon this coast, except two small vessels of Golconda. De Foe. A beauty-waning and distressed widow . . . Made prize and purchase of his lustful eye. Shak. 5. That which is obtained for a price in money or its equivalent. \"The scrip was complete evidence of his right in the purchase.\" Wheaton. 6. Any mechanical hold, or advantage, applied to the raising or removing of heavy bodies, as by a lever, a tackle, capstan, and the like; also, the apparatus, tackle, or device by which the advantage is gained. A politician, to do great things, looks for a power -- what our workmen call a purchase. Burke. 7. (Law)  Acquisition of lands or tenements by other means than descent or inheritance, namely, by one's own act or agreement. Blackstone. Purchase criminal, robbery. [Obs.] Spenser. -- Purchase money, the money paid, or contracted to be paid, for anything bought. Berkeley. -- Worth, or At, [so many] years' purchase, a phrase by which the value or cost of a thing is expressed in the length of time required for the income to amount to the purchasing price; as, he bought the estate at a twenty years' purchase. To say one's life is not worth a day's purchase in the same as saying one will not live a day, or is in imminent peril."}