{"word":"pure","definition":"1. Separate from all heterogeneous or extraneous matter; free from mixture or combination; clean; mere; simple; unmixed; as, pure water; pure clay; pure air; pure compassion. The pure fetters on his shins great. Chaucer. A guinea is pure gold if it has in it no alloy. I. Watts. 2. Free from moral defilement or quilt; hence, innocent; guileless; chaste; -- applied to persons. \"Keep thyself pure.\" 1 Tim. v. 22. Now the end of the commandment is charity out of a pure heart, and of a good conscience. 1 Tim. i. 5. 3. Free from that which harms, vitiates, weakens, or pollutes; genuine; real; perfect; -- applied to things and actions. \"Pure religion and impartial laws.\" Tickell. \"The pure, fine talk of Rome.\" Ascham. Such was the origin of a friendship as warm and pure as any that ancient or modern history records. Macaulay. 4. (Script.)  Ritually clean; fitted for holy services. Thou shalt set them in two rows, six on a row, upon the pure table before the Lord. Lev. xxiv. 6. 5. (Phonetics)  Of a single, simple sound or tone; -- said of some vowels and the unaspirated consonants. Pure-impure, completely or totally impure. \"The inhabitants were pure-impure pagans.\" Fuller. -- Pure blue. (Chem.) See Methylene blue, under Methylene. -- Pure chemistry. See under Chemistry. -- Pure mathematics, that portion of mathematics which treats of the principles of the science, or contradistinction to applied mathematics, which treats of the application of the principles to the investigation of other branches of knowledge, or to the practical wants of life. See Mathematics. Davies & Peck (Math. Dict. ) -- Pure villenage (Feudal Law), a tenure of lands by uncertain services at the will of the lord. Blackstone. Syn. -- Unmixed; clear; simple; real; true; genuine; unadulterated; uncorrupted; unsullied; untarnished; unstained; stainless; clean; fair; unspotted; spotless; incorrupt; chaste; unpolluted; undefiled; immaculate; innocent; guiltless; guileless; holy."}