{"word":"purple","definition":"1. A color formed by, or resembling that formed by, a combination of the primary colors red and blue. Arraying with reflected purple and gold The clouds that on his western throne attend. Milton. Note: The ancient words which are translated purple are supposed to have been used for the color we call crimson. In the gradations of color as defined in art, purple is a mixture of red and blue. When red predominates it is called violet, and when blue predominates, hyacinth. 2. Cloth dyed a purple color, or a garment of such color; especially, a purple robe, worn as an emblem of rank or authority; specifically, the purple rode or mantle worn by Roman emperors as the emblem of imperial dignity; as, to put on the imperial purple. Thou shalt make the tabernacle with ten curtains of fine twined linen, and purple, and scarlet. Ex. xxvi. 1. 3. Hence: Imperial sovereignty; royal rank, dignity, or favor; loosely and colloquially, any exalted station; great wealth. \"He was born in the purple.\" Gibbon. 4. A cardinalate. See Cardinal. 5. (Zoöl.)  Any species of large butterflies, usually marked with purple or blue, of the genus Basilarchia (formerly Limenitis) as, the banded purple (B. arthemis). See Illust. under Ursula. 6. (Zoöl.)  Any shell of the genus Purpura. 7. pl.(Med.)  See Purpura. 8. pl.  A disease of wheat. Same as Earcockle. Note: Purple is sometimes used in composition, esp. with participles forming words of obvious signification; as, purple-colored, purple- hued, purple-stained, purple-tinged, purple-tinted, and the like. French purple. (Chem.) Same as Cudbear. -- Purple of Cassius. See Cassius. -- Purple of mollusca (Zoöl.), a coloring matter derived from certain mollusks, which dyes wool, etc., of a purple or crimson color, and is supposed to be the substance of the famous Tyrian dye. It is obtained from Ianthina, and from several species of Purpura, and Murex. -- To be born in the purple, to be of princely birth; to be highborn.\n\n1. Exhibiting or possessing the color called purple, much esteemed for its richness and beauty; of a deep red, or red and blue color; as, a purple robe. 2. Imperial; regal; -- so called from the color having been an emblem of imperial authority. Hide in the dust thy purple pride. Shelley. 3. Blood-red; bloody. May such purple tears be alway shed. Shak. I view a field of blood, And Tiber rolling with a purple blood. Dryden. Purple bird (Zoöl.), the European purple gallinule. See under Gallinule. -- Purple copper ore. (Min.) See Bornite. -- Purple grackle (Zoöl.), the crow blackbird. See under Crow. -- Purple martin. See under Martin. -- Purple sandpiper. See under Sandpiper. -- Purple shell. See Ianthina.\n\nTo make purple; to dye of purple or deep red color; as, hands purpled with blood. When morn Purples the east. Milton. Reclining soft in blissful bowers, Purpled sweet with springing flowers. Fenton."}