{"word":"put","definition":"A pit. [Obs.] Chaucer.\n\n3d pers. sing. pres. of Put, contracted from putteth. Chaucer.\n\nA rustic; a clown; an awkward or uncouth person. Queer country puts extol Queen Bess's reign. Bramston. What droll puts the citizens seem in it all. F. Harrison.\n\n1. To move in any direction; to impel; to thrust; to push; -- nearly obsolete, except with adverbs, as with by (to put by = to thrust aside; to divert); or with forth (to put forth = to thrust out). His chief designs are . . . to put thee by from thy spiritual employment. Jer. Taylor. 2. To bring to a position or place; to place; to lay; to set; figuratively, to cause to be or exist in a specified relation, condition, or the like; to bring to a stated mental or moral condition; as, to put one in fear; to put a theory in practice; to put an enemy to fight. This present dignity, In which that I have put you. Chaucer. I will put enmity between thee and the woman. Gen. iii. 15. He put no trust in his servants. Job iv. 18. When God into the hands of their deliverer Puts invincible might. Milton. In the mean time other measures were put in operation. Sparks. 3. To attach or attribute; to assign; as, to put a wrong construction on an act or expression. 4. To lay down; to give up; to surrender. [Obs.] No man hath more love than this, that a man put his life for his friends. Wyclif (John xv. 13). 5. To set before one for judgment, acceptance, or rejection; to bring to the attention; to offer; to state; to express; figuratively, to assume; to suppose; -- formerly sometimes followed by that introducing a proposition; as, to put a question; to put a case. Let us now put that ye have leave. Chaucer. Put the perception and you put the mind. Berkeley. These verses, originally Greek, were put in Latin. Milton. All this is ingeniously and ably put. Hare. 6. To incite; to entice; to urge; to constrain; to oblige. These wretches put us upon all mischief. Swift. Put me not use the carnal weapon in my own defense. Sir W. Scott. Thank him who puts me, loath, to this revenge. Milton. 7. To throw or cast with a pushing motion \"overhand,\" the hand being raised from the shoulder; a practice in athletics; as, to put the shot or weight. 8. (Mining)  To convey coal in the mine, as from the working to the tramway. Raymond. Put case, formerly, an elliptical expression for, put or suppose the case to be. Put case that the soul after departure from the body may live. Bp. Hall. -- To put about (Naut.), to turn, or change the course of, as a ship. -- To put away. (a) To renounce; to discard; to expel. (b) To divorce. -- To put back. (a) To push or thrust backwards; hence, to hinder; to delay. (b) To refuse; to deny. Coming from thee, I could not put him back. Shak. (c) To set, as the hands of a clock, to an earlier hour. (d) To restore to the original place; to replace. -- To put by. (a) To turn, set, or thrust, aside. \"Smiling put the question by.\" Tennyson. (b) To lay aside; to keep; to sore up; as, to put by money. -- To put down. (a) To lay down; to deposit; to set down. (b) To lower; to diminish; as, to put down prices. (c) To deprive of position or power; to put a stop to; to suppress; to abolish; to confute; as, to put down rebellion of traitors. Mark, how a plain tale shall put you down. Shak. Sugar hath put down the use of honey. Bacon. (d) To subscribe; as, to put down one's name. -- To put forth. (a) To thrust out; to extend, as the hand; to cause to come or push out; as, a tree puts forth leaves. (b) To make manifest; to develop; also, to bring into action; to exert; as, to put forth strength. (c) To propose, as a question, a riddle, and the like. (d) To publish, as a book. -- To put forward. (a) To advance to a position of prominence responsibility; to promote. (b) To cause to make progress; to aid. (c) To set, as the hands of a clock, to a later hour. -- To put in. (a) To introduce among others; to insert; sometimes, to introduce with difficulty; as, to put in a word while others are discoursing. (b) (Naut.) To conduct into a harbor, as a ship. (c) (Law) To place in due form before a court; to place among the records of a court. Burrill. (d) (Med.) To restore, as a dislocated part, to its place. -- To put off. (a) To lay aside; to discard; as, to put off a robe; to put off mortality. \"Put off thy shoes from off thy feet.\" Ex. iii. 5. (b) To turn aside; to elude; to disappoint; to frustrate; to baffle. I hoped for a demonstration, but Themistius hoped to put me off with an harangue. Boyle. We might put him off with this answer. Bentley. (c) To delay; to defer; to postpone; as, to put off repentance. (d) To get rid of; to dispose of; especially, to pass fraudulently; as, to put off a counterfeit note, or an ingenious theory. (e) To push from land; as, to put off a boat. -- To put on or upon. (a) To invest one's self with, as clothes; to assume. \"Mercury . . . put on the shape of a man.\" L'Estrange. (b) To impute (something) to; to charge upon; as, to put blame on or upon another. (c) To advance; to promote. [Obs.] \"This came handsomely to put on the peace.\" Bacon. (d) To impose; to inflict. \"That which thou puttest on me, will I bear.\" 2 Kings xviii. 14. (e) To apply; as, to put on workmen; to put on steam. (f) To deceive; to trick. \"The stork found he was put upon.\" L'Estrange. (g) To place upon, as a means or condition; as, he put him upon bread and water. \"This caution will put them upon considering.\" Locke. (h) (Law) To rest upon; to submit to; as, a defendant puts himself on or upon the country. Burrill. -- To put out. (a) To eject; as, to put out and intruder. (b) To put forth; to shoot, as a bud, or sprout. (c) To extinguish; as, to put out a candle, light, or fire. (d) To place at interest; to loan; as, to put out funds. (e) To provoke, as by insult; to displease; to vex; as, he was put out by my reply. [Colloq.] (f) To protrude; to stretch forth; as, to put out the hand. (g) To publish; to make public; as, to put out a pamphlet. (h) To confuse; to disconcert; to interrupt; as, to put one out in reading or speaking. (i) (Law) To open; as, to put out lights, that is, to open or cut windows. Burrill. (j) (Med.) To place out of joint; to dislocate; as, to put out the ankle. (k) To cause to cease playing, or to prevent from playing longer in a certain inning, as in base ball. -- To put over. (a) To place (some one) in authority over; as, to put a general over a division of an army. (b) To refer. For the certain knowledge of that knowledge of that truthput you o'er to heaven and to my mother. Shak. (c) To defer; to postpone; as, the court put over the cause to the next term. (d) To transfer (a person or thing) across; as, to put one over the river. -- To put the hand to or unto. (a) To take hold of, as of an instrument of labor; as, to put the hand to the plow; hence, to engage in (any task or affair); as, to put one's hand to the work. (b) To take or seize, as in theft. \"He hath not put his hand unto his neighbor's goods.\" Ex. xxii. 11. -- To put through, to cause to go through all conditions or stages of a progress; hence, to push to completion; to accomplish; as, he put through a measure of legislation; he put through a railroad enterprise. [U.S.] -- To put to. (a) To add; to unite; as, to put one sum to another. (b) To refer to; to expose; as, to put the safety of the state to hazard. \"That dares not put it to the touch.\" Montrose. (c) To attach (something) to; to harness beasts to. Dickens. -- To put to a stand, to stop; to arrest by obstacles or difficulties. -- To put to bed. (a) To undress and place in bed, as a child. (b) To deliver in, or to make ready for, childbirth. -- To put to death, to kill. -- To put together, to attach; to aggregate; to unite in one. -- To put this and that (or two and two) together, to draw an inference; to form a correct conclusion. -- To put to it, to distress; to press hard; to perplex; to give difficulty to. \"O gentle lady, do not put me to 't.\" Shak. -- To put to rights, to arrange in proper order; to settle or compose rightly. -- To put to the sword, to kill with the sword; to slay. -- To put to trial, or on trial, to bring to a test; to try. -- To put trust in, to confide in; to repose confidence in. -- To put up. (a) To pass unavenged; to overlook; not to punish or resent; to put up with; as, to put up indignities. [Obs.] \"Such national injuries are not to be put up.\" Addison. (b) To send forth or upward; as, to put up goods for sale. (d) To start from a cover, as game. \"She has been frightened; she has been put up.\" C. Kingsley. (e) To hoard. \"Himself never put up any of the rent.\" Spelman. (f) To lay side or preserve; to pack away; to store; to pickle; as, to put up pork, beef, or fish. (g) To place out of sight, or away; to put in its proper place; as, put up that letter. Shak. (h) To incite; to instigate; -- followed by to; as, he put the lad up to mischief. (i) To raise; to erect; to build; as, to put up a tent, or a house. (j) To lodge; to entertain; as, to put up travelers. -- To put up a job, to arrange a plot. [Slang] Syn. -- To place; set; lay; cause; produce; propose; state. -- Put, Lay, Place, Set. These words agree in the idea of fixing the position of some object, and are often used interchangeably. To put is the least definite, denoting merely to move to a place. To place has more particular reference to the precise location, as to put with care in a certain or proper place. To set or to lay may be used when there is special reference to the position of the object.\n\n1. To go or move; as, when the air first puts up. [Obs.] Bacon. 2. To steer; to direct one's course; to go. His fury thus appeased, he puts to land. Dryden. 3. To play a card or a hand in the game called put. To put about (Naut.), to change direction; to tack. -- To put back (Naut.), to turn back; to return. \"The French . . . had put back to Toulon.\" Southey. -- To put forth. (a) To shoot, bud, or germinate. \"Take earth from under walls where nettles put forth.\" Bacon. (b) To leave a port or haven, as a ship. Shak. -- To put in (Naut.), to enter a harbor; to sail into port. -- To put in for. (a) To make a request or claim; as, to put in for a share of profits. (b) To go into covert; -- said of a bird escaping from a hawk. (c) To offer one's self; to stand as a candidate for. Locke. -- To put off, to go away; to depart; esp., to leave land, as a ship; to move from the shore. -- To put on, to hasten motion; to drive vehemently. -- To put over (Naut.), to sail over or across. -- To put to sea (Naut.), to set sail; to begin a voyage; to advance into the ocean. -- To put up. (a) To take lodgings; to lodge. (b) To offer one's self as a candidate. L'Estrange. -- To put up to, to advance to. [Obs.] \"With this he put up to my lord.\" Swift. -- To put up with. (a) To overlook, or suffer without recompense, punishment, or resentment; as, to put up with an injury or affront. (b) To take without opposition or expressed dissatisfaction; to endure; as, to put up with bad fare.\n\n1. The act of putting; an action; a movement; a thrust; a push; as, the put of a ball. \"A forced put.\" L'Estrange. 2. A certain game at cards. Young. 3. A privilege which one party buys of another to \"put\" (deliver) to him a certain amount of stock, grain, etc., at a certain price and date. [Brokers' Cant] A put and a call may be combined in one instrument, the holder of which may either buy or sell as he chooses at the fixed price. Johnson's Cyc.\n\nA prostitute. [Obs.]"}