{"word":"quarter","definition":"1. One of four equal parts into which anything is divided, or is regarded as divided; a fourth part or portion; as, a quarter of a dollar, of a pound, of a yard, of an hour, etc. Hence, specifically: (a) The fourth of a hundred-weight, being 25 or 28 pounds, according as the hundredweight is reckoned at 100 or 112 pounds. (b) The fourth of a ton in weight, or eight bushels of grain; as, a quarter of wheat; also, the fourth part of a chaldron of coal. Hutton. (c) (Astron.) The fourth part of the moon's period, or monthly revolution; as, the first quarter after the change or full. (d) One limb of a quadruped with the adjacent parts; one fourth part of the carcass of a slaughtered animal, including a leg; as, the fore quarters; the hind quarters. (e) That part of a boot or shoe which forms the side, from the heel to the vamp. (f) (Far.) That part on either side of a horse's hoof between the toe and heel, being the side of the coffin. (g) A term of study in a seminary, college, etc, etc.; properly, a fourth part of the year, but often longer or shorter. (h) pl. (Mil.)  The encampment on one of the principal passages round a place besieged, to prevent relief and intercept convoys. (i) (Naut.) The after-part of a vessel's side, generally corresponding in extent with the quarter-deck; also, the part of the yardarm outside of the slings. (j) (Her.) One of the divisions of an escutcheon when it is divided into four portions by a horizontal and a perpendicular line meeting in the fess point. Note: When two coats of arms are united upon one escutcheon, as in case of marriage, the first and fourth quarters display one shield, the second and third the other. See Quarter, v. t., 5. (k) One of the four parts into which the horizon is regarded as divided; a cardinal point; a direction' principal division; a region; a territory. Scouts each coast light-armed scour, Each quarter, to descry the distant foe. Milton. (l) A division of a town, city, or county; a particular district; a locality; as, the Latin quarter in Paris. (m) (Arch.) A small upright timber post, used in partitions; -- in the United States more commonly called stud. (n) (Naut.) The fourth part of the distance from one point of the compass to another, being the fourth part of 11° 15', that is, about 2° 49'; -- called also quarter point. 2. Proper station; specific place; assigned position; special location. Swift to their several quarters hasted then The cumbrous elements. Milton. Hence, specifically: (a) (Naut.) A station at which officers and men are posted in battle; -- usually in the plural. (b) Place of lodging or temporary residence; shelter; entertainment; -- usually in the plural. The banter turned as to what quarters each would find. W. Irving. (c) pl. (Mil.)  A station or encampment occupied by troops; a place of lodging for soldiers or officers; as, winter quarters. (d) Treatment shown by an enemy; mercy; especially, the act of sparing the life a conquered enemy; a refraining from pushing one's advantage to extremes. He magnified his own clemency, now they were at his mercy, to offer them quarter for their lives. Clarendon. Cocks and lambs . . . at the mercy of cats and wolves . . . must never expect better quarter. L'Estrange. 3. Friendship; amity; concord. [Obs.] To keep quarter, to keep one's proper place, and so be on good terms with another. [Obs.] In quarter, and in terms like bride and groom. Shak. I knew two that were competitors for the secretary's place, . . . and yet kept good quarter between themselves. Bacon. False quarter, a cleft in the quarter of a horse's foot. -- Fifth quarter, the hide and fat; -- a butcher's term. -- On the quarter (Naut.), in a direction between abeam and astern; opposite, or nearly opposite, a vessel's quarter. -- Quarter aspect. (Astrol.) Same as Quadrate. -- Quarter back (Football), the player who has position next behind center rush, and receives the ball on the snap back. -- Quarter badge (Naut.), an ornament on the side of a vessel near, the stern. Mar. Dict. -- Quarter bill (Naut.), a list specifying the different stations to be taken by the officers and crew in time of action, and the names of the men assigned to each. -- Quarter block (Naut.), a block fitted under the quarters of a yard on each side of the slings, through which the clew lines and sheets are reeved. R. H. Dana, Jr. -- Quarter boat (Naut.), a boat hung at a vessel's quarter. -- Quarter cloths (Naut.), long pieces of painted canvas, used to cover the quarter netting. -- Quarter day, a day regarded as terminating a quarter of the year; hence, one on which any payment, especially rent, becomes due. In matters influenced by United States statutes, quarter days are the first days of January, April, July, and October. In New York and many other places, as between landlord and tenant, they are the first days of May, August, November, and February. The quarter days usually recognized in England are 25th of March (Lady Day), the 24th of June (Midsummer Day), the 29th of September (Michaelmas Day), and the 25th of December (Christmas Day). -- Quarter face, in fine arts, portrait painting, etc., a face turned away so that but one quarter is visible. -- Quarter gallery (Naut.), a balcony on the quarter of a ship. See Gallery, 4. -- Quarter gunner (Naut.), a petty officer who assists the gunner. -- Quarter look, a side glance. [Obs.] B. Jonson. -- Quarter nettings (Naut.), hammock nettings along the quarter rails. -- Quarter note (Mus.), a note equal in duration to half a minim or a fourth of semibreve; a crochet. -- Quarter pieces (Naut.), several pieces of timber at the after- part of the quarter gallery, near the taffrail. Totten. -- Quarter point. (Naut.) See Quarter, n., 1 (n). -- Quarter railing, or Quarter rails (Naut.), narrow molded planks reaching from the top of the stern to the gangway, serving as a fence to the quarter-deck. -- Quarter sessions (Eng. Law), a general court of criminal jurisdiction held quarterly by the justices of peace in counties and by the recorders in boroughs. -- Quarter square (Math.), the fourth part of the square of a number. Tables of quarter squares have been devised to save labor in multiplying numbers. -- Quarter turn, Quarter turn belt (Mach.), an arrangement in which a belt transmits motion between two shafts which are at right angles with each other. -- Quarter watch (Naut.), a subdivision of the full watch (one fourth of the crew) on a man-of- war. -- To give, or show, quarter (Mil.), to accept as prisoner, on submission in battle; to forbear to kill, as a vanquished enemy. -- To keep quarter. See Quarter, n., 3.\n\n1. To divide into four equal parts. 2. To divide; to separate into parts or regions. Then sailors quartered heaven. Dryden. 3. To furnish with shelter or entertainment; to supply with the means of living for a time; especially, to furnish shelter to; as, to quarter soldiers. They mean this night in Sardis to be quartered. Shak. 4. To furnish as a portion; to allot. [R.] This isle . . . He quarters to his blue-haired deities. Milton. 5. (Her.)  To arrange (different coats of arms) upon one escutcheon, as when a man inherits from both father and mother the right to bear arms. Note: When only two coats of arms are so combined they are arranged in four compartments. See Quarter, n., 1 (f).\n\nTo lodge; to have a temporary residence.\n\nTo drive a carriage so as to prevent the wheels from going into the ruts, or so that a rut shall be between the wheels. Every creature that met us would rely on us for quartering. De Quincey."}