{"word":"quick","definition":"1. Alive; living; animate; -- opposed to dead or inanimate. Not fully quyke, ne fully dead they were. Chaucer. The Lord Jesus Christ, who shall judge the quick and the dead at his appearing and his kingdom. 2 Tim. iv. 1. Man is no star, but a quick coal Of mortal fire. Herbert. Note: In this sense the word is nearly obsolete, except in some compounds, or in particular phrases. 2. Characterized by life or liveliness; animated; sprightly; agile; brisk; ready. \" A quick wit.\" Shak. 3. Speedy; hasty; swift; not slow; as, be quick Oft he her his charge of quick return Repeated. Milton. 4. Impatient; passionate; hasty; eager; eager; sharp; unceremonious; as, a quick temper. The bishop was somewhat quick with them, and signified that he was much offended. Latimer. 5. Fresh; bracing; sharp; keen. The air is quick there, And it pierces and sharpens the stomach. Shak. 6. Sensitive; perceptive in a high degree; ready; as, a quick ear. \"To have an open ear, a quick eye.\" Shak. They say that women are so quick. Tennyson. 7. Pregnant; with child. Shak. Quick grass. (Bot.) See Quitch grass. -- Quick match. See under Match. -- Quick vein (Mining), a vein of ore which is productive, not barren. -- Quick vinegar, vinegar made by allowing a weak solution of alcohol to trickle slowly over shavings or other porous material. -- Quick water, quicksilver water. -- Quick with child, pregnant with a living child. Syn. -- Speedy; expeditious; swift; rapid; hasty; prompt; ready; active; brisk; nimble; fleet; alert; agile; lively; sprightly.\n\nIn a quick manner; quickly; promptly; rapidly; with haste; speedily; without delay; as, run quick; get back quick. If we consider how very quick the actions of the mind are performed. Locke.\n\n1. That which is quick, or alive; a living animal or plant; especially, the hawthorn, or other plants used in making a living hedge. The works . . . are curiously hedged with quick. Evelyn. 2. The life; the mortal point; a vital part; a part susceptible of serious injury or keen feeling; the sensitive living flesh; the part of a finger or toe to which the nail is attached; the tender emotions; as, to cut a finger nail to the quick; to thrust a sword to the quick, to taunt one to the quick; -- used figuratively. This test nippeth, . . . this toucheth the quick. Latimer. How feebly and unlike themselves they reason when they come to the quick of the difference ! Fuller. 3. (Bot.)  Quitch grass. Tennyson.\n\nTo revive; to quicken; to be or become alive. [Obs.] Chaucer."}