{"word":"quit","definition":"Any one of numerous species of small passerine birds native of tropical America. See Banana quit, under Banana, and Guitguit.\n\nReleased from obligation, charge, penalty, etc.; free; clear; absolved; acquitted. Chaucer. The owner of the ox shall be quit. Ex. xxi. 28. Note: This word is sometimes used in the form quits, colloquially; as, to be quits with one, that is, to have made mutual satisfaction of demands with him; to be even with him; hence, as an exclamation: Quits! we are even, or on equal terms. \"To cry quits with the commons in their complaints.\" Fuller.\n\n1. To set at rest; to free, as from anything harmful or oppressive; to relieve; to clear; to liberate. [R.] To quit you of this fear, you have already looked Death in the face; what have you found so terrible in it Wake. 2. To release from obligation, accusation, penalty, or the like; to absolve; to acquit. There may no gold them quyte. Chaucer. God will relent, and quit thee all his debt. Milton. 3. To discharge, as an obligation or duty; to meet and satisfy, as a claim or debt; to make payment for or of; to requite; to repay. The blissful martyr quyte you your meed. Chaucer. Enkindle all the sparks of nature To quit this horrid act. Shak. Before that judge that quits each soul his hire. Fairfax. 4. To meet the claims upon, or expectations entertained of; to conduct; to acquit; -- used reflexively. Be strong, and quit yourselves like men. I Sam. iv. 9. Samson hath guit himself Like Samson. Milton. 5. To carry through; to go through to the end. [Obs.] Never worthy prince a day did quit With greater hazard and with more renown. Daniel. 6. To have done with; to cease from; to stop; hence, to depart from; to leave; to forsake; as, to quit work; to quit the place; to quit jesting. Such a superficial way of examining is to quit truth for appearance. Locke. To quit cost, to pay; to reimburse. -- To quit scores, to make even; to clear mutually from demands. Does not the earth quit scores with all the elements in the noble fruits that issue from it South. Syn. -- To leave; relinquish; resign; abandon; forsake; surrender; discharge; requite. -- Quit, Leave. Leave is a general term, signifying merely an act of departure; quit implies a going without intention of return, a final and absolute abandonment.\n\nTo away; to depart; to stop doing a thing; to cease."}