{"word":"race","definition":"A game, match, etc., open only to losers in early stages of contests.\n\nA root. \"A race or two of ginger.\" Shak. Race ginger, ginger in the root, or not pulverized.\n\n1. The descendants of a common ancestor; a family, tribe, people, or nation, believed or presumed to belong to the same stock; a lineage; a breed. The whole race of mankind. Shak. Whence the long race of Alban fathers come. Dryden. Note: Naturalists and ehnographers divide mankind into several distinct varieties, or races. Cuvier refers them all to three, Pritchard enumerates seven, Agassiz eight, Pickering describes eleven. One of the common classifications is that of Blumenbach, who makes five races: the Caucasian, or white race, to which belong the greater part of the European nations and those of Western Asia; the Mongolian, or yellow race, occupying Tartary, China, Japan, etc.; the Ethiopian, or negro race, occupying most of Africa (except the north), Australia, Papua, and other Pacific Islands; the American, or red race, comprising the Indians of North and South America; and the Malayan, or brown race, which occupies the islands of the Indian Archipelago, etc. Many recent writers classify the Malay and American races as branches of the Mongolian. See Illustration in Appendix. 2. Company; herd; breed. For do but note a wild and wanton herd, Or race of youthful and unhandled colts, Fetching mad bounds. Shak . 3. (Bot.)  A variety of such fixed character that it may be propagated by seed. 4. Peculiar flavor, taste, or strength, as of wine; that quality, or assemblage of qualities, which indicates origin or kind, as in wine; hence, characteristic flavor; smack. \"A race of heaven.\" Shak. Is it [the wine] of the right race Massinqer. 5. Hence, characteristic quality or disposition. [Obs.] And now I give my sensual race the rein. Shak. Some . . . great race of fancy or judgment. Sir W. Temple. Syn. -- Lineage; line; family; house; breed; offspring; progeny; issue.\n\n1. A progress; a course; a movement or progression. 2. Esp., swift progress; rapid course; a running. The flight of many birds is swifter than the race of any beasts. Bacon. 3. Hence: The act or process of running in competition; a contest of speed in any way, as in running, riding, driving, skating, rowing, sailing; in the plural, usually, a meeting for contests in the running of horses; as, he attended the races. The race is not to the swift. Eccl. ix. 11. I wield the gauntlet, and I run the race. Pope. 4. Competitive action of any kind, especially when prolonged; hence, career; course of life. My race of glory run, and race of shame. Milton. 5. A strong or rapid current of water, or the channel or passage for such a current; a powerful current or heavy sea, sometimes produced by the meeting of two tides; as, the Portland Race; the Race of Alderney. 6. The current of water that turns a water wheel, or the channel in which it flows; a mill race. Note: The part of the channel above the wheel is sometimes called the headrace, the part below, the tailrace. 7. (Mach.)  A channel or guide along which a shuttle is driven back and forth, as in a loom, sewing machine, etc. Race cloth, a cloth worn by horses in racing, having pockets to hold the weights prescribed. -- Race course. (a) The path, generally circular or elliptical, over which a race is run. (b) Same as Race way, below. -- Race cup, a cup given as a prize to the victor in a race. -- Race glass, a kind of field glass. -- Race horse. (a) A horse that runs in competition; specifically, a horse bred or kept for running races. (b) A breed of horses remarkable for swiftness in running. (c) (Zoöl.) The steamer duck. (d) (Zoöl.) A mantis. -- Race knife, a cutting tool with a blade that is hooked at the point, for marking outlines, on boards or metals, as by a pattern, -- used in shipbuilding. -- Race saddle, a light saddle used in racing. -- Race track. Same as Race course (a), above. -- Race way, the canal for the current that drives a water wheel.\n\n1. To run swiftly; to contend in a race; as, the animals raced over the ground; the ships raced from port to port. 2. (Steam Mach.)  To run too fast at times, as a marine engine or screw, when the screw is lifted out of water by the action of a heavy sea.\n\n1. To cause to contend in race; to drive at high speed; as, to race horses. 2. To run a race with."}