{"word":"radical","definition":"1. Of or pertaining to the root; proceeding directly from the root. 2. Hence: Of or pertaining to the root or origin; reaching to the center, to the foundation to the ultimate sources to the principles, or the like: original; fundamental; thorough-going; unsparing; extreme; as, radical evils; radical reform; a radical party. The most determined exertions of that authority, against them, only showed their radical independence. Burke. 3. (Bot.) (a) Belonging to, or proceeding from, the root of a plant; as, radical tubers or hairs. (b) Proceeding from a rootlike stem, or one which does not rise above the ground; as, the radical leaves of the dandelion and the sidesaddle flower. 4. (Philol.)  Relating, or belonging, to the root, or ultimate source of derivation; as, a radical verbal form. 5. (Math.)  Of or pertaining to a radix or root; as, a radical quantity; a radical sign. See below. Radical axis of two circles. (Geom.) See under Axis. -- Radical pitch, the pitch or tone with which the utterance of a syllable begins. Rush. -- Radical quantity (Alg.), a quantity to which the radical sign is prefixed; specifically, a quantity which is not a perfect power of the degree indicated by the radical sign; a surd. -- Radical sign (Math.), the sign sq. root (originally the letter r, the initial of radix, root), placed before any quantity, denoting that its root is to be extracted; thus, sq. roota, or sq. root(a + b). To indicate any other than the square root, a corresponding figure is placed over the sign; thus cube roota, indicates the third or cube root of a. -- Radical stress (Elocution), force of utterance falling on the initial part of a syllable or sound. -- Radical vessels (Anat.), minute vessels which originate in the substance of the tissues. Syn. -- Primitive; original; natural; underived; fundamental; entire. -- Radical, Entire. These words are frequently employed as interchangeable in describing some marked alternation in the condition of things. There is, however, an obvious difference between them. A radical cure, reform, etc., is one which goes to the root of the thing in question; and it is entire, in the sense that, by affecting the root, it affects in a appropriate degree the entire body nourished by the root; but it may not be entire in the sense of making a change complete in its nature, as well as in its extent. Hence, we speak of a radical change; a radical improvement; radical differences of opinion; while an entire change, an entire improvement, an entire difference of opinion, might indicate more than was actually intended. A certain change may be both radical and entire, in every sense.\n\n1. (Philol.) (a) A primitive word; a radix, root, or simple, underived, uncompounded word; an etymon. (b) A primitive letter; a letter that belongs to the radix. The words we at present make use of, and understand only by common agreement, assume a new air and life in the understanding, when you trace them to their radicals, where you find every word strongly stamped with nature; full of energy, meaning, character, painting, and poetry. Cleland. 2. (Politics)  One who advocates radical changes in government or social institutions, especially such changes as are intended to level class inequalities; -- opposed to conservative. In politics they [the Independents] were, to use phrase of their own time. \"Root-and-Branch men,\" or, to use the kindred phrase of our own, Radicals. Macaulay. 3. (Chem.) (a) A characteristic, essential, and fundamental constituent of any compound; hence, sometimes, an atom. As a general rule, the metallic atoms are basic radicals, while the nonmetallic atoms are acid radicals. J. P. Cooke. (b) Specifically, a group of two or more atoms, not completely saturated, which are so linked that their union implies certain properties, and are conveniently regarded as playing the part of a single atom; a residue; -- called also a compound radical. Cf. Residue. 4. (Alg.)  A radical quantity. See under Radical, a. An indicated root of a perfect power of the degree indicated is not a radical but a rational quantity under a radical form. Davies & Peck (Math. Dict. ) 5. (Anat.)  A radical vessel. See under Radical, a."}