{"word":"rail","definition":"An outer cloak or covering; a neckerchief for women. Fairholt.\n\nTo flow forth; to roll out; to course. [Obs.] Streams of tears from her fair eyes forth railing. Spenser.\n\n1. A bar of timber or metal, usually horizontal or nearly so, extending from one post or support to another, as in fences, balustrades, staircases, etc. 2. (Arch.)  A horizontal piece in a frame or paneling. See Illust. of Style. 3. (Railroad)  A bar of steel or iron, forming part of the track on which the wheels roll. It is usually shaped with reference to vertical strength, and is held in place by chairs, splices, etc. 4. (Naut.) (a) The stout, narrow plank that forms the top of the bulwarks. (b) The light, fencelike structures of wood or metal at the break of the deck, and elsewhere where such protection is needed. Rail fence. See under Fence. -- Rail guard. (a) A device attached to the front of a locomotive on each side for clearing the rail obstructions. (b) A guard rail. See under Guard. -- Rail joint (Railroad), a splice connecting the adjacent ends of rails, in distinction from a chair, which is merely a seat. The two devices are sometimes united. Among several hundred varieties, the fish joint is standard. See Fish joint, under Fish. -- Rail train (Iron & Steel Manuf.), a train of rolls in a rolling mill, for making rails for railroads from blooms or billets.\n\n1. To inclose with rails or a railing. It ought to be fenced in and railed. Ayliffe. 2. To range in a line. [Obs.] They were brought to London all railed in ropes, like a team of horses in a cart. Bacon.\n\nAny one of numerous species of limicoline birds of the family Rallidæ, especially those of the genus Rallus, and of closely allied genera. They are prized as game birds. Note: The common European water rail (Rallus aquaticus) is called also bilcock, skitty coot, and brook runner. The best known American species are the clapper rail, or salt-marsh hen (Rallus lonqirostris, var. crepitans); the king, or red-breasted, rail (R. elegans) (called also fresh-water marshhen); the lesser clapper, or Virginia, rail (R. Virginianus); and the Carolina, or sora, rail (Porzana Carolina). See Sora. Land rail (Zoöl.), the corncrake.\n\nTo use insolent and reproachful language; to utter reproaches; to scoff; followed by at or against, formerly by on. Shak. And rail at arts he did not understand. Dryden. Lesbia forever on me rails. Swift.\n\n1. To rail at. [Obs.] Feltham. 2. To move or influence by railing. [R.] Rail the seal from off my bond. Shak."}