{"word":"rain","definition":"Reign. [Obs.] Spenser.\n\nWater falling in drops from the clouds; the descent of water from the clouds in drops. Rain is water by the heat of the sun divided into very small parts ascending in the air, till, encountering the cold, it be condensed into clouds, and descends in drops. Ray. Fair days have oft contracted wind and rain. Milton. Note: Rain is distinguished from mist by the size of the drops, which are distinctly visible. When water falls in very small drops or particles, it is called mist; and fog is composed of particles so fine as to be not only individually indistinguishable, but to float or be suspended in the air. See Fog, and Mist. Rain band (Meteorol.), a dark band in the yellow portion of the solar spectrum near the sodium line, caused by the presence of watery vapor in the atmosphere, and hence sometimes used in weather predictions. -- Rain bird (Zoöl.), the yaffle, or green woodpecker. [Prov. Eng.] The name is also applied to various other birds, as to Saurothera vetula of the West Indies. -- Rain fowl (Zoöl.), the channel-bill cuckoo (Scythrops Novæ- Hollandiæ) of Australia. -- Rain gauge, an instrument of various forms measuring the quantity of rain that falls at any given place in a given time; a pluviometer; an ombrometer. -- Rain goose (Zoöl.), the red-throated diver, or loon. [Prov. Eng.] -- Rain prints (Geol.), markings on the surfaces of stratified rocks, presenting an appearance similar to those made by rain on mud and sand, and believed to have been so produced. -- Rain quail. (Zoöl.) See Quail, n., 1. -- Rain water, water that has fallen from the clouds in rain.\n\n1. To fall in drops from the clouds, as water; used mostly with it for a nominative; as, it rains. The rain it raineth every day. Shak. 2. To fall or drop like water from the clouds; as, tears rained from their eyes.\n\n1. To pour or shower down from above, like rain from the clouds. Then said the Lord unto Moses, Behold, I will rain bread from heaven for you. Ex. xvi. 4. 2. To bestow in a profuse or abundant manner; as, to rain favors upon a person."}