{"word":"raise","definition":"1. To cause to rise; to bring from a lower to a higher place; to lift upward; to elevate; to heave; as, to raise a stone or weight. Hence, figuratively: -- (a) To bring to a higher condition or situation; to elevate in rank, dignity, and the like; to increase the value or estimation of; to promote; to exalt; to advance; to enhance; as, to raise from a low estate; to raise to office; to raise the price, and the like. This gentleman came to be raised to great titles. Clarendon. The plate pieces of eight were raised three pence in the piece. Sir W. Temple. (b) To increase the strength, vigor, or vehemence of; to excite; to intensify; to invigorate; to heighten; as, to raise the pulse; to raise the voice; to raise the spirits or the courage; to raise the heat of a furnace. (c) To elevate in degree according to some scale; as, to raise the pitch of the voice; to raise the temperature of a room. 2. To cause to rise up, or assume an erect position or posture; to set up; to make upright; as, to raise a mast or flagstaff. Hence: -- (a) To cause to spring up from recumbent position, from a state of quiet, or the like; to awaken; to arouse. They shall not awake, nor be raised out of their sleep. Job xiv. 12. (b) To rouse to action; to stir up; to incite to tumult, struggle, or war; to excite. He commandeth, and raiseth the stormy wind. Ps. cvii. 25. Æneas . . . employs his pains, In parts remote, to raise the Tuscan swains. Dryden. (c) To bring up from the lower world; to call up, as a spirit from the world of spirits; to recall from death; to give life to. Why should it be thought a thing incredible with you, that God should raise the dead Acts xxvi. 8. 3. To cause to arise, grow up, or come into being or to appear; to give to; to originate, produce, cause, effect, or the like. Hence, specifically: -- (a) To form by the accumulation of materials or constituent parts; to build up; to erect; as, to raise a lofty structure, a wall, a heap of stones. I will raise forts against thee. Isa. xxxix. 3. (b) To bring together; to collect; to levy; to get together or obtain for use or service; as, to raise money, troops, and the like. \"To raise up a rent.\" Chaucer. (c) To cause to grow; to procure to be produced, bred, or propagated; to grow; as, to raise corn, barley, hops, etc.; toraise cattle. \"He raised sheep.\" \"He raised wheat where none grew before.\" Johnson's Dict. Note: In some parts of the United States, notably in the Southern States, raise in also commonly applied to the rearing or bringing up of children. I was raised, as they say in Virginia, among the mountains of the North. Paulding. (d) To bring into being; to produce; to cause to arise, come forth, or appear; -- often with up. I will raise them up a prophet from among their brethren, like unto thee. Deut. xviii. 18. God vouchsafes to raise another world From him [Noah], and all his anger to forget. Milton. (e) To give rise to; to set agoing; to occasion; to start; to originate; as, to raise a smile or a blush. Thou shalt not raise a false report. Ex. xxiii. 1. (f) To give vent or utterance to; to utter; to strike up. Soon as the prince appears, they raise a cry. Dryden. (g) To bring to notice; to submit for consideration; as, to raise a point of order; to raise an objection. 4. To cause to rise, as by the effect of leaven; to make light and spongy, as bread. Miss Liddy can dance a jig, and raise paste. Spectator. 5. (Naut.) (a) To cause (the land or any other object) to seem higher by drawing nearer to it; as, to raise Sandy Hook light. (b) To let go; as in the command, Raise tacks and sheets, i. e., Let go tacks and sheets. 6. (Law)  To create or constitute; as, to raise a use that is, to create it. Burrill. To raise a blockade (Mil.), to remove or break up a blockade, either by withdrawing the ships or forces employed in enforcing it, or by driving them away or dispersing them. -- To raise a check, note, bill of exchange, etc., to increase fraudulently its nominal value by changing the writing, figures, or printing in which the sum payable is specified. -- To raise a siege, to relinquish an attempt to take a place by besieging it, or to cause the attempt to be relinquished. -- To raise steam, to produce steam of a required pressure. -- To raise the wind, to procure ready money by some temporary expedient. [Colloq.] -- To raise Cain, or To raise the devil, to cause a great disturbance; to make great trouble. [Slang] Syn. -- To lift; exalt; elevate; erect; originate; cause; produce; grow; heighten; aggravate; excite."}