{"word":"rake","definition":"1. An implement consisting of a headpiece having teeth, and a long handle at right angles to it, -- used for collecting hay, or other light things which are spread over a large surface, or for breaking and smoothing the earth. 2. A toothed machine drawn by a horse, -- used for collecting hay or grain; a horserake. 3. Etym: [Perhaps a different word.] (Mining)  A fissure or mineral vein traversing the strata vertically, or nearly so; -- called also rake-vein. Gill rakes. (Anat.) See under 1st Gill.\n\n1. To collect with a rake; as, to rake hay; -- often with up; as, he raked up the fallen leaves. 2. Hence:  To collect or draw together with laborious industry; to gather from a wide space; to scrape together; as, to rake together wealth; to rake together slanderous tales; to rake together the rabble of a town. 3. To pass a rake over; to scrape or scratch with a rake for the purpose of collecting and clearing off something, or for stirring up the soil; as, to rake a lawn; to rake a flower bed. 4. To search through; to scour; to ransack. The statesman rakes the town to find a plot. Swift. 5. To scrape or scratch across; to pass over quickly and lightly, as a rake does. Like clouds that rake the mountain summits. Wordsworth. 6. (Mil.)  To enfilade; to fire in a direction with the length of; in naval engagements, to cannonade, as a ship, on the stern or head so that the balls range the whole length of the deck. To rake up. (a) To collect together, as the fire (live coals), and cover with ashes. (b) To bring up; to search out an bring to notice again; as, to rake up old scandals.\n\n1. To use a rake, as for searching or for collecting; to scrape; to search minutely. One is for raking in Chaucer for antiquated words. Dryden. 2. To pass with violence or rapidity; to scrape along. Pas could not stay, but over him did rake. Sir P. Sidney.\n\nTo inclination of anything from a perpendicular direction; as, the rake of a roof, a staircase, etc.; especially (Naut.,  the inclination of a mast or tunnel, or, in general, of any part of a vessel not perpendicular to the keel.\n\nTo incline from a perpendicular direction; as, a mast rakes aft. Raking course (Bricklaying), a course of bricks laid diagonally between the face courses in a thick wall, to strengthen.\n\nA loose, disorderly, vicious man; a person addicted to lewdness and other scandalous vices; a debauchee; a roué. Am illiterate and frivolous old rake. Macaulay.\n\n1. Etym: [Icel. reika. Cf. Rake a debauchee.]  To walk about; to gad or ramble idly. [Prov. Eng.] 2. Etym: [See Rake a debauchee.]  To act the rake; to lead a dissolute, debauched life. Shenstone. To rake out (Falconry), to fly too far and wide from its master while hovering above waiting till the game is sprung; -- said of the hawk. Encyc. Brit."}