{"word":"range","definition":"1. To set in a row, or in rows; to place in a regular line or lines, or in ranks; to dispose in the proper order; to rank; as, to range soldiers in line. Maccabeus ranged his army by hands. 2 Macc. xii. 20. 2. To place (as a single individual) among others in a line, row, or order, as in the ranks of an army; -- usually, reflexively and figuratively, (in the sense) to espouse a cause, to join a party, etc. It would be absurd in me to range myself on the side of the Duke of Bedford and the corresponding society. Burke. 3. To separate into parts; to sift. [Obs.] Holland. 4. To dispose in a classified or in systematic order; to arrange regularly; as, to range plants and animals in genera and species. 5. To rove over or through; as, to range the fields. Teach him to range the ditch, and force the brake. Gay. 6. To sail or pass in a direction parallel to or near; as, to range the coast. Note: Compare the last two senses (5 and 6) with the French ranger une côte. 7. (Biol.)  To be native to, or to live in; to frequent.\n\n1. To rove at large; to wander without restraint or direction; to roam. Like a ranging spaniel that barks at every bird he sees. Burton. 2. To have range; to change or differ within limits; to be capable of projecting, or to admit of being projected, especially as to horizontal distance; as, the temperature ranged through seventy degrees Fahrenheit; the gun ranges three miles; the shot ranged four miles. 3. To be placed in order; to be ranked; to admit of arrangement or classification; to rank. And range with humble livers in content. Shak. 4. To have a certain direction; to correspond in direction; to be or keep in a corresponding line; to trend or run; -- often followed by with; as, the front of a house ranges with the street; to range along the coast. Which way the forests range. Dryden. 5. (Biol.)  To be native to, or live in, a certain district or region; as, the peba ranges from Texas to Paraguay. Syn. -- To rove; roam; ramble; wander; stroll.\n\n1. A series of things in a line; a row; a rank; as, a range of buildings; a range of mountains. 2. An aggregate of individuals in one rank or degree; an order; a class. The next range of beings above him are the immaterial intelligences. Sir M. Hale. 3. The step of a ladder; a rung. Clarendon. 4. A kitchen grate. [Obs.] He was bid at his first coming to take off the range, and let down the cinders. L'Estrange. 5. Am extended cooking apparatus of cast iron, set in brickwork, and affording conveniences for various ways 6. A bolting sieve to sift meal. [Obs. or Prov. Eng.] 7. A wandering or roving; a going to and fro; an excursion; a ramble; an expedition. He may take a range all the world over. South. 8. That which may be ranged over; place or room for excursion; especially, a region of country in which cattle or sheep may wander and pasture. 9. Extent or space taken in by anything excursive; compass or extent of excursion; reach; scope; discursive; as, the range of one's voice, or authority. Far as creation's ample range extends. Pope. The range and compass of Hammond's knowledge filled the whole circle of the arts. Bp. Fell. A man has not enough range of thought. Addison. 10. (Biol.)  The region within which a plant or animal naturally lives. 11. (Gun.) (a) The horizontal distance to which a shot or other projectile is carried. (b) Sometimes, less properly, the trajectory of a shot or projectile. (c) A place where shooting, as with cannons or rifles, is practiced. 12. In the public land system of the United States, a row or line of townships lying between two succession meridian lines six miles apart. Note: The meridians included in each great survey are numbered in order east and west from the \"principal meridian\" of that survey, and the townships in the range are numbered north and south from the \"base line,\" which runs east and west; as, township No. 6, N., range 7, W., from the fifth principal meridian. 13. (Naut.)  See Range of cable, below. Range of accommodation (Optics), the distance between the near point and the far point of distinct vision, -- usually measured and designated by the strength of the lens which if added to the refracting media of the eye would cause the rays from the near point to appear as if they came from the far point. -- Range finder (Gunnery), an instrument, or apparatus, variously constructed, for ascertaining the distance of an inaccessible object, -- used to determine what elevation must be given to a gun in order to hit the object; a position finder. -- Range of cable (Naut.), a certain length of slack cable ranged along the deck preparatory to letting go the anchor. -- Range work (Masonry), masonry of squared stones laid in courses each of which is of even height throughout the length of the wall; -- distinguished from broken range work, which consists of squared stones laid in courses not continuously of even height. -- To get the range of (an object) (Gun.), to find the angle at which the piece must be raised to reach (the object) without carrying beyond."}