{"word":"rate","definition":"To chide with vehemence; to scold; to censure violently. Spencer. Go, rate thy minions, proud, insulting boy! Shak. Conscience is a check to beginners in sin, reclaiming them from it, and rating them for it. Barrow.\n\n1. Established portion or measure; fixed allowance. The one right feeble through the evil rate, Of food which in her duress she had found. Spenser. 2. That which is established as a measure or criterion; degree; standard; rank; proportion; ratio; as, a slow rate of movement; rate of interest is the ratio of the interest to the principal, per annum. Heretofore the rate and standard of wit was different from what it is nowadays. South. In this did his holiness and godliness appear above the rate and pitch of other men's, in that he was so . . . merciful. Calamy. Many of the horse could not march at that rate, nor come up soon enough. Clarendon. 3. Variation; prise fixed with relation to a standard; cost; charge; as, high or low rates of transportation. They come at dear rates from Japan. Locke. 4. A tax or sum assessed by authority on property for public use, according to its income or value; esp., in England, a local tax; as, parish rates; town rates. 5. Order; arrangement. [Obs.] Thus sat they all around in seemly rate. Spenser. 6. Ratification; approval. [R.] Chapman. 7. (Horol.)  The gain or loss of a timepiece in a unit of time; as, daily rate; hourly rate; etc. 8. (Naut.) (a) The order or class to which a war vessel belongs, determined according to its size, armament, etc.; as, first rate, second rate, etc. (b) The class of a merchant vessel for marine insurance, determined by its relative safety as a risk, as A1, A2, etc.\n\n1. To set a certain estimate on; to value at a certain price or degree. To rate a man by the nature of his companions is a rule frequent indeed, but not infallible. South. You seem not high enough your joys to rate. Dryden. 2. To assess for the payment of a rate or tax. 3. To settle the relative scale, rank, position, amount, value, or quality of; as, to rate a ship; to rate a seaman; to rate a pension. 4. To ratify. [Obs.] \"To rate the truce.\" Chapman. To rate a chronometer, to ascertain the exact rate of its gain or loss as compared with true time, so as to make an allowance or computation depended thereon. Syn. -- To value; appraise; estimate; reckon.\n\n1. To be set or considered in a class; to have rank; as, the ship rates as a ship of the line. 2. To make an estimate."}