{"word":"rattle","definition":"1. To make a quick succession of sharp, inharmonious noises, as by the collision of hard and not very sonorous bodies shaken together; to clatter. And the rude hail in rattling tempest forms. Addison. 'T was but the wind, Or the car rattling o'er the stony street. Byron. 2. To drive or ride briskly, so as to make a clattering; as, we rattled along for a couple of miles. [Colloq.] 3. To make a clatter with a voice; to talk rapidly and idly; to clatter; -- with on or away; as, she rattled on for an hour. [Colloq.]\n\n1. To cause to make a ratting or clattering sound; as, to rattle a chain. 2. To assail, annoy, or stun with a ratting noise. Sound but another [drum], and another shall As loud as thine rattle the welkin's ear. Shak. 3. Hence, to disconcert; to confuse; as, to rattle one's judgment; to rattle a player in a game. [Colloq.] 4. To scold; to rail at. L'Estrange. To rattle off. (a) To tell glibly or noisily; as, to rattle off a story. (b) To rail at; to scold. \"She would sometimes rattle off her servants sharply.\" Arbuthnot.\n\n1. A rapid succession of sharp, clattering sounds; as, the rattle of a drum. Prior. 2. Noisy, rapid talk. All this ado about the golden age is but an empty rattle and frivolous conceit. Hakewill. 3. An instrument with which a ratting sound is made; especially, a child's toy that rattle when shaken. The rattles of Isis and the cymbals of Brasilea nearly enough resemble each other. Sir W. Raleigh. Pleased with a rattle, tickled with a straw. Pope. 4. A noisy, senseless talker; a jabberer. It may seem strange that a man who wrote with so much perspicuity, vivacity, and grace, should have been, whenever he took a part in conversation, an empty, noisy, blundering rattle. Macaulay. 5. A scolding; a sharp rebuke. [Obs.] Heylin. 6. (Zoöl.)  Any organ of an animal having a structure adapted to produce a ratting sound. Note: The rattle of the rattlesnake is composed of the hardened terminal scales, loosened in succession, but not cast off, and so modified in form as to make a series of loose, hollow joints. 7. The noise in the throat produced by the air in passing through mucus which the lungs are unable to expel; -- chiefly observable at the approach of death, when it is called the death rattle. See Râle. To spring a rattle, to cause it to sound. -- Yellow rattle (Bot.), a yellow-flowered herb (Rhinanthus Crista- galli), the ripe seeds of which rattle in the inflated calyx."}