{"word":"reach","definition":"An effort to vomit. [R.]\n\n1. To extend; to stretch; to thrust out; to put forth, as a limb, a member, something held, or the like. Her tresses yellow, and long straughten, Unto her heeles down they raughten. Rom. of R. Reach hither thy hand and thrust it into my side. John xx. 27. Fruit trees, over woody, reached too far Their pampered boughs. Milton. 2. Hence, to deliver by stretching out a member, especially the hand; to give with the hand; to pass to another; to hand over; as, to reach one a book. He reached me a full cap. 2 Esd. xiv. 39. 3. To attain or obtain by stretching forth the hand; too extend some part of the body, or something held by one, so as to touch, strike, grasp, or the like; as, to reach an object with the hand, or with a spear. O patron power, . . . thy present aid afford, Than I may reach the beast. Dryden. 4. To strike, hit, or tough with a missile; as, to reach an object with an arrow, a bullet, or a shell. 5. Hence, to extend an action, effort, or influence to; to penetrate to; to pierce, or cut, as far as. If these examples of grown men reach not the case of children, let them examine. Locke. 6. To extend to; to stretch out as far as; to touch by virtue of extent; as, his hand reaches the river. Thy desire . . . leads to no excess That reaches blame. Milton. 7. To arrive at by effort of any kind; to attain to; to gain; to be advanced to. The best account of the appearances of nature which human penetration can reach, comes short of its reality. Cheyne. 9. To understand; to comprehend. [Obs.] Do what, sir I reach you not. Beau. & Fl. 10. To overreach; to deceive. [Obs.] South.\n\n1. To stretch out the hand. Goddess humane, reach, then, and freely taste! Milton. 2. To strain after something; to make efforts. Reaching above our nature does no good. Dryden. 3. To extend in dimension, time, amount, action, influence, etc., so as to touch, attain to, or be equal to, something. And behold, a ladder set upon the earth, and the top of it reached to heaven. Gen. xxviii. 12. The new world reaches quite across the torrid zone. Boyle. 4. (Naut.)  To sail on the wind, as from one point of tacking to another, or with the ind nearly abeam. To reach after or at, to make efforts to attain to or obtain. He would be in the mind reaching after a positive idea of infinity. Locke.\n\n1. The act of stretching or extending; extension; power of reaching or touching with the person, or a limb, or something held or thrown; as, the fruit is beyond my reach; to be within reach of cannon shot. 2. The power of stretching out or extending action, influence, or the like; power of attainment or management; extent of force or capacity. Drawn by others who had deeper reaches than themselves to matters which they least intended. Hayward. Be sure yourself and your own reach to know. Pope. 3. Extent; stretch; expanse; hence, application; influence; result; scope. And on the left hand, hell, With long reach, interposed. Milton. I am to pray you not to strain my speech To grosser issues, nor to larger reach Than to suspicion. Shak. 4. An extended portion of land or water; a stretch; a straight portion of a stream or river, as from one turn to another; a level stretch, as between locks in a canal; an arm of the sea extending up into the land. \"The river's wooded reach.\" Tennyson. The coast . . . is very full of creeks and reaches. Holland. 5. An article to obtain an advantage. The Duke of Parma had particular reaches and ends of his own underhand to cross the design. Bacon. 6. The pole or rod which connects the hind axle with the forward bolster of a wagon."}