{"word":"reason","definition":"1. A thought or a consideration offered in support of a determination or an opinion; a just ground for a conclusion or an action; that which is offered or accepted as an explanation; the efficient cause of an occurrence or a phenomenon; a motive for an action or a determination; proof, more or less decisive, for an opinion or a conclusion; principle; efficient cause; final cause; ground of argument. I'll give him reasons for it. Shak. The reason of the motion of the balance in a wheel watch is by the motion of the next wheel. Sir M. Hale. This reason did the ancient fathers render, why the church was called \"catholic.\" Bp. Pearson. Virtue and vice are not arbitrary things; but there is a natural and eternal reason for that goodness and virtue, and against vice and wickedness. Tillotson. 2. The faculty of capacity of the human mind by which it is distinguished from the intelligence of the inferior animals; the higher as distinguished from the lower cognitive faculties, sense, imagination, and memory, and in contrast to the feelings and desires. Reason comprises conception, judgment, reasoning, and the intuitional faculty. Specifically, it is the intuitional faculty, or the faculty of first truths, as distinguished from the understanding, which is called the discursive or ratiocinative faculty. We have no other faculties of perceiving or knowing anything divine or human, but by our five senses and our reason. P. Browne. In common and popular discourse, reason denotes that power by which we distinguish truth from falsehood, and right from wrong, and by which we are enabled to combine means for the attainment of particular ends. Stewart. Reason is used sometimes to express the whole of those powers which elevate man above the brutes, and constitute his rational nature, more especially, perhaps, his intellectual powers; sometimes to express the power of deduction or argumentation. Stewart. By the pure reason I mean the power by which we become possessed of principles. Coleridge. The sense perceives; the understanding, in its own peculiar operation, conceives; the reason, or rationalized understanding, comprehends. Coleridge. 3. Due exercise of the reasoning faculty; accordance with, or that which is accordant with and ratified by, the mind rightly exercised; right intellectual judgment; clear and fair deductions from true principles; that which is dictated or supported by the common sense of mankind; right conduct; right; propriety; justice. I was promised, on a time, To have reason for my rhyme. Spenser. But law in a free nation hath been ever public reason; the enacted reason of a parliament, which he denying to enact, denies to govern us by that which ought to be our law; interposing his own private reason, which to us is no law. Milton. The most probable way of bringing France to reason would be by the making an attempt on the Spanish West Indies. Addison. 4. (Math.)  Ratio; proportion. [Obs.] Barrow. By reason of, by means of; on account of; because of. \"Spain is thin sown of people, partly by reason of the sterility of the soil.\" Bacon. In reason, In all reason, in justice; with rational ground; in a right view. When anything is proved by as good arguments as a thing of that kind is capable of, we ought not, in reason, to doubt of its existence. Tillotson. -- It is reason, it is reasonable; it is right. [Obs.] Yet it were great reason, that those that have children should have greatest care of future times. Bacon. Syn. -- Motive; argument; ground; consideration; principle; sake; account; object; purpose; design. See Motive, Sense.\n\n1. To exercise the rational faculty; to deduce inferences from premises; to perform the process of deduction or of induction; to ratiocinate; to reach conclusions by a systematic comparison of facts. 2. Hence: To carry on a process of deduction or of induction, in order to convince or to confute; to formulate and set forth propositions and the inferences from them; to argue. Stand still, that I may reason with you, before the Lord, of all the righteous acts of the Lord. 1 Sam. xii. 7. 3. To converse; to compare opinions. Shak.\n\n1. To arrange and present the reasons for or against; to examine or discuss by arguments; to debate or discuss; as, I reasoned the matter with my friend. When they are clearly discovered, well digested, and well reasoned in every part, there is beauty in such a theory. T. Burnet. 2. To support with reasons, as a request. [R.] Shak. 3. To persuade by reasoning or argument; as, to reason one into a belief; to reason one out of his plan. Men that will not be reasoned into their senses. L'Estrange. 4. To overcome or conquer by adducing reasons; -- with down; as, to reason down a passion. 5. To find by logical process; to explain or justify by reason or argument; -- usually with out; as, to reason out the causes of the librations of the moon."}