{"word":"receive","definition":"1. To take, as something that is offered, given, committed, sent, paid, or the like; to accept; as, to receive money offered in payment of a debt; to receive a gift, a message, or a letter. Receyven all in gree that God us sent. Chaucer. 2. Hence: To gain the knowledge of; to take into the mind by assent to; to give admission to; to accept, as an opinion, notion, etc.; to embrace. Our hearts receive your warnings. Shak. The idea of solidity we receives by our touch. Locke. 3. To allow, as a custom, tradition, or the like; to give credence or acceptance to. Many other things there be which they have received to hold, as the washing of cups, and pots. Mark vii. 4. 4. To give admittance to; to permit to enter, as into one's house, presence, company, and the like; as, to receive a lodger, visitor, ambassador, messenger, etc. They kindled a fire, and received us every one. Acts xxviii. 2. 5. To admit; to take in; to hold; to contain; to have capacity fro; to be able to take in. The brazen altar that was before the Lord was too little to receive the burnt offerings. 1 Kings viii. 64. 6. To be affected by something; to suffer; to be subjected to; as, to receive pleasure or pain; to receive a wound or a blow; to receive damage. Against his will he can receive no harm. Milton. 7. To take from a thief, as goods known to be stolen. 8. (Lawn Tennis)  To bat back (the ball) when served. Receiving ship, one on board of which newly recruited sailors are received, and kept till drafted for service. Syn. -- To accept; take; allow; hold; retain; admit. -- Receive, Accept. To receive describes simply the act of taking. To accept denotes the taking with approval, or for the purposes for which a thing is offered. Thus, we receive a letter when it comes to hand; we receive news when it reaches us; we accept a present when it is offered; we accept an invitation to dine with a friend. Who, if we knew What we receive, would either not accept Life offered, or soon beg to lay it down. Milton.\n\n1. To receive visitors; to be at home to receive calls; as, she receives on Tuesdays. 2. (Lawn Tennis)  To return, or bat back, the ball when served; as, it is your turn to receive."}