{"word":"reciprocal","definition":"1. Recurring in vicissitude; alternate. 2. Done by each to the other; interchanging or interchanged; given and received; due from each to each; mutual; as, reciprocal love; reciprocal duties. Let our reciprocal vows be remembered. Shak. 3. Mutually interchangeable. These two rules will render a definition reciprocal with the thing defined. I. Watts. 4. (Gram.)  Reflexive; -- applied to pronouns and verbs, but sometimes limited to such pronouns as express mutual action. 5. (Math.)  Used to denote different kinds of mutual relation; often with reference to the substitution of reciprocals for given quantities. See the Phrases below. Reciprocal equation (Math.), one which remains unchanged in form when the reciprocal of the unknown quantity is substituted for that quantity. -- Reciprocal figures (Geom.), two figures of the same kind (as triangles, parallelograms, prisms, etc.), so related that two sides of the one form the extremes of a proportion of which the means are the two corresponding sides of the other; in general, two figures so related that the first corresponds in some special way to the second, and the second corresponds in the same way to the first. -- Reciprocal proportion (Math.), a proportion such that, of four terms taken in order, the first has to the second the same ratio which the fourth has to the third, or the first has to the second the same ratio which the reciprocal of the third has to the reciprocal of the fourth. Thus, 2:5: :20:8 form a reciprocal proportion, because 2:5: :1/20:1/8. -- Reciprocal quantities (Math.), any two quantities which produce unity when multiplied together. -- Reciprocal ratio (Math.), the ratio between the reciprocals of two quantities; as, the reciprocal ratio of 4 to 9 is that of ¼ to 1/9. -- Reciprocal terms (Logic), those terms which have the same signification, and, consequently, are convertible, and may be used for each other. Syn. -- Mutual; alternate. -- Reciprocal, Mutual. The distinctive idea of mutual is, that the parties unite by interchange in the same act; as, a mutual covenant; mutual affection, etc. The distinctive idea of reciprocal is, that one party acts by way of return or response to something previously done by the other party; as, a reciprocal kindness; reciprocal reproaches, etc. Love is reciprocal when the previous affection of one party has drawn forth the attachment of the other. To make it mutual in the strictest sense, the two parties should have fallen in love at the same time; but as the result is the same, the two words are here used interchangeably. The ebbing and flowing of the tide is a case where the action is reciprocal, but not mutual.\n\n1. That which is reciprocal to another thing. Corruption is a reciprocal to generation. Bacon. 2. (Arith. & Alg.)  The quotient arising from dividing unity by any quantity; thus ¼ is the reciprocal of 4; 1/(a + b) is the reciprocal of a + b. The reciprocal of a fraction is the fraction inverted, or the denominator divided by the numerator."}