{"word":"record","definition":"1. To recall to mind; to recollect; to remember; to meditate. [Obs.] \"I it you record.\" Chaucer. 2. To repeat; to recite; to sing or play. [Obs.] They longed to see the day, to hear the lark Record her hymns, and chant her carols blest. Fairfax. 3. To preserve the memory of, by committing to writing, to printing, to inscription, or the like; to make note of; to write or enter in a book or on parchment, for the purpose of preserving authentic evidence of; to register; to enroll; as, to record the proceedings of a court; to record historical events. Those things that are recorded of him . . . are written in the chronicles of the kings. 1 Esd. i. 42. To record a deed, mortgage, lease, etc., to have a copy of the same entered in the records of the office designated by law, for the information of the public.\n\n1. To reflect; to ponder. [Obs.] Praying all the way, and recording upon the words which he before had read. Fuller. 2. To sing or repeat a tune. [Obs.] Shak. Whether the birds or she recorded best. W. Browne.\n\n1. A writing by which same act or event, or a number of acts or events, is recorded; a register; as, a record of the acts of the Hebrew kings; a record of the variations of temperature during a certain time; a family record. 2. Especially: (a) An official contemporaneous writing by which the acts of some public body, or public officer, are recorded; as, a record of city ordinances; the records of the receiver of taxes. (b) An authentic official copy of a document which has been entered in a book, or deposited in the keeping of some officer designated by law. (c) An official contemporaneous memorandum stating the proceedings of a court of justice; a judicial record. (d) The various legal papers used in a case, together with memoranda of the proceedings of the court; as, it is not permissible to allege facts not in the record. 3. Testimony; witness; attestation. John bare record, saying. John i. 32 . 4. That which serves to perpetuate a knowledge of acts or events; a monument; a memorial. 5. That which has been, or might be, recorded; the known facts in the course, progress, or duration of anything, as in the life of a public man; as, a politician with a good or a bad record. 6. That which has been publicly achieved in any kind of competitive sport as recorded in some authoritative manner, as the time made by a winning horse in a race. Court of record (pron. rin Eng.), a court whose acts and judicial proceedings are written on parchment or in books for a perpetual memorial. -- Debt of record, a debt which appears to be due by the evidence of a court of record, as upon a judgment or a cognizance. -- Trial by record, a trial which is had when a matter of record is pleaded, and the opposite party pleads that there is no such record. In this case the trial is by inspection of the record itself, no other evidence being admissible. Blackstone. -- To beat, or break, the record (Sporting), to surpass any performance of like kind as authoritatively recorded; as, to break the record in a walking match."}