{"word":"red","definition":". imp. & p. p. of Read. Spenser.\n\nTo put on order; to make tidy; also, to free from entanglement or embarrassement; -- generally with up; as, to red up a house. [Prov. Eng. & Scot.]\n\nOf the color of blood, or of a tint resembling that color; of the hue of that part of the rainbow, or of the solar spectrum, which is furthest from the violet part. \"Fresh flowers, white and reede.\" Chaucer. Your color, I warrant you, is as red as any rose. Shak. Note: Red is a general term, including many different shades or hues, as scarlet, crimson, vermilion, orange red, and the like. Note: Red is often used in the formation of self-explaining compounds; as, red-breasted, red-cheeked, red-faced, red-haired, red- headed, red-skinned, red-tailed, red-topped, red-whiskered, red- coasted. Red admiral (Zoöl.), a beautiful butterfly (Vanessa Atalanta) common in both Europe and America. The front wings are crossed by a broad orange red band. The larva feeds on nettles. Called also Atlanta butterfly, and nettle butterfly. -- Red ant. (Zoöl.) (a) A very small ant (Myrmica molesta) which often infests houses. (b) A larger reddish ant (Formica sanquinea), native of Europe and America. It is one of the slave-making species. -- Red antimony (Min.), kermesite. See Kermes mineral (b), under Kermes. -- Red ash (Bot.), an American tree (Fraxinus pubescens), smaller than the white ash, and less valuable for timber. Cray. -- Red bass. (Zoöl.) See Redfish (d). -- Red bay (Bot.), a tree (Persea Caroliniensis) having the heartwood red, found in swamps in the Southern United States. -- Red beard (Zoöl.), a bright red sponge (Microciona prolifera), common on oyster shells and stones. [Local, U.S.] -- Red birch (Bot.), a species of birch (Betula nigra) having reddish brown bark, and compact, light-colored wood. Gray. -- Red blindness. (Med.) See Daltonism. -- Red book, a book containing the names of all the persons in the service of the state. [Eng.] -- Red book of the Exchequer, an ancient record in which are registered the names of all that held lands per baroniam in the time of Henry II. Brande & C. -- Red brass, an alloy containing eight parts of copper and three of zinc. -- Red bug. (Zoöl.) (a) A very small mite which in Florida attacks man, and produces great irritation by its bites. (b) A red hemipterous insect of the genus Pyrrhocoris, especially the European species (P. apterus), which is bright scarlet and lives in clusters on tree trunks. (c) See Cotton stainder, under Cotton. -- Red cedar. (Bot.) An evergreen North American tree (Juniperus Virginiana) having a fragrant red-colored heartwood. (b) A tree of India and Australia (Cedrela Toona) having fragrant reddish wood; -- called also toon tree in India. -- Red chalk. See under Chalk. -- Red copper (Min.), red oxide of copper; cuprite. -- Red coral (Zoöl.), the precious coral (Corallium rubrum). See Illusts. of Coral and Gorgonlacea. -- Red cross. The cross of St. George, the national emblem of the English. (b) The Geneva cross. See Geneva convention, and Geneva cross, under Geneva. -- Red currant. (Bot.) See Currant. -- Red deer. (Zoöl.) (a) The common stag (Cervus elaphus), native of the forests of the temperate parts of Europe and Asia. It is very similar to the American elk, or wapiti. (b) The Virginia deer. See Deer. -- Red duck (Zoöl.), a European reddish brown duck (Fuligula nyroca); -- called also ferruginous duck. -- Red ebony. (Bot.) See Grenadillo. -- Red empress (Zoöl.), a butterfly. See Tortoise shell. -- Red fir (Bot.), a coniferous tree (Pseudotsuga Douglasii) found from British Columbia to Texas, and highly valued for its durable timber. The name is sometimes given to other coniferous trees, as the Norway spruce and the American Abies magnifica and A. nobilis. -- Red fire. (Pyrotech.) See Blue fire, under Fire. -- Red flag. See under Flag. -- Red fox (Zoöl.), the common American fox (Vulpes fulvus), which is usually reddish in color. -- Red grouse (Zoöl.), the Scotch grouse, or ptarmigan. See under Ptarmigan. -- Red gum, or Red gum-tree (Bot.), a name given to eight Australian species of Eucalyptus (Eucalyptus amygdalina, resinifera, etc.) which yield a reddish gum resin. See Eucalyptus. -- Red hand (Her.), a left hand appaumé, fingers erect, borne on an escutcheon, being the mark of a baronet of the United Kingdom of Great Britain and Ireland; -- called also Badge of Ulster. -- Red herring, the common herring dried and smoked. -- Red horse. (Zoöl.) (a) Any large American red fresh-water sucker, especially Moxostoma macrolepidotum and allied species. (b) See the Note under Drumfish. -- Red lead. (Chem) See under Lead, and Minium. -- Red-lead ore. (Min.) Same as Crocoite. -- Red liquor (Dyeing), a solution consisting essentially of aluminium acetate, used as a mordant in the fixation of dyestuffs on vegetable fiber; -- so called because used originally for red dyestuffs. Called also red mordant. -- Red maggot (Zoöl.), the larva of the wheat midge. -- Red manganese. (Min.) Same as Rhodochrosite. -- Red man, one of the American Indians; -- so called from his color. -- Red maple (Bot.), a species of maple (Acer rubrum). See Maple. -- Red mite. (Zoöl.) See Red spider, below. -- Red mulberry (Bot.), an American mulberry of a dark purple color (Morus rubra). -- Red mullet (Zoöl.), the surmullet. See Mullet. -- Red ocher (Min.), a soft earthy variety of hematite, of a reddish color. -- Red perch (Zoöl.), the rosefish. -- Red phosphorus. (Chem.) See under Phosphorus. -- Red pine (Bot.), an American species of pine (Pinus resinosa); -- so named from its reddish bark. -- Red precipitate. See under Precipitate. -- Red Republican (European Politics), originally, one who maintained extreme republican doctrines in France, -- because a red liberty cap was the badge of the party; an extreme radical in social reform. [Cant] -- Red ribbon, the ribbon of the Order of the Bath in England. -- Red sanders. (Bot.) See Sanders. -- Red sandstone. (Geol.) See under Sandstone. -- Red scale (Zoöl.), a scale insect (Aspidiotus aurantii) very injurious to the orange tree in California and Australia. -- Red silver (Min.), an ore of silver, of a ruby-red or reddish black color. It includes proustite, or light red silver, and pyrargyrite, or dark red silver. -- Red snapper (Zoöl.), a large fish (Lutlanus aya or Blackfordii) abundant in the Gulf of Mexico and about the Florida reefs. -- Red snow, snow colored by a mocroscopic unicellular alga (Protococcus nivalis) which produces large patches of scarlet on the snows of arctic or mountainous regions. -- Red softening (Med.) a form of cerebral softening in which the affected parts are red, -- a condition due either to infarction or inflammation. -- Red spider (Zoöl.), a very small web-spinning mite (Tetranychus telarius) which infests, and often destroys, plants of various kinds, especially those cultivated in houses and conservatories. It feeds mostly on the under side of the leaves, and causes them to turn yellow and die. The adult insects are usually pale red. Called also red mite. -- Red squirrel (Zoöl.), the chickaree. -- Red tape, the tape used in public offices for tying up documents, etc.; hence, official formality and delay. -- Red underwing (Zoöl.), any species of noctuid moths belonging to Catacola and allied genera. The numerous species are mostly large and handsomely colored. The under wings are commonly banded with bright red or orange. -- Red water, a disease in cattle, so called from an appearance like blood in the urine.\n\n1. The color of blood, or of that part of the spectrum farthest from violet, or a tint resembling these. \"Celestial rosy red, love's proper hue.\" Milton. 2. A red pigment. 3. (European Politics)  An abbreviation for Red Republican. See under Red, a. [Cant] 4. pl. (Med.)  The menses. Dunglison. English red, a pigment prepared by the Dutch, similar to Indian red. -- Hypericum red, a red resinous dyestuff extracted from Hypericum. -- Indian red. See under Indian, and Almagra."}