{"word":"reed","definition":"Red. [Obs.] Chaucer.\n\nSame as Rede. [Obs.] Chaucer.\n\nThe fourth stomach of a ruminant; rennet. [Prov. Eng. or Scot.]\n\n1. (Bot.)  A name given to many tall and coarse grasses or grasslike plants, and their slender, often jointed, stems, such as the various kinds of bamboo, and especially the common reed of Europe and North America (Phragmites communis). 2. A musical instrument made of the hollow joint of some plant; a rustic or pastoral pipe. Arcadian pipe, the pastoral reed Of Hermes. Milton. 3. An arrow, as made of a reed. Prior. 4. Straw prepared for thatching a roof. [Prov. Eng.] 5. (Mus.) (a) A small piece of cane or wood attached to the mouthpiece of certain instruments, and set in vibration by the breath. In the clarinet it is a single fiat reed; in the oboe and bassoon it is double, forming a compressed tube. (b) One of the thin pieces of metal, the vibration of which produce the tones of a melodeon, accordeon, harmonium, or seraphine; also attached to certain sets or registers of pipes in an organ. 6. (Weaving)  A frame having parallel flat stripe of metal or reed, between which the warp threads pass, set in the swinging lathe or batten of a loom for beating up the weft; a sley. See Batten. 7. (Mining)  A tube containing the train of powder for igniting the charge in blasting. 8. (Arch.)  Same as Reeding. Egyptian reed (Bot.), the papyrus. -- Free reed (Mus.), a reed whose edges do not overlap the wind passage, -- used in the harmonium, concertina, etc. It is distinguished from the beating or striking reed of the organ and clarinet. -- Meadow reed grass (Bot.), the Glyceria aquatica, a tall grass found in wet places. -- Reed babbler. See Reedbird. -- Reed bunting (Zoöl.) A European sparrow (Emberiza schoeniclus) which frequents marshy places; -- called also reed sparrow, ring bunting. (b) Reedling. -- Reed canary grass (Bot.), a tall wild grass (Phalaris arundinacea). -- Reed grass. (Bot.) (a) The common reed. See Reed, 1. (b) A plant of the genus Sparganium; bur reed. See under Bur. -- Reed organ (Mus.), an organ in which the wind acts on a set of free reeds, as the harmonium, melodeon, concertina, etc. -- Reed pipe (Mus.), a pipe of an organ furnished with a reed. -- Reed sparrow. (Zoöl.) See Reed bunting, above. -- Reed stop (Mus.), a set of pipes in an organ furnished with reeds. -- Reed warbler. (Zoöl.) (a) A small European warbler (Acrocephalus streperus); -- called also reed wren. (b) Any one of several species of Indian and Australian warblers of the genera Acrocephalus, Calamoherpe, and Arundinax. They are excellent singers. -- Sea-sand reed (Bot.), a kind of coarse grass (Ammophila arundinacea). See Beach grass, under Beach. -- Wood reed grass (Bot.), a tall, elegant grass (Cinna arundinacea), common in moist woods."}