{"word":"refer","definition":"1. To carry or send back. [Obs.] Chaucer. 2. Hence: To send or direct away; to send or direct elsewhere, as for treatment, aid, infirmation, decision, etc.; to make over, or pass over, to another; as, to refer a student to an author; to refer a beggar to an officer; to refer a bill to a committee; a court refers a matter of fact to a commissioner for investigation, or refers a question of law to a superior tribunal. 3. To place in or under by a mental or rational process; to assign to, as a class, a cause, source, a motive, reason, or ground of explanation; as, he referred the phenomena to electrical disturbances. To refer one's self, to have recourse; to betake one's self; to make application; to appeal. [Obs.] I'll refer me to all things sense. Shak.\n\n1. To have recourse; to apply; to appeal; to betake one's self; as, to refer to a dictionary. In suits . . . it is to refer to some friend of trust. Bacon. 2. To have relation or reference; to relate; to point; as, the figure refers to a footnote. Of those places that refer to the shutting and opening the abyss, I take notice of that in Job. Bp. Burnet. 3. To carry the mind or throught; to direct attention; as, the preacher referrd to the late election. 4. To direct inquiry for information or a quarantes of any kind, as in respect to one's integrity, capacity, pecuniary ability, and the like; as, I referred to his employer for the truth of his story. Syn. -- To allude; advert; suggest; appeal. Refer, Allude, Advert. We refer to a thing by specifically and distinctly introducing it into our discourse. We allude to it by introducing it indirectly or indefinitely, as by something collaterally allied to it. We advert to it by turning off somewhat abruptly to consider it more at large. Thus, Macaulay refers to the early condition of England at the opening of his history; he alludes to these statements from time to time; and adverts, in the progress of his work, to various circumstances of pecullar interest, on which for a time he dwells. \"But to do good is . . . that that Solomon chiefly refers to in the text.\" Sharp. \"This, I doubt not, was that artificial structure here alluded to.\" T. Burnet. Now to the universal whole advert: The earth regard as of that whole a part. Blackmore."}