{"word":"regard","definition":"1. To keep in view; to behold; to look at; to view; to gaze upon. Your niece regards me with an eye of favor. Shak. 2. Hence, to look or front toward; to face. [Obs.] It is peninsula which regardeth the mainland. Sandys. That exceedingly beatiful seat, on the assregarding the river. Evelyn. 3. To look closely at; to observe attentively; to pay attention to; to notice or remark particularly. If much you note him, You offened him; . . . feed, and regard him not. Shak. 4. To look upon, as in a certain relation; to hold as an popinion; to consider; as, to regard abstinence from wine as a duty; to regard another as a friend or enemy. 5. To consider and treat; to have a certain feeling toward; as, to regard one with favor or dislike. His associates seem to have regarded him with kindness. Macaulay. 6. To pay respect to; to treat as something of peculiar value, sanctity, or the like; to care for; to esteem. He that regardeth thae day, regardeth it into the LOrd. Rom. xiv. 6. Here's Beaufort, that regards nor God nor king. Shak. 7. To take into consideration; to take account of, as a fact or condition. \"Nether regarding that she is my child, nor fearing me as if II were her father.\" Shak. 8. To have relation to, as bearing upon; to respect; to relate to; to touch; as, an argument does not regard the question; -- often used impersonally; as, I agree with you as regards this or that. Syn. -- To consider; observe; remark; heed; mind; respect; esteem; estimate; value. See Attend.\n\nTo look attentively; to consider; to notice. [Obs.] Shak.\n\n1. A look; aspect directed to another; view; gaze. But her, with stern regard, he thus repelled. Milton. 2. Attention of the mind with a feeling of interest; observation; heed; notice. Full many a lady I have eyed with best regard. Shak. 3. That view of the mind which springs from perception of value, estimable qualities, or anything that excites admiration; respect; esteem; reverence; affection; as, to have a high regard for a person; -- often in the plural. He has rendered himself worthy of their most favorable regards. A. Smith. Save the long-sought regards of woman, nothing is sweeter than those marks of childish preference. Hawthorne. 4. State of being regarded, whether favorably or otherwise; estimation; repute; note; account. A man of meanest regard amongst them, neither having wealth or power. Spenser. 5. Consideration; thought; reflection; heed. Sad pause and deep regard become the sage. Shak. 6. Matter for conssideration; account; condition. [Obs.] \"Reason full of good regard.\" Shak. 7. Respect; relation; reference. Persuade them to pursue and persevere in virtue, with regard to themselves; in justice and goodness with regard to their neighbors; and piefy toward God. I. Watts. Note: The phrase in regard of was formerly used as equivalent in meaning to on account of, but in modern usage is often improperly substituted for in respect to, or in regard to. G. P. Marsh. Change was thought necessary in regard of the injury the church did receive by a number of things then in use. Hooker. In regard of its security, it had a great advantage over the bandboxes. Dickens. 8. Object of sight; scene; view; aspect. [R.] Throw out our eyes for brave Othello, Even till we make the main and the aërial blue An indistinct regard. Shak. 9. (O.Eng.Law)  Supervision; inspection. At regard of, in consideration of; in comparison with. [Obs.] \"Bodily penance is but short and little at regard of the pains of hell.\" Chaucer. -- Court of regard, a forest court formerly held in England every third year for the lawing, or expeditation, of dogs, to prevent them from running after deer; -- called also survey of dogs. Blackstone. Syn. -- Respect; consideration; notice; observance; heed; care; concern; estimation; esteem; attachment; reverence."}