{"word":"religion","definition":"1. The outward act or form by which men indicate their recognition of the existence of a god or of gods having power over their destiny, to whom obedience, service, and honor are due; the feeling or expression of human love, fear, or awe of some superhuman and overruling power, whether by profession of belief, by observance of rites and ceremonies, or by the conduct of life; a system of faith and worship; a manifestation of piety; as, ethical religions; monotheistic religions; natural religion; revealed religion; the religion of the Jews; the religion of idol worshipers. An orderly life so far as others are able to observe us is now and then produced by prudential motives or by dint of habit; but without seriousness there can be no religious principle at the bottom, no course of conduct from religious motives; in a word, there can be no religion. Paley. Religion [was] not, as too often now, used as equivalent for godliness; but . . . it expressed the outer form and embodiment which the inward spirit of a true or a false devotion assumed. Trench. Religions, by which are meant the modes of sdivine worship proper to different tribes, nations, or communities, and based on the belief held in common by the members of them severally . . . There is no living religion without something like a doctrine. On the other hand, a doctrine, however elaborate, does not constitute a religion. C. P. Tiele (Encyc. Brit. ). Religion . . . means the conscious relation between man and God, and the expression of that relation in human conduct. J. Köstlin (Schaff- Herzog Encyc. ) After the most straitest sect of our religion I lived a Pharisce. Acts xxvi. 5. The image of a brute, adorned With gay religions full of pomp and gold. Milton. 2. Specifically, conformity in faith and life to the precepts inculcated in the Bible, respecting the conduct of life and duty toward God and man; the Christian faith and practice. Let us with caution indulge the supposition that morality can be maintained without religion. Washington. Religion will attend you . . . as pleasant and useful companion in every proper place, and every temperate occupation of life. Buckminster. 3. (R.C.CH.)  A monastic or religious order subject to a regulated mode of life; the religious state; as, to enter religion. Trench. A good man was there of religion. Chaucer. 4. Strictness of fidelity in conforming to any practice, as if it were an enjoined rule of conduct. [R.] Those parts of pleading which in ancient times might perhaps be material, but at this time are become only mere styles and forms, are still continued with much religion. Sir M. Hale. Note: Religion, as distinguished from theology, is subjective, designating the feelings and acts of men which relate to God; while theology is objective, and denotes those ideas which man entertains respecting the God whom he worships, especially his systematized views of God. As distinguished from morality, religion denotes the influences and motives to human duty which are found in the character and will of God, while morality describes the duties to man, to which true religion always influences. As distinguished from piety, religion is a high sense of moral obligation and spirit of reverence or worship which affect the heart of man with respect to the Deity, while piety, which first expressed the feelings of a child toward a parent, is used for that filial sentiment of veneration and love which we owe to the Father of all. As distinguished from sanciti, religion is the means by which sanctity is achieved, sanctity denoting primarily that purity of heart and life which results from habitual communion with God, and a sense of his continual presence. Natural religion, a religion based upon the evidences of a God and his qualities, which is supplied by natural phenomena. See Natural theology, under Natural. -- Religion of humanity, a name sometimes given to a religion founded upon positivism as a philosophical basis. -- Revealed religion, that which is based upon direct communication of God's will to mankind; especially, the Christian religion, based on the revelations recorded in the Old and New Testaments."}