{"word":"representative","definition":"1. Fitted to represent; exhibiting a similitude. 2. Bearing the character or power of another; acting for another or others; as, a council representative of the people. Swift. 3. Conducted by persons chosen to represent, or act as deputies for, the people; as, a representative government. 4. (Nat.Hist.) (a) Serving or fitted to present the full characters of the type of a group; typical; as, a representative genus in a family. (b) Similar in general appearance, structure, and habits, but living in different regions; -- said of certain species and varieties. 5. (Metaph.)  Giving, or existing as, a transcript of what was originally presentative knowledge; as, representative faculties; representative knowledge. See Presentative, 3 and Represent, 8.\n\n1. One who, or that which, represents (anything); that which exhibits a likeness or similitude. A statute of Rumor, whispering an idiot in the ear, who was the representative of Credulity. Addison. Difficulty must cumber this doctrine which supposes that the perfections of God are the representatives to us of whatever we perceive in the creatures. Locke. 2. An agent, deputy, or substitute, who supplies the place of another, or others, being invested with his or their authority. 3. (Law)  One who represents, or stands in the place of, another. Note: The executor or administrator is ordinarily held to be the representative of a deceased person, and is sometimes called the legal representative, or the personal representative. The heir is sometimes called the real representative of his deceased ancestor. The heirs and executors or administrators of a deceased person are sometimes compendiously described as his real and personal representatives. Wharton. Burrill. 4. A member of the lower or popular house in a State legislature, or in the national Congress. [U.S.] 5. (Nat.Hist.) (a) That which presents the full character of the type of a group. (b) A species or variety which, in any region, takes the place of a similar one in another region."}