{"word":"resolve","definition":"1. To separate the component parts of; to reduce to the constituent elements; -- said of compound substances; hence, sometimes, to melt, or dissolve. O, that this too too solid flesh would melt, Thaw, and resolve itself into a dew! Shak. Ye immortal souls, who once were men, And now resolved to elements again. Dryden. 2. To reduce to simple or intelligible notions; -- said of complex ideas or obscure questions; to make clear or certain; to free from doubt; to disentangle; to unravel; to explain; hence, to clear up, or dispel, as doubt; as, to resolve a riddle. \"Resolve my doubt.\" Shak. To the resolving whereof we must first know that the Jews were commanded to divorce an unbelieving Gentile. Milton. 3. To cause to perceive or understand; to acquaint; to inform; to convince; to assure; to make certain. Sir, be resolved. I must and will come. Beau & Fl. Resolve me, Reason, which of these is worse, Want with a full, or with an empty purse Pope. In health, good air, pleasure, riches, I am resolved it can not be equaled by any region. Sir W. Raleigh. We must be resolved how the law can be pure and perspicuous, and yet throw a polluted skirt over these Eleusinian mysteries. Milton. 4. To determine or decide in purpose; to make ready in mind; to fix; to settle; as, he was resolved by an unexpected event. 5. To express, as an opinion or determination, by resolution and vote; to declare or decide by a formal vote; -- followed by a clause; as, the house resolved (or, it was resolved by the house) that no money should be apropriated (or, to appropriate no money). 6. To change or convert by resolution or formal vote; -- used only reflexively; as, the house resolved itself into a committee of the whole. 7. (Math.)  To solve, as a problem, by enumerating the several things to be done, in order to obtain what is required; to find the answer to, or the result of. Hutton. 8. (Med.)  To dispere or scatter; to discuss, as an inflammation or a tumor. 9. (Mus.)  To let the tones (as of a discord) follow their several tendencies, resulting in a concord. 10. To relax; to lay at ease. [Obs.] B. Jonson. To resolve a nebula.(Astron.) See Resolution of a nebula, under Resolution. Syn. -- To solve; analyze; unravel; disentangle.\n\n1. To be separated into its component parts or distinct principles; to undergo resolution. 2. To melt; to dissolve; to become fluid. When the blood stagnates in any part, it first coagulates, then resolves, and turns alkaline. Arbuthhnot. 3. To be settled in opinion; to be convinced. [R.] Let men resolve of that as they plaease. Locke. 4. To form a purpose; to make a decision; especially, to determine after reflection; as, to resolve on a better course of life. Syn. -- To determine; decide; conclude; purpose.\n\n1. The act of resolving or making clear; resolution; solution. \"To give a full resolve of that which is so much controverted.\" Milton. 2. That which has been resolved on or determined; decisive conclusion; fixed purpose; determination; also, legal or official determination; a legislative declaration; a resolution. Nor is your firm resolve unknown. Shak. Cæsar's approach has summoned us together, And Rome attends her fate from our resolves. Addison."}