{"word":"respect","definition":"1. To take notice of; to regard with special attention; to regard as worthy of special consideration; hence, to care for; to heed. Thou respectest not spilling Edward's blood. Shak. In orchards and gardens, we do not so much respect beauty as variety of ground for fruits, trees, and herbs. Bacon. 2. To consider worthy of esteem; to regard with honor. \"I do respect thee as my soul.\" Shak. 3. To look toward; to front upon or toward. [Obs.] Palladius adviseth the front of his house should so respect the Sir T. Browne. 4. To regard; to consider; to deem. [Obs.] To whom my father gave this name of Gaspar, And as his own respected him to death. B. Jonson. 5. To have regard to; to have reference to; to relateto; as, the treaty particularly respects our commerce. As respects, as regards; with regard to; as to. Macaulay. -- To respect the person or persons, to favor a person, or persons on corrupt grounds; to show partiality. \"Ye shall not respect persons in judgment.\" Deut. i. 17. Syn. -- To regard; esteem; honor; revere; venerate.\n\n1. The act of noticing with attention; the giving particular consideration to; hence, care; caution. But he it well did ward with wise respect. Spenser. 2. Esteem; regard; consideration; honor. Seen without awe, and served without respect. Prior. The same men treat the Lord's Day with as little respect. R. Nelson. 3. pl.  An expression of respect of deference; regards; as, to send one's respects to another. 4. Reputation; repute. [Obs.] Many of the best respect in Rome. Shak. 5. Relation; reference; regard. They believed but one Supreme Deity, which, with respect to the various benefits men received from him, had several titles. Tillotson. 4. Particular; point regarded; point of view; as, in this respect; in any respect; in all respects. Everything which is imperfect, as the world must be acknowledged in many respects. Tillotson. In one respect I'll be thy assistant. Shak. 7. Consideration; motive; interest. [Obs.] \"Whatever secret respects were likely to move them.\" Hooker. To the publik good Private respects must yield. Milton. In respect, in comparison. [Obs.] Shak. -- In respect of. (a) In comparison with. [Obs.] Shak. (b) As to; in regard to. [Archaic] \"Monsters in respect of their bodies.\" Bp. Wilkins. \"In respect of these matters.\" Jowett. (Thucyd. ) -- In, or With, respect to, in relation to; with regard to; as respects. Tillotson. -- To have respect of persons, to regard persons with partiality or undue bias, especially on account of friendship, power, wealth, etc. \"It is not good to have respect of persons in judgment.\" Prov. xxiv. 23. Syn. -- Deference; attention; regard; consideration; estimation. See Deference."}