{"word":"rest","definition":"To arrest. [Obs.]\n\n1. A state of quiet or repose; a cessation from motion or labor; tranquillity; as, rest from mental exertion; rest of body or mind. Chaucer. Sleep give thee all his rest! Shak. 2. Hence, freedom from everything which wearies or disturbs; peace; security. And the land had rest fourscore years. Judges iii. 30. 3. Sleep; slumber; hence, poetically, death. How sleep the brave who sink to rest, By all their country's wishes blest. Collins. 4. That on which anything rests or leans for support; as, a rest in a lathe, for supporting the cutting tool or steadying the work. He made narrowed rests round about, that the beams should not be fastened in the walls of the house. 1 Kings vi. 6. 5. (Anc. Armor)  A projection from the right side of the cuirass, serving to support the lance. Their visors closed, their lances in the rest. Dryden. 6. A place where one may rest, either temporarily, as in an inn, or permanently, as, in an abode. \"Halfway houses and travelers' rests.\" J. H. Newman. In dust our final rest, and native home. Milton. Ye are not as yet come to the rest and to the inheritance which the Lord your God giveth you. Deut. xii. 9. 7. (Pros.)  A short pause in reading verse; a cæsura. 8. The striking of a balance at regular intervals in a running account. \"An account is said to be taken with annual or semiannual rests.\" Abbott. 9. A set or game at tennis. [Obs.] 10. (Mus.)  Silence in music or in one of its parts; the name of the character that stands for such silence. They are named as notes are, whole, half, quarter,etc. Rest house, an empty house for the accomodation of travelers; a caravansary. [India] -- To set, or To set up, one's rest, to have a settled determination; -- from an old game of cards, when one so expressed his intention to stand or rest upon his hand. [Obs.] Shak. Bacon. Syn. -- Cessation; pause; intermission; stop; stay; repose; slumber; quiet; ease; quietness; stillness; tranquillity; peacefulness; pease. -- Rest, Repose. Rest is a ceasing from labor or exertion; repose is a mode of resting which gives relief and refreshment after toil and labor. The words are commonly interchangeable.\n\n1. To cease from action or motion, especially from action which has caused weariness; to desist from labor or exertion. God . . . rested on the seventh day from all his work which he had made. Gen. ii. 2. Six days thou shalt do thy work, and on the seventh day thou shalt rest. Ex. xxiii. 12. 2. To be free from whanever wearies or disturbs; to be quiet or still. There rest, if any rest can harbor there. Milton. 3. To lie; to repose; to recline; to lan; as, to rest on a couch. 4. To stand firm; to be fixed; to be supported; as, a column rests on its pedestal. 5. To sleep; to slumber; hence, poetically, to be dead. Fancy . . . then retries Into her private cell when Nature rests. Milton. 6. To lean in confidence; to trust; to rely; to repose without anxiety; as, to rest on a man's promise. On him I rested, after long debate, And not without considering, fixed Dryden. 7. To be satisfied; to acquiesce. To rest in Heaven's determination. Addison. To rest with, to be in the power of; to depend upon; as, it rests with him to decide.\n\n1. To lay or place at rest; to quiet. Your piety has paid All needful rites, to rest my wandering shade. Dryden. 2. To place, as on a support; to cause to lean. Her weary head upon your bosom rest. Waller.\n\n1. That which is left, or which remains after the separation of a part, either in fact or in contemplation; remainder; residue. Religion gives part of its reward in hand, the present comfort of having done our duty, and, for the rest, it offers us the best security that Heaven can give. Tillotson. 2. Those not included in a proposition or description; the remainder; others. \"Plato and the rest of the philosophers.\" Bp. Stillingfleet. Armed like the rest, the Trojan prince appears. DRyden. 3. (Com.)  A surplus held as a reserved fund by a bank to equalize its dividends, etc.; in the Bank of England, the balance of assets above liabilities. [Eng.] Syn. -- Remainder; overplus; surplus; remnant; residue; reserve; others.\n\nTo be left; to remain; to continue to be. The affairs of men rest still uncertain. Shak."}