{"word":"reverence","definition":"1. Profound respect and esteem mingled with fear and affection, as for a holy being or place; the disposition to revere; veneration. If thou be poor, farewell thy reverence. Chaucer. Reverence, which is the synthesis of love and fear. Coleridge. When discords, and quarrels, and factions, are carried openly and audaciously, it is a sign the reverence of government islost. Bacon. Note: Formerly, as in Chaucer, reverence denoted \"respect\" \"honor\", without awe or fear. 2. The act of revering; a token of respect or veneration; an obeisance. Make twenty reverences upon receiving . . . about twopence. Goldsmith. And each of them doeth all his diligence To do unto the feast reverence. Chaucer. 3. That which deserves or exacts manifestations of reverence; reverend character; dignity; state. I am forced to lay my reverence by. Shak. 4. A person entitled to be revered; -- a title applied to priests or other ministers with the pronouns his or your; sometimes poetically to a father. Shak. Save your reverence, Saving your reverence, an apologetical phrase for an unseemly expression made in the presence of a priest or clergyman. -- Sir reverence, a contracted form of Save your reverence. Such a one as a man may not speak of, without he say. \"Sir reverence.\" Shak. -- To do reverence, to show reverence or honor; to perform an act of reverence. Now lies he there, And none so poor to do him reverence. Shak. Syn. -- Awe; honor; veneration; adoratuon; dread. -- Awe, Reverence, Dread, Veneration. Reverence is a strong sentiment of respect and esteem, sometimes mingled slightly with fear; as, reverence for the divine law. Awe is a mixed feeling of sublimity and dread in view of something great or terrible, sublime or sacred; as, awe at the divine presence. It does not necessarily imply love. Dread is an anxious fear in view of an impending evil; as, dread of punishment. Veneration is reverence in its strongest manifestations. It is the highest emotion we can exercise toward human beings. Exalted and noble objects produce reverence; terrific and threatening objects awaken dread; a sense of the divine presence fills us with awe; a union of wisdom and virtue in one who is advanced in years inspires us with veneration.\n\nTo regard or treat with reverence; to regard with respect and affection mingled with fear; to venerate. Let . . . the wife see that she reverence her husband. Eph. v. 33. Those that I reverence those I fear, the wise. Shak."}