{"word":"rib","definition":"1. (Anat.)  One of the curved bones attached to the vertebral column and supporting the lateral walls of the thorax. Note: In man there are twelve ribs on each side, of which the upper seven are directly connected with the sternum by cartilages, and are called sternal, or true, ribs. The remaining five pairs are called asternal, or false, ribs, and of these each of the three upper pairs is attached to the cartilage of the rib above, while the two lower pairs are free at the ventral ends, and are called floating ribs. See Thorax. 2. That which resembles a rib in form or use. Specifically: (a) (Shipbuilding) One of the timbers, or bars of iron or steel, that branch outward and upward from the keel, to support the skin or planking, and give shape and strength to the vessel. (b) (Mach. & Structures)  A ridge, fin, or wing, as on a plate, cylinder, beam, etc., to strengthen or stiffen it. (c) One of the rods on which the cover of an umbrella is extended. (d) A prominent line or ridge, as in cloth. (e) A longitudinal strip of metal uniting the barrels of a double- barreled gun. 3. (Bot.)  The chief nerve, or one of the chief nerves, of a leaf. (b) Any longitudinal ridge in a plant. 4. (Arch.) (a) In Gothic vaulting, one of the primary members of the vault. These are strong arches, meeting and crossing one another, dividing the whole space into triangles, which are then filled by vaulted construction of lighter material. Hence, an imitation of one of these in wood, plaster, or the like. (b) A projecting mold, or group of moldings, forming with others a pattern, as on a ceiling, ornamental door, or the like. 5. (Mining) (a) Solid coal on the side of a gallery; solid ore in a vein. (b) An elongated pillar of ore or coal left as a support. Raymond. 6. A wife; -- in allusion to Eve, as made out of Adam's rib. [Familiar & Sportive] How many have we known whose heads have been broken with their own rib. Bp. Hall. Chuck rib, a cut of beef immediately in front of the middle rib. See Chuck. -- Fore ribs, a cut of beef immediately in front of the sirloin. -- Middle rib, a cut of beef between the chuck rib and the fore ribs. -- Rib grass. (Bot.) Same as Ribwort.\n\n1. To furnish with ribs; to form with rising lines and channels; as, to rib cloth. 2. To inclose, as with ribs, and protect; to shut in. It [lead] were too gross To rib her cerecloth in the obscure grave. Shak. To rib land, to leave strips of undisturbed ground between the furrows in plowing."}