{"word":"ribbon","definition":"1. A fillet or narrow woven fabric, commonly of silk, used for trimming some part of a woman's attire, for badges, and other decorative purposes. 2. A narrow strip or shred; as, a steel or magnesium ribbon; sails torn to ribbons. 3. (Shipbuilding)  Same as Rib-band. 4. pl.  Driving reins. [Cant] London Athenæum. 5. (Her.)  A bearing similar to the bend, but only one eighth as wide. 6. (Spinning)  A silver. Note: The blue ribbon, and The red ribbon, are phrases often used to designate the British orders of the Garter and of the Bath, respectively, the badges of which are suspended by ribbons of these colors. See Blue ribbon, under Blue. Ribbon fish. (Zoöl.) (a) Any elongated, compressed, ribbon-shaped marine fish of the family Trachypteridæ, especially the species of the genus Trachypterus, and the oarfish (Regelecus Banksii) of the North Atlantic, which is sometimes over twenty feet long. (b) The hairtail, or bladefish. (c) A small compressed marine fish of the genus Cepola, having a long, slender, tapering tail. The European species (C. rubescens) is light red throughout. Called also band fish. -- Ribbon grass (Bot.), a variety of reed canary grass having the leaves stripped with green and white; -- called also Lady's garters. See Reed grass, under Reed. -- Ribbon seal (Zoöl.), a North Pacific seal (Histriophoca fasciata). The adult male is dark brown, conspicuously banded and striped with yellowish white. -- Ribbon snake (Zoöl.), a common North American snake (Eutainia saurita). It is conspicuously striped with bright yellow and dark brown. -- Ribbon Society, a society in Ireland, founded in the early part of the 19th century in antagonism to the Orangemen. It afterwards became an organization of tennant farmers banded together to prevent eviction by landlords. It took its name from the green ribbon worn by members as a badge. -- Ribborn worm. (Zoöl.) (a) A tapeworm. (b) A nemertean.\n\nTo adorn with, or as with, ribbons; to mark with stripes resembling ribbons."}