{"word":"ride","definition":"1. To be carried on the back of an animal, as a horse. To-morrow, when ye riden by the way. Chaucer. Let your master ride on before, and do you gallop after him. Swift. 2. To be borne in a carriage; as, to ride in a coach, in a car, and the like. See Synonym, below. The richest inhabitants exhibited their wealth, not by riding in gilden carriages, but by walking the streets with trains of servants. Macaulay. 3. To be borne or in a fluid; to float; to lie. Men once walked where ships at anchor ride. Dryden. 4. To be supported in motion; to rest. Strong as the exletree On which heaven rides. Shak. On whose foolish honesty My practices ride easy! Shak. 5. To manage a horse, as an equestrian. He rode, he fenced, he moved with graceful ease. Dryden. 6. To support a rider, as a horse; to move under the saddle; as, a horse rides easy or hard, slow or fast. To ride easy (Naut.), to lie at anchor without violent pitching or straining at the cables. -- To ride hard (Naut.), to pitch violently. -- To ride out. (a) To go upon a military expedition. [Obs.] Chaucer. (b) To ride in the open air. [Colloq.] -- To ride to hounds, to ride behind, and near to, the hounds in hunting. Syn. -- Drive. -- Ride, Drive. Ride originally meant (and is so used throughout the English Bible) to be carried on horseback or in a vehicle of any kind. At present in England, drive is the word applied in most cases to progress in a carriage; as, a drive around the park, etc.; while ride is appropriated to progress on a horse. Johnson seems to sanction this distinction by giving \"to travel on horseback\" as the leading sense of ride; though he adds \"to travel in a vehicle\" as a secondary sense. This latter use of the word still occurs to some extent; as, the queen rides to Parliament in her coach of state; to ride in an omnibus. \"Will you ride over or drive\" said Lord Willowby to his quest, after breakfast that morning. W. Black.\n\n1. To sit on, so as to be carried; as, to ride a horse; to ride a bicycle. [They] rend up both rocks and hills, and ride the air In whirlwind. Milton. 2. To manage insolently at will; to domineer over. The nobility could no longer endure to be ridden by bakers, cobblers, and brewers. Swift. 3. To convey, as by riding; to make or do by riding. Tue only men that safe can ride Mine errands on the Scottish side. Sir W. Scott. 4. (Surg.)  To overlap (each other); -- said of bones or fractured fragments. To ride a hobby, to have some favorite occupation or subject of talk. -- To ride and tie, to take turn with another in labor and rest; -- from the expedient adopted by two persons with one horse, one of whom rides the animal a certain distance, and then ties him for the use of the other, who is coming up on foot. Fielding. -- To ride down. (a) To ride over; to trample down in riding; to overthrow by riding against; as, to ride down an enemy. (b) (Naut.) To bear down, as on a halyard when hoisting a sail. -- To ride out (Naut.), to keep safe afloat during (a storm) while riding at anchor or when hove to on the open sea; as, to ride out the gale. to ride the lightning, (Colloq.) to be executed by electrocution in an electric chair.\n\n1. The act of riding; an excursion on horseback or in a vehicle. 2. A saddle horse. [Prov. Eng.] Wright. 3. A road or avenue cut in a wood, or through grounds, to be used as a place for riding; a riding."}