{"word":"right","definition":"1. Straight; direct; not crooked; as, a right line. \"Right as any line.\" Chaucer 2. Upright; erect from a base; having an upright axis; not oblique; as, right ascension; a right pyramid or cone. 3. Conformed to the constitution of man and the will of God, or to justice and equity; not deviating from the true and just; according with truth and duty; just; true. That which is conformable to the Supreme Rule is absolutely right, and is called right simply without relation to a special end. Whately. 2. Fit; suitable; proper; correct; becoming; as, the right man in the right place; the right way from London to Oxford. 5. Characterized by reality or genuineness; real; actual; not spurious. \"His right wife.\" Chaucer. In this battle, . . . the Britons never more plainly manifested themselves to be right barbarians. Milton. 6. According with truth; passing a true judgment; conforming to fact or intent; not mistaken or wrong; not erroneous; correct; as, this is the right faith. You are right, Justice, and you weigh this well. Shak. If there be no prospect beyond the grave, the inference is . . . right, \"Let us eat and drink, for to-morrow we die.\" Locke. 7. Most favorable or convenient; fortunate. The lady has been disappointed on the right side. Spectator. 8. Of or pertaining to that side of the body in man on which the muscular action is usually stronger than on the other side; -- opposed to left when used in reference to a part of the body; as, the right side, hand, arm. Also applied to the corresponding side of the lower animals. Became the sovereign's favorite, his right hand. Longfellow. Note: In designating the banks of a river, right and left are used always with reference to the position of one who is facing in the direction of the current's flow. 9. Well placed, disposed, or adjusted; orderly; well regulated; correctly done. 10. Designed to be placed or worn outward; as, the right side of a piece of cloth. At right angles, so as to form a right angle or right angles, as when one line crosses another perpendicularly. -- Right and left, in both or all directions. [Colloq.] -- Right and left coupling (Pipe fitting), a coupling the opposite ends of which are tapped for a right-handed screw and a left-handed screw, respectivelly. -- Right angle. (a) The angle formed by one line meeting another perpendicularly, as the angles ABD, DBC. (b) (Spherics) A spherical angle included between the axes of two great circles whose planes are perpendicular to each other. -- Right ascension. See under Ascension. -- Right Center (Politics), those members belonging to the Center in a legislative assembly who have sympathies with the Right on political questions. See Center, n., 5. -- Right cone, Right cylinder, Right prism, Right pyramid (Geom.), a cone, cylinder, prism, or pyramid, the axis of which is perpendicular to the base. -- Right line. See under Line. -- Right sailing (Naut.), sailing on one of the four cardinal points, so as to alter a ship's latitude or its longitude, but not both. Ham. Nav. Encyc. -- Right sphere (Astron. & Geol.), a sphere in such a position that the equator cuts the horizon at right angles; in spherical projections, that position of the sphere in which the primitive plane coincides with the plane of the equator. Note: Right is used elliptically for it is right, what you say is right, true. \"Right,\" cries his lordship. Pope. Syn. -- Straight; direct; perpendicular; upright; lawful; rightful; true; correct; just; equitable; proper; suitable; becoming.\n\n1. In a right manner. 2. In a right or straight line; directly; hence; straightway; immediately; next; as, he stood right before me; it went right to the mark; he came right out; he followed right after the guide. Unto Dian's temple goeth she right. Chaucer. Let thine eyes look right on. Prov. iv. 25. Right across its track there lay, Down in the water, a long reef of gold. Tennyson. 3. Exactly; just. [Obs. or Colloq.] Came he right now to sing a raven's note Shak. 4. According to the law or will of God; conforming to the standard of truth and justice; righteously; as, to live right; to judge right. 5. According to any rule of art; correctly. You with strict discipline instructed right. Roscommon. 6. According to fact or truth; actually; truly; really; correctly; exactly; as, to tell a story right. \"Right at mine own cost.\" Chaucer. Right as it were a steed of Lumbardye. Chaucer. His wounds so smarted that he slept right naught. Fairfax. 7. In a great degree; very; wholly; unqualifiedly; extremely; highly; as, right humble; right noble; right valiant. \"He was not right fat\". Chaucer. For which I should be right sorry. Tyndale. [I] return those duties back as are right fit. Shak. Note: In this sense now chiefly prefixed to titles; as, right honorable; right reverend. Right honorable, a title given in England to peers and peeresses, to the eldest sons and all daughters of such peers as have rank above viscounts, and to all privy councilors; also, to certain civic officers, as the lord mayor of London, of York, and of Dublin. Note: Right is used in composition with other adverbs, as upright, downright, forthright, etc. Right along, without cessation; continuously; as, to work right along for several hours. [Colloq. U.S.] -- Right away, or Right off, at once; straightway; without delay. [Colloq. U.S.] \"We will . . . shut ourselves up in the office and do the work right off.\" D. Webster.\n\n1. That which is right or correct. Specifically: (a) The straight course; adherence to duty; obedience to lawful authority, divine or human; freedom from guilt, -- the opposite of moral wrong. (b) A true statement; freedom from error of falsehood; adherence to truth or fact. Seldom your opinions err; Your eyes are always in the right. Prior. (c) A just judgment or action; that which is true or proper; justice; uprightness; integrity. Long love to her has borne the faithful knight, And well deserved, had fortune done him right. Dryden. 2. That to which one has a just claim. Specifically: (a) That which one has a natural claim to exact. There are no rights whatever, without corresponding duties. Coleridge. (b) That which one has a legal or social claim to do or to exact; legal power; authority; as, a sheriff has a right to arrest a criminal. (c) That which justly belongs to one; that which one has a claim to possess or own; the interest or share which anyone has in a piece of property; title; claim; interest; ownership. Born free, he sought his right. Dryden. Hast thou not right to all created things Milton. Men have no right to what is not reasonable. Burke. (d) Privilege or immunity granted by authority. 3. The right side; the side opposite to the left. Led her to the Souldan's right. Spenser. 4. In some legislative bodies of Europe (as in France), those members collectively who are conservatives or monarchists. See Center, 5. 5. The outward or most finished surface, as of a piece of cloth, a carpet, etc. At all right, at all points; in all respects. [Obs.] Chaucer. -- Bill of rights, a list of rights; a paper containing a declaration of rights, or the declaration itself. See under Bill. -- By right, By rights, or By good rights, rightly; properly; correctly. He should himself use it by right. Chaucer. I should have been a woman by right. Shak. -- Divine right, or Divine right of kings, a name given to the patriarchal theory of government, especially to the doctrine that no misconduct and no dispossession can forfeit the right of a monarch or his heirs to the throne, and to the obedience of the people. -- To rights. (a) In a direct line; straight. [R.] Woodward. (b) At once; directly. [Obs. or Colloq.] Swift. -- To set to rights, To put to rights, to put in good order; to adjust; to regulate, as what is out of order. -- Writ of right (Law), a writ which lay to recover lands in fee simple, unjustly withheld from the true owner. Blackstone.\n\n1. To bring or restore to the proper or natural position; to set upright; to make right or straight (that which has been wrong or crooked); to correct. 2. To do justice to; to relieve from wrong; to restore rights to; to assert or regain the rights of; as, to right the oppressed; to right one's self; also, to vindicate. So just is God, to right the innocent. Shak. All experience hath shown that mankind are more disposed to suffer while evils are sufferable, than to right themselves by abolishing the forms to which they are accustomed. Jefferson. To right a vessel (Naut.), to restore her to an upright position after careening. -- To right the helm (Naut.), to place it in line with the keel.\n\n1. To recover the proper or natural condition or position; to become upright. 2. (Naut.)  Hence, to regain an upright position, as a ship or boat, after careening."}