{"word":"rise","definition":"1. To move from a lower position to a higher; to ascend; to mount up. Specifically: -- (a) To go upward by walking, climbing, flying, or any other voluntary motion; as, a bird rises in the air; a fish rises to the bait. (b) To ascend or float in a fluid, as gases or vapors in air, cork in water, and the like. (c) To move upward under the influence of a projecting force; as, a bullet rises in the air. (d) To grow upward; to attain a certain heght; as, this elm rises to the height of seventy feet. (e) To reach a higher level by increase of quantity or bulk; to swell; as, a river rises in its bed; the mercury rises in the thermometer. (f) To become erect; to assume an upright position; as, to rise from a chair or from a fall. (g) To leave one's bed; to arise; as, to rise early. He that would thrive, must rise by five. Old Proverb. (h) To tower up; to be heaved up; as, the Alps rise far above the sea. (i) To slope upward; as, a path, a line, or surface rises in this direction. \"A rising ground.\" Dryden. (j) To retire; to give up a siege. He, rising with small honor from Gunza, . . . was gone. Knolles. (k) To swell or puff up in the process of fermentation; to become light, as dough, and the like. 2. To have the aspect or the effect of rising. Specifically: -- (a) To appear above the horizont, as the sun, moon, stars, and the like. \"He maketh his sun to rise on the evil and the good.\" Matt. v. 45. (b) To become apparent; to emerge into sight; to come forth; to appear; as, an eruption rises on the skin; the land rises to view to one sailing toward the shore. (c) To become perceptible to other senses than sight; as, a noise rose on the air; odor rises from the flower. (d) To have a beginning; to proceed; to originate; as, rivers rise in lakes or springs. A scepter shall rise out of Israel. Num. xxiv. 17. Honor and shame from no condition rise. Pope. 3. To increase in size, force, or value; to proceed toward a climax. Specifically: -- (a) To increase in power or fury; -- said of wind or a storm, and hence, of passion. \"High winde . . . began to rise, high passions -- anger, hate.\" Milton. (b) To become of higher value; to increase in price. Bullion is risen to six shillings . . . the ounce. Locke. (c) To become larger; to swell; -- said of a boil, tumor, and the like. (d) To increase in intensity; -- said of heat. (e) To become louder, or higher in pitch, as the voice. (f) To increase in amount; to enlarge; as, his expenses rose beyond his expectations. 4. In various figurative senses. Specifically: -- (a) To become excited, opposed, or hostile; to go to war; to take up arms; to rebel. At our heels all hell should rise With blackest insurrection. Milton. No more shall nation against nation rise. Pope. (b) To attain to a better social position; to be promoted; to excel; to succeed. Some rise by sin, and some by virtue fall. Shak. (c) To become more and more dignified or forcible; to increase in interest or power; -- said of style, thought, or discourse; as, to rise in force of expression; to rise in eloquence; a story rises in interest. (d) To come to mind; to be suggested; to occur. A thought rose in me, which often perplexes men of contemplative natures. Spectator. (e) To come; to offer itself. There chanced to the prince's hand to rise An ancient book. Spenser. 5. To ascend from the grave; to come to life. But now is Christ risen from the dead. 1. Cor. xv. 20. 6. To terminate an official sitting; to adjourn; as, the committee rose after agreeing to the report. It was near nine . . . before the House rose. Macaulay. 7. To ascend on a musical scale; to take a higher pith; as, to rise a tone or semitone. 8. (Print.)  To be lifted, or to admit of being lifted, from the imposing stone without dropping any of the type; -- said of a form. Syn. -- To arise; mount; ascend; climb; scale. -- Rise, Appreciate. Some in America use the word appreciate for \"rise in value;\" as, stocks appreciate, money appreciates, etc. This use is not unknown in England, but it is less common there. It is undesirable, because rise sufficiently expresses the idea, and appreciate has its own distinctive meaning, which ought not to be confused with one so entirely different.\n\n1. The act of rising, or the state of being risen. 2. The distance through which anything rises; as, the rise of the thermometer was ten degrees; the rise of the river was six feet; the rise of an arch or of a step. 3. Land which is somewhat higher than the rest; as, the house stood on a rise of land. [Colloq.] 4. Spring; source; origin; as, the rise of a stream. All wickednes taketh its rise from the heart. R. Nelson. 5. Appearance above the horizon; as, the rise of the sun or of a planet. Shak. 6. Increase; advance; augmentation, as of price, value, rank, property, fame, and the like. The rise or fall that may happen in his constant revenue by a Spanish war. Sir W. Temple. 7. Increase of sound; a swelling of the voice. The ordinary rises and falls of the voice. Bacon. 8. Elevation or ascent of the voice; upward change of key; as, a rise of a tone or semitone. 9. The spring of a fish to seize food (as a fly) near the surface of the water."}