{"word":"rock","definition":"See Roc.\n\nA distaff used in spinning; the staff or frame about which flax is arranged, and from which the thread is drawn in spinning. Chapman. Sad Clotho held the rocke, the whiles the thread By grisly Lachesis was spun with pain, That cruel Atropos eftsoon undid. Spenser.\n\n1. A large concreted mass of stony material; a large fixed stone or crag. See Stone. Come one, come all! this rock shall fly From its firm base as soon as I. Sir W. Scott. 2. (Geol.)  Any natural deposit forming a part of the earth's crust, whether consolidated or not, including sand, earth, clay, etc., when in natural beds. 3. That which resembles a rock in firmness; a defense; a support; a refuge. The Lord is my rock, and my fortress. 2 Sam. xxii. 2. 4. Fig.: Anything which causes a disaster or wreck resembling the wreck of a vessel upon a rock. 5. (Zoöl.)  The striped bass. See under Bass. Note: This word is frequently used in the formation of self- explaining compounds; as, rock-bound, rock-built, rock-ribbed, rock- roofed, and the like. Rock alum. Etym: [Probably so called by confusion with F. roche a rock.] Same as Roche alum. -- Rock barnacle (Zoöl.), a barnacle (Balanus balanoides) very abundant on rocks washed by tides. -- Rock bass. (Zoöl.) (a) The stripped bass. See under Bass. (b) The goggle-eye. (c) The cabrilla. Other species are also locally called rock bass. -- Rock builder (Zoöl.), any species of animal whose remains contribute to the formation of rocks, especially the corals and Foraminifera. -- Rock butter (Min.), native alum mixed with clay and oxide of iron, usually in soft masses of a yellowish white color, occuring in cavities and fissures in argillaceous slate. -- Rock candy, a form of candy consisting of crystals of pure sugar which are very hard, whence the name. -- Rock cavy. (Zoöl.) See Moco. -- Rock cod (Zoöl.) (a) A small, often reddish or brown, variety of the cod found about rocks andledges. (b) A California rockfish. -- Rock cook. (Zoöl.) (a) A European wrasse (Centrolabrus exoletus). (b) A rockling. -- Rock cork (Min.), a variety of asbestus the fibers of which are loosely interlaced. It resembles cork in its texture. -- Rock crab (Zoöl.), any one of several species of large crabs of the genus Cancer, as the two species of the New England coast (C. irroratus and C. borealis). See Illust. under Cancer. -- Rock cress (Bot.), a name of several plants of the cress kind found on rocks, as Arabis petræa, A. lyrata, etc. -- Rock crystal (Min.), limpid quartz. See Quartz, and under Crystal. -- Rock dove (Zoöl.), the rock pigeon; -- called also rock doo. -- Rock drill, an implement for drilling holes in rock; esp., a machine impelled by steam or compressed air, for drilling holes for blasting, etc. -- Rock duck (Zoöl.), the harlequin duck. -- Rock eel. (Zoöl.) See Gunnel. -- Rock goat (Zoöl.), a wild goat, or ibex. -- Rock hopper (Zoöl.), a penguin of the genus Catarractes. See under Penguin. -- Rock kangaroo. (Zoöl.) See Kangaroo, and Petrogale. -- Rock lobster (Zoöl.), any one of several species of large spinose lobsters of the genera Panulirus and Palinurus. They have no large claws. Called also spiny lobster, and sea crayfish. -- Rock meal (Min.), a light powdery variety of calcite occuring as an efflorescence. -- Rock milk. (Min.) See Agaric mineral, under Agaric. -- Rock moss, a kind of lichen; the cudbear. See Cudbear. -- Rock oil. See Petroleum. -- Rock parrakeet (Zoöl.), a small Australian parrakeet (Euphema petrophila), which nests in holes among the rocks of high cliffs. Its general color is yellowish olive green; a frontal band and the outer edge of the wing quills are deep blue, and the central tail feathers bluish green. -- Rock pigeon (Zoöl.), the wild pigeon (Columba livia) Of Europe and Asia, from which the domestic pigeon was derived. See Illust. under Pigeon. -- Rock pipit. (Zoöl.) See the Note under Pipit. -- Rock plover. (Zoöl.) (a) The black-bellied, or whistling, plover. (b) The rock snipe. -- Rock ptarmigan (Zoöl.), an arctic American ptarmigan (Lagopus rupestris), which in winter is white, with the tail and lores black. In summer the males are grayish brown, coarsely vermiculated with black, and have black patches on the back. -- Rock rabbit (Zoöl.), the hyrax. See Cony, and Daman. -- Rock ruby (Min.), a fine reddish variety of garnet. -- Rock salt (Min.), cloride of sodium (common salt) occuring in rocklike masses in mines; mineral salt; salt dug from the earth. In the United States this name is sometimes given to salt in large crystals, formed by evaporation from sea water in large basins or cavities. -- Rock seal (Zoöl.), the harbor seal. See Seal. -- Rock shell (Zoöl.), any species of Murex, Purpura, and allied genera. -- Rock snake (Zoöl.), any one of several large pythons; as, the royal rock snake (Python regia) of Africa, and the rock snake of India (P. molurus). The Australian rock snakes mostly belong to the allied genus Morelia. -- Rock snipe (Zoöl.), the purple sandpiper (Tringa maritima); -- called also rock bird, rock plover, winter snipe. -- Rock soap (Min.), a kind of clay having a smooth, greasy feel, and adhering to the tongue. -- Rock sparrow. (Zoöl.) (a) Any one of several species of Old World sparrows of the genus Petronia, as P. stulla, of Europe. (b) A North American sparrow (Pucæa ruficeps). -- Rock tar, petroleum. -- Rock thrush (Zoöl.), any Old World thrush of the genus Monticola, or Petrocossyphus; as, the European rock thrush (M. saxatilis), and the blue rock thrush of India (M. cyaneus), in which the male is blue throughout. -- Rock tripe (Bot.), a kind of lichen (Umbilicaria Dillenii) growing on rocks in the northen parts of America, and forming broad, flat, coriaceous, dark fuscous or blackish expansions. It has been used as food in cases of extremity. -- Rock trout (Zoöl.), any one of several species of marine food fishes of the genus Hexagrammus, family Chiradæ, native of the North Pacific coasts; -- called also sea trout, boregat, bodieron, and starling. -- Rock warbler (Zoöl.), a small Australian singing bird (Origma rubricata) which frequents rocky ravines and water courses; -- called also cataract bird. -- Rock wren (Zoöl.), any one of several species of wrens of the genus Salpinctes, native of the arid plains of Lower California and Mexico.\n\n1. To cause to sway backward and forward, as a body resting on a support beneath; as, to rock a cradle or chair; to cause to vibrate; to cause to reel or totter. A rising earthquake rocked the ground. Dryden. 2. To move as in a cradle; hence, to put to sleep by rocking; to still; to quiet. \"Sleep rock thy brain.\" Shak. Note: Rock differs from shake, as denoting a slower, less violent, and more uniform motion, or larger movements. It differs from swing, which expresses a vibratory motion of something suspended.\n\n1. To move or be moved backward and forward; to be violently agitated; to reel; to totter. The rocking town Supplants their footsteps. J. Philips . 2. To roll or saway backward and forward upon a support; as, to rock in a rocking-chair."}