{"word":"roller","definition":"1. One who, or that which, rolls; especially, a cylinder, sometimes grooved, of wood, stone, metal, etc., used in husbandry and the arts. 2. A bandage; a fillet; properly, a long and broad bandage used in surgery. 3. (Naut.)  One of series of long, heavy waves which roll in upon a coast, sometimes in calm weather. 4. A long, belt-formed towel, to be suspended on a rolling cylinder; -- called also roller towel. 5. (Print.)  A cylinder coated with a composition made principally of glue and molassess, with which forms of type are inked previously to taking an impression from them. W. Savage. 6. A long cylinder on which something is rolled up; as, the roller of a man. 7. A small wheel, as of a caster, a roller skate, etc. 8. (Zoöl.)  ANy insect whose larva rolls up leaves; a leaf roller. see Tortrix. 9. Etym: [CF. F. rollier.] (Zoöl.)  Any one of numerous species of Old World picarian birds of the family Coraciadæ. The name alludes to their habit of suddenly turning over or \"tumbling\" in flight. Note: Many of the species are brilliantly colored. The common European species (Coracias garrula) has the head, neck, and under parts light blue varied with green, the scapulars chestnut brown, and the tail blue, green, and black. The broad-billed rollers of India and Africa belong to the genus Eurystomus, as the oriental roller (E. orientalis), and the Australian roller, or dollar bird (E. Pacificus). The latter is dark brown on the head and neck, sea green on the back, and bright blue on the throat, base of the tail, and parts of the wings. It has a silvery-white spot on the middle of each wing. 10. (Zoöl.)  Any species of small ground snakes of the family Tortricidæ. Ground roller (Zoöl.), any one of several species of Madagascar rollers belonging to Atelornis and allied genera. They are nocturnal birds, and feed on the ground. -- Roller bolt, the bar in a carriage to which the traces are attached; a whiffletree. [Eng.] -- Roller gin, a cotton gin inn which rolls are used for separating the seeds from the fiber. -- Roller mill. See under Mill. -- Roller skate, a skate which has small wheels in the place of the metallic runner; -- designed for use in skating upon a smooth, hard surface, other than ice."}