{"word":"roll","definition":"1. To cause to revolve by turning over and over; to move by turning on an axis; to impel forward by causing to turn over and over on a supporting surface; as, to roll a wheel, a ball, or a barrel. 2. To wrap round on itself; to form into a spherical or cylindrical body by causing to turn over and over; as, to roll a sheet of paper; to roll parchment; to roll clay or putty into a ball. 3. To bind or involve by winding, as in a bandage; to inwrap; -- often with up; as, to roll up a parcel. 4. To drive or impel forward with an easy motion, as of rolling; as, a river rolls its waters to the ocean. The flood of Catholic reaction was rolled over Europe. J. A. Symonds. 5. To utter copiously, esp. with sounding words; to utter with a deep sound; -- often with forth, or out; as, to roll forth some one's praises; to roll out sentences. Who roll'd the psalm to wintry skies. Tennyson. 6. To press or level with a roller; to spread or form with a roll, roller, or rollers; as, to roll a field; to roll paste; to roll steel rails, etc. 7. To move, or cause to be moved, upon, or by means of, rollers or small wheels. 8. To beat with rapid, continuous strokes, as a drum; to sound a roll upon. 9. (Geom.)  To apply (one line or surface) to another without slipping; to bring all the parts of (one line or surface) into successive contact with another, in suck manner that at every instant the parts that have been in contact are equal. 10. To turn over in one's mind; to revolve. Full oft in heart he rolleth up and down The beauty of these florins new and bright. Chaucer. To roll one's self, to wallow. -- To roll the eye, to direct its axis hither and thither in quick succession. -- To roll one's r's, to utter the letter r with a trill. [Colloq.]\n\n1. To move, as a curved object may, along a surface by rotation without sliding; to revolve upon an axis; to turn over and over; as, a ball or wheel rolls on the earth; a body rolls on an inclined plane. And her foot, look you, is fixed upon a spherical stone, which rolls, and rolls, and rolls. Shak. 2. To move on wheels; as, the carriage rolls along the street. \"The rolling chair.\" Dryden. 3. To be wound or formed into a cylinder or ball; as, the cloth rolls unevenly; the snow rolls well. 4. To fall or tumble; -- with over; as, a stream rolls over a precipice. 5. To perform a periodical revolution; to move onward as with a revolution; as, the rolling year; ages roll away. 6. To turn; to move circularly. And his red eyeballs roll with living fire. Dryden. 7. To move, as waves or billows, with alternate swell and depression. What different sorrows did within thee roll. Prior. 8. To incline first to one side, then to the other; to rock; as, there is a great difference in ships about rolling; in a general semse, to be tossed about. Twice ten tempestuous nights I rolled. Pope. 9. To turn over, or from side to side, while lying down; to wallow; as, a horse rolls. 10. To spread under a roller or rolling-pin; as, the paste rolls well. 11. To beat a drum with strokes so rapid that they can scarcely be distinguished by the ear. 12. To make a loud or heavy rumbling noise; as, the thunder rolls. To roll about, to gad abroad. [Obs.] Man shall not suffer his wife go roll about. Chaucer.\n\n1. The act of rolling, or state of being rolled; as, the roll of a ball; the roll of waves. 2. That which rolls; a roller. Specifically: (a) A heavy cylinder used to break clods. Mortimer. (b) One of a set of revolving cylinders, or rollers, between which metal is pressed, formed, or smoothed, as in a rolling mill; as, to pass rails through the rolls. 3. That which is rolled up; as, a roll of fat, of wool, paper, cloth, etc. Specifically: (a) A document written on a piece of parchment, paper, or other materials which may be rolled up; a scroll. Busy angels spread The lasting roll, recording what we say. Prior. (b) Hence, an official or public document; a register; a record; also, a catalogue; a list. The rolls of Parliament, the entry of the petitions, answers, and transactions in Parliament, are extant. Sir M. Hale. The roll and list of that army doth remain. Sir J. Davies. (c) A quantity of cloth wound into a cylindrical form; as, a roll of carpeting; a roll of ribbon. (d) A cylindrical twist of tobacco. 4. A kind of shortened raised biscuit or bread, often rolled or doubled upon itself. 5. (Naut.)  The oscillating movement of a vessel from side to side, in sea way, as distinguished from the alternate rise and fall of bow and stern called pitching. 6. A heavy, reverberatory sound; as, the roll of cannon, or of thunder. 7. The uniform beating of a drum with strokes so rapid as scarcely to be distinguished by the ear. 8. Part; office; duty; rôle. [Obs.] L'Estrange. Long roll (Mil.), a prolonged roll of the drums, as the signal of an attack by the enemy, and for the troops to arrange themselves in line. -- Master of the rolls. See under Master. -- Roll call, the act, or the time, of calling over a list names, as among soldiers. -- Rolls of court, of parliament (or of any public body), the parchments or rolls on which the acts and proceedings of that body are engrossed by the proper officer, and which constitute the records of such public body. -- To call the roll, to call off or recite a list or roll of names of persons belonging to an organization, in order to ascertain who are present or to obtain responses from those present. Syn. -- List; schedule; catalogue; register; inventory. See List."}