{"word":"root","definition":"1. To turn up the earth with the snout, as swine. 2. Hence, to seek for favor or advancement by low arts or groveling servility; to fawn servilely.\n\nTo turn up or to dig out with the snout; as, the swine roots the earth.\n\n1. (Bot.) (a) The underground portion of a plant, whether a true root or a tuber, a bulb or rootstock, as in the potato, the onion, or the sweet flag. (b) The descending, and commonly branching, axis of a plant, increasing in length by growth at its extremity only, not divided into joints, leafless and without buds, and having for its offices to fix the plant in the earth, to supply it with moisture and soluble matters, and sometimes to serve as a reservoir of nutriment for future growth. A true root, however, may never reach the ground, but may be attached to a wall, etc., as in the ivy, or may hang loosely in the air, as in some epiphytic orchids. 2. An edible or esculent root, especially of such plants as produce a single root, as the beet, carrot, etc.; as, the root crop. 3. That which resembles a root in position or function, esp. as a source of nourishment or support; that from which anything proceeds as if by growth or development; as, the root of a tooth, a nail, a cancer, and the like. Specifically: (a) An ancestor or progenitor; and hence, an early race; a stem. They were the roots out of which sprang two distinct people. Locke. (b) A primitive form of speech; one of the earliest terms employed in language; a word from which other words are formed; a radix, or radical. (c) The cause or occasion by which anything is brought about; the source. \"She herself . . . is root of bounty.\" Chaucer. The love of money is a root of all kinds of evil. 1 Tim. vi. 10 (rev. Ver. ) (d) (Math.)  That factor of a quantity which when multiplied into itself will produce that quantity; thus, 3 is a root of 9, because 3 multiplied into itself produces 9; 3 is the cube root of 27. (e) (Mus.) The fundamental tone of any chord; the tone from whose harmonics, or overtones, a chord is composed. Busby. (f) The lowest place, position, or part. \"Deep to the roots of hell.\" Milton. \"The roots of the mountains.\" Southey. 4. (Astrol.)  The time which to reckon in making calculations. When a root is of a birth yknowe [known]. Chaucer. Aërial roots. (Bot.) (a) Small roots emitted from the stem of a plant in the open air, which, attaching themselves to the bark of trees, etc., serve to support the plant. (b) Large roots growing from the stem, etc., which descend and establish themselves in the soil. See Illust. of Mangrove. -- Multiple primary root (Bot.), a name given to the numerous roots emitted from the radicle in many plants, as the squash. -- Primary root (Bot.), the central, first-formed, main root, from which the rootlets are given off. -- Root and branch, every part; wholly; completely; as, to destroy an error root and branch. -- Root-and-branch men, radical reformers; -- a designation applied to the English Independents (1641). See Citation under Radical, n., 2. -- Root barnacle (Zoöl.), one of the Rhizocephala. -- Root hair (Bot.), one of the slender, hairlike fibers found on the surface of fresh roots. They are prolongations of the superficial cells of the root into minute tubes. Gray. -- Root leaf (Bot.), a radical leaf. See Radical, a., 3 (b). -- Root louse (Zoöl.), any plant louse, or aphid, which lives on the roots of plants, as the Phylloxera of the grapevine. See Phylloxera. -- Root of an equation (Alg.), that value which, substituted for the unknown quantity in an equation, satisfies the equation. -- Root of a nail (Anat.), the part of a nail which is covered by the skin. -- Root of a tooth (Anat.), the part of a tooth contained in the socket and consisting of one or more fangs. -- Secondary roots (Bot.), roots emitted from any part of the plant above the radicle. -- To strike root, To take root, to send forth roots; to become fixed in the earth, etc., by a root; hence, in general, to become planted, fixed, or established; to increase and spread; as, an opinion takes root. \"The bended twigs take root.\" Milton.\n\n1. To fix the root; to enter the earth, as roots; to take root and begin to grow. In deep grounds the weeds root deeper. Mortimer. 2. To be firmly fixed; to be established. If any irregularity chanced to intervene and to cause misappehensions, he gave them not leave to root and fasten by concealment. Bp. Fell.\n\n1. To plant and fix deeply in the earth, or as in the earth; to implant firmly; hence, to make deep or radical; to establish; -- used chiefly in the participle; as, rooted trees or forests; rooted dislike. 2. To tear up by the root; to eradicate; to extirpate; -- with up, out, or away. \"I will go root away the noisome weeds.\" Shak. The Lord rooted them out of their land . . . and cast them into another land. Deut. xxix. 28."}