{"word":"round","definition":"To whisper. [obs.] Shak. Holland. The Bishop of Glasgow rounding in his ear, \"Ye are not a wise man,\" . . . he rounded likewise to the bishop, and said, \"Wherefore brought ye me here\" Calderwood.\n\n1. Having every portion of the surface or of the circumference equally distant from the center; spherical; circular; having a form approaching a spherical or a circular shape; orbicular; globular; as, a round ball. \"The big, round tears.\" Shak. Upon the firm opacous globe Of this round world. Milton. 2. Having the form of a cylinder; cylindrical; as, the barrel of a musket is round. 3. Having a curved outline or form; especially, one like the arc of a circle or an ellipse, or a portion of the surface of a sphere; rotund; bulging; protuberant; not angular or pointed; as, a round arch; round hills. \"Their round haunches gored.\" Shak. 4. Full; complete; not broken; not fractional; approximately in even units, tens, hundreds, thousands, etc.; -- said of numbers. Pliny put a round number near the truth, rather than the fraction. Arbuthnot. 5. Not inconsiderable; large; hence, generous; free; as, a round price. Three thousand ducats; 'tis a good round sum. Shak. Round was their pace at first, but slackened soon. Tennyson. 6. Uttered or emitted with a full tone; as, a round voice; a round note. 7. (Phonetics)  Modified, as a vowel, by contraction of the lip opening, making the opening more or less round in shape; rounded; labialized; labial. See Guide to Pronunciation, § 11. 8. Outspoken; plain and direct; unreserved; unqualified; not mincing; as, a round answer; a round oath. \"The round assertion.\" M. Arnold. Sir Toby, I must be round with you. Shak. 9. Full and smoothly expanded; not defective or abrupt; finished; polished; -- said of style, or of authors with reference to their style. [Obs.] In his satires Horace is quick, round, and pleasant. Peacham. 10. Complete and consistent; fair; just; -- applied to conduct. Round dealing is the honor of man's nature. Bacon. At a round rate, rapidly. Dryden. -- In round numbers, approximately in even units, tens, hundreds, etc.; as, a bin holding 99 or 101 bushels may be said to hold in round numbers 100 bushels. -- Round bodies (Geom.), the sphere right cone, and right cylinder. -- Round clam (Zoöl.), the quahog. -- Round dance one which is danced by couples with a whirling or revolving motion, as the waltz, polka, etc. -- Round game, a game, as of cards, in which each plays on his own account. -- Round hand, a style of penmanship in which the letters are formed in nearly an upright position, and each separately distinct; -- distinguished from running hand. -- Round robin. Etym: [Perhaps F. round round + ruban ribbon.] (a) A written petition, memorial, remonstrance, protest, etc., the signatures to which are made in a circle so as not to indicate who signed first. \"No round robins signed by the whole main deck of the Academy or the Porch.\" De Quincey. (b) (Zoöl.) The cigar fish. -- Round shot, a solid spherical projectile for ordnance. -- Round Table, the table about which sat King Arthur and his knights. See Knights of the Round Table, under Knight. -- Round tower, one of certain lofty circular stone towers, tapering from the base upward, and usually having a conical cap or roof, which crowns the summit, -- found chiefly in Ireland. They are of great antiquity, and vary in heigh from thirty-five to one hundred and thiry feet. -- Round trot, one in which the horse throws out his feet roundly; a full, brisk, quick trot. Addison. -- Round turn (Naut.), one turn of a rope round a timber, a belaying pin, etc. -- To bring up with a round turn, to stop abruptly. [Colloq.] Syn. -- Circular; spherical; globular; globase; orbicular; orbed; cylindrical; full; plump; rotund.\n\n1. Anything round, as a circle, round\" [the crown]. Shak. In labyrinth of many a round self-rolled. Milton. 2. A series of changes or events ending where it began; a series of like events recurring in continuance; a cycle; a periodical revolution; as, the round of the seasons; a round of pleasures. 3. A course of action or conduct performed by a number of persons in turn, or one after another, as if seated in a circle. Women to cards may be compared: we play A round or two; which used, we throw away. Granville. The feast was served; the bowl was crowned; To the king's pleasure went the mirthful round. Prior. 4. A series of duties or tasks which must be performed in turn, and then repeated. the trivial round, the common task. Keble. 5. A circular dance. Come, knit hands, and beat the ground, In a light fantastic round. Milton. 6. That which goes round a whole circle or company; as, a round of applause. 7. Rotation, as in office; succession. Holyday. 8. The step of a ladder; a rundle or rung; also, a crosspiece which joins and braces the legs of a chair. All the rounds like Jacob's ladder rise. Dryden. 9. A course ending where it began; a circuit; a beat; especially, one freguently or regulary traversed; also, the act of traversing a circuit; as, a watchman's round; the rounds of the postman. 10. (Mil.) (a) A walk performed by a guard or an officer round the rampart of a garrison, or among sentinels, to see that the sentinels are faithful and all things safe; also, the guard or officer, with his attendants, who performs this duty; -- usually in the plural. (b) A general discharge of firearms by a body of troops in which each soldier fires once. (c) Ammunition for discharging a piece or pieces once; as, twenty rounds of ammunition were given out. 11. (Mus.)  A short vocal piece, resembling a catch in which three or four voices follow each other round in a species of canon in the unison. 12. The time during which prize fighters or boxers are in actual contest without an intermission, as prescribed by their rules; a bout. 13. A brewer's vessel in which the fermentation is concluded, the yeast escaping through the bunghole. 14. A vessel filled, as for drinking. [R.] 15. An assembly; a group; a circle; as, a round of politicians. Addison. 16. (Naut.)  See Roundtop. 17. Same as Round of beef, below. Gentlemen of the round. (a) Gentlemen soldiers of low rank who made the rounds. See 10 (a), above. (b) Disbanded soldiers who lived by begging. [Obs.] Worm-eaten gentlemen of the round, such as have vowed to sit on the skirts of the city, let your provost and his half dozen of halberdiers do what they can. B. Jonson. -- Round of beef, the part of the thigh below the aitchbone, or between the rump and the leg. See Illust. of beef. -- Round steak, a beefsteak cut from the round. -- Sculpture in the round, sculpture giving the full form, as of man; statuary, distinguished from relief.\n\n1. On all sides; around. Round he throws his baleful eyes. Milton. 2. Circularly; in a circular form or manner; by revolving or reversing one's position; as, to turn one's head round; a wheel turns round. 3. In circumference; as, a ball is ten inches round. 4. From one side or party to another; as to come or turn round, -- that is, to change sides or opinions. 5. By or in a circuit; by a course longer than the direct course; back to the starting point. 6. Through a circle, as of friends or houses. The invitations were sent round accordingly. Sir W. Scott. 7. Roundly; fully; vigorously. [Obs.] Chaucer. All round, over the whole place; in every direction. -- All-round, of general capacity; as, an all-round man. [Colloq.] - - To bring one round. (a) To cause one to change his opinions or line of conduct. (b) To restore one to health. [Colloq.]\n\nOn every side of, so as to encompass or encircle; around; about; as, the people atood round him; to go round the city; to wind a cable round a windlass. The serpent Error twines round human hearts. Cowper. Round about, an emphatic form for round or about. \"Moses . . . set them [The elders] round about the tabernacle.\" Num. xi. 24. -- To come round, to gain the consent of, or circumvent, (a person) by flattery or deception. [Colloq.]\n\n1. To make circular, spherical, or cylindrical; to give a round or convex figure to; as, to round a silver coin; to round the edges of anything. Worms with many feet, which round themselves into balls, are bred chiefly under logs of timber. Bacon. The figures on our modern medals are raised and rounded to a very great perfection. Addison. 2. To surround; to encircle; to encompass. The inclusive verge Of golden metal that must round my brow. Shak. 3. To bring to fullness or completeness; to complete; hence, to bring to a fit conclusion. We are such stuff As dreams are made on, and our little life Is rounded with a sleep. Shak. 4. To go round wholly or in part; to go about (a corner or point); as, to round a corner; to round Cape Horn. 5. To make full, smooth, and flowing; as, to round periods in writing. Swift. To round in (Naut.) To haul up; usually, to haul the slack of (a rope) through its leading block, or to haul up (a tackle which hangs loose) by its fall. Totten. (b) To collect together (cattle) by riding around them, as on cattle ranches. [Western U.S.]\n\n1. To grow round or full; hence, to attain to fullness, completeness, or perfection. The queen your mother rounds apace. Shak. So rounds he to a separate mind, From whence clear memory may begin. Tennyson. 2. To go round, as a guard. [Poetic] They . . . nightly rounding walk. Milton. 3. To go or turn round; to wheel about. Tennyson. To round to (Naut.), to turn the head of a ship toward the wind."}