{"word":"rout","definition":"To roar; to bellow; to snort; to snore loudly. [Obs. or Scot.] Chaucer.\n\nA bellowing; a shouting; noise; clamor; uproar; disturbance; tumult. Shak. This new book the whole world makes such a rout about. Sterne. \"My child, it is not well,\" I said, \"Among the graves to shout; To laugh and play among the dead, And make this noisy rout.\" Trench.\n\nTo scoop out with a gouge or other tool; to furrow. To rout out (a) To turn up to view, as if by rooting; to discover; to find. (b) To turn out by force or compulsion; as, to rout people out of bed. [Colloq.]\n\nTo search or root in the ground, as a swine. Edwards.\n\n1. A troop; a throng; a company; an assembly; especially, a traveling company or throng. [Obs.] \"A route of ratones [rats].\" Piers Plowman. \"A great solemn route.\" Chaucer. And ever he rode the hinderest of the route. Chaucer. A rout of people there assembled were. Spenser. 2. A disorderly and tumultuous crowd; a mob; hence, the rabble; the herd of common people. the endless routs of wretched thralls. Spenser. The ringleader and head of all this rout. Shak. Nor do I name of men the common rout. Milton. 3. The state of being disorganized and thrown into confusion; -- said especially of an army defeated, broken in pieces, and put to flight in disorder or panic; also, the act of defeating and breaking up an army; as, the rout of the enemy was complete. thy army . . . Dispersed in rout, betook them all to fly. Daniel. To these giad conquest, murderous rout to those. pope. 4. (Law)  A disturbance of the peace by persons assembled together with intent to do a thing which, if executed, would make them rioters, and actually making a motion toward the executing thereof. Wharton. 5. A fashionable assembly, or large evening party. \"At routs and dances.\" Landor. To put to rout, to defeat and throw into confusion; to overthrow and put to flight.\n\nTo break the ranks of, as troops, and put them to flight in disorder; to put to rout. That party . . . that charged the Scots, so totally routed and defeated their whole army, that they fied. Clarendon. Syn. -- To defeat; discomfit; overpower; overthrow.\n\nTo assemble in a crowd, whether orderly or disorderly; to collect in company. [obs.] Bacon. In all that land no Christian[s] durste route. Chaucer."}