{"word":"royal","definition":"1. Kingly; pertaining to the crown or the sovereign; suitable for a king or queen; regal; as, royal power or prerogative; royal domains; the royal family; royal state. 2. Noble; generous; magnificent; princely. How doth that royal merchant, good Antonio Shak. 3. Under the patronage of royality; holding a charter granted by the sovereign; as, the Royal Academy of Arts; the Royal Society. Battle royal. See under Battle. -- Royal bay (Bot.), the classic laurel (Laurus nobilis.) -- Royal eagle. (Zoöl.) See Golden eagle, under Golden. -- Royal fern (Bot.), the handsome fern Osmunda regalis. See Osmund. -- Royal mast (Naut.), the mast next above the topgallant mast and usually the highest on a square-rigged vessel. The royal yard and royal sail are attached to the royal mast. -- Royal metal, an old name for gold. -- Royal palm (Bot.), a magnificent West Indian palm tree (Oreodoxa regia), lately discovered also in Florida. -- Royal pheasant. See Curassow. -- Royal purple, an intense violet color, verging toward blue. -- Royal tern (Zoöl.), a large, crested American tern (Sterna maxima). -- Royal tiger. (Zoöl.) See Tiger. -- Royal touch, the touching of a diseased person by the hand of a king, with the view of restoring to health; -- formerly extensively practiced, particularly for the scrofula, or king's evil. Syn. -- Kingly; regal; monarchical; imperial; kinglike; princely; august; majestic; superb; splendid; illustrious; noble; magnanimous.\n\n1. Printing and writing papers of particular sizes. See under paper, n. 2. (Naut.)  A small sail immediately above the topgallant sail. Totten. 3. (Zoöl.)  One of the upper or distal branches of an antler, as the third and fourth tynes of the antlers of a stag. 4. (Gun.)  A small mortar. 5. (Mil.)  One of the soldiers of the first regiment of foot of the British army, formerly called the Royals, and supposed to be the oldest regular corps in Europe; -- now called the Royal Scots. 6. An old English coin. See Rial."}