{"word":"rule","definition":"1. That which is prescribed or laid down as a guide for conduct or action; a governing direction for a specific purpose; an authoritative enactment; a regulation; a prescription; a precept; as, the rules of various societies; the rules governing a school; a rule of etiquette or propriety; the rules of cricket. We profess to have embraced a religion which contains the most exact rules for the government of our lives. Tillotson. 2. Hence: (a) Uniform or established course of things. 'T is against the rule of nature. Shak. (b) Systematic method or practice; as, my ule is to rise at six o'clock. (c) Ordibary course of procedure; usual way; comon state or condition of things; as, it is a rule to which there are many exeptions. (d) Conduct in general; behavior. [Obs.] This uncivil rule; she shall know of it. Shak. 3. The act of ruling; administration of law; government; empire; authority; control. Obey them that have the rule over you. Heb. xiii. 17. His stern rule the groaning land obeyed. Pope. 4. (Law)  An order regulating the practice of the courts, or an order made between parties to an action or a suit. Wharton. 5. (Math.)  A determinate method prescribed for performing any operation and producing a certain result; as, a rule for extracting the cube root. 6. (Gram.)  A general principle concerning the formation or use of words, or a concise statement thereof; thus, it is a rule in England, that s or es , added to a noun in the singular number, forms the plural of that noun; but \"man\" forms its plural \"men\", and is an exception to the rule. 7. (a) A straight strip of wood, metal, or the like, which serves as a guide in drawing a straight line; a ruler. (b) A measuring instrument consisting of a graduated bar of wood, ivory, metal, or the like, which is usually marked so as to show inches and fractions of an inch, and jointed so that it may be folded compactly. A judicious artist will use his eye, but he will trust only to his rule. South. 8. (Print.) (a) A thin plate of metal (usually brass) of the same height as the type, and used for printing lines, as between columns on the same page, or in tabular work. (b) A composing rule. See under Conposing. As a rule, as a general thing; in the main; usually; as, he behaves well, as a rule. -- Board rule, Caliber rule,etc. See under Board, Caliber, etc. -- Rule joint, a knuckle joint having shoulders that abut when the connected pieces come in line with each other, and thus permit folding in one direction only. -- Rule of three (Arith.), that rule which directs, when three terms are given, how to find a fourth, which shall have the same ratio to the third term as the second has to the first; proportion. See Proportion, 5 (b). -- Rule of thumb, any rude process or operation, like that of using the thumb as a rule in measuring; hence, judgment and practical experience as distinguished from scientific knowledge. Syn. -- regulation; law; precept; maxim; guide; canon; order; method; direction; control; government; sway; empire.\n\n1. To control the will and actions of; to exercise authority or dominion over; to govern; to manage. Chaucer. A bishop then must be blameless; . . . one that ruleth well his own house, having his children in subjection. 1 Tim. iii. 2, 4. 2. To control or direct by influence, counsel, or persuasion; to guide; -- used chiefly in the passive. I think she will be ruled In all respects by me. Shak. 3. To establish or settle by, or as by, a rule; to fix by universal or general consent, or by common practice. That's are ruled case with the schoolmen. Atterbury. 4. (Law)  To require or command by rule; to give as a direction or order of court. 5. To mark with lines made with a pen, pencil, etc., guided by a rule or ruler; to print or mark with lines by means of a rule or other contrivance effecting a similar result; as, to rule a sheet of paper of a blank book. Ruled surface (Geom.), any surface that may be described by a straight line moving according to a given law; -- called also a scroll.\n\n1. To have power or command; to exercise supreme authority; -- often followed by over. By me princes rule, and nobles. Prov. viii. 16. We subdue and rule over all other creatures. Ray. 2. (Law)  To lay down and settle a rule or order of court; to decide an incidental point; to enter a rule. Burril. Bouvier. 3. (Com.)  To keep within a (certain) range for a time; to be in general, or as a rule; as, prices ruled lower yesterday than the day before."}