{"word":"running","definition":"1. Moving or advancing by running. Specifically, of a horse; (a) Having a running gait; not a trotter or pacer. (b) trained and kept for running races; as, a running horse. Law. 2. Successive; one following the other without break or intervention; -- said of periods of time; as, to be away two days running; to sow land two years running. 3. Flowing; easy; cursive; as, a running hand. 4. Continuous; keeping along step by step; as, he stated the facts with a running explanation. \"A running conquest.\" Milton. What are art and science if not a running commentary on Nature Hare. 5. (Bot.)  Extending by a slender climbing or trailing stem; as, a running vine. 6. (med.)  Discharging pus; as, a running sore. Running block (Mech.), a block in an arrangement of pulleys which rises or sinks with the weight which is raised or lowered. -- Running board, a narrow platform extending along the side of a locomotive. -- Running bowsprit (Naut.) Same as Reefing bowsprit. -- Running days (Com.), the consecutive days occupied on a voyage under working days. Simmonds. -- Running fire, a constant fire of musketry or cannon. -- Running gear, the wheels and axles of a vehicle, and their attachments, in distinction from the body; all the working parts of a locomotive or other machine, in distinction from the framework. -- Running hand, a style of rapid writing in which the letters are usually slanted and the words formed without lifting the pen; -- distinguished from round hand. -- Running part (Naut.), that part of a rope that is hauled upon, -- in distinction from the standing part. -- Running rigging (Naut.), that part of a ship's rigging or ropes which passes through blocks, etc.; -- is distinction from standing rigging. -- Running title (Print.), the title of a book or chapter continued from page to page on the upper margin.\n\nThe act of one who, or of that which runs; as, the running was slow. 2. That which runs or flows; the quantity of a liquid which flows in a certain time or during a certain operation; as, the first running of a still. 3. The discharge from an ulcer or other sore. At long running, in the long run. [Obs.] Jer. Taylor."}