{"word":"rush","definition":"1. (Bot.)  A name given to many aquatic or marsh-growing endogenous plants with soft, slender stems, as the species of Juncus and Scirpus. Note: Some species are used in bottoming chairs and plaiting mats, and the pith is used in some places for wicks to lamps and rushlights. 2. The merest trifle; a straw. John Bull's friendship is not worth a rush. Arbuthnot. Bog rush. See under Bog. -- Club rush, any rush of the genus Scirpus. -- Flowering rush. See under Flowering. -- Nut rush (a) Any plant of the genus Scleria, rushlike plants with hard nutlike fruits. (b) A name for several species of Cyperus having tuberous roots. -- Rush broom, an Australian leguminous plant (Viminaria denudata), having long, slender branches. Also, the Spanish broom. See under Candle. -- Rush grass, any grass of the genus Vilfa, grasses with wiry stems and one-flowered spikelets. -- Rush toad (Zoöl.), the natterjack. -- Scouring rush (Bot.) Same as Dutch rush, under Dutch. -- Spike rush, any rushlike plant of the genus Eleocharis, in which the flowers grow in dense spikes. -- Sweet rush, a sweet-scented grass of Arabia, etc. (Andropogon schoenanthus), used in Oriental medical practice. -- Wood rush, any plant of the genus Luzula, which differs in some technical characters from Juncus.\n\n1. To move forward with impetuosity, violence, and tumultuous rapidity or haste; as, armies rush to battle; waters rush down a precipice. Like to an entered tide, they all rush by. Shak. 2. To enter into something with undue haste and eagerness, or without due deliberation and preparation; as, to rush business or speculation. They . . . never think it to be a part of religion to rush into the office of princes and ministers. Sprat.\n\n1. To push or urge forward with impetuosity or violence; to hurry forward. 2. To recite (a lesson) or pass (an examination) without an error. [College Cant, U.S.]\n\n1. A moving forward with rapidity and force or eagerness; a violent motion or course; as, a rush of troops; a rush of winds; a rush of water. A gentleman of his train spurred up his horse, and, with a violent rush, severed him from the duke. Sir H. Wotton. 2. Great activity with pressure; as, a rush of business. [Colloq.] 3. A perfect recitation. [College Cant, U.S.] 4. (Football) (a) A rusher; as, the center rush, whose place is in the center of the rush line; the end rush. (b) The act of running with the ball. Bunt rush (Football), a combined rush by main strength. -- Rush line (Football), the line composed of rushers."}