{"word":"sacred","definition":"1. Set apart by solemn religious ceremony; especially, in a good sense, made holy; set apart to religious use; consecrated; not profane or common; as, a sacred place; a sacred day; sacred service. 2. Relating to religion, or to the services of religion; not secular; religious; as, sacred history. Smit with the love of sacred song. Milton. 3. Designated or exalted by a divine sanction; possessing the highest title to obedience, honor, reverence, or veneration; entitled to extreme reverence; venerable. Such neighbor nearness to our sacred [royal] blood Should nothing privilege him. Shak. Poet and saint to thee alone were given, The two most sacred names of earth and heaven. Cowley. 4. Hence, not to be profaned or violated; inviolable. Secrets of marriage still are sacred held. Dryden. 5. Consecrated; dedicated; devoted; -- with to. A temple, sacred to the queen oflove. Dryden. 6. Solemnly devoted, in a bad sense, as to evil, vengeance, curse, or the like; accursed; baleful. [Archaic] But, to destruction sacred and devote. Milton. Society of the Sacred Heart (R.C. Ch.), a religious order of women, founded in France in 1800, and approved in 1826. It was introduced into America in 1817. The members of the order devote themselves to the higher branches of female education. -- Sacred baboon. (Zoöl.) See Hamadryas. -- Sacred bean (Bot.), a seed of the Oriental lotus (Nelumbo speciosa or Nelimbium speciosum), a plant resembling a water lily; also, the plant itself. See Lotus. -- Sacred beetle (Zoöl.) See Scarab. -- Sacred canon. See Canon, n., 3. -- Sacred fish (Zoöl.), any one of fresh-water African fishes of the family Mormyridæ. Several large species inhabit the Nile and were considered sacred by the ancient Egyptians; especially Mormyris oxyrhynchus. -- Sacred ibis. See Ibis. -- Sacred monkey. (Zoöl.) (a) Any Asiatic monkey of the genus Semnopitchecus, regarded as sacred by the Hindoos; especially, the entellus. See Entellus. (b) The sacred baboon. See Hamadryas. (c) The blunder monkey. -- Sacred place (Civil Law), the place where a deceased person is buried. Syn. -- Holy; divine; hallowed; consecrated; dedicated; devoted; religious; venerable; reverend. -- Sa\"cred*ly, adv. -- Sa\"cred*ness, n."}