{"word":"sacrifice","definition":"1. The offering of anything to God, or to a god; consecratory rite. Great pomp, and sacrifice, and praises loud, To Dagon. Milton. 2. Anything consecrated and offered to God, or to a divinity; an immolated victin, or an offering of any kind, laid upon an altar, or otherwise presented in the way of religious thanksgiving, atonement, or conciliation. Moloch, horrid king, besmeared with blood Of human sacrifice. Milton. My life, if thou preserv's my life, Thy sacrifice shall be. Addison. 3. Destruction or surrender of anything for the sake of something else; devotion of some desirable object in behalf of a higher object, or to a claim deemed more pressing; hence, also, the thing so devoted or given up; as, the sacrifice of interest to pleasure, or of pleasure to interest. 4. A sale at a price less than the cost or the actual value. [Tradesmen's Cant] Burnt sacrifice. See Burnt offering, under Burnt. -- Sacrifice hit (Baseball), in batting, a hit of such a kind that the batter loses his chance of tallying, but enables one or more who are on bases to get home or gain a base.\n\n1. To make an offering of; to consecrate or present to a divinity by way of expiation or propitiation, or as a token acknowledgment or thanksgiving; to immolate on the altar of God, in order to atone for sin, to procure favor, or to express thankfulness; as, to sacrifice an ox or a sheep. Oft sacrificing bullock, lamb, or kid. Milton. 2. Hence, to destroy, surrender, or suffer to be lost, for the sake of obtaining something; to give up in favor of a higher or more imperative object or duty; to devote, with loss or suffering. Condemned to sacrifice his childish years To babbling ignorance, and to empty fears. Prior. The Baronet had sacrificed a large sum . . . for the sake of . . . making this boy his heir. G. Eliot. 3. To destroy; to kill. Johnson. 4. To sell at a price less than the cost or the actual value. [Tradesmen's Cant]\n\nTo make offerings to God, or to a deity, of things consumed on the altar; to offer sacrifice. O teacher, some great mischief hath befallen To that meek man, who well had sacrificed. Milton."}