{"word":"sal","definition":"An East Indian timber tree (Shorea robusta), much used for building purposes. It is of a light brown color, close-grained, and durable. [Written also saul.]\n\nSalt. Sal absinthii Etym: [NL.] (Old Chem.), an impure potassium carbonate obtained from the ashes of wormwood (Artemisia Absinthium). -- Sal acetosell\\'91 Etym: [NL.] (Old Chem.), salt of sorrel. -- Sal alembroth. (Old Chem.) See Alembroth. -- Sal ammoniac (Chem.), ammonium chloride, NH4Cl, a white crystalline volatile substance having a sharp salty taste, obtained from gas works, from nitrogenous matter, etc. It is largely employed as a source of ammonia, as a reagent, and as an expectorant in bronchitis. So called because originally made from the soot from camel's dung at the temple of Jupiter Ammon in Africa. Called also muriate of ammonia. -- Sal catharticus Etym: [NL.] (Old Med. Chem.), Epsom salts. -- Sal culinarius Etym: [L.] (Old Chem.), common salt, or sodium chloride. -- Sal Cyrenaicus. Etym: [NL.] (Old Chem.) See Sal ammoniac above. -- Sal de duobus, Sal duplicatum Etym: [NL.] (Old Chem.), potassium sulphate; -- so called because erroneously supposed to be composed of two salts, one acid and one alkaline. -- Sal diureticus Etym: [NL.] (Old Med. Chem.), potassium acetate. -- Sal enixum Etym: [NL.] (Old Chem.), acid potassium sulphate. -- Sal gemm\\'91 Etym: [NL.] (Old Min.), common salt occuring native. -- Sal Jovis Etym: [NL.] (Old Chem.), salt tin, or stannic chloride; -- the alchemical name of tin being Jove. -- Sal Martis Etym: [NL.] (Old Chem.), green vitriol, or ferrous sulphate; -- the alchemical name of iron being. Mars. -- Sal microcosmicum Etym: [NL.] (Old Chem.) See Microcosmic salt, under Microcosmic. -- Sal plumbi Etym: [NL.] (Old Chem.), sugar of lead. -- Sal prunella. (Old Chem.) See Prunella salt, under 1st Prunella. -- Sal Saturni Etym: [NL.] (Old Chem.), sugar of lead, or lead acetate; -- the alchemical name of lead being Saturn. -- Sal sedativus Etym: [NL.] (Old Chem.), sedative salt, or boric acid. -- Sal Seignette Etym: [F. seignette, sel de seignette] (Chem.), Rochelle salt. -- Sal soda (Chem.), sodium carbonate. See under Sodium. -- Sal vitrioli Etym: [NL.] (Old Chem.), white vitriol; zinc sulphate. -- Sal volatile. Etym: [NL.] (a) (Chem.) See Sal ammoniac, above. (b) Spirits of ammonia."}