{"word":"sand","definition":"1. Fine particles of stone, esp. of siliceous stone, but not reduced to dust; comminuted stone in the form of loose grains, which are not coherent when wet. That finer matter, called sand, is no other than very small pebbles. Woodsward. 2. A single particle of such stone. [R.] Shak. 3. The sand in the hourglass; hence, a moment or interval of time; the term or extent of one's life. The sands are numbered that make up my life. Shak. 4. pl.  Tracts of land consisting of sand, like the deserts of Arabia and Africa; also, extensive tracts of sand exposed by the ebb of the tide. \"The Libyan sands.\" Milton. \"The sands o'Dee.\" C. Kingsley. 5. Courage; pluck; grit. [Slang] Sand badger (Zoöl.), the Japanese badger (Meles ankuma). -- Sand bag (a) A bag filled with sand or earth, used for various purposes, as in fortification, for ballast, etc. (b) A long bag filled with sand, used as a club by assassins. -- Sand ball, soap mixed with sand, made into a ball for use at the toilet. -- Sand bath. (a) (Chem.) A vessel of hot sand in a laboratory, in which vessels that are to be heated are partially immersed. (b) A bath in which the body is immersed in hot sand. -- Sand bed, a thick layer of sand, whether deposited naturally or artificially; specifically, a thick layer of sand into which molten metal is run in casting, or from a reducing furnace. -- Sand birds (Zoöl.), a collective name for numerous species of limicoline birds, such as the sandpipers, plovers, tattlers, and many others; -- called also shore birds. -- Sand blast, a process of engraving and cutting glass and other hard substances by driving sand against them by a steam jet or otherwise; also, the apparatus used in the process. -- Sand box. (a) A box with a perforated top or cover, for sprinkling paper with sand. (b) A box carried on locomotives, from which sand runs on the rails in front of the driving wheel, to prevent slipping. -- Sand-box tree (Bot.), a tropical American tree (Hura crepitans). Its fruit is a depressed many-celled woody capsule which, when completely dry, bursts with a loud report and scatters the seeds. See Illust. of Regma. -- Sand bug (Zoöl.), an American anomuran crustacean (Hippa talpoidea) which burrows in sandy seabeaches. It is often used as bait by fishermen. See Illust. under Anomura. -- Sand canal (Zoöl.), a tubular vessel having a calcareous coating, and connecting the oral ambulacral ring with the madreporic tubercle. It appears to be excretory in function. -- Sand cock (Zoöl.), the redshank. [Prov. Eng.] -- Sand collar. (Zoöl.) Same as Sand saucer, below. -- Sand crab. (Zoöl.) (a) The lady crab. (b) A land crab, or ocypodian. -- Sand crack (Far.), a crack extending downward from the coronet, in the wall of a horse's hoof, which often causes lameness. -- Sand cricket (Zoöl.), any one of several species of large terrestrial crickets of the genus Stenophelmatus and allied genera, native of the sandy plains of the Western United States. -- Sand cusk (Zoöl.), any ophidiod fish. See Illust. under Ophidiod. -- Sand dab (Zoöl.), a small American flounder (Limanda ferruginea); -- called also rusty dab. The name is also applied locally to other allied species. -- Sand darter (Zoöl.), a small etheostomoid fish of the Ohio valley (Ammocrypta pellucida). -- Sand dollar (Zoöl.), any one of several species of small flat circular sea urchins, which live on sandy bottoms, especially Echinarachnius parma of the American coast. -- Sand drift, drifting sand; also, a mound or bank of drifted sand. -- Sand eel. (Zoöl.) (a) A lant, or launce. (b) A slender Pacific Ocean fish of the genus Gonorhynchus, having barbels about the mouth. -- Sand flag, sandstone which splits up into flagstones. -- Sand flea. (Zoöl.) (a) Any species of flea which inhabits, or breeds in, sandy places, especially the common dog flea. (b) the chigoe. (c) Any leaping amphipod crustacean; a beach flea, or orchestian. See Beach flea, under Beach. -- Sand flood, a vast body of sand borne along by the wind. James Bruce. -- Sand fluke. (Zoöl.) (a) The sandnecker. (b) The European smooth dab (Pleuronectes microcephalus); -- called also kitt, marysole, smear dab, town dab. -- Sand fly (Zoöl.), any one of several species of small dipterous flies of the genus Simulium, abounding on sandy shores, especially Simulium nocivum of the United States. They are very troublesome on account of their biting habits. Called also no-see-um, punky, and midge. -- Sand gall (Geol.) See Sand pipe, below. -- Sand grass (Bot.), any species of grass which grows in sand; especially, a tufted grass (Triplasis purpurea) with numerous bearded joints, and acid awl-shaped leaves, growing on the Atlantic coast. -- Sand grouse (Zoöl.), any one of many species of Old World birds belonging to the suborder Pterocletes, and resembling both grouse and pigeons. Called also rock grouse, rock pigeon, and ganga. They mostly belong to the genus Pterocles, as the common Indian species (P. exustus). The large sand grouse (P. arenarius), the painted sand grouse (P. fasciatus), and the pintail sand grouse (P. alchata) are also found in India. See Illust. under Pterocletes. -- Sand hill, a hill of sand; a dune. -- Sand-hill crane (Zoöl.), the American brown crane (Grus Mexicana). -- Sand hopper (Zoöl.), a beach flea; an orchestian. -- Sand hornet (Zoöl.), a sand wasp. -- Sand lark. (Zoöl.) (a) A small lark (Alaudala raytal), native of India. (b) A small sandpiper, or plover, as the ringneck, the sanderling, and the common European sandpiper. (c) The Australian red-capped dotterel (Ægialophilus ruficapillus); -- called also red- necked plover. -- Sand launce (Zoöl.), a lant, or launce. -- Sand lizard (Zoöl.), a common European lizard (Lacerta agilis). -- Sand martin (Zoöl.), the bank swallow. -- Sand mole (Zoöl.), the coast rat. -- Sand monitor (Zoöl.), a large Egyptian lizard (Monitor arenarius) which inhabits dry localities. -- Sand mouse (Zoöl.), the dunlin. [Prov. Eng.] -- Sand myrtle. (Bot.) See under Myrtle. -- Sand partridge (Zoöl.), either of two small Asiatic partridges of the genus Ammoperdix. The wings are long and the tarsus is spurless. One species (A. Heeji) inhabits Palestine and Arabia. The other species (A. Bonhami), inhabiting Central Asia, is called also seesee partridge, and teehoo. -- Sand picture, a picture made by putting sand of different colors on an adhesive surface. -- Sand pike. (Zoöl.) (a) The sauger. (b) The lizard fish. -- Sand pillar, a sand storm which takes the form of a whirling pillar in its progress in desert tracts like those of the Sahara and Mongolia. -- Sand pipe (Geol.), a tubular cavity, from a few inches to several feet in dept, occurring especially in calcareous rocks, and often filled with gravel, sand, etc.; -- called also sand gall. -- Sand pride (Zoöl.), a small british lamprey now considered to be the young of larger species; -- called also sand prey. -- Sand pump, in artesian well boring, a long, slender bucket with a valve at the bottom for raising sand from the well. -- Sand rat (Zoöl.), the pocket gopher. -- Sand rock, a rock made of cemented sand. -- Sand runner (Zoöl.), the turnstone. -- Sand saucer (Zoöl.), the mass of egg capsules, or oöthecæ, of any mollusk of the genus Natica and allied genera. It has the shape of a bottomless saucer, and is coated with fine sand; -- called also sand collar. -- Sand screw (Zoöl.), an amphipod crustacean (Lepidactylis arenarius), which burrows in the sandy seabeaches of Europe and America. -- Sand shark (Zoöl.), an American shark (Odontaspis littoralis) found on the sandy coasts of the Eastern United States; -- called also gray shark, and dogfish shark. See Illust. under Remora. -- Sand skink (Zoöl.), any one of several species of Old World lizards belonging to the genus Seps; as, the ocellated sand skink (Seps ocellatus) of Southern Europe. -- Sand skipper (Zoöl.), a beach flea, or orchestian. -- Sand smelt (Zoöl.), a silverside. -- Sand snake. (Zoöl.) (a) Any one of several species of harmless burrowing snakes of the genus Eryx, native of Southern Europe, Africa, and Asia, especially E. Jaculus of India and E. Johnii, used by snake charmers. (b) Any innocuous South African snake of the genus Psammophis, especially P. sibilans. -- Sand snipe (Zoöl.), the sandpiper. -- Sand star (Zoöl.), an ophiurioid starfish living on sandy sea bottoms; a brittle star. -- Sand storm, a cloud of sand driven violently by the wind. -- Sand sucker, the sandnecker. -- Sand swallow (Zoöl.), the bank swallow. See under Bank. -- Sand tube, a tube made of sand. Especially: (a) A tube of vitrified sand, produced by a stroke of lightning; a fulgurite. (b) (Zoöl.) Any tube made of cemented sand. (c) (Zoöl. ) In starfishes, a tube having calcareous particles in its wall, which connects the oral water tube with the madreporic plate. -- Sand viper. (Zoöl.) See Hognose snake. -- Sand wasp (Zoöl.), any one of numerous species of hymenopterous insects belonging to the families Pompilidæ and Spheridæ, which dig burrows in sand. The female provisions the nest with insects or spiders which she paralyzes by stinging, and which serve as food for her young.\n\n1. To sprinkle or cover with sand. 2. To drive upon the sand. [Obs.] Burton. 3. To bury (oysters) beneath drifting sand or mud. 4. To mix with sand for purposes of fraud; as, to sand sugar. [Colloq.]"}