{"word":"saw","definition":"imp. of See.\n\n1. Something said; speech; discourse. [Obs.] \"To hearken all his sawe.\" Chaucer. 2. A saying; a proverb; a maxim. His champions are the prophets and apostles, His weapons holy saws of sacred writ. Shak. 3. Dictate; command; decree. [Obs.] [Love] rules the creatures by his powerful saw. Spenser.\n\nAn instrument for cutting or dividing substances, as wood, iron, etc., consisting of a thin blade, or plate, of steel, with a series of sharp teeth on the edge, which remove successive portions of the material by cutting and tearing. Note: Saw is frequently used adjectively, or as the first part of a compound. Band saw, Crosscut saw, etc. See under Band, Crosscut, etc. -- Circular saw, a disk of steel with saw teeth upon its periphery, and revolved on an arbor. -- Saw bench, a bench or table with a flat top for for sawing, especially with a circular saw which projects above the table. -- Saw file, a three-cornered file, such as is used for sharpening saw teeth. -- Saw frame, the frame or sash in a sawmill, in which the saw, or gang of saws, is held. -- Saw gate, a saw frame. -- Saw gin, the form of cotton gin invented by Eli Whitney, in which the cotton fibers are drawn, by the teeth, of a set of revolving circular saws, through a wire grating which is too fine for the seeds to pass. -- Saw grass (Bot.), any one of certain cyperaceous plants having the edges of the leaves set with minute sharp teeth, especially the Cladium effusum of the Southern United States. Cf. Razor grass, under Razor. -- Saw log, a log of suitable size for sawing into lumber. -- Saw mandrel, a mandrel on which a circular saw is fastened for running. -- Saw pit, a pit over which timbor is sawed by two men, one standing below the timber and the other above. Mortimer. -- Saw sharpener (Zoöl.), the great titmouse; -- so named from its harsh call note. [Prov. Eng.] -- Saw whetter (Zoöl.), the marsh titmouse (Parus palustris); -- so named from its call note. [Prov. Eng.] -- Scroll saw, a ribbon of steel with saw teeth upon one edge, stretched in a frame and adapted for sawing curved outlines; also, a machine in which such a saw is worked by foot or power.\n\n1. To cut with a saw; to separate with a saw; as, to saw timber or marble. 2. To form by cutting with a saw; as, to saw boards or planks, that is, to saw logs or timber into boards or planks; to saw shingles; to saw out a panel. 3. Also used figuratively; as, to saw the air.\n\n1. To use a saw; to practice sawing; as, a man saws well. 2. To cut, as a saw; as, the saw or mill saws fast. 3. To be cut with a saw; as, the timber saws smoothly."}