{"word":"scene","definition":"1. The structure on which a spectacle or play is exhibited; the part of a theater in which the acting is done, with its adjuncts and decorations; the stage. 2. The decorations and fittings of a stage, representing the place in which the action is supposed to go on; one of the slides, or other devices, used to give an appearance of reality to the action of a play; as, to paint scenes; to shift the scenes; to go behind the scenes. 3. So much of a play as passes without change of locality or time, or important change of character; hence, a subdivision of an act; a separate portion of a play, subordinate to the act, but differently determined in different plays; as, an act of four scenes. My dismal scene I needs must act alone. Shak. 4. The place, time, circumstance, etc., in which anything occurs, or in which the action of a story, play, or the like, is laid; surroundings amid which anything is set before the imagination; place of occurence, exhibition, or action. \"In Troy, there lies the scene.\" Shak. The world is a vast scene of strife. J. M. Mason. 5. An assemblage of objects presented to the view at once; a series of actions and events exhibited in their connection; a spectacle; a show; an exhibition; a view. Through what new scenes and changes must we pass! Addison. 6. A landscape, or part of a landscape; scenery. A sylvan scene with various greens was drawn, Shades on the sides, and in the midst a lawn. Dryden. 7. An exhibition of passionate or strong feeling before others; often, an artifical or affected action, or course of action, done for effect; a theatrical display. Probably no lover of scenes would have had very long to wait De Quincey. Behind the scenes, behind the scenery of a theater; out of the view of the audience, but in sight of the actors, machinery, etc.; hence, conversant with the hidden motives and agencies of what appears to public view.\n\nTo exhibit as a scene; to make a scene of; to display. [Obs.] Abp. Sancroft."}