{"word":"scorpion","definition":"1. (Zoöl.)  Any one of numerous species of pulmonate arachnids of the order scorpiones, having a suctorial mouth, large claw-bearing palpi, and a caudal sting. Note: Scorpions have a flattened body, and a long, slender post- abdomen formed of six movable segments, the last of which terminates in a curved venomous sting. The venom causes great pain, but is unattended either with redness or swelling, except in the axillary or inguinal glands, when an extremity is affected. It is seldom if ever destructive of life. Scorpions are found widely dispersed in the warm climates of both the Old and New Worlds. 2. (Zoöl.)  The pine or gray lizard (Sceloporus undulatus). [Local, U.S.] 3. (Zoöl.)  the scorpene. 4. (Script.)  A painful scourge. My father hath chastised you with whips, but I will chastise you with scorpions. 1 Kings xii. 11. 5. (Astron.)  A sign and constellation. See Scorpio. 6. (Antiq.)  An ancient military engine for hurling stones and other missiles. Book scorpion. (Zoöl.) See under Book. -- False scorpion. (Zoöl.) See under False, and Book scorpion. -- Scorpion bug, or Water scorpion (Zoöl.) See Nepa. -- Scorpion fly (Zoöl.), a neuropterous insect of the genus Panorpa. See Panorpid. -- Scorpion grass (Bot.), a plant of the genus Myosotis. M. palustris is the forget-me-not. -- Sorpion senna (Bot.), a yellow-flowered leguminous shrub (Coronilla Emerus) having a slender joined pod, like a scorpion's tail. The leaves are said to yield a dye like indigo, and to be used sometimes to adulterate senna. -- Scorpion shell (Zoöl.), any shell of the genus Pteroceras. See Pteroceras. -- Scorpion spiders. (Zoöl.), any one of the Pedipalpi. -- Scorpion's tail (Bot.), any plant of the leguminous genus Scorpiurus, herbs with a circinately coiled pod; -- also called caterpillar. -- Scorpion's thorn (Bot.), a thorny leguminous plant (Genista Scorpius) of Southern Europe. -- The Scorpion's Heart (Astron.), the star Antares in the constellation Scorpio."}