{"word":"score","definition":"1. A notch or incision; especially, one that is made as a tally mark; hence, a mark, or line, made for the purpose of account. Whereas, before, our forefathers had no other books but the score and the tally, thou hast caused printing to be used. Shak. 2. An account or reckoning; account of dues; bill; hence, indebtedness. He parted well, and paid his score. Shak. 3. Account; reason; motive; sake; behalf. But left the trade, as many more Have lately done on the same score. Hudibras. You act your kindness in Cydria's score. Dryden. 4. The number twenty, as being marked off by a special score or tally; hence, in pl., a large number. Amongst three or four score hogsheads. Shak. At length the queen took upon herself to grant patents of monopoly by score. Macaulay. 5. A distance of twenty yards; -- a term used in ancient archery and gunnery. Halliwell. 6. A weight of twenty pounds. [Prov. Eng.] 7. The number of points gained by the contestants, or either of them, in any game, as in cards or cricket. 8. line drawn; a groove or furrow. 9. (Mus.)  The original and entire draught, or its transcript, of a composition, with the parts for all the different instruments or voices written on staves one above another, so that they can be read at a glance; -- so called from the bar, which, in its early use, was drawn through all the parts. Moore (Encyc. of Music). In score (Mus.), having all the parts arranged and placed in juxtaposition. Smart. -- To quit scores, to settle or balance accounts; to render an equivalent; to make compensation. Does not the earth quit scores with all the elements in the noble fruits that issue from it South.\n\n1. To mark with lines, scratches, or notches; to cut notches or furrows in; to notch; to scratch; to furrow; as, to score timber for hewing; to score the back with a lash. Let us score their backs. Shak. A briar in that tangled wilderness Had scored her white right hand. M. Arnold. 2. Especially, to mark with significant lines or notches, for indicating or keeping account of something; as, to score a tally. 3. To mark or signify by lines or notches; to keep record or account; to set down; to record; to charge. Madam, I know when, Instead of five, you scored me ten. Swift. Nor need I tallies thy dear love to score. Shak. 4. To engrave, as upon a shield. [R.] Spenser. 5. To make a score of, as points, runs, etc., in a game. 6. (Mus.)  To write down in proper order and arrangement; as, to score an overture for an orchestra. See Score, n., 9. 7. (Geol.)  To mark with parallel lines or scratches; as, the rocks of New England and the Western States were scored in the drift epoch."}