{"word":"scratch","definition":"1. To rub and tear or mark the surface of with something sharp or ragged; to scrape, roughen, or wound slightly by drawing something pointed or rough across, as the claws, the nails, a pin, or the like. Small sand-colored stones, so hard as to scratch glass.Grew. Be mindful, when invention fails., To scratch your head, and bite your nails.Swift. 2. To write or draw hastily or awkwardly. Scratch out a pamphlet.\" Swift. 3. To cancel by drawing one or more lines through, as the name of a candidate upon a ballot, or of a horse in a list; hence, to erase; to efface; -- often with out. 4. To dig or excavate with the claws; as, some animals scratch holes, in which they burrow. To scratch a ticket, to cancel one or more names of candidates on a party ballot; to refuse to vote the party ticket in its entirety. [U.S.]\n\n1. To use the claws or nails in tearing or in digging; to make scratches. Dull, tame things, . . . that will neither bite nor scratch. Dr. H. More. 2. (Billiards)  To score, not by skillful play but by some fortunate chance of the game. [Cant, U.S.]\n\n1. A break in the surface of a thing made by scratching, or by rubbing with anything pointed or rough; a slight wound, mark, furrow, or incision. The coarse file . . . makes deep scratches in the work. Moxon. These nails with scratches deform my breast. Prior. God forbid a shallow scratch should drive The prince of Wales from such a field as this. Shak. 2. (Pugilistic Matches)  A line across the prize ring; up to which boxers are brought when they join fight; hence, test, trial, or proof of courage; as, to bring to the scratch; to come up to the scratch. [Cant] Grose. 3. pl. (Far.)  Minute, but tender and troublesome, excoriations, covered with scabs, upon the heels of horses which have been used where it is very wet or muddy. Law (Farmer's Veter. Adviser). 4. A kind of wig covering only a portion of the head. 5. (Billiards)  A shot which scores by chance and not as intended by the player; a fluke. [Cant, U.S.] Scratch cradle. See Cratch cradle, under Cratch. -- Scratch grass (Bot.), a climbing knotweed (Polygonum sagittatum) with a square stem beset with fine recurved prickles along the angles. -- Scratch wig. Same as Scratch, 4, above. Thackeray.\n\nMade, done, or happening by chance; arranged with little or no preparation; determined by circumstances; haphazard; as, a scratch team; a scratch crew for a boat race; a scratch shot in billiards. [Slang] Scratch race, one without restrictions regarding the entrance of competitors; also, one for which the competitors are chosen by lot."}