{"word":"sea","definition":"1. One of the larger bodies of salt water, less than an ocean, found on the earth's surface; a body of salt water of second rank, generally forming part of, or connecting with, an ocean or a larger sea; as, the Mediterranean Sea; the Sea of Marmora; the North Sea; the Carribean Sea. 2. An inland body of water, esp. if large or if salt or brackish; as, the Caspian Sea; the Sea of Aral; sometimes, a small fresh-water lake; as, the Sea of Galilee. 3. The ocean; the whole body of the salt water which covers a large part of the globe. I marvel how the fishes live in the sea. Shak. Ambiguous between sea and land The river horse and scaly crocodile. Milton. 4. The swell of the ocean or other body of water in a high wind; motion of the water's surface; also, a single wave; a billow; as, there was a high sea after the storm; the vessel shipped a sea. 5. (Jewish Antiq.)  A great brazen laver in the temple at Jerusalem; -- so called from its size. He made a molten sea of ten cubits from brim to brim, round in compass, and five cubits the height thereof. 2 Chron. iv. 2. 6. Fig.: Anything resembling the sea in vastness; as, a sea of glory. Shak. All the space . . . was one sea of heads. Macaulay. Note: Sea is often used in the composition of words of obvious signification; as, sea-bathed, sea-beaten, sea-bound, sea-bred, sea- circled, sealike, sea-nursed, sea-tossed, sea-walled, sea-worn, and the like. It is also used either adjectively or in combination with substantives; as, sea bird, sea-bird, or seabird, sea acorn, or sea- acorn. At sea, upon the ocean; away from land; figuratively, without landmarks for guidance; lost; at the mercy of circumstances. \"To say the old man was at sea would be too feeble an expression.\" G. W. Cable -- At full sea at the height of flood tide; hence, at the height. \"But now God's mercy was at full sea.\" Jer. Taylor. -- Beyond seas, or Beyond the sea or the seas (Law), out of the state, territory, realm, or country. Wharton. -- Half seas over, half drunk. [Colloq.] Spectator. -- Heavy sea, a sea in which the waves run high. -- Long sea, a sea characterized by the uniform and steady motion of long and extensive waves. -- Short sea, a sea in which the waves are short, broken, and irregular, so as to produce a tumbling or jerking motion. -- To go to sea, a adopt the calling or occupation of a sailor."}