{"word":"seal","definition":"Any aquatic carnivorous mammal of the families Phocidæ and Otariidæ. Note: Seals inhabit seacoasts, and are found principally in the higher latitudes of both hemispheres. There are numerous species, bearing such popular names as sea lion, sea leopard, sea bear, or ursine seal, fur seal, and sea elephant. The bearded seal (Erignathus barbatus), the hooded seal (Cystophora crustata), and the ringed seal (Phoca foetida), are northern species. See also Eared seal, Harp seal, and Fur seal, under Eared, Harp, Monk, and Fur. Seals are much hunted for their skins and fur, and also for their oil, which in some species is very abundant. Harbor seal (Zoöl.), the common seal (Phoca vitulina). It inhabits both the North Atlantic and the North Pacific Ocean, and often ascends rivers; -- called also marbled seal, native seal, river seal, bay seal, land seal, sea calf, sea cat, sea dog, dotard, ranger, selchie, tangfish.\n\n1. An engraved or inscribed stamp, used for marking an impression in wax or other soft substance, to be attached to a document, or otherwise used by way of authentication or security. 2. Wax, wafer, or other tenacious substance, set to an instrument, and impressed or stamped with a seal; as, to give a deed under hand and seal. Till thou canst rail the seal from off my bond Thou but offend;st thy lungs to speak so loud. Shak. 3. That which seals or fastens; esp., the wax or wafer placed on a letter or other closed paper, etc., to fasten it. 4. That which confirms, ratifies, or makes stable; that which authenticates; that which secures; assurance. \"under the seal of silence.\" Milton. Like a red seal is the setting sun On the good and the evil men have done. Lonfellow. 5. An arrangement for preventing the entrance or return of gas or air into a pipe, by which the open end of the pipe dips beneath the surface of water or other liquid, or a deep bend or sag in the pipe is filled with the liquid; a draintrap. Great seal. See under Great. -- Privy seal. See under Privy, a. -- Seal lock, a lock in which the keyhole is covered by a seal in such a way that the lock can not be opened without rupturing the seal. Seal manual. See under Manual, a. -- Seal ring, a ring having a seal engraved on it, or ornamented with a device resembling a seal; a signet ring. Shak.\n\n1. To set or affix a seal to; hence, to authenticate; to confirm; to ratify; to establish; as, to seal a deed. And with my hand I seal my true heart's love. Shak. 2. To mark with a stamp, as an evidence of standard exactness, legal size, or merchantable quality; as, to seal weights and measures; to seal silverware. 3. To fasten with a seal; to attach together with a wafer, wax, or other substance causing adhesion; as, to seal a letter. 4. Hence, to shut close; to keep close; to make fast; to keep secure or secret. Seal up your lips, and give no words but \"mum\". Shak. 5. To fix, as a piece of iron in a wall, with cement, plaster, or the like. Gwilt. 6. To close by means of a seal; as, to seal a drainpipe with water. See 2d Seal, 5. 7. Among the Mormons, to confirm or set apart as a second or additional wife. [Utah, U.S.] If a man once married desires a second helpmate . . . she is sealed to him under the solemn sanction of the church. H. Stansbury.\n\nTo affix one's seal, or a seal. [Obs.] I will seal unto this bond. Shak."}