{"word":"season","definition":"1. One of the divisions of the year, marked by alternations in the length of day and night, or by distinct conditions of temperature, moisture, etc., caused mainly by the relative position of the earth with respect to the sun. In the north temperate zone, four seasons, namely, spring, summer, autumn, and winter, are generally recognized. Some parts of the world have three seasons, -- the dry, the rainy, and the cold; other parts have but two, -- the dry and the rainy. The several seasons of the year in their beauty. Addison. 2. Hence, a period of time, especially as regards its fitness for anything contemplated or done; a suitable or convenient time; proper conjuncture; as, the season for planting; the season for rest. The season, prime for sweetest scents and airs. Milton. 3. A period of time not very long; a while; a time. Thou shalt be blind, not seeing the sun for a season. Acts xiii. 11. 4. That which gives relish; seasoning. [Obs.] You lack the season of all natures, sleep. Shak. In season, in good time, or sufficiently early for the purpose. -- Out of season, beyond or out of the proper time of the usual or appointed time.\n\n1. To render suitable or appropriate; to prepare; to fit. He is fit and seasoned for his passage. Shak. 2. To fit for any use by time or habit; to habituate; to accustom; to inure; to ripen; to mature; as, to season one to a climate. 3. Hence, to prepare by drying or hardening, or removal of natural juices; as, to season timber. 4. To fit for taste; to render palatable; to give zest or relish to; to spice; as, to season food. 5. Hence, to fit for enjoyment; to render agrecable. You season still with sports your serious hours. Dryden. The proper use of wit is to season conversation. Tillotson. 6. To qualify by admixture; to moderate; to temper. \"When mercy seasons justice.\" Shak. 7. To imbue; to tinge or taint. \"Who by his tutor being seasoned with the love of the truth.\" Fuller. Season their younger years with prudent and pious principles. Jer. Taylor. 8. To copulate with; to impregnate. [R.] Holland.\n\n1. To become mature; to grow fit for use; to become adapted to a climate. 2. To become dry and hard, by the escape of the natural juices, or by being penetrated with other substance; as, timber seasons in the sun. 3. To give token; to savor. [Obs.] Beau. & Fl."}