{"word":"second","definition":"1. Immediately following the first; next to the first in order of place or time; hence, occuring again; another; other. And he slept and dreamed the second time. Gen. xli. 5. 2. Next to the first in value, power, excellence, dignity, or rank; secondary; subordinate; inferior. May the day when we become the second people upon earth . . . be the day of our utter extirpation. Landor. 3. Being of the same kind as another that has preceded; another, like a protype; as, a second Cato; a second Troy; a second deluge. A Daniel, still say I, a second Daniel! Shak. Second Adventist. See Adventist. -- Second cousin, the child of a cousin. -- Second-cut file. See under File. -- Second distance (Art), that part of a picture between the foreground and the background; -- called also middle ground, or middle distance. [R.] -- Second estate (Eng.), the House of Peers. -- Second girl, a female house-servant who does the lighter work, as chamber work or waiting on table. -- Second intention. See under Intention. -- Second story, Story floor, in America, the second range of rooms from the street level. This, in England, is called the first floor, the one beneath being the ground floor. -- Second thought or thoughts, consideration of a matter following a first impulse or impression; reconsideration. On second thoughts, gentlemen, I don't wish you had known him. Dickens.\n\n1. One who, or that which, follows, or comes after; one next and inferior in place, time, rank, importance, excellence, or power. Man an angel's second, nor his second long. Young. 2. One who follows or attends another for his support and aid; a backer; an assistant; specifically, one who acts as another's aid in a duel. Being sure enough of seconds after the first onset. Sir H. Wotton. 3. Aid; assistance; help. [Obs.] Give second, and my love Is everlasting thine. J. Fletcher. 4. pl.  An article of merchandise of a grade inferior to the best; esp., a coarse or inferior kind of flour. 5. Etym: [F. seconde. See Second, a.]  The sixtieth part of a minute of time or of a minute of space, that is, the second regular subdivision of the degree; as, sound moves about 1,140 English feet in a second; five minutes and ten seconds north of this place. 6. In the duodecimal system of mensuration, the twelfth part of an inch or prime; a line. See Inch, and Prime, n., 8. 7. (Mus.) (a) The interval between any tone and the tone which is represented on the degree of the staff next above it. (b) The second part in a concerted piece; -- often popularly applied to the alto. Second hand, the hand which marks the seconds on the dial of a watch or a clock.\n\n1. To follow in the next place; to succeed; to alternate. [R.] In the method of nature, a low valley is immediately seconded with an ambitious hill. Fuller. Sin is seconded with sin. South. 2. To follow or attend for the purpose of assisting; to support; to back; to act as the second of; to assist; to forward; to encourage. We have supplies to second our attempt. Shak. In human works though labored on with pain, A thousand movements scarce one purpose gain; In God's, one single can its end produce, Yet serves to second too some other use. Pope. 3. Specifically, to support, as a motion or proposal, by adding one's voice to that of the mover or proposer."}