{"word":"section","definition":"1. The act of cutting, or separation by cutting; as, the section of bodies. 2. A part separated from something; a division; a portion; a slice. Specifically: -- (a) A distinct part or portion of a book or writing; a subdivision of a chapter; the division of a law or other writing; a paragraph; an article; hence, the character §, often used to denote such a division. It is hardly possible to give a distinct view of his several arguments in distinct sections. Locke. (b) A distinct part of a country or people, community, class, or the like; a part of a territory separated by geographical lines, or of a people considered as distinct. The extreme section of one class consists of bigoted dotards, the extreme section of the other consists of shallow and reckless empirics. Macaulay. (c) One of the portions, of one square mile each, into which the public lands of the United States are divided; one thirty-sixth part of a township. These sections are subdivided into quarter sections for sale under the homestead and preëmption laws. 3. (Geom.)  The figure made up of all the points common to a superficies and a solid which meet, or to two superficies which meet, or to two lines which meet. In the first case the section is a superficies, in the second a line, and in the third a point. 4. (Nat. Hist.)  A division of a genus; a group of species separated by some distinction from others of the same genus; -- often indicated by the sign §. 5. (Mus.)  A part of a musical period, composed of one or more phrases. See Phrase. 6. The description or representation of anything as it would appear if cut through by any intersecting plane; depiction of what is beyond a plane passing through, or supposed to pass through, an object, as a building, a machine, a succession of strata; profile. Note: In mechanical drawing, as in these Illustrations of a cannon, a longitudinal section (a) usually represents the object as cut through its center lengthwise and vertically; a cross or transverse section (b), as cut crosswise and vertically; and a horizontal section (c), as cut through its center horizontally. Oblique sections are made at various angles. In architecture, a vertical section is a drawing showing the interior, the thickness of the walls, ets., as if made on a vertical plane passed through a building. Angular sections (Math.), a branch of analysis which treats of the relations of sines, tangents, etc., of arcs to the sines, tangents, etc., of their multiples or of their parts. [R.] -- Conic sections. (Geom.) See under Conic. -- Section liner (Drawing), an instrument to aid in drawing a series of equidistant parallel lines, -- used in representing sections. -- Thin sections, a section or slice, as of mineral, animal, or vegetable substance, thin enough to be transparent, and used for study under the microscope. Syn. -- Part; portion; division. -- Section, Part. The English more commonly apply the word section to a part or portion of a body of men; as, a section of the clergy, a small section of the Whigs, etc. In the United States this use is less common, but another use, unknown or but little known in England, is very frequent, as in the phrases \"the eastern section of our country,\" etc., the same sense being also given to the adjective sectional as, sectional feelings, interests, etc."}