{"word":"self","definition":"Same; particular; very; identical. [Obs., except in the compound selfsame.] \"On these self hills.\" Sir. W. Raleigh. To shoot another arrow that self way Which you did shoot the first. Shak. At that self moment enters Palamon. Dryden.\n\n1. The individual as the object of his own reflective consciousness; the man viewed by his own cognition as the subject of all his mental phenomena, the agent in his own activities, the subject of his own feelings, and the possessor of capacities and character; a person as a distinct individual; a being regarded as having personality. \"Those who liked their real selves.\" Addison. A man's self may be the worst fellow to converse with in the world. Pope. The self, the I, is recognized in every act of intelligence as the subject to which that act belongs. It is I that perceive, I that imagine, I that remember, I that attend, I that compare, I that feel, I that will, I that am conscious. Sir W. Hamilton. 2. Hence, personal interest, or love of private interest; selfishness; as, self is his whole aim. 3. Personification; embodiment. [Poetic.] She was beauty's self. Thomson. Note: Self is united to certain personal pronouns and pronominal adjectives to express emphasis or distinction. Thus, for emphasis; I myself will write; I will examine for myself; thou thyself shalt go; thou shalt see for thyself; you yourself shall write; you shall see for yourself; he himself shall write; he shall examine for himself; she herself shall write; she shall examine for herself; the child itself shall be carried; it shall be present itself. It is also used reflexively; as, I abhor myself; thou enrichest thyself; he loves himself; she admires herself; it pleases itself; we walue ourselves; ye hurry yourselves; they see themselves. Himself, herself, themselves, are used in the nominative case, as well as in the objective. \"Jesus himself baptized not, but his disciples.\" John iv. 2. Note: Self is used in the formation of innumerable compounds, usually of obvious signification, in most of which it denotes either the agent or the object of the action expressed by the word with which it is joined, or the person in behalf of whom it is performed, or the person or thing to, for, or towards whom or which a quality, attribute, or feeling expressed by the following word belongs, is directed, or is exerted, or from which it proceeds; or it denotes the subject of, or object affected by, such action, quality, attribute, feeling, or the like; as, self-abandoning, self-abnegation, self- abhorring, self-absorbed, self-accusing, self-adjusting, self- balanced, self-boasting, self-canceled, self-combating, self- commendation, self-condemned, self-conflict, self-conquest, self- constituted, self-consumed, self-contempt, self-controlled, self- deceiving, self-denying, self-destroyed, self-disclosure, self- display, self-dominion, self-doomed, self-elected, self-evolved, self-exalting, self-excusing, self-exile, self-fed, self-fulfillment, self-governed, self-harming, self-helpless, self-humiliation, self- idolized, self-inflicted, self-improvement, self-instruction, self- invited, self-judging, self-justification, self-loathing, self- loving, self-maintenance, self-mastered, self-nourishment, self- perfect, self-perpetuation, self-pleasing, self-praising, self- preserving, self-questioned, self-relying, self-restraining, self- revelation, self-ruined, self-satisfaction, self-support, self- sustained, self-sustaining, self-tormenting, self-troubling, self- trust, self-tuition, self-upbraiding, self-valuing, self-worshiping, and many others."}