{"word":"sense","definition":"1. (Physiol.)  A faculty, possessed by animals, of perceiving external objects by means of impressions made upon certain organs (sensory or sense organs) of the body, or of perceiving changes in the condition of the body; as, the senses of sight, smell, hearing, taste, and touch. See Muscular sense, under Muscular, and Temperature sense, under Temperature. Let fancy still my sense in Lethe steep. Shak. What surmounts the reach Of human sense I shall delineate. Milton. The traitor Sense recalls The soaring soul from rest. Keble. 2. Perception by the sensory organs of the body; sensation; sensibility; feeling. In a living creature, though never so great, the sense and the affects of any one part of the body instantly make a transcursion through the whole. Bacon. 3. Perception through the intellect; apprehension; recognition; understanding; discernment; appreciation. This Basilius, having the quick sense of a lover. Sir P. Sidney. High disdain from sense of injured merit. Milton. 4. Sound perception and reasoning; correct judgment; good mental capacity; understanding; also, that which is sound, true, or reasonable; rational meaning. \"He speaks sense.\" Shak. He raves; his words are loose As heaps of sand, and scattering wide from sense. Dryden. 5. That which is felt or is held as a sentiment, view, or opinion; judgment; notion; opinion. I speak my private but impartial sense With freedom. Roscommon. The municipal council of the city had ceased to speak the sense of the citizens. Macaulay. 6. Meaning; import; signification; as, the true sense of words or phrases; the sense of a remark. So they read in the book in the law of God distinctly, and gave the sense. Neh. viii. 8. I think 't was in another sense. Shak. 7. Moral perception or appreciation. Some are so hardened in wickedness as to have no sense of the most friendly offices. L' Estrange. 8. (Geom.)  One of two opposite directions in which a line, surface, or volume, may be supposed to be described by the motion of a point, line, or surface. Common sense, according to Sir W. Hamilton: (a) \"The complement of those cognitions or convictions which we receive from nature, which all men possess in common, and by which they test the truth of knowledge and the morality of actions.\" (b) \"The faculty of first principles.\" These two are the philosophical significations. (c) \"Such ordinary complement of intelligence, that,if a person be deficient therein, he is accounted mad or foolish.\" (d) When the substantive is emphasized: \"Native practical intelligence, natural prudence, mother wit, tact in behavior, acuteness in the observation of character, in contrast to habits of acquired learning or of speculation.\" -- Moral sense. See under Moral, (a). -- The inner, or internal, sense, capacity of the mind to be aware of its own states; consciousness; reflection. \"This source of ideas every man has wholly in himself, and though it be not sense, as having nothing to do with external objects, yet it is very like it, and might properly enough be called internal sense.\" Locke. -- Sense capsule (Anat.), one of the cartilaginous or bony cavities which inclose, more or less completely, the organs of smell, sight, and hearing. -- Sense organ (Physiol.), a specially irritable mechanism by which some one natural force or form of energy is enabled to excite sensory nerves; as the eye, ear, an end bulb or tactile corpuscle, etc. -- Sense organule (Anat.), one of the modified epithelial cells in or near which the fibers of the sensory nerves terminate. Syn. -- Understanding; reason. -- Sense, Understanding, Reason. Some philosophers have given a technical signification to these terms, which may here be stated. Sense is the mind's acting in the direct cognition either of material objects or of its own mental states. In the first case it is called the outer, in the second the inner, sense. Understanding is the logical faculty, i. e., the power of apprehending under general conceptions, or the power of classifying, arranging, and making deductions. Reason is the power of apprehending those first or fundamental truths or principles which are the conditions of all real and scientific knowledge, and which control the mind in all its processes of investigation and deduction. These distinctions are given, not as established, but simply because they often occur in writers of the present day.\n\nTo perceive by the senses; to recognize. [Obs. or Colloq.] Is he sure that objects are not otherwise sensed by others than they are by him Glanvill."}