{"word":"sensible","definition":"1. Capable of being perceived by the senses; apprehensible through the bodily organs; hence, also, perceptible to the mind; making an impression upon the sense, reason, or understanding; sensible resistance. Air is sensible to the touch by its motion. Arbuthnot. The disgrace was more sensible than the pain. Sir W. Temple. Any very sensible effect upon the prices of things. A. Smith. 2. Having the capacity of receiving impressions from external objects; capable of perceiving by the instrumentality of the proper organs; liable to be affected physsically or mentally; impressible. Would your cambric were sensible as your finger. Shak. 3. Hence: Liable to impression from without; easily affected; having nice perception or acute feeling; sensitive; also, readily moved or affected by natural agents; delicate; as, a sensible thermometer. \"With affection wondrous sensible.\" Shak. 4. Perceiving or having perception, either by the senses or the mind; cognizant; perceiving so clearly as to be convinced; satisfied; persuaded. He [man] can not think at any time, waking or sleeping, without being sensible of it. Locke. They are now sensible it would have been better to comply than to refuse. Addison. 5. Having moral perception; capable of being affected by moral good or evil. 6. Possessing or containing sense or reason; giftedwith, or characterized by, good or common sense; intelligent; wise. Now a sensible man, by and by a fool. Shak. Sensible note or tone (Mus.), the major seventh note of any scale; -- so called because, being but a half step below the octave, or key tone, and naturally leading up to that, it makes the ear sensible of its approaching sound. Called also the leading tone. -- Sensible horizon. See Horizon, n., 2. (a). Syn. -- Intelligent; wise. -- Sensible, Intelligent. We call a man sensible whose judgments and conduct are marked and governed by sound judgment or good common semse. We call one intelligent who is quick and clear in his understanding, i. e., who discriminates readily and nicely in respect to difficult and important distinction. The sphere of the sensible man lies in matters of practical concern; of the intelligent man, in subjects of intellectual interest. \"I have been tired with accounts from sensible men, furnished with matters of fact which have happened within their own knowledge.\" Addison. \"Trace out numerous footsteps . . . of a most wise and intelligent architect throughout all this stupendous fabric.\" Woodward.\n\n1. Sensation; sensibility. [R.] \"Our temper changed . . . which must needs remove the sensible of pain.\" Milton. 2. That which impresses itself on the sense; anything perceptible. Aristotle distinguished sensibles into common and proper. Krauth- Fleming. 3. That which has sensibility; a sensitive being. [R.] This melancholy extends itself not to men only, but even to vegetals and sensibles. Burton."}