{"word":"sentiment","definition":"1. A thought prompted by passion or feeling; a state of mind in view of some subject; feeling toward or respecting some person or thing; disposition prompting to action or expression. The word sentiment, agreeably to the use made of it by our best English writers, expresses, in my own opinion very happily, those complex determinations of the mind which result from the coöperation of our rational powers and of our moral feelings. Stewart. Alike to council or the assembly came, With equal souls and sentiments the same. Pope. 2. Hence, generally, a decision of the mind formed by deliberation or reasoning; thought; opinion; notion; judgment; as, to express one's sentiments on a subject. Sentiments of philosophers about the perception of external objects. Reid. Sentiment, as here and elsewhere employed by Reid in the meaning of opinion (sententia), is not to be imitated. Sir W. Hamilton. 3. A sentence, or passage, considered as the expression of a thought; a maxim; a saying; a toast. 4. Sensibility; feeling; tender susceptibility. Mr. Hume sometimes employs (after the manner of the French metaphysicians) sentiment as synonymous with feeling; a use of the word quite unprecedented in our tongue. Stewart. Less of sentiment than sense. Tennyson. Syn. -- Thought; opinion; notion; sensibility; feeling. -- Sentiment, Opinion, Feeling. An opinion is an intellectual judgment in respect to any and every kind of truth. Feeling describes those affections of pleasure and pain which spring from the exercise of our sentient and emotional powers. Sentiment (particularly in the plural) lies between them, denoting settled opinions or principles in regard to subjects which interest the feelings strongly, and are presented more or less constantly in practical life. Hence, it is more appropriate to speak of our religious sentiments than opinions, unless we mean to exclude all reference to our feelings. The word sentiment, in the singular, leans ordinarily more to the side of feeling, and denotes a refined sensibility on subjects affecting the heart. \"On questions of feeling, taste, observation, or report, we define our sentiments. On questions of science, argument, or metaphysical abstraction, we define our opinions. The sentiments of the heart. The opinions of the mind . . . There is more of instinct in sentiment, and more of definition in opinion. The admiration of a work of art which results from first impressions is classed with our sentiments; and, when we have accounted to ourselves for the approbation, it is classed with our opinions.\" W. Taylor."}