{"word":"serpent","definition":"1. (Zoöl.)  Any reptile of the order Ophidia; a snake, especially a large snake. See Illust. under Ophidia. Note: The serpents are mostly long and slender, and move partly by bending the body into undulations or folds and pressing them against objects, and partly by using the free edges of their ventral scales to cling to rough surfaces. Many species glide swiftly over the ground, some burrow in the earth, others live in trees. A few are entirely aquatic, and swim rapidly. See Ophidia, and Fang. 2. Fig.: A subtle, treacherous, malicious person. 3. A species of firework having a serpentine motion as it passess through the air or along the ground. 4. (Astron.)  The constellation Serpens. 5. (Mus.)  A bass wind instrument, of a loud and coarse tone, formerly much used in military bands, and sometimes introduced into the orchestra; -- so called from its form. Pharaoh's serpent (Chem.), mercuric sulphocyanate, a combustible white substance which in burning gives off a poisonous vapor and leaves a peculiar brown voluminous residue which is expelled in a serpentine from. It is employed as a scientific toy. -- Serpent cucumber (Bot.), the long, slender, serpentine fruit of the cucurbitaceous plant Trichosanthes colubrina; also, the plant itself. -- Serpent eage (Zoöl.), any one of several species of raptorial birds of the genera Circaëtus and Spilornis, which prey on serpents. They inhabit Africa, Southern Europe, and India. The European serpent eagle is Circaëtus Gallicus. -- Serpent eater. (Zoöl.) (a) The secretary bird. (b) An Asiatic antelope; the markhoor. -- Serpent fish (Zoöl.), a fish (Cepola rubescens) with a long, thin, compressed body, and a band of red running lengthwise. -- Serpent star (Zoöl.), an ophiuran; a brittle star. -- Serpent's tongue (Paleon.), the fossil tooth of a shark; -- so called from its resemblance to a tongue with its root. -- Serpent withe (Bot.), a West Indian climbing plant (Aristolochia odoratissima). -- Tree serpent (Zoöl.), any species of African serpents belonging to the family Dendrophidæ.\n\nTo wind like a serpent; to crook about; to meander. [R.] \"The serpenting of the Thames.\" Evelyn.\n\nTo wind; to encircle. [R.] Evelyn."}