{"word":"service","definition":"A name given to several trees and shrubs of the genus Pyrus, as Pyrus domestica and P. torminalis of Europe, the various species of mountain ash or rowan tree, and the American shad bush (see Shad bush, under Shad). They have clusters of small, edible, applelike berries. Service berry (Bot.), the fruit of any kind of service tree. In British America the name is especially applied to that of the several species or varieties of the shad bush (Amelanchier.)\n\nA name given to several trees and shrubs of the genus Pyrus, as Pyrus domestica and P. torminalis of Europe, the various species of mountain ash or rowan tree, and the American shad bush (see Shad bush, under Shad). They have clusters of small, edible, applelike berries. Service berry (Bot.), the fruit of any kind of service tree. In British America the name is especially applied to that of the several species or varieties of the shad bush (Amelanchier.)\n\n1. The act of serving; the occupation of a servant; the performance of labor for the benefit of another, or at another's command; attendance of an inferior, hired helper. slave, etc., on a superior, employer, master, or the like; also, spiritual obedience and love. \"O God . . . whose service is perfect freedom.\" Bk. of Com. Prayer. Madam, I entreat true peace of you, Which I will purchase with my duteous service. Shak. God requires no man's service upon hard and unreasonable terms. Tillotson. 2. The deed of one who serves; labor performed for another; duty done or required; office. I have served him from the hour of my nativity, . . . and have nothing at his hands for my service but blows. Shak. This poem was the last piece of service I did for my master, King Charles. Dryden. To go on the forlorn hope is a service of peril; who will understake it if it be not also a service of honor Macaulay. 3. Office of devotion; official religious duty performed; religious rites appropriate to any event or ceremonial; as, a burial service. The outward service of ancient religion, the rites, ceremonies, and ceremonial vestments of the old law. Coleridge. 4. Hence, a musical composition for use in churches. 5. Duty performed in, or appropriate to, any office or charge; official function; hence, specifically, military or naval duty; performance of the duties of a soldier. When he cometh to experience of service abroad . . . ne maketh a worthy soldier. Spenser. 6. Useful office; advantage conferred; that which promotes interest or happiness; benefit; avail. The stork's plea, when taken in a net, was the service she did in picking up venomous creatures. L'Estrange. 7. Profession of respect; acknowledgment of duty owed. \"Pray, do my service to his majesty.\" Shak. 8. The act and manner of bringing food to the persons who eat it; order of dishes at table; also, a set or number of vessels ordinarily used at table; as, the service was tardy and awkward; a service of plate or glass. There was no extraordinary service seen on the board. Hakewill. 9. (Law)  The act of bringing to notice, either actually or constructively, in such manner as is prescribed by law; as, the service of a subpoena or an attachment. 10. (Naut.)  The materials used for serving a rope, etc., as spun yarn, small lines, etc. 11. (Tennis)  The act of serving the ball. 12. Act of serving or covering. See Serve, v. t., 13. Service book, a prayer book or missal. -- Service line (Tennis), a line parallel to the net, and at a distance of 21 feet from it. -- Service of a writ, process, etc. (Law), personal delivery or communication of the writ or process, etc., to the party to be affected by it, so as to subject him to its operation; the reading of it to the person to whom notice is intended to be given, or the leaving of an attested copy with the person or his attorney, or at his usual place of abode. -- Service of an attachment (Law), the seizing of the person or goods according to the direction. -- Service of an execution (Law), the levying of it upon the goods, estate, or person of the defendant. -- Service pipe, a pipe connecting mains with a dwelling, as in gas pipes, and the like. Tomlinson. -- To accept service. (Law) See under Accept. -- To see service (Mil.), to do duty in the presence of the enemy, or in actual war."}