{"word":"serve","definition":"1. To work for; to labor in behalf of; to exert one's self continuously or statedly for the benefit of; to do service for; to be in the employment of, as an inferior, domestic, serf, slave, hired assistant, official helper, etc.; specifically, in a religious sense, to obey and worship. God is my witness, whom I serve with my spirit. Rom. i. 9. Jacob loved Rachel; and said, I will serve thee seven years for Rachel thy younger daughter. Gen. xxix. 18. No man can serve two masters. Matt. vi. 24. Had I but served my God with half the zeal I served my king, he would not in mine age Have left me naked to mine enemies. Shak. 2. To be subordinate to; to act a secondary part under; to appear as the inferior of; to minister to. Bodies bright and greater should not serve The less not bright. Milton. 3. To be suitor to; to profess love to. [Obs.] To serve a lady in his beste wise. Chaucer. 4. To wait upon; to supply the wants of; to attend; specifically, to wait upon at table; to attend at meals; to supply with food; as, to serve customers in a shop. Others, pampered in their shameless pride, Are served in plate and in their chariots ride. Dryden. 5. Hence, to bring forward, arrange, deal, or distribute, as a portion of anything, especially of food prepared for eating; -- often with up; formerly with in. Bid them cover the table, serve in the meat, and we will come in to dinner. Shak. Some part he roasts, then serves it up so dressed. Dryde. 6. To perform the duties belonging to, or required in or for; hence, to be of use to; as, a curate may serve two churches; to serve one's country. 7. To contribute or conduce to; to promote; to be sufficient for; to satisfy; as, to serve one's turn. Turn it into some advantage, by observing where it can serve another end. Jer. Taylor. 8. To answer or be (in the place of something) to; as, a sofa serves one for a seat and a couch. 9. To treat; to behave one's self to; to requite; to act toward; as, he served me very ill. 10. To work; to operate; as, to serve the guns. 11. (Law) (a) To bring to notice, deliver, or execute, either actually or constructively, in such manner as the law requires; as, to serve a summons. (b) To make legal service opon (a person named in a writ, summons, etc.); as, to serve a witness with a subpoena. 12. To pass or spend, as time, esp. time of punishment; as, to serve a term in prison. 13. To copulate with; to cover; as, a horse serves a mare; -- said of the male. 14. (Tennis)  To lead off in delivering (the ball). 15. (Naut.)  To wind spun yarn, or the like, tightly around (a rope or cable, etc.) so as to protect it from chafing or from the weather. See under Serving. To serve an attachment or a writ of attachment (Law), to levy it on the person or goods by seizure, or to seize. -- To serve an execution (Law), to levy it on a lands, goods, or person, by seizure or taking possession. -- To serve an office, to discharge a public duty. -- To serve a process (Law), in general, to read it, so as to give due notice to the party concerned, or to leave an attested copy with him or his attorney, or his usual place of abode. -- To serve a warrant, to read it, and seize the person against whom it is issued. -- To serve a writ (Law), to read it to the defendant, or to leave an attested copy at his usual place of abode. -- To serve one out, to retaliate upon; to requite. \"I'll serve you out for this.\" C. Kingsley. -- To serve one right, to treat, or cause to befall one, according to his deserts; -- used commonly of ill deserts; as, it serves the scoundrel right; -- To serve one's self of, to avail one's self of; to make use of. [A Gallicism] I will serve myself of this concession. Chillingworth. -- To serve out, to distribute; as, to serve out rations. -- To serve the time or the hour, to regulate one's actions by the requirements of the time instead of by one's duty; to be a timeserver. [Obs.] They think herein we serve the time, because thereby we either hold or seek preferment. Hooker. Syn. -- To obey; minister to; subserve; promote; aid; help; assist; benefit; succor.\n\n1. To be a servant or a slave; to be employed in labor or other business for another; to be in subjection or bondage; to render menial service. The Lord shall give thee rest . . . from the hard bondage wherein thou wast made to serve. Isa. xiv. 3. 2. To perform domestic offices; to be occupied with household affairs; to prepare and dish up food, etc. But Martha . . . said, Lord, dost thou not care that my sister hath left me to serve alone Luke x. 40. 3. To be in service; to do duty; to discharge the requirements of an office or employment. Specifically, to act in the public service, as a soldier, seaman. etc. Many . . . who had before been great commanders, but now served as private gentlemen without pay. Knolles. 4. To be of use; to answer a purpose; to suffice; to suit; to be convenient or favorable. This little brand will serve to light your fire. Dryden. As occasion serves, this noble queen And prince shall follow with a fresh supply. Shak. 5. (Tennis)  To lead off in delivering the ball."}