{"word":"set","definition":"1. To cause to sit; to make to assume a specified position or attitude; to give site or place to; to place; to put; to fix; as, to set a house on a stone foundation; to set a book on a shelf; to set a dish on a table; to set a chest or trunk on its bottom or on end. I do set my bow in the cloud. Gen. ix. 13. 2. Hence, to attach or affix (something) to something else, or in or upon a certain place. Set your affection on things above. Col. iii. 2. The Lord set a mark upon Cain. Gen. iv. 15. 3. To make to assume specified place, condition, or occupation; to put in a certain condition or state (described by the accompanying words); to cause to be. The Lord thy God will set thee on hihg. Deut. xxviii. 1. I am come to set a man at variance against his father, and the daughter against her mother. Matt. x. 35. Every incident sets him thinking. Coleridge. 4. To fix firmly; to make fast, permanent, or stable; to render motionless; to give an unchanging place, form, or condition to. Specifically: -- (a) To cause to stop or stick; to obstruct; to fsten to a spot; hence, to occasion difficulty to; to embarrass; as, to set a coach in the mud. They show how hard they are set in this particular. Addison. (b) To fix beforehand; to determine; hence, to make unyielding or obstinate; to render stiff, unpliant, or rigid; as, to set one's countenance. His eyes were set by reason of his age. 1 Kings xiv. 4. On these three objects his heart was set. Macaulay. Make my heart as a millstone, set my face as a flint. Tennyson. (c) To fix in the ground, as a post or a tree; to plant; as, to set pear trees in an orchard. (d) To fix, as a precious stone, in a border of metal; to place in a setting; hence, to place in or amid something which serves as a setting; as, to set glass in a sash. And him too rich a jewel to be set In vulgar metal for a vulgar use. Dryden. (e) To render stiff or solid; especially, to convert into curd; to curdle; as, to set milk for cheese. 5. To put into a desired position or condition; to adjust; to regulate; to adapt. Specifically: -- (a) To put in order in a particular manner; to prepare; as, to set (that is, to hone) a razor; to set a saw. Tables for to sette, and beddes make. Chaucer. (b) To extend and bring into position; to spread; as, to set the sails of a ship. (c) To give a pitch to, as a tune; to start by fixing the keynote; as, to set a psalm. Fielding. (d) To reduce from a dislocated or fractured state; to replace; as, to set a broken bone. (e) To make to agree with some standard; as, to set a watch or a clock. (f) (Masonry) To lower into place and fix silidly, as the blocks of cut stone in a structure. 6. To stake at play; to wager; to risk. I have set my life upon a cast, And I will stand the hazard of the die. Shak. 7. To fit with music; to adapt, as words to notes; to prepare for singing. Set thy own songs, and sing them to thy lute. Dryden. 8. To determine; to appoint; to assign; to fix; as, to set a time for a meeting; to set a price on a horse. 9. To adorn with something infixed or affixed; to stud; to variegate with objects placed here and there. High on their heads, with jewels richly set, Each lady wore a radiant coronet. Dryden. Pastoral dales thin set with modern farms. Wordsworth. 10. To value; to rate; -- with at. Be you contented, wearing now the garland, To have a son set your decrees at naught. Shak. I do not set my life at a pin's fee. Shak. 11. To point out the seat or position of, as birds, or other game; -- said of hunting dogs. 12. To establish as a rule; to furnish; to prescribe; to assign; as, to set an example; to set lessons to be learned. 13. To suit; to become; as, it sets him ill. [Scot.] 14. (Print.)  To compose; to arrange in words, lines, etc.; as, to set type; to set a page. To set abroach. See Abroach. [Obs.] Shak. -- To set against, to oppose; to set in comparison with, or to oppose to, as an equivalent in exchange; as, to set one thing against another. -- To set agoing, to cause to move. -- To set apart, to separate to a particular use; to separate from the rest; to reserve. -- To set a saw, to bend each tooth a little, every alternate one being bent to one side, and the intermediate ones to the other side, so that the opening made by the saw may be a little wider than the thickness of the back, to prevent the saw from sticking. -- To set aside. (a) To leave out of account; to pass by; to omit; to neglect; to reject; to annul. Setting aside all other considerations, I will endeavor to know the truth, and yield to that. Tillotson. (b) To set apart; to reserve; as, to set aside part of one's income. (c) (Law) See under Aside. -- To set at defiance, to defy. -- To set at ease, to quiet; to tranquilize; as, to set the heart at ease. -- To set at naught, to undervalue; to contemn; to despise. \"Ye have set at naught all my counsel.\" Prov. i. 25. -- To set a trap, snare, or gin, to put it in a proper condition or position to catch prey; hence, to lay a plan to deceive and draw another into one's power. -- To set at work, or To set to work. (a) To cause to enter on work or action, or to direct how tu enter on work. (b) To apply one's self; -- used reflexively. -- To set before. (a) To bring out to view before; to exhibit. (b) To propose for choice to; to offer to. -- To set by. (a) To set apart or on one side; to reject. (b) To attach the value of (anything) to. \"I set not a straw by thy dreamings.\" Chaucer. -- To set by the compass, to observe and note the bearing or situation of by the compass. -- To set case, to suppose; to assume. Cf. Put case, under Put, v. t. [Obs.] Chaucer. -- To set down. (a) To enter in writing; to register. Some rules were to be set down for the government of the army. Clarendon. (b) To fix; to establish; to ordain. This law we may name eternal, being that order which God . . . hath set down with himself, for himself to do all things by. Hooker. (c) To humiliate. -- To set eyes on, to see; to behold; to fasten the eyes on. -- To set fire to, or To set on fire, to communicate fire to; fig., to inflame; to enkindle the passions of; to irritate. -- To set flying (Naut.), to hook to halyards, sheets, etc., instead of extending with rings or the like on a stay; -- said of a sail. -- To set forth. (a) To manifest; to offer or present to view; to exhibt; to display. (b) To publish; to promulgate; to make appear. Waller. (c) To send out; to prepare and send. [Obs.] The Venetian admiral had a fleet of sixty galleys, set forth by the Venetians. Knolles. -- To set forward. (a) To cause to advance. (b) To promote. -- To set free, to release from confinement, imprisonment, or bondage; to liberate; to emancipate. -- To set in, to put in the way; to begin; to give a start to. [Obs.] If you please to assist and set me in, I will recollect myself. Collier. -- To set in order, to adjust or arrange; to reduce to method. \"The rest will I set in order when I come.\" 1 Cor. xi. 34. -- To set milk. (a) To expose it in open dishes in order that the cream may rise to the surface. (b) To cause it to become curdled as by the action of rennet. See 4 (e). -- To set much, or little, by, to care much, or little, for. -- To set of, to value; to set by. [Obs.] \"I set not an haw of his proverbs.\" Chaucer. -- To set off. (a) To separate from a whole; to assign to a particular purpose; to portion off; as, to set off a portion of an estate. (b) To adorn; to decorate; to embellish. They . . . set off the worst faces with the best airs. Addison. (c) To give a flattering description of. -- To set off against, to place against as an equivalent; as, to set off one man's services against another's. -- To set on or upon. (a) To incite; to instigate. \"Thou, traitor, hast set on thy wife to this.\" Shak. (b) To employ, as in a task. \" Set on thy wife to observe.\" Shak. (c) To fix upon; to attach strongly to; as, to set one's heart or affections on some object. See definition 2, above. -- To set one's cap for. See under Cap, n. -- To set one's self against, to place one's self in a state of enmity or opposition to. -- To set one's teeth, to press them together tightly. -- To set on foot, to set going; to put in motion; to start. -- To set out. (a) To assign; to allot; to mark off; to limit; as, to set out the share of each proprietor or heir of an estate; to set out the widow's thirds. (b) To publish, as a proclamation. [Obs.] (c) To adorn; to embellish. An ugly woman, in rich habit set out with jewels, nothing can become. Dryden. (d) To raise, equip, and send forth; to furnish. [R.] The Venetians pretend they could set out, in case of great necessity, thirty men-of-war. Addison. (e) To show; to display; to recommend; to set off. I could set out that best side of Luther. Atterbury. (f) To show; to prove. [R.] \"Those very reasons set out how heinous his sin was.\" Atterbury. (g) (Law) To recite; to state at large. -- To set over. (a) To appoint or constitute as supervisor, inspector, ruler, or commander. (b) To assign; to transfer; to convey. -- To set right, to correct; to put in order. -- To set sail. (Naut.) See under Sail, n. -- To set store by, to consider valuable. -- To set the fashion, to determine what shall be the fashion; to establish the mode. -- To set the teeth on edge, to affect the teeth with a disagreeable sensation, as when acids are brought in contact with them. -- To set the watch (Naut.), to place the starboard or port watch on duty. -- To set to, to attach to; to affix to. \"He . . . hath set to his seal that God is true.\" John iii. 33. -- To set up. (a) To erect; to raise; to elevate; as, to set up a building, or a machine; to set up a post, a wall, a pillar. (b) Hence, to exalt; to put in power. \"I will . . . set up the throne of David over Israel.\" 2 Sam. iii. 10. (c) To begin, as a new institution; to institute; to establish; to found; as, to set up a manufactory; to set up a school. (d) To enable to commence a new business; as, to set up a son in trade. (e) To place in view; as, to set up a mark. (f) To raise; to utter loudly; as, to set up the voice. I'll set up such a note as she shall hear. Dryden. (g) To advance; to propose as truth or for reception; as, to set up a new opinion or doctrine. T. Burnet. (h) To raise from depression, or to a sufficient fortune; as, this good fortune quite set him up. (i) To intoxicate. [Slang] (j) (Print.) To put in type; as, to set up copy; to arrange in words, lines, etc., ready for printing; as, to set up type. -- To set up the rigging (Naut.), to make it taut by means of tackles. R. H. Dana, Jr. Syn. -- See Put.\n\n1. To pass below the horizon; to go down; to decline; to sink out of sight; to come to an end. Ere the weary sun set in the west. Shak. Thus this century sets with little mirth, and the next is likely to arise with more mourning. Fuller. 2. To fit music to words. [Obs.] Shak. 3. To place plants or shoots in the ground; to plant. \"To sow dry, and set wet.\" Old Proverb. 4. To be fixed for growth; to strike root; to begin to germinate or form; as, cuttings set well; the fruit has set well (i. e., not blasted in the blossom). 5. To become fixed or rigid; to be fastened. A gathering and serring of the spirits together to resist, maketh the teeth to set hard one against another. Bacon. 6. To congeal; to concrete; to solidify. That fluid substance in a few minutes begins to set. Boyle. 7. To have a certain direction in motion; to flow; to move on; to tend; as, the current sets to the north; the tide sets to the windward. 8. To begin to move; to go out or forth; to start; -- now followed by out. The king is set from London. Shak. 9. To indicate the position of game; -- said of a dog; as, the dog sets well; also, to hunt game by the aid of a setter. 10. To apply one's self; to undertake earnestly; -- now followed by out. If he sets industriously and sincerely to perform the commands of Christ, he can have no ground of doubting but it shall prove successful to him. Hammond. 11. To fit or suit one; to sit; as, the coat sets well. Note: [Colloquially used, but improperly, for sit.] Note: The use of the verb set for sit in such expressions as, the hen is setting on thirteen eggs; a setting hen, etc., although colloquially common, and sometimes tolerated in serious writing, is not to be approved. To set about, to commence; to begin. -- To set forward, to move or march; to begin to march; to advance. -- To set forth, to begin a journey. -- To set in. (a) To begin; to enter upon a particular state; as, winter set in early. (b) To settle one's self; to become established. \"When the weather was set in to be very bad.\" Addyson. (c) To flow toward the shore; -- said of the tide. -- To set off. (a) To enter upon a journey; to start. (b) (Typog.) To deface or soil the next sheet; -- said of the ink on a freshly printed sheet, when another sheet comes in contract with it before it has had time to dry. -- To set on or upon. (a) To begin, as a journey or enterprise; to set about. He that would seriously set upon the search of truth. Locke. (b) To assault; to make an attack. Bacon. Cassio hath here been set on in the dark. Shak. -- To set out, to begin a journey or course; as, to set out for London, or from London; to set out in business;to set out in life or the world. -- To set to, to apply one's self to. -- To set up. (a) To begin business or a scheme of life; as, to set up in trade; to set up for one's self. (b) To profess openly; to make pretensions. Those men who set up for mortality without regard to religion, are generally but virtuous in part. Swift.\n\n1. Fixed in position; immovable; rigid; as, a set line; a set countenance. 2. Firm; unchanging; obstinate; as, set opinions or prejudices. 3. Regular; uniform; formal; as, a set discourse; a set battle. \"The set phrase of peace.\" Shak. 4. Established; prescribed; as, set forms of prayer. 5. Adjusted; arranged; formed; adapted. Set hammer. (a) A hammer the head of which is not tightly fastened upon the handle, but may be reversed. Knight. (b) A hammer with a concave face which forms a die for shaping anything, as the end of a bolt, rivet, etc. -- Set line, a line to which a number of baited hooks are attached, and which, supported by floats and properly secured, may be left unguarded during the absence of the fisherman. -- Set nut, a jam nut or lock nut. See under Nut. -- Set screw (Mach.), a screw, sometimes cupped or printed at one end, and screwed through one part, as of a machine, tightly upon another part, to prevent the one from slipping upon the other. -- Set speech, a speech carefully prepared before it is delivered in public; a formal or methodical speech.\n\n1. The act of setting, as of the sun or other heavenly body; descent; hence, the close; termination. \"Locking at the set of day.\" Tennyson. The weary sun hath made a golden set. Shak. 2. That which is set, placed, or fixed. Specifically: -- (a) A young plant for growth; as, a set of white thorn. (b) That which is staked; a wager; a venture; a stake; hence, a game at venture. [Obs. or R.] We will in France, by God's grace, play a set Shall strike his father's crown into the hazard. Shak. That was but civil war, an equal set. Dryden. (c) (Mech.)  Permanent change of figure in consequence of excessive strain, as from compression, tension, bending, twisting, etc.; as, the set of a spring. (d) A kind of punch used for bending, indenting, or giving shape to, metal; as, a saw set. (e) (Pile Driving)  A piece placed temporarily upon the head of a pile when the latter cannot be reached by the weight, or hammer, except by means of such an intervening piece. [Often incorrectly written sett.] (f) (Carp.)  A short steel spike used for driving the head of a nail below the surface. 3. Etym: [Perhaps due to confusion with sect, sept.]  A number of things of the same kind, ordinarily used or classed together; a collection of articles which naturally complement each other, and usually go together; an assortment; a suit; as, a set of chairs, of china, of surgical or mathematical instruments, of books, etc. [In this sense, sometimes incorrectly written sett.] 4. A number of persons associated by custom, office, common opinion, quality, or the like; a division; a group; a clique. \"Others of our set.\" Tennyson. This falls into different divisions, or sets, of nations connected under particular religions. R. P. Ward. 5. Direction or course; as, the set of the wind, or of a current. 6. In dancing, the number of persons necessary to execute a quadrille; also, the series of figures or movements executed. 7. The deflection of a tooth, or of the teeth, of a saw, which causes the the saw to cut a kerf, or make an opening, wider than the blade. 8. (a) A young oyster when first attached. (b) Collectively, the crop of young oysters in any locality. 9. (Tennis)  A series of as many games as may be necessary to enable one side to win six. If at the end of the tenth game the score is a tie, the set is usually called a deuce set, and decided by an application of the rules for playing off deuce in a game. See Deuce. 10. (Type Founding)  That dimension of the body of a type called by printers the width. Dead set. (a) The act of a setter dog when it discovers the game, and remains intently fixed in pointing it out. (b) A fixed or stationary condition arising from obstacle or hindrance; a deadlock; as, to be at a dead set. (c) A concerted scheme to defraud by gaming; a determined onset. -- To make a dead set, to make a determined onset, literally or figuratively. Syn. -- Collection; series; group. See Pair."}