{"word":"shade","definition":"1. Comparative obscurity owing to interception or interruption of the rays of light; partial darkness caused by the intervention of something between the space contemplated and the source of light. Note: Shade differs from shadow as it implies no particular form or definite limit; whereas a shadow represents in form the object which intercepts the light. When we speak of the shade of a tree, we have no reference to its form; but when we speak of measuring a pyramid or other object by its shadow, we have reference to its form and extent. 2. Darkness; obscurity; -- often in the plural. The shades of night were falling fast. Longfellow. 3. An obscure place; a spot not exposed to light; hence, a secluded retreat. Let us seek out some desolate shade, and there Weep our sad bosoms empty. Shak. 4. That which intercepts, or shelters from, light or the direct rays of the sun; hence, also, that which protects from heat or currents of air; a screen; protection; shelter; cover; as, a lamp shade. The Lord is thy shade upon thy right hand. Ps. cxxi. 5. Sleep under a fresh tree's shade. Shak. Let the arched knife well sharpened now assail the spreading shades of vegetables. J. Philips. 5. Shadow. [Poetic.] Envy will merit, as its shade, pursue. Pope. 6. The soul after its separation from the body; -- so called because the ancients it to be perceptible to the sight, though not to the touch; a spirit; a ghost; as, the shades of departed heroes. Swift as thought the flitting shade Thro' air his momentary journey made. Dryden. 7. (Painting, Drawing, etc.)  The darker portion of a picture; a less illuminated part. See Def. 1, above. 8. Degree or variation of color, as darker or lighter, stronger or paler; as, a delicate shade of pink. White, red, yellow, blue, with their several degrees, or shades and mixtures, as green only in by the eyes. Locke. 9. A minute difference or variation, as of thought, belief, expression, etc.; also, the quality or degree of anything which is distinguished from others similar by slight differences; as, the shades of meaning in synonyms. New shades and combinations of thought. De Quincey. Every shade of religious and political opinion has its own headquarters. Macaulay. The Shades, the Nether World; the supposed abode of souls after leaving the body.\n\n1. To shelter or screen by intercepting the rays of light; to keep off illumination from. Milton. I went to crop the sylvan scenes, And shade our altars with their leafy greens. Dryden. 2. To shelter; to cover from injury; to protect; to screen; to hide; as, to shade one's eyes. Ere in our own house I do shade my head. Shak. 3. To obscure; to dim the brightness of. Thou shad'st The full blaze of thy beams. Milton. 4. To pain in obscure colors; to darken. 5. To mark with gradations of light or color. 6. To present a shadow or image of; to shadow forth; to represent. [Obs.] [The goddess] in her person cunningly did shade That part of Justice which is Equity. Spenser."}