{"word":"shadow","definition":"1. Shade within defined limits; obscurity or deprivation of light, apparent on a surface, and representing the form of the body which intercepts the rays of light; as, the shadow of a man, of a tree, or of a tower. See the Note under Shade, n., 1. 2. Darkness; shade; obscurity. Night's sable shadows from the ocean rise. Denham. 3. A shaded place; shelter; protection; security. In secret shadow from the sunny ray, On a sweet bed of lilies softly laid. Spenser. 4. A reflected image, as in a mirror or in water. Shak. 5. That which follows or attends a person or thing like a shadow; an inseparable companion; hence, an obsequious follower. Sin and her shadow Death. Milton. 6. A spirit; a ghost; a shade; a phantom. \"Hence, horrible shadow!\" Shak. 7. An imperfect and faint representation; adumbration; indistinct image; dim bodying forth; hence, mystical reprresentation; type. The law having a shadow of good things to come. Heb. x. 1. [Types] and shadows of that destined seed. Milton. 8. A small degree; a shade. \"No variableness, neither shadow of turning.\" James i. 17. 9. An uninvited guest coming with one who is invited. [A Latinism] Nares. I must not have my board pastered with shadows That under other men's protection break in Without invitement. Massinger. Shadow of death, darkness or gloom like that caused by the presence or the impending of death. Ps. xxiii. 4.\n\n1. To cut off light from; to put in shade; to shade; to throw a shadow upon; to overspead with obscurity. The warlike elf much wondered at this tree, So fair and great, that shadowed all the ground. Spenser. 2. To conceal; to hide; to screen. [R.] Let every soldier hew him down a bough. And bear't before him; thereby shall we shadow The numbers of our host. Shak. 3. To protect; to shelter from danger; to shroud. Shadoving their right under your wings of war. Shak. 4. To mark with gradations of light or color; to shade. 5. To represent faintly or imperfectly; to adumbrate; hence, to represent typically. Augustus is shadowed in the person of Dryden. 6. To cloud; to darken; to cast a gloom over. The shadowed livery of the burnished sun. Shak. Why sad I must not see the face O love thus shadowed. Beau & Fl. 7. To attend as closely as a shadow; to follow and watch closely, especially in a secret or unobserved manner; as, a detective shadows a criminal."}