{"word":"shake","definition":"obs. p. p. of Shake. Chaucer.\n\n1. To cause to move with quick or violent vibrations; to move rapidly one way and the other; to make to tremble or shiver; to agitate. As a fig tree casteth her untimely figs, when she is shaken of a mighty wind. Rev. vi. 13. Ascend my chariot; guide the rapid wheels That shake heaven's basis. Milton. 2. Fig.: To move from firmness; to weaken the stability of; to cause to waver; to impair the resolution of. When his doctrines grew too strong to be shook by his enemies, they persecuted his reputation. Atterbury. Thy equal fear that my firm faith and love Can by his fraud be shaken or seduced. Milton. 3. (Mus.)  To give a tremulous tone to; to trill; as, to shake a note in music. 4. To move or remove by agitating; to throw off by a jolting or vibrating motion; to rid one's self of; -- generally with an adverb, as off, out, etc.; as, to shake fruit down from a tree. Shake off the golden slumber of repose. Shak. 'Tis our fast intent To shake all cares and business from our age. Shak. I could scarcely shake him out of my company. Bunyan. To shake a cask (Naut.), to knock a cask to pieces and pack the staves. -- To shake hands, to perform the customary act of civility by clasping and moving hands, as an expression of greeting, farewell, good will, agreement, etc. -- To shake out a reef (Naut.), to untile the reef points and spread more canvas. -- To shake the bells. See under Bell. -- To shake the sails (Naut.), to luff up in the wind, causing the sails to shiver. Ham. Nav. Encyc.\n\nTo be agitated with a waving or vibratory motion; to tremble; to shiver; to quake; to totter. Under his burning wheels The steadfast empyrean shook throughout, All but the throne itself of God. Milton. What danger Who 's that that shakes behind there Beau & FL. Shaking piece, a name given by butchers to the piece of beef cut from the under side of the neck. See Illust. of Beef.\n\n1. The act or result of shaking; a vacillating or wavering motion; a rapid motion one way and other; a trembling, quaking, or shivering; agitation. The great soldier's honor was composed Of thicker stuff, which could endure a shake. Herbert. Our salutations were very hearty on both sides, consisting of many kind shakes of the hand. Addison. 2. A fissure or crack in timber, caused by its being dried too suddenly. Gwilt. 3. A fissure in rock or earth. 4. (Mus.)  A rapid alternation of a principal tone with another represented on the next degree of the staff above or below it; a trill. 5. (Naut.)  One of the staves of a hogshead or barrel taken apart. Totten. 6. A shook of staves and headings. Knight. 7. (Zoöl.)  The redshank; -- so called from the nodding of its head while on the ground. [Prov. Eng.] No great shakes, of no great importance. [Slang] Byron. -- The shakes, the fever and ague. [Colloq. U.S.]"}