{"word":"shear","definition":"1. To cut, clip, or sever anything from with shears or a like instrument; as, to shear sheep; to shear cloth. Note: It is especially applied to the cutting of wool from sheep or their skins, and the nap from cloth. 2. To separate or sever with shears or a similar instrument; to cut off; to clip (something) from a surface; as, to shear a fleece. Before the golden tresses . . . were shorn away. Shak. 3. To reap, as grain. [Scot.] Jamieson. 4. Fig.: To deprive of property; to fleece. 5. (Mech.)  To produce a change of shape in by a shear. See Shear, n., 4.\n\n1. A pair of shears; -- now always used in the plural, but formerly also in the singular. See Shears. On his head came razor none, nor shear. Chaucer. Short of the wool, and naked from the shear. Dryden. 2. A shearing; -- used in designating the age of sheep. After the second shearing, he is a two-sher ram; . . . at the expiration of another year, he is a three-shear ram; the name always taking its date from the time of shearing. Youatt. 3. (Engin.)  An action, resulting from applied forces, which tends to cause two contiguous parts of a body to slide relatively to each other in a direction parallel to their plane of contact; -- also called shearing stress, and tangential stress. 4. (Mech.)  A strain, or change of shape, of an elastic body, consisting of an extension in one direction, an equal compression in a perpendicular direction, with an unchanged magnitude in the third direction. Shear blade, one of the blades of shears or a shearing machine. -- Shear hulk. See under Hulk. -- Shear steel, a steel suitable for shears, scythes, and other cutting instruments, prepared from fagots of blistered steel by repeated heating, rolling, and tilting, to increase its malleability and fineness of texture.\n\n1. To deviate. See Sheer. 2. (Engin.)  To become more or less completely divided, as a body under the action of forces, by the sliding of two contiguous parts relatively to each other in a direction parallel to their plane of contact."}