{"word":"sheet","definition":"In general, a large, broad piece of anything thin, as paper, cloth, etc.; a broad, thin portion of any substance; an expanded superficies. Specifically: (a) A broad piece of cloth, usually linen or cotton, used for wrapping the body or for a covering; especially, one used as an article of bedding next to the body. He fell into a trance, and saw heaven opened, and a certain vessel descending unto him, as it had been a great sheet knit at the four corners. Acts x. 10, 11. If I do die before thee, prithee, shroud me In one of those same sheets. Shak. (b) A broad piece of paper, whether folded or unfolded, whether blank or written or printed upon; hence, a letter; a newspaper, etc. (c) A single signature of a book or a pamphlet; in pl., the book itself. To this the following sheets are intended for a full and distinct answer. Waterland. (d) A broad, thinly expanded portion of metal or other substance; as, a sheet of copper, of glass, or the like; a plate; a leaf. (e) A broad expanse of water, or the like. \"The two beautiful sheets of water.\" Macaulay. (f) A sail. Dryden. (g) (Geol.) An extensive bed of an eruptive rock intruded between, or overlying, other strata. 2. Etym: [AS. sceáta. See the Etymology above.] (Naut.) (a) A rope or chain which regulates the angle of adjustment of a sail in relation in relation to the wind; -- usually attached to the lower corner of a sail, or to a yard or a boom. (b) pl.  The space in the forward or the after part of a boat where there are no rowers; as, fore sheets; stern sheets. Note: Sheet is often used adjectively, or in combination, to denote that the substance to the name of which it is prefixed is in the form of sheets, or thin plates or leaves; as, sheet brass, or sheet-brass; sheet glass, or sheet-glass; sheet gold, or sheet-gold; sheet iron, or sheet-iron, etc. A sheet in the wind, half drunk. [Sailors' Slang] -- Both sheets in the wind, very drunk. [Sailors' Slang] -- In sheets, lying flat or expanded; not folded, or folded but not bound; -- said especially of printed sheets. -- Sheet bend (Naut.), a bend or hitch used for temporarily fastening a rope to the bight of another rope or to an eye. -- Sheet lightning, Sheet piling, etc. See under Lightning, Piling, etc.\n\n1. To furnish with a sheet or sheets; to wrap in, or cover with, a sheet, or as with a sheet. \"The sheeted dead.\" \"When snow the pasture sheets.\" Shak. 2. To expand, as a sheet. The star shot flew from the welkin blue, As it fell from the sheeted sky. J. R. Drake. To sheet home (Naut.), to haul upon a sheet until the sail is as flat, and the clew as near the wind, as possible."}