{"word":"shell","definition":"1. A hard outside covering, as of a fruit or an animal. Specifically: (a) The covering, or outside part, of a nut; as, a hazelnut shell. (b) A pod. (c) The hard covering of an egg. Think him as a serpent's egg, . . . And kill him in the shell. Shak. (d) (Zoöl.)  The hard calcareous or chitinous external covering of mollusks, crustaceans, and some other invertebrates. In some mollusks, as the cuttlefishes, it is internal, or concealed by the mantle. Also, the hard covering of some vertebrates, as the armadillo, the tortoise, and the like. (e) (Zoöl.) Hence, by extension, any mollusks having such a covering. 2. (Mil.)  A hollow projectile, of various shapes, adapted for a mortar or a cannon, and containing an explosive substance, ignited with a fuse or by percussion, by means of which the projectile is burst and its fragments scattered. See Bomb. 3. The case which holds the powder, or charge of powder and shot, used with breechloading small arms. 4. Any slight hollow structure; a framework, or exterior structure, regarded as not complete or filled in; as, the shell of a house. 5. A coarse kind of coffin; also, a thin interior coffin inclosed in a more substantial one. Knight. 6. An instrument of music, as a lyre, -- the first lyre having been made, it is said, by drawing strings over a tortoise shell. When Jubal struck the chorded shell. Dryden. 7. An engraved copper roller used in print works. 8. pl.  The husks of cacao seeds, a decoction of which is often used as a substitute for chocolate, cocoa, etc. 9. (Naut.)  The outer frame or case of a block within which the sheaves revolve. 10. A light boat the frame of which is covered with thin wood or with paper; as, a racing shell. Message shell, a bombshell inside of which papers may be put, in order to convey messages. -- Shell bit, a tool shaped like a gouge, used with a brace in boring wood. See Bit, n., 3. -- Shell button. (a) A button made of shell. (b) A hollow button made of two pieces, as of metal, one for the front and the other for the back, -- often covered with cloth, silk, etc. -- Shell cameo, a cameo cut in shell instead of stone. -- Shell flower. (Bot.) Same as Turtlehead. -- Shell gland. (Zoöl.) (a) A glandular organ in which the rudimentary shell is formed in embryonic mollusks. (b) A glandular organ which secretes the eggshells of various worms, crustacea, mollusks, etc. -- Shell gun, a cannon suitable for throwing shells. -- Shell ibis (Zoöl.), the openbill of India. -- Shell jacket, an undress military jacket. -- Shell lime, lime made by burning the shells of shellfish. -- Shell marl (Min.), a kind of marl characterized by an abundance of shells, or fragments of shells. -- Shell meat, food consisting of shellfish, or testaceous mollusks. Fuller. -- Shell mound. See under Mound. -- Shell of a boiler, the exterior of a steam boiler, forming a case to contain the water and steam, often inclosing also flues and the furnace; the barrel of a cylindrical, or locomotive, boiler. -- Shell road, a road of which the surface or bed is made of shells, as oyster shells. -- Shell sand, minute fragments of shells constituting a considerable part of the seabeach in some places.\n\n1. To strip or break off the shell of; to take out of the shell, pod, etc.; as, to shell nuts or pease; to shell oysters. 2. To separate the kernels of (an ear of Indian corn, wheat, oats, etc.) from the cob, ear, or husk. 3. To throw shells or bombs upon or into; to bombard; as, to shell a town. To shell out, to distribute freely; to bring out or pay, as money. [Colloq.]\n\n1. To fall off, as a shell, crust, etc. 2. To cast the shell, or exterior covering; to fall out of the pod or husk; as, nuts shell in falling. 3. To be disengaged from the ear or husk; as, wheat or rye shells in reaping."}