{"word":"shock","definition":"1. A pile or assemblage of sheaves of grain, as wheat, rye, or the like, set up in a field, the sheaves varying in number from twelve to sixteen; a stook. And cause it on shocks to be by and by set. Tusser. Behind the master walks, builds up the shocks. Thomson. 2. Etym: [G. schock.] (Com.)  A lot consisting of sixty pieces; -- a term applied in some Baltic ports to loose goods.\n\nTo collect, or make up, into a shock or shocks; to stook; as, to shock rye.\n\nTo be occupied with making shocks. Reap well, scatter not, gather clean that is shorn, Bind fast, shock apace. Tusser.\n\n1. A quivering or shaking which is the effect of a blow, collision, or violent impulse; a blow, impact, or collision; a concussion; a sudden violent impulse or onset. These strong, unshaken mounds resist the shocks Of tides and seas tempestuous. Blackmore. He stood the shock of a whole host of foes. Addison. 2. A sudden agitation of the mind or feelings; a sensation of pleasure or pain caused by something unexpected or overpowering; also, a sudden agitating or overpowering event. \"A shock of pleasure.\" Talfourd. 3. (Med.)  A sudden depression of the vital forces of the entire body, or of a port of it, marking some profound impression produced upon the nervous system, as by severe injury, overpowering emotion, or the like. 4. (Elec.)  The sudden convulsion or contraction of the muscles, with the feeling of a concussion, caused by the discharge, through the animal system, of electricity from a charged body. Syn. -- Concussion, Shock. Both words signify a sudden violent shaking caused by impact or colision; but concussion is restricted in use to matter, while shock is used also of mental states.\n\n1. To give a shock to; to cause to shake or waver; hence, to strike against suddenly; to encounter with violence. Come the three corners of the world in arms, And we shall shock them. Shak. A shall never forget the force with which he shocked De Vipont. Sir W. Scott. 2. To strike with surprise, terror, horror, or disgust; to cause to recoil; as, his violence shocked his associates. Advise him not to shock a father's will. Dryden.\n\nTo meet with a shock; to meet in violent encounter. \"They saw the moment approach when the two parties would shock together.\" De Quincey.\n\n1. (Zoöl.)  A dog with long hair or shag; -- called also shockdog. 2. A thick mass of bushy hair; as, a head covered with a shock of sandy hair.\n\nBushy; shaggy; as, a shock hair. His red shock peruke . . . was laid aside. Sir W. Scott."}