{"word":"shoe","definition":"1. A covering for the human foot, usually made of leather, having a thick and somewhat stiff sole and a lighter top. It differs from a boot on not extending so far up the leg. Your hose should be ungartered, . . . yourshoe untied. Shak. Spare none but such as go in clouted shoon. Shak. 2. Anything resembling a shoe in form, position, or use. Specifically: (a) A plate or rim of iron nailed to the hoof of an animal to defend it from injury. (b) A band of iron or steel, or a ship of wood, fastened to the bottom of the runner of a sleigh, or any vehicle which slides on the snow. (c) A drag, or sliding piece of wood or iron, placed under the wheel of a loaded vehicle, to retard its motion in going down a hill. (d) The part of a railroad car brake which presses upon the wheel to retard its motion. (e) (Arch.) A trough-shaped or spout-shaped member, put at the bottom of the water leader coming from the eaves gutter, so as to throw the water off from the building. (f) (Milling.) The trough or spout for conveying the grain from the hopper to the eye of the millstone. (g) An inclined trough in an ore-crushing mill. (h) An iron socket or plate to take the thrust of a strut or rafter. (i) An iron socket to protect the point of a wooden pile. (j) (Mach.) A plate, or notched piece, interposed between a moving part and the stationary part on which it bears, to take the wear and afford means of adjustment; -- called also slipper, and gib. Note: Shoe is often used adjectively, or in composition; as, shoe buckle, or shoe-buckle; shoe latchet, or shoe-latchet; shoe leathet, or shoe-leather; shoe string, shoe-string, or shoestring. Shoe of an anchor. (Naut.) (a) A small block of wood, convex on the back, with a hole to receive the point of the anchor fluke, -- used to prevent the anchor from tearing the planks of the vessel when raised or lowered. (b) A broad, triangular piece of plank placed upon the fluke to give it a better hold in soft ground. -- Shoe block (Naut.), a block with two sheaves, one above the other, and at right angles to each other. -- Shoe bolt, a bolt with a flaring head, for fastening shoes on sleigh runners. -- Shoe pac, a kind of moccasin. See Pac. -- Shoe stone, a sharpening stone used by shoemakers and other workers in leather.\n\n1. To furnish with a shoe or shoes; to put a shoe or shoes on; as, to shoe a horse, a sled, an anchor. 2. To protect or ornament with something which serves the purpose of a shoe; to tip. The sharp and small end of the billiard stick, which is shod with brass or silver. Evelyn."}