{"word":"shroud","definition":"1. That which clothes, covers, conceals, or protects; a garment. Piers Plowman. Swaddled, as new born, in sable shrouds. Sandys. 2. Especially, the dress for the dead; a winding sheet. \"A dead man in his shroud.\" Shak. 3. That which covers or shelters like a shroud. Jura answers through her misty shroud. Byron. 4. A covered place used as a retreat or shelter, as a cave or den; also, a vault or crypt. [Obs.] The shroud to which he won His fair-eyed oxen. Chapman. A vault, or shroud, as under a church. Withals. 5. The branching top of a tree; foliage. [R.] The Assyrian wad a cedar in Lebanon, with fair branches and with a shadowing shroad. Ezek. xxxi. 3. 6. pl. (Naut.)  A set of ropes serving as stays to support the masts. The lower shrouds are secured to the sides of vessels by heavy iron bolts and are passed around the head of the lower masts. 7. (Mach.)  One of the two annular plates at the periphery of a water wheel, which form the sides of the buckets; a shroud plate. Bowsprit shrouds (Naut.), ropes extending from the head of the bowsprit to the sides of the vessel. -- Futtock shrouds (Naut.), iron rods connecting the topmast rigging with the lower rigging, passing over the edge of the top. -- Shroud plate. (a) (Naut.) An iron plate extending from the dead- eyes to the ship's side. Ham. Nav. Encyc. (b) (Mach.) A shroud. See def. 7, above.\n\n1. To cover with a shroud; especially, to inclose in a winding sheet; to dress for the grave. The ancient Egyptian mummies were shrouded in a number of folds of linen besmeared with gums. Bacon. 2. To cover, as with a shroud; to protect completely; to cover so as to conceal; to hide; to veil. One of these trees, with all his young ones, may shroud four hundred horsemen. Sir W. Raleigh. Some tempest rise, And blow out all the stars that light the skies, To shroud my shame. Dryden.\n\nTo take shelter or harbor. [Obs.] If your stray attendance be yet lodged, Or shroud within these limits. Milton.\n\nTo lop. See Shrood. [Prov. Eng.]"}