{"word":"shut","definition":"1. To close so as to hinder ingress or egress; as, to shut a door or a gate; to shut one's eyes or mouth. 2. To forbid entrance into; to prohibit; to bar; as, to shut the ports of a country by a blockade. Shall that be shut to man which to the beast Is open Milton. 3. To preclude; to exclude; to bar out. \"Shut from every shore.\" Dryden. 4. To fold together; to close over, as the fingers; to close by bringing the parts together; as, to shut the hand; to shut a book. To shut in. (a) To inclose; to confine. \"The Lord shut him in.\" Cen. vii. 16. (b) To cover or intercept the view of; as, one point shuts in another. -- To shut off. (a) To exclude. (b) To prevent the passage of, as steam through a pipe, or water through a flume, by closing a cock, valve, or gate. -- To shut out, to preclude from entering; to deny admission to; to exclude; as, to shut out rain by a tight roof. -- To shut together, to unite; to close, especially to close by welding. -- To shut up. (a) To close; to make fast the entrances into; as, to shut up a house. (b) To obstruct. \"Dangerous rocks shut up the passage.\" Sir W. Raleigh. (c) To inclose; to confine; to imprison; to fasten in; as, to shut up a prisoner. Before faith came, we were kept under the law, shut up unto the faith which should afterwards be revealed. Gal. iii. 23. (d) To end; to terminate; to conclude. When the scene of life is shut up, the slave will be above his master if he has acted better. Collier. (e) To unite, as two pieces of metal by welding. (f) To cause to become silent by authority, argument, or force.\n\nTo close itself; to become closed; as, the door shuts; it shuts hard. To shut up, to cease speaking. [Colloq.] T. Hughes.\n\n1. Closed or fastened; as, a shut door. 2. Rid; clear; free; as, to get shut of a person. [Now dialectical or local, Eng. & U.S.] L'Estrange. 3. (Phon.) (a) Formed by complete closure of the mouth passage, and with the nose passage remaining closed; stopped, as are the mute consonants, p, t, k, b, d, and hard g. H. Sweet. (b) Cut off sharply and abruptly by a following consonant in the same syllable, as the English short vowels, â, ê, î, ô, û, always are.\n\nThe act or time of shutting; close; as, the shut of a door. Just then returned at shut of evening flowers. Milton. 2. A door or cover; a shutter. [Obs.] Sir I. Newton. 3. The line or place where two pieces of metal are united by welding. Cold shut, the imperfection in a casting caused by the flowing of liquid metal upon partially chilled metal; also, the imperfect weld in a forging caused by the inadequate heat of one surface under working."}