{"word":"side","definition":"1. The margin, edge, verge, or border of a surface; especially (when the thing spoken of is somewhat oblong in shape), one of the longer edges as distinguished from the shorter edges, called ends; a bounding line of a geometrical figure; as, the side of a field, of a square or triangle, of a river, of a road, etc. 3. Any outer portion of a thing considered apart from, and yet in relation to, the rest; as, the upper side of a sphere; also, any part or position viewed as opposite to or contrasted with another; as, this or that side. Looking round on every side beheld A pathless desert. Milton. 4. (a) One of the halves of the body, of an animals or man, on either side of the mesial plane; or that which pertains to such a half; as, a side of beef; a side of sole leather. (b) The right or left part of the wall or trunk of the body; as, a pain in the side. One of the soldiers with a spear pierced his side. John xix. 34. 5. A slope or declivity, as of a hill, considered as opposed to another slope over the ridge. Along the side of yon small hill. Milton. 6. The position of a person or party regarded as opposed to another person or party, whether as a rival or a foe; a body of advocates or partisans; a party; hence, the interest or cause which one maintains against another; a doctrine or view opposed to another. God on our side, doubt not of victory. Shak. We have not always been of the . . . same side in politics. Landor. Sets the passions on the side of truth. Pope. 7. A line of descent traced through one parent as distinguished from that traced through another. To sit upon thy father David's throne, By mother's side thy father. Milton. 8. Fig.: Aspect or part regarded as contrasted with some other; as, the bright side of poverty. By the side of, close at hand; near to. -- Exterior side. (Fort.) See Exterior, and Illust. of Ravelin. -- Interior side (Fort.), the line drawn from the center of one bastion to that of the next, or the line curtain produced to the two oblique radii in front. H. L. Scott. -- Side by side, close together and abreast; in company or along with. -- To choose sides, to select those who shall compete, as in a game, on either side. -- To take sides, to attach one's self to, or give assistance to, one of two opposing sides or parties.\n\n1. Of or pertaining to a side, or the sides; being on the side, or toward the side; lateral. One mighty squadron with a side wind sped. Dryden. 2. Hence, indirect; oblique; collateral; incidental; as, a side issue; a side view or remark. The law hath no side respect to their persons. Hooker. 3. Etym: [AS. sid. Cf Side, n.]  Long; large; extensive. [Obs. or Scot.] Shak. His gown had side sleeves down to mid leg. Laneham. Side action, in breech-loading firearms, a mechanism for operating the breech block, which is moved by a lever that turns sidewise. -- Side arms, weapons worn at the side, as sword, bayonet, pistols, etc. -- Side ax, an ax of which the handle is bent to one side. -- Side-bar rule (Eng. Law.), a rule authorized by the courts to be granted by their officers as a matter of course, without formal application being made to them in open court; -- so called because anciently moved for by the attorneys at side bar, that is, informally. Burril. -- Side box, a box or inclosed seat on the side of a theater. To insure a side-box station at half price. Cowper. -- Side chain, one of two safety chains connecting a tender with a locomotive, at the sides. -- Side cut, a canal or road branching out from the main one. [U.S.] -- Side dish, one of the dishes subordinate to the main course. -- Side glance, a glance or brief look to one side. -- Side hook (Carp.), a notched piece of wood for clamping a board to something, as a bench. -- Side lever, a working beam of a side-lever engine. -- Side-lever engine, a marine steam engine having a working beam of each side of the cylinder, near the bottom of the engine, communicating motion to a crank that is above them. -- Side pipe (Steam Engine), a steam or exhaust pipe connecting the upper and lower steam chests of the cylinder of a beam engine. -- Side plane, a plane in which the cutting edge of the iron is at the side of the stock. -- Side posts (Carp.), posts in a truss, usually placed in pairs, each post set at the same distance from the middle of the truss, for supporting the principal rafters, hanging the tiebeam, etc. -- Side rod. (a) One of the rods which connect the piston-rod crosshead with the side levers, in a side-lever engine. (b) See Parallel rod, under Parallel. -- Side screw (Firearms), one of the screws by which the lock is secured to the side of a firearm stock. -- Side table, a table placed either against the wall or aside from the principal table. -- Side tool (Mach.), a cutting tool, used in a lathe or planer, having the cutting edge at the side instead of at the point. -- Side wind, a wind from one side; hence, an indirect attack, or indirect means. Wright.\n\n1. To lean on one side. [Obs.] Bacon. 2. To embrace the opinions of one party, or engage in its interest, in opposition to another party; to take sides; as, to side with the ministerial party. All side in parties, and begin the attack. Pope.\n\n1. To be or stand at the side of; to be on the side toward. [Obs.] His blind eye that sided Paridell. Spenser. 2. To suit; to pair; to match. [Obs.] Clarendon. 3. (Shipbuilding)  To work (a timber or rib) to a certain thickness by trimming the sides. 4. To furnish with a siding; as, to side a house."}