{"word":"sign","definition":"That by which anything is made known or represented; that which furnishes evidence; a mark; a token; an indication; a proof. Specifically: (a) A remarkable event, considered by the ancients as indicating the will of some deity; a prodigy; an omen. (b) An event considered by the Jews as indicating the divine will, or as manifesting an interposition of the divine power for some special end; a miracle; a wonder. Through mighty signs and wonders, by the power of the Spirit of God. Rom. xv. 19. It shall come to pass, if they will not believe thee, neither hearken to the voice of the first sign, that they will believe the voice of the latter sign. Ex. iv. 8. (c) Something serving to indicate the existence, or preserve the memory, of a thing; a token; a memorial; a monument. What time the fire devoured two hundred and fifty men, and they became a sign. Num. xxvi. 10. (d) Any symbol or emblem which prefigures, typifles, or represents, an idea; a type; hence, sometimes, a picture. The holy symbols, or signs, are not barely significative; but what they represent is as certainly delivered to us as the symbols themselves. Brerewood. Saint George of Merry England, the sign of victory. Spenser. (e) A word or a character regarded as the outward manifestation of thought; as, words are the sign of ideas. (f) A motion, an action, or a gesture by which a thought is expressed, or a command or a wish made known. They made signs to his father, how he would have him called. Luke i. 62. (g) Hence, one of the gestures of pantomime, or of a language of a signs such as those used by the North American Indians, or those used by the deaf and dumb. Note: Educaters of the deaf distinguish between natural signs, which serve for communicating ideas, and methodical, or systematic, signs, adapted for the dictation, or the rendering, of written language, word by word; and thus the signs are to be distinguished from the manual alphabet, by which words are spelled on the fingers. (h) A military emblem carried on a banner or a standard. Milton. (i) A lettered board, or other conspicuous notice, placed upon or before a building, room, shop, or office to advertise the business there transacted, or the name of the person or firm carrying it on; a publicly displayed token or notice. The shops were, therefore, distinguished by painted signs, which gave a gay and grotesque aspect to the streets. Macaulay. (j) (Astron.)  The twelfth part of the ecliptic or zodiac. Note: The signs are reckoned from the point of intersection of the ecliptic and equator at the vernal equinox, and are named, respectively, Aries (Taurus (Gemini (II), Cancer (Leo (Virgo (Libra (Scorpio (Sagittarius (Capricornus (Aquarius (Pisces ( (k) (Alg.) A character indicating the relation of quantities, or an operation performed upon them; as, the sign + (plus); the sign -- (minus); the sign of division รท, and the like. (l) (Med.) An objective evidence of disease; that is, one appreciable by some one other than the patient. Note: The terms symptom and and sign are often used synonymously; but they may be discriminated. A sign differs from a symptom in that the latter is perceived only by the patient himself. The term sign is often further restricted to the purely local evidences of disease afforded by direct examination of the organs involved, as distinguished from those evidence of general disturbance afforded by observation of the temperature, pulse, etc. In this sense it is often called physical sign. (m) (Mus.) Any character, as a flat, sharp, dot, etc. (n) (Theol.) That which, being external, stands for, or signifies, something internal or spiritual; -- a term used in the Church of England in speaking of an ordinance considered with reference to that which it represents. An outward and visible sign of an inward and spiritual grace. Bk. of Common Prayer. Note: See the Table of Arbitrary Signs, p. 1924. Sign manual. (a) (Eng. Law) The royal signature superscribed at the top of bills of grants and letter patent, which are then sealed with the privy signet or great seal, as the case may be, to complete their validity. (b) The signature of one's name in one's own handwriting. Craig. Tomlins. Wharton. Syn. -- Token; mark; note; symptom; indication; signal; symbol; type; omen; prognostic; presage; manifestation. See Emblem.\n\n1. To represent by a sign; to make known in a typical or emblematic manner, in distinction from speech; to signify. I signed to Browne to make his retreat. Sir W. Scott. 2. To make a sign upon; to mark with a sign. We receive this child into the congregation of Christ's flock, and do sign him with the sign of the cross. Bk. of Com Prayer. 3. To affix a signature to; to ratify by hand or seal; to subscribe in one's own handwriting. Inquire the Jew's house out, give him this deed, And let him sign it. Shak. 4. To assign or convey formally; -- used with away. 5. To mark; to make distinguishable. Shak.\n\n1. To be a sign or omen. [Obs.] Shak. 2. To make a sign or signal; to communicate directions or intelligence by signs. 3. To write one's name, esp. as a token of assent, responsibility, or obligation."}