{"word":"sin","definition":"Old form of Since. [Obs. or Prov.Eng. & Scot.] Sin that his lord was twenty year of age. Chaucer.\n\n1. Transgression of the law of God; disobedience of the divine command; any violation of God's will, either in purpose or conduct; moral deficiency in the character; iniquity; as, sins of omission and sins of commission. Whosoever committeth sin is the servant of sin. John viii. 34. Sin is the transgression of the law. 1 John iii. 4. I think 't no sin. To cozen him that would unjustly win. Shak. Enthralled By sin to foul, exorbitant desires. Milton. 2. An offense, in general; a violation of propriety; a misdemeanor; as, a sin against good manners. I grant that poetry's a crying sin. Pope. 3. A sin offering; a sacrifice for sin. He hath made him to be sin for us, who knew no sin. 2 Cor. v. 21. 4. An embodiment of sin; a very wicked person. [R.] Thy ambition, Thou scarlet sin, robbed this bewailing land Of noble Buckingham. Shak. Note: Sin is used in the formation of some compound words of obvious signification; as, sin-born; sin-bred, sin-oppressed, sin-polluted, and the like. Actual sin, Canonical sins, Original sin, Venial sin. See under Actual, Canonical, etc. -- Deadly, or Mortal, sins (R. C. Ch.), willful and deliberate transgressions, which take away divine grace; -- in distinction from vental sins. The seven deadly sins are pride, covetousness, lust, wrath, gluttony, envy, and sloth. -- Sin eater, a man who (according to a former practice in England) for a small gratuity ate a piece of bread laid on the chest of a dead person, whereby he was supposed to have taken the sins of the dead person upon himself. -- Sin offering, a sacrifice for sin; something offered as an expiation for sin. Syn. -- Iniquity; wickedness; wrong. See Crime.\n\n1. To depart voluntarily from the path of duty prescribed by God to man; to violate the divine law in any particular, by actual transgression or by the neglect or nonobservance of its injunctions; to violate any known rule of duty; -- often followed by against. Against thee, thee only, have I sinned. Ps. li. 4. All have sinned, and come short of the glory of God. Rom. iii. 23. 2. To violate human rights, law, or propriety; to commit an offense; to trespass; to transgress. I am a man More sinned against than sinning. Shak. Who but wishes to invert the laws Of order, sins against the eternal cause. Pope."}