{"word":"singular","definition":"1. Separate or apart from others; single; distinct. [Obs.] Bacon. And God forbid that all a company Should rue a singular man's folly. Chaucer. 2. Engaged in by only one on a side; single. [Obs.] To try the matter thus together in a singular combat. Holinshed. 3. (Logic)  Existing by itself; single; individual. The idea which represents one . . . determinate thing, is called a singular idea, whether simple, complex, or compound. I. Watts. 4. (Law)  Each; individual; as, to convey several parcels of land, all and singular. 5. (Gram.)  Denoting one person or thing; as, the singular number; -- opposed to dual and Ant: plural. 6. Standing by itself; out of the ordinary course; unusual; uncommon; strange; as, a singular phenomenon. So singular a sadness Must have a cause as strange as the effect. Denham. 7. Distinguished as existing in a very high degree; rarely equaled; eminent; extraordinary; exceptional; as, a man of singular gravity or attainments. 8. Departing from general usage or expectations; odd; whimsical; -- often implying disapproval or consure. His zeal None seconded, as out of season judged, Or singular and rash. Milton. To be singular in anything that is wise and worthy, is not a disparagement, but a praise. Tillotson. 9. Being alone; belonging to, or being, that of which there is but one; unique. These busts of the emperors and empresses are all very scarce, and some of them almost singular in their kind. Addison. Singular point in a curve (Math.), a point at which the curve possesses some peculiar properties not possessed by other points of the curve, as a cusp point, or a multiple point. -- Singular proposition (Logic), a proposition having as its subject a singular term, or a common term limited to an individual by means of a singular sign. Whately. -- Singular succession (Civil Law), division among individual successors, as distinguished from universal succession, by which an estate descended in intestacy to the heirs in mass. -- Singular term (Logic), a term which represents or stands for a single individual. Syn. -- Unexampled; unprecedented; eminent; extraordinary; remarkable; uncommon; rare; unusual; peculiar; strange; odd; eccentric; fantastic.\n\n1. An individual instance; a particular. [Obs.] Dr. H. More. 2. (Gram)  The singular number, or the number denoting one person or thing; a word in the singular number."}