{"word":"single","definition":"1. One only, as distinguished from more than one; consisting of one alone; individual; separate; as, a single star. No single man is born with a right of controlling the opinions of all the rest. Pope. 2. Alone; having no companion. Who single hast maintained, Against revolted multitudes, the cause Of truth. Milton. 3. Hence, unmarried; as, a single man or woman. Grows, lives, and dies in single blessedness. Shak. Single chose to live, and shunned to wed. Dryden. 4. Not doubled, twisted together, or combined with others; as, a single thread; a single strand of a rope. 5. Performed by one person, or one on each side; as, a single combat. These shifts refuted, answer thy appellant, . . . Who now defles thee thrice ti single fight. Milton. 6. Uncompounded; pure; unmixed. Simple ideas are opposed to complex, and single to compound. I. Watts. 7. Not deceitful or artful; honest; sincere. I speak it with a single heart. Shak. 8. Simple; not wise; weak; silly. [Obs.] He utters such single matter in so infantly a voice. Beau & Fl. Single ale, beer, or drink, small ale, etc., as contrasted with double ale, etc., which is stronger. [Obs.] Nares. -- Single bill (Law), a written engagement, generally under seal, for the payment of money, without a penalty. Burril. -- Single court (Lawn Tennis), a court laid out for only two players. -- Single-cut file. See the Note under 4th File. -- Single entry. See under Bookkeeping. -- Single file. See under 1st File. -- Single flower (Bot.), a flower with but one set of petals, as a wild rose. -- Single knot. See Illust. under Knot. -- Single whip (Naut.), a single rope running through a fixed block.\n\n1. To select, as an individual person or thing, from among a number; to choose out from others; to separate. Dogs who hereby can single out their master in the dark. Bacon. His blood! she faintly screamed her mind Still singling one from all mankind. More. 2. To sequester; to withdraw; to retire. [Obs.] An agent singling itself from consorts. Hooker. 3. To take alone, or one by one. Men . . . commendable when they are singled. Hooker.\n\nTo take the irrregular gait called single-foot;- said of a horse. See Single-foot. Many very fleet horses, when overdriven, adopt a disagreeable gait, which seems to be a cross between a pace and a trot, in which the two legs of one side are raised almost but not quite, simultaneously. Such horses are said to single, or to be single-footed. W. S. Clark.\n\n1. A unit; one; as, to score a single. 2. pl.  The reeled filaments of silk, twisted without doubling to give them firmness. 3. A handful of gleaned grain. [Prov. Eng. & Scot.] 4. (Law Tennis)  A game with but one player on each side; -- usually in the plural. 5. (Baseball)  A hit by a batter which enables him to reach first base only."}