{"word":"siphon","definition":"1. A device, consisting of a pipe or tube bent so as to form two branches or legs of unequal length, by which a liquid can be transferred to a lower level, as from one vessel to another, over an intermediate elevation, by the action of the pressure of the atmosphere in forcing the liquid up the shorter branch of the pipe immersed in it, while the continued excess of weight of the liquid in the longer branch (when once filled) causes a continuous flow. The flow takes place only when the discharging extremity of the pipe ia lower than the higher liquid surface, and when no part of the pipe is higher above the surface than the same liquid will rise by atmospheric pressure; that is, about 33 feet for water, and 30 inches for mercury, near the sea level. 2. (Zoöl.) (a) One of the tubes or folds of the mantle border of a bivalve or gastropod mollusk by which water is conducted into the gill cavity. See Illust. under Mya, and Lamellibranchiata. (b) The anterior prolongation of the margin of any gastropod shell for the protection of the soft siphon. (c) The tubular organ through which water is ejected from the gill cavity of a cephaloid. It serves as a locomotive organ, by guiding and confining the jet of water. Called also siphuncle. See Illust. under Loligo, and Dibranchiata. (d) The siphuncle of a cephalopod shell. (e) The sucking proboscis of certain parasitic insects and crustaceans. (f) A sproutlike prolongation in front of the mouth of many gephyreans. (g) A tubular organ connected both with the esophagus and the intestine of certain sea urchins and annelids. 3. A siphon bottle. Inverted siphon, a tube bent like a siphon, but having the branches turned upward; specifically (Hydraulic Engineering), a pipe for conducting water beneath a depressed place, as from one hill to another across an intervening valley, following the depression of the ground. -- Siphon barometer. See under Barometer. -- Siphon bottle, a bottle for holding aërated water, which is driven out through a bent tube in the neck by the gas within the bottle when a valve in the tube is opened; -- called also gazogene, and siphoid. -- Siphon condenser, a condenser for a steam engine, in which the vacuum is maintained by the downward flow of water through a vertical pipe of great height. -- Siphon cup, a cup with a siphon attached for carrying off any liquid in it; specifically (Mach.), an oil cup in which oil is carried over the edge of a tube in a cotton wick, and so reaches the surface to be lubricated. -- Siphon gauge. See under Gauge. -- Siphon pump, a jet pump. See under Jet, n.\n\nTo convey, or draw off, by means of a siphon, as a liquid from one vessel to another at a lower level."}