{"word":"sit","definition":"obs. 3d pers. sing. pres. of Sit, for sitteth.\n\n1. To rest upon the haunches, or the lower extremity of the trunk of the body; -- said of human beings, and sometimes of other animals; as, to sit on a sofa, on a chair, or on the ground. And he came and took the book put of the right hand of him that sate upon the seat. Bible (1551) (Rev. v. 7.) I pray you, jest, sir, as you sit at dinner. Shak. 2. To perch; to rest with the feet drawn up, as birds do on a branch, pole, etc. 3. To remain in a state of repose; to rest; to abide; to rest in any position or condition. And Moses said to . . . the children of Reuben, Shall your brothren go to war, and shall ye sit here Num. xxxii. 6. Like a demigod here sit I in the sky. Shak. 4. To lie, rest, or bear; to press or weigh; -- with on; as, a weight or burden sits lightly upon him. The calamity sits heavy on us. Jer. Taylor. 5. To be adjusted; to fit; as, a coat sts well or ill. This new and gorgeous garment, majesty, Sits not so easy on me as you think. Shak. 6. To suit one well or ill, as an act; to become; to befit; -- used impersonally. [Obs.] Chaucer. 7. To cover and warm eggs for hatching, as a fowl; to brood; to incubate. As the partridge sitteth on eggs, and hatcheth them not. Jer. xvii. 11. 8. To have position, as at the point blown from; to hold a relative position; to have direction. Like a good miller that knows how to grind, which way soever the wind sits. Selden. Sits the wind in that quarter Sir W. Scott. 9. To occupy a place or seat as a member of an official body; as, to sit in Congress. 10. To hold a session; to be in session for official business; -- said of legislative assemblies, courts, etc.; as, the court sits in January; the aldermen sit to-night. 11. To take a position for the purpose of having some artistic representation of one's self made, as a picture or a bust; as, to sit to a painter. To sit at, to rest under; to be subject to. [Obs.] \"A farmer can not husband his ground so well if he sit at a great rent\". Bacon. -- To sit at meat or at table, to be at table for eating. -- To sit down. (a) To place one's self on a chair or other seat; as, to sit down when tired. (b) To begin a siege; as, the enemy sat down before the town. (c) To settle; to fix a permanent abode. Spenser. (d) To rest; to cease as satisfied. \"Here we can not sit down, but still proceed in our search.\" Rogers. -- To sit for a fellowship, to offer one's self for examination with a view to obtaining a fellowship. [Eng. Univ.] -- To sit out. (a) To be without engagement or employment. [Obs.] Bp. Sanderson. (b) To outstay. -- To sit under, to be under the instruction or ministrations of; as, to sit under a preacher; to sit under good preaching. -- To sit up, to rise from, or refrain from, a recumbent posture or from sleep; to sit with the body upright; as, to sit up late at night; also, to watch; as, to sit up with a sick person. \"He that was dead sat up, and began to speak.\" Luke vii. 15.\n\n1. To sit upon; to keep one's seat upon; as, he sits a horse well. Hardly the muse can sit the headstrong horse. Prior. 2. To cause to be seated or in a sitting posture; to furnish a seat to; -- used reflexively. They sat them down to weep. Milton. Sit you down, father; rest you. Shak. 3. To suit (well or ill); to become. [Obs. or R.]"}