{"word":"size","definition":"Six.\n\n1. A thin, weak glue used in various trades, as in painting, bookbinding, paper making, etc. 2. Any viscous substance, as gilder's varnish.\n\nTo cover with size; to prepare with size.\n\n1. A settled quantity or allowance. See Assize. [Obs.] \"To scant my sizes.\" Shak. 2. (Univ. of Cambridge, Eng.)  An allowance of food and drink from the buttery, aside from the regular dinner at commons; -- corresponding to battel at Oxford. 3. Extent of superficies or volume; bulk; bigness; magnitude; as, the size of a tree or of a mast; the size of a ship or of a rock. 4. Figurative bulk; condition as to rank, ability, character, etc.; as, the office demands a man of larger size. Men of a less size and quality. L'Estrange. The middling or lower size of people. Swift. 5. A conventional relative measure of dimension, as for shoes, gloves, and other articles made up for sale. 6. An instrument consisting of a number of perforated gauges fastened together at one end by a rivet, -- used for ascertaining the size of pearls. Knight. Size roll, a small piese of parchment added to a roll. -- Size stick, a measuring stick used by shoemakers for ascertaining the size of the foot. Syn. -- Dimension; bigness; largeness; greatness; magnitude.\n\n1. To fix the standard of. \"To size weights and measures.\" [R.] Bacon. 2. To adjust or arrange according to size or bulk. Specifically: (a) (Mil.) To take the height of men, in order to place them in the ranks according to their stature. (b) (Mining) To sift, as pieces of ore or metal, in order to separate the finer from the coarser parts. 3. To swell; to increase the bulk of. Beau. & Fl. 4. (Mech.)  To bring or adjust anything exactly to a required dimension, as by cutting. To size up, to estimate or ascertain the character and ability of. See 4th Size, 4. [Slang, U.S.] We had to size up our fellow legislators. The Century.\n\n1. To take greater size; to increase in size. Our desires give them fashion, and so, As they wax lesser, fall, as they size, grow. Donne. 2. (Univ. of Cambridge, Eng.)  To order food or drink from the buttery; hence, to enter a score, as upon the buttery book."}