{"word":"skeptic","definition":"1. One who is yet undecided as to what is true; one who is looking or inquiring for what is true; an inquirer after facts or reasons. 2. (Metaph.)  A doubter as to whether any fact or truth can be certainly known; a universal doubter; a Pyrrhonist; hence, in modern usage, occasionally, a person who questions whether any truth or fact can be established on philosophical grounds; sometimes, a critical inquirer, in opposition to a dogmatist. All this criticism [of Hume] proceeds upon the erroneous hypothesis that he was a dogmatist. He was a skeptic; that is, he accepted the principles asserted by the prevailing dogmatism: and only showed that such and such conclusions were, on these principles, inevitable. Sir W. Hamilton. 3. (Theol.)  A person who doubts the existence and perfections of God, or the truth of revelation; one who disbelieves the divine origin of the Christian religion. Suffer not your faith to be shaken by the sophistries of skeptics. S. Clarke. Note: This word and its derivatives are often written with c instead of k in the first syllable, -- sceptic, sceptical, scepticism, etc. Dr. Johnson, struck with the extraordinary irregularity of giving c its hard sound before e, altered the spelling, and his example has been followed by most of the lexicographers who have succeeded him; yet the prevalent practice among English writers and printers is in favor of the other mode. In the United States this practice is reversed, a large and increasing majority of educated persons preferring the orthography which is most in accordance with etymology and analogy. Syn. -- Infidel; unbeliever; doubter. -- See Infidel.\n\n1. Of or pertaining to a sceptic or skepticism; characterized by skepticism; hesitating to admit the certainly of doctrines or principles; doubting of everything. 2. (Theol.)  Doubting or denying the truth of revelation, or the sacred Scriptures. The skeptical system subverts the whole foundation of morals. R. Hall. -- Skep\"tac*al*ly, adv. -- Skep\"tic*al*ness, n."}