{"word":"sleep","definition":"imp. of Sleep. Slept. Chaucer.\n\n1. To take rest by a suspension of the voluntary exercise of the powers of the body and mind, and an apathy of the organs of sense; to slumber. Chaucer. Watching at the head of these that sleep. Milton. 2. Figuratively: (a) To be careless, inattentive, or uncouncerned; not to be vigilant; to live thoughtlessly. We sleep over our happiness. Atterbury. (b) To be dead; to lie in the grave. Them also which sleep in Jesus will God bring with him. 1 Thess. iv. 14. (c) To be, or appear to be, in repose; to be quiet; to be unemployed, unused, or unagitated; to rest; to lie dormant; as, a question sleeps for the present; the law sleeps. How sweet the moonlight sleep upon this bank! Shak.\n\n1. To be slumbering in; -- followed by a cognate object; as, to sleep a dreamless sleep. Tennyson. 2. To give sleep to; to furnish with accomodations for sleeping; to lodge. [R.] Blackw. Mag. To sleep away, to spend in sleep; as, to sleep away precious time. -- To sleep off, to become free from by sleep; as, to sleep off drunkeness or fatigue.\n\nA natural and healthy, but temporary and periodical, suspension of the functions of the organs of sense, as well as of those of the voluntary and rational soul; that state of the animal in which there is a lessened acuteness of sensory perception, a confusion of ideas, and a loss of mental control, followed by a more or less unconscious state. \"A man that waketh of his sleep.\" Chaucer. O sleep, thou ape of death. Shak. Note: Sleep is attended by a relaxation of the muscles, and the absence of voluntary activity for any rational objects or purpose. The pulse is slower, the respiratory movements fewer in number but more profound, and there is less blood in the cerebral vessels. It is susceptible of greater or less intensity or completeness in its control of the powers. Sleep of plants (Bot.), a state of plants, usually at night, when their leaflets approach each other, and the flowers close and droop, or are covered by the folded leaves. Syn. -- Slumber; repose; rest; nap; doze; drowse."}