{"word":"slide","definition":"1. To move along the surface of any body by slipping, or without walking or rolling; to slip; to glide; as, snow slides down the mountain's side. 2. Especially, to move over snow or ice with a smooth, uninterrupted motion, as on a sled moving by the force of gravity, or on the feet. They bathe in summer, and in winter slide. Waller. 3. To pass inadvertently. Beware thou slide not by it. Ecclus. xxviii. 26. 4. To pass along smoothly or unobservedly; to move gently onward without friction or hindrance; as, a ship or boat slides through the water. Ages shall slide away without perceiving. Dryden. Parts answering parts shall slide into a whole. Pope. 5. To slip when walking or standing; to fall. Their foot shall slide in due time. Deut. xxxii. 35. 6. (Mus.)  To pass from one note to another with no perceptible cassation of sound. 7. To pass out of one's thought as not being of any consequence. [Obs. or Colloq.] With good hope let he sorrow slide. Chaucer. With a calm carelessness letting everything slide. Sir P. Sidney.\n\n1. To cause to slide; to thrust along; as, to slide one piece of timber along another. 2. To pass or put imperceptibly; to slip; as, to slide in a word to vary the sense of a question.\n\n1. The act of sliding; as, a slide on the ice. 2. Smooth, even passage or progress. A better slide into their business. Bacon. 3. That on which anything moves by sliding. Specifically: (a) An inclined plane on which heavy bodies slide by the force of gravity, esp. one constructed on a mountain side for conveying logs by sliding them down. (b) A surface of ice or snow on which children slide for amusement. 4. That which operates by sliding. Specifically: (a) A cover which opens or closes an aperture by sliding over it. (b) (Mach.) A moving piece which is guided by a part or parts along which it slides. (c) A clasp or brooch for a belt, or the like. 5. A plate or slip of glass on which is a picture or delineation to be exhibited by means of a magic lantern, stereopticon, or the like; a plate on which is an object to be examined with a microscope. 6. The descent of a mass of earth, rock, or snow down a hill or mountain side; as, a land slide, or a snow slide; also, the track of bare rock left by a land slide. 7. (Geol.)  A small dislocation in beds of rock along a line of fissure. Dana. 8. (Mus.) (a) A grace consisting of two or more small notes moving by conjoint degrees, and leading to a principal note either above or below. (b) An apparatus in the trumpet and trombone by which the sounding tube is lengthened and shortened so as to produce the tones between the fundamental and its harmonics. 9. (Phonetics)  A sound which, by a gradual change in the position of the vocal organs, passes imperceptibly into another sound. 10. (Steam Engine) (a) Same as Guide bar, under Guide. (b) A slide valve. Slide box (Steam Engine), a steam chest. See under Steam. -- Slide lathe, an engine lathe. See under Lathe. -- Slide rail, a transfer table. See under Transfer. -- Slide rest (Turning lathes), a contrivance for holding, moving, and guiding, the cutting tool, made to slide on ways or guides by screws or otherwise, and having compound motion. -- Slide rule, a mathematical instrument consisting of two parts, one of which slides upon the other, for the mechanical performance of addition and subtraction, and, by means of logarithmic scales, of multiplication and division. -- Slide valve. (a) Any valve which opens and closes a passageway by sliding over a port. (b) A particular kind of sliding valve, often used in steam engines for admitting steam to the piston and releasing it, alternately, having a cuplike cavity in its face, through which the exhaust steam passes. It is situated in the steam chest, and moved by the valve gear. It is sometimes called a D valve, -- a name which is also applied to a semicylindrical pipe used as a sliding valve. In the illustration, a is the cylinder of a steam engine, in which plays the piston p; b the steam chest, receiving its supply from the pipe i, and containing the slide valve s, which is shown as admitting steam to one end of the cylinder through the port e, and opening communication between the exhaust passage f and the port c, for the release of steam from the opposite end of the cylinder."}