{"word":"slight","definition":"Sleight. Spenser.\n\n1. To overthrow; to demolish. [Obs.] Clarendon. 2. To make even or level. [Obs.] Hexham. 3. To throw heedlessly. [Obs.] The rogue slighted me into the river. Shak.\n\n1. Not decidedly marked; not forcible; inconsiderable; unimportant; insignificant; not severe; weak; gentle; -- applied in a great variety of circumstances; as, a slight (i. e., feeble) effort; a slight (i. e., perishable) structure; a slight (i. e., not deep) impression; a slight (i. e., not convincing) argument; a slight (i. e., not thorough) examination; slight (i. e., not severe) pain, and the like. \"At one slight bound.\" Milton. Slight is the subject, but not so the praise. Pope. Some firmly embrace doctrines upon slight grounds. Locke. 2. Not stout or heavy; slender. His own figure, which was formerly so slight. Sir W. Scott. 3. Foolish; silly; weak in intellect. Hudibras.\n\nTo disregard, as of little value and unworthy of notice; to make light of; as, to slight the divine commands. Milton. The wretch who slights the bounty of the skies. Cowper. To slight off, to treat slightingly; to drive off; to remove. [R.] -- To slight over, to run over in haste; to perform superficially; to treat carelessly; as, to slight over a theme. \"They will but slight it over.\" Bacon. Syn. -- To neglect; disregard; disdain; scorn. -- Slight, Neglect. To slight is stronger than to neglect. We may neglect a duty or person from inconsiderateness, or from being over- occupied in other concerns. To slight is always a positive and intentional act, resulting from feelings of dislike or contempt. We ought to put a kind construction on what appears neglect on the part of a friend; but when he slights us, it is obvious that he is our friend no longer. Beware . . . lest the like befall . . . If they transgress and slight that sole command. Milton. This my long-sufferance, and my day of grace, Those who neglect and scorn shall never taste. Milton.\n\nThe act of slighting; the manifestation of a moderate degree of contempt, as by neglect or oversight; neglect; indignity. Syn. -- Neglect; disregard; inattention; contempt; disdain; scorn; disgrace; indignity; disparagement.\n\nSlightly. [Obs. or Poetic] Think not so slight of glory. Milton."}