{"word":"slip","definition":"1. To move along the surface of a thing without bounding, rolling, or stepping; to slide; to glide. 2. To slide; to lose one's footing or one's hold; not to tread firmly; as, it is necessary to walk carefully lest the foot should slip. 3. To move or fly (out of place); to shoot; -- often with out, off, etc.; as, a bone may slip out of its place. 4. To depart, withdraw, enter, appear, intrude, or escape as if by sliding; to go or come in a quiet, furtive manner; as, some errors slipped into the work. Thus one tradesman slips away, To give his partner fairer play. Prior. Thrice the flitting shadow slipped away. Dryden. 5. To err; to fall into error or fault. There is one that slippeth in his speech, but not from his heart. Ecclus. xix. 16. To let slip, to loose from the slip or noose, as a hound; to allow to escape. Cry, \"Havoc,\" and let slip the dogs of war. Shak.\n\n1. To cause to move smoothly and quickly; to slide; to convey gently or secretly. He tried to slip a powder into her drink. Arbuthnot. 2. To omit; to loose by negligence. And slip no advantage That my secure you. B. Jonson. 3. To cut slips from; to cut; to take off; to make a slip or slips of; as, to slip a piece of cloth or paper. The branches also may be slipped and planted. Mortimer. 4. To let loose in pursuit of game, as a greyhound. Lucento slipped me like his greyhound. Shak. 5. To cause to slip or slide off, or out of place; as, a horse slips his bridle; a dog slips his collar. 6. To bring forth (young) prematurely; to slink. To slip a cable. (Naut.) See under Cable. -- To slip off, to take off quickly; as, to slip off a coat. -- To slip on, to put on in haste or loosely; as, to slip on a gown or coat.\n\n1. The act of slipping; as, a slip on the ice. 2. An unintentional error or fault; a false step. This good man's slip mended his pace to martyrdom. Fuller. 3. A twig separated from the main stock; a cutting; a scion; hence, a descendant; as, a slip from a vine. A native slip to us from foreign seeds. Shak. The girlish slip of a Sicilian bride. R. Browning. 4. A slender piece; a strip; as, a slip of paper. Moonlit slips of silver cloud. Tennyson. A thin slip of a girl, like a new moon Sure to be rounded into beauty soon. Longfellow. 5. A leash or string by which a dog is held; -- so called from its being made in such a manner as to slip, or become loose, by relaxation of the hand. We stalked over the extensive plains with Killbuck and Lena in the slips, in search of deer. Sir S. Baker. 6. An escape; a secret or unexpected desertion; as, to give one the slip. Shak. 7. (Print.)  A portion of the columns of a newspaper or other work struck off by itself; a proof from a column of type when set up and in the galley. 8. Any covering easily slipped on. Specifically: (a) A loose garment worn by a woman. (b) A child's pinafore. (c) An outside covering or case; as, a pillow slip. (d) The slip or sheath of a sword, and the like. [R.] 9. A counterfeit piece of money, being brass covered with silver. [Obs.] Shak 10. Matter found in troughs of grindstones after the grinding of edge tools. [Prov. Eng.] Sir W. Petty. 11. Potter's clay in a very liquid state, used for the decoration of ceramic ware, and also as a cement for handless and other applied parts. 12. A particular quantity of yarn. [Prov. Eng.] 13. An inclined plane on which a vessel is built, or upon which it is hauled for repair. 14. An opening or space for vessels to lie in, between wharves or in a dock; as, Peck slip. [U. S.] 15. A narrow passage between buildings. [Eng.] 16. A long seat or narrow pew in churches, often without a door. [U. S.] 17. (Mining.)  A dislocation of a lead, destroying continuity. Knight. 18. (Engin.)  The motion of the center of resistance of the float of a paddle wheel, or the blade of an oar, through the water horozontally, or the difference between a vessel's actual speed and the speed which she would have if the propelling instrument acted upon a solid; also, the velocity, relatively to still water, of the backward current of water produced by the propeller. 19. (Zoöl.)  A fish, the sole. 20. (Cricket)  A fielder stationed on the off side and to the rear of the batsman. There are usually two of them, called respectively short slip, and long slip. To give one the slip, to slip away from one; to elude one. -- Slip dock. See under Dock. -- Slip link (Mach.), a connecting link so arranged as to allow some play of the parts, to avoid concussion. -- Slip rope (Naut.), a rope by which a cable is secured preparatory to slipping. Totten. -- Slip stopper (Naut.), an arrangement for letting go the anchor suddenly."}