{"word":"slow","definition":"imp. of Slee, to slay. Slew. Chaucer.\n\n1. Moving a short space in a relatively long time; not swift; not quick in motion; not rapid; moderate; deliberate; as, a slow stream; a slow motion. 2. Not happening in a short time; gradual; late. These changes in the heavens, though slow, produced Like change on sea and land, sidereal blast. Milton. 3. Not ready; not prompt or quick; dilatory; sluggish; as, slow of speech, and slow of tongue. Fixed on defense, the Trojans are not slow To guard their shore from an expected foe. Dryden. 4. Not hasty; not precipitate; acting with deliberation; tardy; inactive. He that is slow to wrath is of great understanding. Prov. xiv. 29. 5. Behind in time; indicating a time earlier than the true time; as, the clock or watch is slow. 6. Not advancing or improving rapidly; as, the slow growth of arts and sciences. 7. Heavy in wit; not alert, prompt, or spirited; wearisome; dull. [Colloq.] Dickens. Thackeray. Note: Slow is often used in the formation of compounds for the most part self-explaining; as, slow-gaited, slow-paced, slow-sighted, slow-winged, and the like. Slow coach, a slow person. See def.7, above. [Colloq.] -- Slow lemur, or Slow loris (Zoöl.), an East Indian nocturnal lemurine animal (Nycticebus tardigradus) about the size of a small cat; -- so called from its slow and deliberate movements. It has very large round eyes and is without a tail. Called also bashful Billy. -- Slow match. See under Match. Syn. -- Dilatory; late; lingering; tardy; sluggish; dull; inactive. -- Slow, Tardy, Dilatory. Slow is the wider term, denoting either a want of rapid motion or inertness of intellect. Dilatory signifies a proneness to defer, a habit of delaying the performance of what we know must be done. Tardy denotes the habit of being behind hand; as, tardy in making up one's acounts.\n\nSlowly. Let him have time to mark how slow time goes In time of sorrow. Shak.\n\nTo render slow; to slacken the speed of; to retard; to delay; as, to slow a steamer. Shak.\n\nTo go slower; -- often with up; as, the train slowed up before crossing the bridge.\n\nA moth. [Obs.] Rom. of R."}