{"word":"smoke","definition":"1. The visible exhalation, vapor, or substance that escapes, or expelled, from a burning body, especially from burning vegetable matter, as wood, coal, peat, or the like. Note: The gases of hydrocarbons, raised to a red heat or thereabouts, without a mixture of air enough to produce combustion, disengage their carbon in a fine powder, forming smoke. The disengaged carbon when deposited on solid bodies is soot. 2. That which resembles smoke; a vapor; a mist. 3. Anything unsubstantial, as idle talk. Shak. 4. The act of smoking, esp. of smoking tobacco; as, to have a smoke. [Colloq.] Note: Smoke is sometimes joined with other word. forming self- explaining compounds; as, smoke-consuming, smoke-dried, smoke- stained, etc. Smoke arch, the smoke box of a locomotive. -- Smoke ball (Mil.), a ball or case containing a composition which, when it burns, sends forth thick smoke. -- Smoke black, lampblack. [Obs.] -- Smoke board, a board suspended before a fireplace to prevent the smoke from coming out into the room. -- Smoke box, a chamber in a boiler, where the smoke, etc., from the furnace is collected before going out at the chimney. -- Smoke sail (Naut.), a small sail in the lee of the galley stovepipe, to prevent the smoke from annoying people on deck. -- Smoke tree (Bot.), a shrub (Rhus Cotinus) in which the flowers are mostly abortive and the panicles transformed into tangles of plumose pedicels looking like wreaths of smoke. -- To end in smoke, to burned; hence, to be destroyed or ruined; figuratively, to come to nothing. Syn. -- Fume; reek; vapor.\n\n1. To emit smoke; to throw off volatile matter in the form of vapor or exhalation; to reek. Hard by a cottage chimney smokes. Milton. 2. Hence, to burn; to be kindled; to rage. The anger of the Lord and his jealousy shall smoke agains. that man. Deut. xxix. 20. 3. To raise a dust or smoke by rapid motion. Proud of his steeds, he smokes along the field. Dryden. 4. To draw into the mouth the smoke of tobacco burning in a pipe or in the form of a cigar, cigarette, etc.; to habitually use tobacco in this manner. 5. To suffer severely; to be punished. Some of you shall smoke for it in Rome. Shak.\n\n1. To apply smoke to; to hang in smoke; to disinfect, to cure, etc., by smoke; as, to smoke or fumigate infected clothing; to smoke beef or hams for preservation. 2. To fill or scent with smoke; hence, to fill with incense; to perfume. \"Smoking the temple.\" Chaucer. 3. To smell out; to hunt out; to find out; to detect. I alone Smoked his true person, talked with him. Chapman. He was first smoked by the old Lord Lafeu. Shak. Upon that . . . I began to smoke that they were a parcel of mummers. Addison. 4. To ridicule to the face; to quiz. [Old Slang] 5. To inhale and puff out the smoke of, as tobacco; to burn or use in smoking; as, to smoke a pipe or a cigar. 6. To subject to the operation of smoke, for the purpose of annoying or driving out; -- often with out; as, to smoke a woodchuck out of his burrow."}