{"word":"smooth","definition":"1. Having an even surface, or a surface so even that no roughness or points can be perceived by the touch; not rough; as, smooth glass; smooth porcelain. Chaucer. The outlines must be smooth, imperceptible to the touch, and even, without eminence or cavities. Dryden. 2. Evenly spread or arranged; sleek; as, smooth hair. 3. Gently flowing; moving equably; not ruffled or obstructed; as, a smooth stream. 4. Flowing or uttered without check, obstruction, or hesitation; not harsh; voluble; even; fluent. The only smooth poet of those times. Milton. Waller was smooth; but Dryden taught to join The varying verse, the full-resounding line. Pope. When sage Minerva rose, From her sweet lips smooth elocution flows. Gay. 5. Bland; mild; smoothing; fattering. This smooth discourse and mild behavior oft Conceal a traitor. Addison. 6. (Mech. & Physics)  Causing no resistance to a body sliding along its surface; frictionless. Note: Smooth is often used in the formation of selfexplaining compounds; as, smooth-bodied, smooth-browed, smooth-combed, smooth- faced, smooth-finished, smooth-gliding, smooth-grained, smooth- leaved, smooth-sliding, smooth-speaking, smooth-woven, and the like. Syn. -- Even; plain; level; flat; polished; glossy; sleek; soft; bland; mild; soothing; voluble; flattering; adulatory; deceptive.\n\nSmoothly. Chaucer. Smooth runs the water where the brook is deep. Shak.\n\n1. The act of making smooth; a stroke which smooths. Thackeray. 2. That which is smooth; the smooth part of anything. \"The smooth of his neck.\" Gen. xxvii. 16.\n\nTo make smooth; to make even on the surface by any means; as, to smooth a board with a plane; to smooth cloth with an iron. Specifically: -- (a) To free from obstruction; to make easy. Thou, Abelard! the last sad office pay, And smooth my passage to the realms of day. Pope. (b) To free from harshness; to make flowing. In their motions harmony divine So smooths her charming tones that God's own ear Listens delighted. Milton. (c) To palliate; to gloze; as, to smooth over a fault. (d) To give a smooth or calm appearance to. Each perturbation smoothed with outward calm. Milton. (e) To ease; to regulate. Dryden.\n\nTo flatter; to use blandishment. Because I can not flatter and speak fair, Smile in men's faces, smooth, deceive and cog. Shak."}