{"word":"snap","definition":"1. To break at once; to break short, as substances that are brittle. Breaks the doors open, snaps the locks. Prior. 2. To strike, to hit, or to shut, with a sharp sound. 3. To bite or seize suddenly, especially with the teeth. He, by playing too often at the mouth of death, has been snapped by it at last. South. 4. To break upon suddenly with sharp, angry words; to treat snappishly; -- usually with up. Granville. 5. To crack; to cause to make a sharp, cracking noise; as, to snap a whip. MacMorian snapped his fingers repeatedly. Sir W. Scott. 6. To project with a snap. To snap back (Football), to roll the ball back with the foot; -- done only by the center rush, who thus delivers the ball to the quarter back on his own side when both sides are ranged in line. -- To snap off. (a) To break suddenly. (b) To bite off suddenly.\n\n1. To break short, or at once; to part asunder suddenly; as, a mast snaps; a needle snaps. But this weapon will snap short, unfaithful to the hand that employs it. Burke. 2. To give forth, or produce, a sharp, cracking noise; to crack; as, blazing firewood snaps. 3. To make an effort to bite; to aim to seize with the teeth; to catch eagerly (at anything); -- often with at; as, a dog snapsat a passenger; a fish snaps at the bait. 4. To utter sharp, harsh, angry words; -- often with at; as, to snap at a child. 5. To miss fire; as, the gun snapped.\n\n1. A sudden breaking or rupture of any substance. 2. A sudden, eager bite; a sudden seizing, or effort to seize, as with the teeth. 3. A sudden, sharp motion or blow, as with the finger sprung from the thumb, or the thumb from the finger. 4. A sharp, abrupt sound, as that made by the crack of a whip; as, the snap of the trigger of a gun. 5. A greedy fellow. L'Estrange. 6. That which is, or may be, snapped up; something bitten off, seized, or obtained by a single quick movement; hence, a bite, morsel, or fragment; a scrap. He's a nimble fellow, And alike skilled in every liberal science, As having certain snaps of all. B. Jonson. 7. A sudden severe interval or spell; -- applied to the weather; as, a cold snap. Lowell. 8. A small catch or fastening held or closed by means of a spring, or one which closes with a snapping sound, as the catch of a bracelet, necklace, clasp of a book, etc. 9. (Zoöl.)  A snap beetle. 10. A thin, crisp cake, usually small, and flavored with ginger; -- used chiefly in the plural. 11. Briskness; vigor; energy; decision. [Colloq.] 12. Any circumstance out of which money may be made or an advantage gained. [Slang] Snap back (Football), the act of snapping back the ball. -- Snap beetle, or Snap bug (Zoöl.), any beetle of the family Elateridæ, which, when laid on its back, is able to leap to a considerable height by means of a thoracic spring; -- called also snapping beetle. -- Snap flask (Molding), a flask for small work, having its sides separable and held together by latches, so that the flask may be removed from around the sand mold. -- Snap judgment, a judgment formed on the instant without deliberation. -- Snap lock, a lock shutting with a catch or snap. -- Snap riveting, riveting in which the rivets have snapheads formed by a die or swaging tool. -- Snap shot, a quick offhand shot, without deliberately taking aim."}