{"word":"snow","definition":"A square-rigged vessel, differing from a brig only in that she has a trysail mast close abaft the mainmast, on which a large trysail is hoisted.\n\n1. Watery particles congealed into white or transparent crystals or flakes in the air, and falling to the earth, exhibiting a great variety of very beautiful and perfect forms. Note: Snow is often used to form compounds, most of which are of obvious meaning; as, snow-capped, snow-clad, snow-cold, snow-crowned, snow-crust, snow-fed, snow-haired, snowlike, snow-mantled, snow- nodding, snow-wrought, and the like. 2. Fig.: Something white like snow, as the white color (argent) in heraldry; something which falls in, or as in, flakes. The field of snow with eagle of black therein. Chaucer. Red snow. See under Red. Snow bunting. (Zoöl.) See Snowbird, 1. -- Snow cock (Zoöl.), the snow pheasant. -- Snow flea (Zoöl.), a small black leaping poduran (Achorutes nivicola) often found in winter on the snow in vast numbers. -- Snow flood, a flood from melted snow. -- Snow flower (Bot.), the fringe tree. -- Snow fly, or Snow insect (Zoöl.), any one of several species of neuropterous insects of the genus Boreus. The male has rudimentary wings; the female is wingless. These insects sometimes appear creeping and leaping on the snow in great numbers. -- Snow gnat (Zoöl.), any wingless dipterous insect of the genus Chionea found running on snow in winter. -- Snow goose (Zoöl.), any one of several species of arctic geese of the genus Chen. The common snow goose (Chen hyperborea), common in the Western United States in winter, is white, with the tips of the wings black and legs and bill red. Called also white brant, wavey, and Texas goose. The blue, or blue-winged, snow goose (C. coerulescens) is varied with grayish brown and bluish gray, with the wing quills black and the head and upper part of the neck white. Called also white head, white-headed goose, and bald brant. -- Snow leopard (Zool.), the ounce. -- Snow line, lowest limit of perpetual snow. In the Alps this is at an altitude of 9,000 feet, in the Andes, at the equator, 16,000 feet. -- Snow mouse (Zoöl.), a European vole (Arvicola nivalis) which inhabits the Alps and other high mountains. -- Snow pheasant (Zoöl.), any one of several species of large, handsome gallinaceous birds of the genus Tetraogallus, native of the lofty mountains of Asia. The Himalayn snow pheasant (T.Himalayensis) in the best-known species. Called also snow cock, and snow chukor. -- Snow partridge. (Zoöl.) See under Partridge. -- Snow pigeon (Zoöl.), a pigeon (Columba leuconota) native of the Himalaya mountains. Its back, neck, and rump are white, the top of the head and the ear coverts are black. -- Snow plant (Bot.), a fleshy parasitic herb (Sarcodes sanguinea) growing in the coniferous forests of California. It is all of a bright red color, and is fabled to grow from the snow, through which it sometimes shoots up.\n\nTo fall in or as snow; -- chiefly used impersonally; as, it snows; it snowed yesterday.\n\nTo scatter like snow; to cover with, or as with, snow. Donne. Shak."}