{"word":"so","definition":"1. In that manner or degree; as, indicated (in any way), or as implied, or as supposed to be known. Why is his chariot so long in coming Judges v. 28. 2. In like manner or degree; in the same way; thus; for like reason; whith equal reason; -- used correlatively, following as, to denote comparison or resemblance; sometimes, also, following inasmuch as. As a war should be undertaken upon a just motive, so a prince ought to consider the condition he is in. Swift. 3. In such manner; to such degree; -- used correlatively with as or that following; as, he was so fortunate as to escape. I viewed in may mind, so far as I was able, the beginning and progress of a rising world. T. Burnet. He is very much in Sir Roger's esteem, so that he lives in the family rather as a relation than dependent. Addison. 4. Very; in a high degree; that is, in such a degree as can not well be expressed; as, he is so good; he planned so wisely. 5. In the same manner; as has been stated or suggested; in this or that condition or state; under these circumstances; in this way; -- with reflex reference to something just asserted or implied; used also with the verb to be, as a predicate. Use him [your tutor] with great respect yourself, and cause all your family to do so too. Locke. It concerns every man, with the greatest seriousness, to inquire into those matters, whether they be so or not. Tillotson. He is Sir Robert's son, and so art thou. Shak. 6. The case being such; therefore; on this account; for this reason; on these terms; -- used both as an adverb and a conjuction. God makes him in his own image an intellectual creature, and so capable of dominion. Locke. Here, then, exchange we mutually forgiveness; So may the guilt of all my broken vows, My perjuries to thee, be all forgotten. Rowe. 7. It is well; let it be as it is, or let it come to pass; -- used to express assent. And when 't is writ, for my sake read it over, And if it please you, so; if not, why, so. Shak. There is Percy; if your father will do me any honor, so; if not, let him kill the next Percy himself. Shak. 8. Well; the fact being as stated; -- used as an expletive; as, so the work is done, is it 9. Is it thus do you mean what you say -- with an upward tone; as, do you say he refuses So [Colloq.] 10. About the number, time, or quantity specified; thereabouts; more or less; as, I will spend a week or so in the country; I have read only a page or so. A week or so will probably reconcile us. Gay. Note: See the Note under Ill, adv. So . . . as. So is now commonly used as a demonstrative correlative of as when it is the puprpose to emphasize the equality or comparison suggested, esp. in negative assertions, and questions implying a negative answer. By Shakespeare and others so . . . as was much used where as . . . as is now common. See the Note under As, 1. So do, as thou hast said. Gen. xviii. 5. As a flower of the field, so he flourisheth. Ps. ciii. 15. Had woman been so strong as men. Shak. No country suffered so much as England. Macaulay. -- So far, to that point or extent; in that particular. \"The song was moral, and so far was right.\" Cowper. -- So far forth, as far; to such a degree. Shak. Bacon. -- So forth, further in the same or similar manner; more of the same or a similar kind. See And so forth, under And. -- So, so, well, well. \"So, so, it works; now, mistress, sit you fast.\" Dryden. Also, moderately or tolerably well; passably; as, he succeeded but so so. \"His leg is but so so.\" Shak. -- So that, to the end that; in order that; with the effect or result that. -- So then, thus then it is; therefore; the consequence is.\n\nProvided that; on condition that; in case that; if. Though all the winds of doctrine were let loose play upon the earth, so truth be in the field, we do injuriously, by licensing and prohibiting, to misdoubt her strength. Milton.\n\nBe as you are; stand still; stop; that will do; right as you are; -- a word used esp. to cows; also used by sailors."}