{"word":"soap","definition":"A substance which dissolves in water, thus forming a lather, and is used as a cleansing agent. Soap is produced by combining fats or oils with alkalies or alkaline earths, usually by boiling, and consists of salts of sodium, potassium, etc., with the fatty acids (oleic, stearic, palmitic, etc.). See the Note below, and cf. Saponification. By extension, any compound of similar composition or properties, whether used as a cleaning agent or not. Note: In general, soaps are of two classes, hard and soft. Calcium, magnesium, lead, etc., form soaps, but they are insoluble and useless. The purifying action of soap depends upon the fact that it is decomposed by a large quantity of water into free alkali and an insoluble acid salt. The first of these takes away the fatty dirt on washing, and the latter forms the soap lather which envelops the greasy matter and thus tends to remove it. Roscoe & Schorlemmer. Castile soap, a fine-grained hard soap, white or mottled, made of olive oil and soda; -- called also Marseilles, or Venetian, soap. -- Hard soap, any one of a great variety of soaps, of different ingredients and color, which are hard and compact. All solid soaps are of this class. -- Lead soap, an insoluble, white, pliable soap made by saponifying an oil (olive oil) with lead oxide; -- used externally in medicine. Called also lead plaster, diachylon, etc. -- Marine soap. See under Marine. -- Pills of soap (Med.), pills containing soap and opium. -- Potash soap, any soap made with potash, esp. the soft soaps, and a hard soap made from potash and castor oil. -- Pumice soap, any hard soap charged with a gritty powder, as silica, alumina, powdered pumice, etc., which assists mechanically in the removal of dirt. -- Resin soap, a yellow soap containing resin, -- used in bleaching. -- Silicated soap, a cheap soap containing water glass (sodium silicate). -- Soap bark. (Bot.) See Quillaia bark. -- Soap bubble, a hollow iridescent globe, formed by blowing a film of soap suds from a pipe; figuratively, something attractive, but extremely unsubstantial. This soap bubble of the metaphysicians. J. C. Shairp. -- Soap cerate, a cerate formed of soap, olive oil, white wax, and the subacetate of lead, sometimes used as an application to allay inflammation. -- Soap fat, the refuse fat of kitchens, slaughter houses, etc., used in making soap. -- Soap liniment (Med.), a liniment containing soap, camphor, and alcohol. -- Soap nut, the hard kernel or seed of the fruit of the soapberry tree, -- used for making beads, buttons, etc. -- Soap plant (Bot.), one of several plants used in the place of soap, as the Chlorogalum pomeridianum, a California plant, the bulb of which, when stripped of its husk and rubbed on wet clothes, makes a thick lather, and smells not unlike new brown soap. It is called also soap apple, soap bulb, and soap weed. -- Soap tree. (Bot.) Same as Soapberry tree. -- Soda soap, a soap containing a sodium salt. The soda soaps are all hard soaps. -- Soft soap, a soap of a gray or brownish yellow color, and of a slimy, jellylike consistence, made from potash or the lye from wood ashes. It is strongly alkaline and often contains glycerin, and is used in scouring wood, in cleansing linen, in dyehouses, etc. Figuratively, flattery; wheedling; blarney. [Colloq.] -- Toilet soap, hard soap for the toilet, usually colored and perfumed.\n\n1. To rub or wash over with soap. 2. To flatter; to wheedle. [Slang]"}