{"word":"soft","definition":"1. Easily yielding to pressure; easily impressed, molded, or cut; not firm in resisting; impressible; yielding; also, malleable; -- opposed to Ant: hard; as, a soft bed; a soft peach; soft earth; soft wood or metal. 2. Not rough, rugged, or harsh to the touch; smooth; delicate; fine; as, soft silk; a soft skin. They that wear soft clothing are in king's houses. Matt. xi. 8. 3. Hence, agreeable to feel, taste, or inhale; not irritating to the tissues; as, a soft liniment; soft wines. \"The soft, delicious air.\" Milton. 4. Not harsh or offensive to the sight; not glaring; pleasing to the eye; not exciting by intensity of color or violent contrast; as, soft hues or tints. The sun, shining upon the upper part of the clouds . . . made the softest lights imaginable. Sir T. Browne. 5. Not harsh or rough in sound; gentle and pleasing to the ear; flowing; as, soft whispers of music. Her voice was ever soft, Gentle, and low, -- an excellent thing in woman. Shak. Soft were my numbers; who could take offense Pope. 6. Easily yielding; susceptible to influence; flexible; gentle; kind. I would to God my heart were flint, like Edward's; Or Edward's soft and pitiful, like mine. Shak. The meek or soft shall inherit the earth. Tyndale. 7. Expressing gentleness, tenderness, or the like; mild; conciliatory; courteous; kind; as, soft eyes. A soft answer turneth away wrath. Prov. xv. 1. A face with gladness overspread, Soft smiles, by human kindness bred. Wordsworth. 8. Effeminate; not courageous or manly, weak. A longing after sensual pleasures is a dissolution of the spirit of a man, and makes it loose, soft, and wandering. Jer. Taylor. 9. Gentle in action or motion; easy. On her soft axle, white she paces even, And bears thee soft with the smooth air along. Milton. 10. Weak in character; impressible. The deceiver soon found this soft place of Adam's. Glanvill. 11. Somewhat weak in intellect. [Colloq.] He made soft fellows stark noddies, and such as were foolish quite mad. Burton. 12. Quiet; undisturbed; paceful; as, soft slumbers. 13. Having, or consisting of, a gentle curve or curves; not angular or abrupt; as, soft outlines. 14. Not tinged with mineral salts; adapted to decompose soap; as, soft water is the best for washing. 15. (Phonetics) (a) Applied to a palatal, a sibilant, or a dental consonant (as g in gem, c in cent, etc.) as distinguished from a guttural mute (as g in go, c in cone, etc.); -- opposed to hard. (b) Belonging to the class of sonant elements as distinguished from the surd, and considered as involving less force in utterance; as, b, d, g, z, v, etc., in contrast with p, t, k, s, f, etc. Soft clam (Zoöl.), the common or long clam (Mya arenaria). See Mya. -- Soft coal, bituminous coal, as distinguished from anthracite, or hard, coal. -- Soft crab (Zoöl.), any crab which has recently shed its shell. -- Soft dorsal (Zoöl.), the posterior part of the dorsal fin of fishes when supported by soft rays. -- Soft grass. (Bot.) See Velvet grass. -- Soft money, paper money, as distinguished from coin, or hard money. [Colloq. U.S.] -- Soft mute. (Phonetics) See Media. -- Soft palate. See the Note under Palate. -- Soft ray (Zoöl.), a fin ray which is articulated and usually branched. -- Soft soap. See under Soap. -- Soft-tack, leavened bread, as distinguished from hard-tack, or ship bread. -- Soft tortoise (Zoöl.), any river tortoise of the genus Trionyx. See Trionyx.\n\nA soft or foolish person; an idiot. [Colloq.] G. Eliot.\n\nSoftly; without roughness or harshness; gently; quietly. Chaucer. A knight soft riding toward them. Spenser.\n\nBe quiet; hold; stop; not so fast. Soft, you; a word or two before you go. Shak."}