{"word":"solar","definition":"A loft or upper chamber; a garret room. [Obs.] [Written also soler, solere, sollar.] Oxf. Gloss.\n\n1. Of or pertaining to the sun; proceeding from the sun; as, the solar system; solar light; solar rays; solar influence. See Solar system, below. 2. (Astrol.)  Born under the predominant influence of the sun. [Obs.] And proud beside, as solar people are. Dryden. 3. Measured by the progress or revolution of the sun in the ecliptic; as, the solar year. 4. Produced by the action of the sun, or peculiarly affected by its influence. They denominate some herbs solar, and some lunar. Bacon. Solar cycle. See under Cycle. -- Solar day. See Day, 2. -- Solar engine, an engine in which the energy of solar heat is used to produce motion, as in evaporating water for a steam engine, or expanding air for an air engine. -- Solar flowers (Bot.), flowers which open and shut daily at certain hours. -- Solar lamp, an argand lamp. -- Solar microscope, a microscope consisting essentially, first, of a mirror for reflecting a beam of sunlight through the tube, which sometimes is fixed in a window shutter; secondly, of a condenser, or large lens, for converging the beam upon the object; and, thirdly, of a small lens, or magnifier, for throwing an enlarged image of the object at its focus upon a screen in a dark room or in a darkened box. -- Solar month. See under Month. -- Solar oil, a paraffin oil used an illuminant and lubricant. -- Solar phosphori (Physics), certain substances, as the diamond, siulphide of barium (Bolognese or Bologna phosphorus), calcium sulphide, etc., which become phosphorescent, and shine in the dark, after exposure to sunlight or other intense light. -- Solar plexus (Anat.), a nervous plexus situated in the dorsal and anterior part of the abdomen, consisting of several sympathetic ganglia with connecting and radiating nerve fibers; -- so called in allusion to the radiating nerve fibers. -- Solar spots. See Sun spots, under Sun. -- Solar system (Astron.), the sun, with the group of celestial bodies which, held by its attraction, revolve round it. The system comprises the major planets, with their satellites; the minor planets, or asteroids, and the comets; also, the meteorids, the matter that furnishes the zodiacal light, and the rings of Saturn. The satellites that revolve about the major planets are twenty-two in number, of which the Earth has one (see Moon.), Mars two, Jupiter five, Saturn nine, Uranus four, and Neptune one. The asteroids, between Mars and Jupiter, thus far discovered (1900), number about five hundred, the first four of which were found near the beginning of the century, and are called Ceres, Pallas, Juno, and Vesta. Note: The principal elements of the major planets, and of the comets seen at more than one perihelion passage, are exhibited in the following tables: -- I. -- Major Planets. Symbol.Name.Mean distance -- that of the Earth being unity.Period in days.Eccentricity.Inclination of orbit.Diameter in miles II. -- Periodic Comets. Name.Greatest distance from sun.Least distance from sun.Inclination of orbit.Perihelion passage. ยบ min 54 Encke's3.314.100.34212 541885.2 -- Solar telegraph, telegraph for signaling by flashes of reflected sunlight. -- Solar time. See Apparent time, under Time."}