{"word":"solid","definition":"1. Having the constituent parts so compact, or so firmly adhering, as to resist the impression or penetration of other bodies; having a fixed form; hard; firm; compact; -- opposed to fluid and liquid or to plastic, like clay, or to incompact, like sand. 2. Not hollow; full of matter; as, a solid globe or cone, as distinguished from a Ant: hollow one; not spongy; dense; hence, sometimes, heavy. 3. (Arith.)  Having all the geometrical dimensions; cubic; as, a solid foot contains 1,728 solid inches. Note: In this sense, cubics now generally used. 4. Firm; compact; strong; stable; unyielding; as, a solid pier; a solid pile; a solid wall. 5. Applied to a compound word whose parts are closely united and form an unbroken word; -- opposed to hyphened. 6. Fig.: Worthy of credit, trust, or esteem; substantial, as opposed to frivolous or fallacious; weighty; firm; strong; valid; just; genuine. The solid purpose of a sincere and virtuous answer. Milton. These, wanting wit, affect gravity, and go by the name of solid men. Dryden. The genius of the Italians wrought by solid toil what the myth-making imagination of the Germans had projected in a poem. J. A. Symonds. 7. Sound; not weakly; as, a solid constitution of body. I. Watts. 8. (Bot.)  Of a fleshy, uniform, undivided substance, as a bulb or root; not spongy or hollow within, as a stem. 9. (Metaph.)  Impenetrable; resisting or excluding any other material particle or atom from any given portion of space; -- applied to the supposed ultimate particles of matter. 10. (Print.)  Not having the lines separated by leads; not open. 11. United; without division; unanimous; as, the delegation is solid for a candidate. [Polit. Cant. U.S.] Solid angle. (Geom.) See under Angle. -- Solid color, an even color; one not shaded or variegated. -- Solid green. See Emerald green (a), under Green. -- Solid measure (Arith.), a measure for volumes, in which the units are each a cube of fixed linear magnitude, as a cubic foot, yard, or the like; thus, a foot, in solid measure, or a solid foot, contains 1,728 solid inches. -- Solid newel (Arch.), a newel into which the ends of winding stairs are built, in distinction from a hollow newel. See under Hollow, a. -- Solid problem (Geom.), a problem which can be construed geometrically, only by the intersection of a circle and a conic section or of two conic sections. Hutton. -- Solid square (Mil.), a square body or troops in which the ranks and files are equal. Syn. -- Hard; firm; compact; strong; substantial; stable; sound; real; valid; true; just; weighty; profound; grave; important. -- Solid, Hard. These words both relate to the internal constitution of bodies; but hardnotes a more impenetrable nature or a firmer adherence of the component parts than solid. Hard is opposed to soft, and solid to fluid, liquid, open, or hollow. Wood is usually solid; but some kinds of wood are hard, and others are soft. Repose you there; while I [return] to this hard house, More harder than the stones whereof 't is raised. Shak. I hear his thundering voice resound, And trampling feet than shake the solid ground. Dryden.\n\n1. A substance that is held in a fixed form by cohesion among its particles; a substance not fluid. 2. (Geom.)  A magnitude which has length, breadth, and thickness; a part of space bounded on all sides. Solid of revolution. (Geom.) See Revolution, n., 5."}