{"word":"soul","definition":"Sole. [Obs.] Chaucer.\n\nSole. [Obs.] Chaucer.\n\nTo afford suitable sustenance. [Obs.] Warner.\n\n1. The spiritual, rational, and immortal part in man; that part of man which enables him to think, and which renders him a subject of moral government; -- sometimes, in distinction from the higher nature, or spirit, of man, the so-called animal soul, that is, the seat of life, the sensitive affections and phantasy, exclusive of the voluntary and rational powers; -- sometimes, in distinction from the mind, the moral and emotional part of man's nature, the seat of feeling, in distinction from intellect; -- sometimes, the intellect only; the understanding; the seat of knowledge, as distinguished from feeling. In a more general sense, \"an animating, separable, surviving entity, the vehicle of individual personal existence.\" Tylor. The eyes of our souls only then begin to see, when our bodily eyes are closing. Law. 2. The seat of real life or vitality; the source of action; the animating or essential part. \"The hidden soul of harmony.\" Milton. Thou sun, of this great world both eye and soul. Milton. 3. The leader; the inspirer; the moving spirit; the heart; as, the soul of an enterprise; an able gemeral is the soul of his army. He is the very soul of bounty! Shak. 4. Energy; courage; spirit; fervor; affection, or any other noble manifestation of the heart or moral nature; inherent power or goodness. That he wants algebra he must confess; But not a soul to give our arms success. Young. 5. A human being; a person; -- a familiar appellation, usually with a qualifying epithet; as, poor soul. As cold waters to a thirsty soul, so is good news from a far country. Prov. xxv. 25. God forbid so many simple souls Should perish by the aword! Shak. Now mistress Gilpin (careful soul). Cowper. 6. A pure or disembodied spirit. That to his only Son . . . every soul in heaven Shall bend the knee. Milton. Note: Soul is used in the formation of numerous compounds, most of which are of obvious signification; as, soul-betraying, soul- consuming, soul-destroying, soul-distracting, soul-enfeebling, soul- exalting, soul-felt, soul-harrowing, soul-piercing, soul-quickening, soul-reviving, soul-stirring, soul-subduing, soul-withering, etc. Syn. -- Spirit; life; courage; fire; ardor. Cure of souls. See Cure, n., 2. -- Soul bell, the passing bell. Bp. Hall. -- Soul foot. See Soul scot, below. [Obs.] -- Soul scot or Soul shot. Etym: [Soul + scot, or shot; cf. AS. sawelsceat.] (O. Eccl. Law) A funeral duty paid in former times for a requiem for the soul. Ayliffe.\n\nTo indue with a soul; to furnish with a soul or mind. [Obs.] Chaucer."}