{"word":"sour","definition":"1. Having an acid or sharp, biting taste, like vinegar, and the juices of most unripe fruits; acid; tart. All sour things, as vinegar, provoke appetite. Bacon. 2. Changed, as by keeping, so as to be acid, rancid, or musty, turned. 3. Disagreeable; unpleasant; hence; cross; crabbed; peevish; morose; as, a man of a sour temper; a sour reply. \"A sour countenance.\" Swift. He was a scholar . . . Lofty and sour to them that loved him not, But to those men that sought him sweet as summer. Shak. 4. Afflictive; painful. \"Sour adversity.\" Shak. 5. Cold and unproductive; as, sour land; a sour marsh. Sour dock (Bot.), sorrel. -- Sour gourd (Bot.), the gourdlike fruit Adansonia Gregorii, and A. digitata; also, either of the trees bearing this fruit. See Adansonia. -- Sour grapes. See under Grape. -- Sour gum (Bot.) See Turelo. -- Sour plum (Bot.), the edible acid fruit of an Australian tree (Owenia venosa); also, the tree itself, which furnished a hard reddish wood used by wheelwrights. Syn. -- Acid; sharp; tart; acetous; acetose; harsh; acrimonious; crabbed; currish; peevish.\n\nA sour or acid substance; whatever produces a painful effect. Spenser.\n\n1. To cause to become sour; to cause to turn from sweet to sour; as, exposure to the air sours many substances. So the sun's heat, with different powers, Ripens the grape, the liquor sours. Swift. 2. To make cold and unproductive, as soil. Mortimer. 3. To make unhappy, uneasy, or less agreeable. To sour your happiness I must report, The queen is dead. Shak. 4. To cause or permit to become harsh or unkindly. \"Souring his cheeks.\" Shak. Pride had not sour'd nor wrath debased my heart. Harte. 5. To macerate, and render fit for plaster or mortar; as, to sour lime for business purposes.\n\nTo become sour; to turn from sweet to sour; as, milk soon sours in hot weather; a kind temper sometimes sours in adversity. They keep out melancholy from the virtuous, and hinder the hatred of vice from souring into severity. Addison."}