{"word":"space","definition":"1. Extension, considered independently of anything which it may contain; that which makes extended objects conceivable and possible. Pure space is capable neither of resistance nor motion. Locke. 2. Place, having more or They gave him chase, and hunted him as hare; Long had he no space to dwell [in]. R. of Brunne. While I have time and space. Chaucer. 3. A quantity or portion of extension; distance from one thing to another; an interval between any two or more objects; as, the space between two stars or two hills; the sound was heard for the space of a mile. Put a space betwixt drove and drove. Gen. xxxii. 16. 4. Quantity of time; an interval between two points of time; duration; time. \"Grace God gave him here, this land to keep long space.\" R. of brunne. Nine times the space that measures day and night. Milton. God may defer his judgments for a time, and give a people a longer space of repentance. Tillotson. 5. A short time; a while. [R.] \"To stay your deadly strife a space.\" Spenser. 6. Walk; track; path; course. [Obs.] This ilke [same] monk let old things pace, And held after the new world the space. Chaucer. 7. (print.) (a) A small piece of metal cast lower than a face type, so as not to receive the ink in printing, -- used to separate words or letters. (b) The distance or interval between words or letters in the lines, or between lines, as in books. Note: Spaces are of different thicknesses to enable the compositor to arrange the words at equal distances from each other in the same line. 8. (Mus.)  One of the intervals, or open places, between the lines of the staff. Absolute space, Euclidian space, etc. See under Absolute, Euclidian, etc. -- Space line (Print.), a thin piece of metal used by printers to open the lines of type to a regular distance from each other, and for other purposes; a lead. Hansard. -- Space rule (Print.), a fine, thin, short metal rule of the same height as the type, used in printing short lines in tabular matter.\n\nTo walk; to rove; to roam. [Obs.] And loved in forests wild to space. Spenser.\n\nTo arrange or adjust the spaces in or between; as, to space words, lines, or letters."}