{"word":"span","definition":"imp. & p. p. of Spin.\n\n1. The space from the thumb to the end of the little finger when extended; nine inches; eighth of a fathom. 2. Hence, a small space or a brief portion of time. Yet not to earth's contracted span Thy goodness let me bound. Pope. Life's but a span; I'll every inch enjoy. Farquhar. 3. The spread or extent of an arch between its abutments, or of a beam, girder, truss, roof, bridge, or the like, between its supports. 4. (Naut.)  A rope having its ends made fast so that a purchase can be hooked to the bight; also, a rope made fast in the center so that both ends can be used. 5. Etym: [Cf. D. span, Sw. spann, Dan. spænd, G. gespann. See Span, v. t. ]  A pair of horses or other animals driven together; usually, such a pair of horses when similar in color, form, and action. Span blocks (Naut.), blocks at the topmast and topgallant-mast heads, for the studding-sail halyards. -- Span counter, an old English child's game, in which one throws a counter on the ground, and another tries to hit it with his counter, or to get his counter so near it that he can span the space between them, and touch both the counters. Halliwell. \"Henry V., in whose time boys went to span counter for French crowns.\" Shak. -- Span iron (Naut.), a special kind of harpoon, usually secured just below the gunwale of a whaleboat. -- Span roof, a common roof, having two slopes and one ridge, with eaves on both sides. Gwilt. -- Span shackle (Naut.), a large bolt driven through the forecastle deck, with a triangular shackle in the head to receive the heel of the old-fashioned fish davit. Ham. Nav. Encyc.\n\n1. To measure by the span of the hand with the fingers extended, or with the fingers encompassing the object; as, to span a space or distance; to span a cylinder. My right hand hath spanned the heavens. Isa. xiviii. 13. 2. To reach from one side of to the order; to stretch over as an arch. The rivers were spanned by arches of solid masonry. prescott. 3. To fetter, as a horse; to hobble.\n\nTo be matched, as horses. [U. S.]"}