{"word":"speak","definition":"1. To utter words or articulate sounds, as human beings; to express thoughts by words; as, the organs may be so obstructed that a man may not be able to speak. Till at the last spake in this manner. Chaucer. Speak, Lord; for thy servant heareth. 1 Sam. iii. 9. 2. To express opinions; to say; to talk; to converse. That fluid substance in a few minutes begins to set, as the tradesmen speak. Boyle. An honest man, is able to speak for himself, when a knave is not. Shak. During the century and a half which followed the Conquest, there is, to speak strictly, no English history. Macaulay. 3. To utter a speech, discourse, or harangue; to adress a public assembly formally. Many of the nobility made themselves popular by speaking in Parliament against those things which were most grateful to his majesty. Clarendon. 4. To discourse; to make mention; to tell. Lycan speaks of a part of Cæsar's army that came to him from the Leman Lake. Addison. 5. To give sound; to sound. Make all our trumpets speak. Shak. 6. To convey sentiments, ideas, or intelligence as if by utterance; as, features that speak of self-will. Thine eye begins to speak. Shak. To speak of, to take account of, to make mention of. Robynson (More's Utopia). -- To speak out, to speak loudly and distinctly; also, to speak unreservedly. -- To speak well for, to commend; to be favorable to. -- To speak with, to converse with. \"Would you speak with me\" Shak. Syn. -- To say; tell; talk; converse; discourse; articulate; pronounce; utter.\n\n1. To utter with the mouth; to pronounce; to utter articulately, as human beings. They sat down with him upn ground seven days and seven nights, and none spake a word unto him. Job. ii. 13. 2. To utter in a word or words; to say; to tell; to declare orally; as, to speak the truth; to speak sense. 3. To declare; to proclaim; to publish; to make known; to exhibit; to express in any way. It is my father;s muste To speak your deeds. Shak. Speaking a still good morrow with her eyes. Tennyson. And for the heaven's wide circuit, let it speak The maker's high magnificence. Milton. Report speaks you a bonny monk. Sir W. Scott. 4. To talk or converse in; to utter or pronounce, as in conversation; as, to speak Latin. And French she spake full fair and fetisely. Chaucer. 5. To address; to accost; to speak to. [He will] thee in hope; he will speak thee fair. Ecclus. xiii. 6. each village senior paused to scan And speak the lovely caravan. Emerson. To speak a ship (Naut.), to hail and speak to her captain or commander."}