{"word":"special","definition":"1. Of or pertaining to a species; constituting a species or sort. A special is called by the schools a \"species\". I. Watts. 2. Particular; peculiar; different from others; extraordinary; uncommon. Our Savior is represented everywhere in Scripture as the special patron of the poor and the afficted. Atterbury. To this special evil an improvement of style would apply a special redress. De Quincey. 3. Appropriate; designed for a particular purpose, occasion, or person; as, a special act of Parliament or of Congress; a special sermon. 4. Limited in range; confined to a definite field of action, investigation, or discussion; as, a special dictionary of commercial terms; a special branch of study. 5. Chief in excellence. [Obs.] The king hath drawn The special head of all the land together. Shak. Special administration (Law), an administration limited to certain specified effects or acts, or one granted during a particular time or the existence of a special cause, as during a controversy respecting the probate of a will, or the right of administration, etc. -- Special agency, an agency confined to some particular matter. -- Special bail, Bail above, or Bail to the action (Law), sureties who undertake that, if the defendant is convicted, he shall satisfy the plaintiff, or surrender himself into custody. Tomlins. Wharton (Law Dict.). -- Special constable. See under Constable. Bouvier. -- Special damage (Law), a damage resulting from the act complained of, as a natural, but not the necessary, consequence of it. -- Special demurrer (Law), a demurrer for some defect of form in the opposite party pleading, in which the cause of demurrer is particularly stated. -- Special deposit, a deposit made of a specific thing to be kept distinct from others. -- Special homology. (Biol.) See under Homology. -- Special injuction (Law), an injuction granted on special grounds, arising of the circumstances of the case. Daniell. -- Special issue (Law), an issue produced upon a special plea. Stephen. -- Special jury (Law), a jury consisting of persons of some particular calling, station, or qualification, which is called upon motion of either party when the cause is supposed to require it; a struck jury. -- Special orders (Mil.), orders which do not concern, and are not published to, the whole command, such as those relating to the movement of a particular corps, a detail, a temporary camp, etc. -- Special partner, a limited partner; a partner with a limited or restricted responsibility; -- unknown at common law. -- Special partnership, a limited or particular partnership; -- a term sometimes applied to a partnership in a particular business, operation, or adventure. -- Special plea in bar (Law), a plea setting forth particular and new matter, distinguished from the general issue. Bouvier. -- Special pleader (Law), originally, a counsel who devoted himself to drawing special counts and pleas; in a wider sense, a lawyer who draws pleadings. -- Special pleading (Law), the allegation of special or new matter, as distingiushed from a direct denial of matter previously alleged on the side. Bouvier. The popular denomination of the whole science of pleading. Stephen. The phrase is sometimes popularly applied to the specious, but unsound, argumentation of one whose aim is victory, and not truth. Burrill. -- Special property (Law), a qualified or limited ownership possession, as in wild animals, things found or bailed. -- Special session, an extraordinary session; a session at an unusual time or for an unusual purpose; as, a special session of Congress or of a legislature. -- Special statute, or Special law, an act of the legislature which has reference to a particular person, place, or interest; -- in distinction from a general law. -- Special verdict (Law), a special finding of the facts of the case, leaving to the court the application of the law to them. Wharton (Law Dict.). Syn. -- Peculiar; appropriate; specific; dictinctive; particular; exceptional; singular. See Peculiar.\n\n1. A particular. [Obs.] Hammond. 2. One appointed for a special service or occasion. In special, specially; in particular. Chaucer."}