{"word":"species","definition":"1. Visible or sensible presentation; appearance; a sensible percept received by the imagination; an image. [R.] \"The species of the letters illuminated with indigo and violet.\" Sir I. Newton. Wit, . . . the faculty of imagination in the writer, which searches over all the memory for the species or ideas of those things which it designs to represent. Dryden. Note: In the scholastic philosophy, the species was sensible and intelligible. The sensible species was that in any material, object which was in fact discerned by the mind through the organ of perception, or that in any object which rendered it possible that it should be perceived. The sensible species, as apprehended by the understanding in any of the relations of thought, was called an intelligible species. \"An apparent diversity between the species visible and audible is, that the visible doth not mingle in the medium, but the audible doth.\" Bacon. 2. (Logic)  A group of individuals agreeing in common attributes, and designated by a common name; a conception subordinated to another conception, called a genus, or generic conception, from which it differs in containing or comprehending more attributes, and extending to fewer individuals. Thus, man is a species, under animal as a genus; and man, in its turn, may be regarded as a genus with respect to European, American, or the like, as species. 3. In science, a more or less permanent group of existing things or beings, associated according to attributes, or properties determined by scientific observation. Note: In mineralogy and chemistry, objects which possess the same definite chemical structure, and are fundamentally the same in crystallization and physical characters, are classed as belonging to a species. In zoölogy and botany, a species is an ideal group of individuals which are believed to have descended from common ancestors, which agree in essential characteristics, and are capable of indefinitely continued fertile reproduction through the sexes. A species, as thus defined, differs from a variety or subspecies only in the greater stability of its characters and in the absence of individuals intermediate between the related groups. 4. A sort; a kind; a variety; as, a species of low cunning; a species of generosity; a species of cloth. 5. Coin, or coined silver, gold, ot other metal, used as a circulating medium; specie. [Obs.] There was, in the splendor of the Roman empire, a less quantity of current species in Europe than there is now. Arbuthnot. 6. A public spectacle or exhibition. [Obs.] Bacon. 7. (Pharmacy) (a) A component part of compound medicine; a simple. (b) (Med.) An officinal mixture or compound powder of any kind; esp., one used for making an aromatic tea or tisane; a tea mixture. Quincy. 8. (Civil Law)  The form or shape given to materials; fashion or shape; form; figure. Burill. Incipient species (Zoöl.), a subspecies, or variety, which is in process of becoming permanent, and thus changing to a true species, usually by isolation in localities from which other varieties are excluded."}