{"word":"spectrum","definition":"1. An apparition; a specter. [Obs.] 2. (Opt.) (a) The several colored and other rays of which light is composed, separated by the refraction of a prism or other means, and observed or studied either as spread out on a screen, by direct vision, by photography, or otherwise. See Illust. of Light, and Spectroscope. (b) A luminous appearance, or an image seen after the eye has been exposed to an intense light or a strongly illuminated object. When the object is colored, the image appears of the complementary color, as a green image seen after viewing a red wafer lying on white paper. Called also ocular spectrum. Absorption spectrum, the spectrum of light which has passed through a medium capable of absorbing a portion of the rays. It is characterized by dark spaces, bands, or lines. -- Chemical spectrum, a spectrum of rays considered solely with reference to their chemical effects, as in photography. These, in the usual photogrophic methods, have their maximum influence at and beyond the violet rays, but are not limited to this region. -- Chromatic spectrum, the visible colored rays of the solar spectrum, exhibiting the seven principal colors in their order, and covering the central and larger portion of the space of the whole spectrum. -- Continous spectrum, a spectrum not broken by bands or lines, but having the colors shaded into each other continously, as that from an incandescent solid or liquid, or a gas under high pressure. -- Diffraction spectrum, a spectrum produced by diffraction, as by a grating. -- Gaseous spectrum, the spectrum of an incandesoent gas or vapor, under moderate, or especially under very low, pressure. It is characterized by bright bands or lines. -- Normal spectrum, a representation of a spectrum arranged upon conventional plan adopted as standard, especially a spectrum in which the colors are spaced proportionally to their wave lengths, as when formed by a diffraction grating. -- Ocular spectrum. See Spectrum, 2 (b), above. -- Prismatic spectrum, a spectrum produced by means of a prism. -- Solar spectrum, the spectrum of solar light, especially as thrown upon a screen in a darkened room. It is characterized by numerous dark lines called Fraunhofer lines. -- Spectrum analysis, chemical analysis effected by comparison of the different relative positions and qualities of the fixed lines of spectra produced by flames in which different substances are burned or evaporated, each substance having its own characteristic system of lines. -- Thermal spectrum, a spectrum of rays considered solely with reference to their heating effect, especially of those rays which produce no luminous phenomena."}