{"word":"speed","definition":"1. Prosperity in an undertaking; favorable issue; success. \"For common speed.\" Chaucer. O Lord God of my master Abraham, I pray thee, send me good speed this day. Gen. xxiv. 12. 2. The act or state of moving swiftly; swiftness; velocity; rapidly; rate of motion; dispatch; as, the speed a horse or a vessel. Speed, to describe whose swiftness number fails. Milton. Note: In kinematics, speedis sometimes used to denote the amount of velocity without regard to direction of motion, while velocity is not regarded as known unless both the direction and the amount are known. 3. One who, or that which, causes or promotes speed or success. [Obs.] \"Hercules be thy speed!\" Shak. God speed, Good speed; prosperity. See Godspeed. -- Speed gauge, Speed indicator, and Speed recorder (Mach.), devices for indicating or recording the rate of a body's motion, as the number of revolutions of a shaft in a given time. -- Speed lathe (Mach.), a power lathe with a rapidly revolving spindle, for turning small objects, for polishing, etc.; a hand lathe. -- Speed pulley, a cone pulley with steps. Syn. -- Haste; swiftness; celerity; quickness; dispatch; expedition; hurry; acceleration. See Haste.\n\n1. To go; to fare. [Obs.] To warn him now he is too farre sped. Remedy of Love. 2. To experience in going; to have any condition, good or ill; to fare. Shak. Ships heretofore in seas lke fishes sped; The mightiest still upon the smallest fed. Waller. 3. To fare well; to have success; to prosper. Save London, and send true lawyers their meed! For whoso wants money with them shall not speed! Lydgate. I told ye then he should prevail, and speed On his bad errand. Milton. 4. To make haste; to move with celerity. I have speeded hither with the very extremest inch of possibility. Shak. 5. To be expedient. [Obs.] Wyclif (2 Cor. xii. 1.)\n\n1. To cause to be successful, or to prosper; hence, to aid; to favor. \"Fortune speed us!\" Shak. With rising gales that speed their happy flight. Dryden. 2. To cause to make haste; to dispatch with celerity; to drive at full speed; hence, to hasten; to hurry. He sped him thence home to his habitation. Fairfax. 3. To hasten to a conclusion; to expedite. Judicial acts . . . are sped in open court at the instance of one or both of the parties. Ayliffe. 4. To hurry to destruction; to put an end to; to ruin; to undo. \"Sped with spavins.\" Shak. A dire dilemma! either way I 'm sped. If foes, they write, if friends, they read, me dead. Pope. 5. To wish success or god fortune to, in any undertaking, especially in setting out upon a journey. Welkome the coming, speed the parting guest. Pope. God speed you, them, etc., may God speed you; or, may you have good speed. Syn. -- To depatch; hasten; expedite; accelerate; hurry."}