{"word":"sphere","definition":"1. (Geom.)  A body or space contained under a single surface, which in every part is equally distant from a point within called its center. 2. Hence, any globe or globular body, especially a celestial one, as the sun, a planet, or the earth. Of celestial bodies, first the sun, A mighty sphere, he framed. Milton. 3. (Astron.) (a) The apparent surface of the heavens, which is assumed to be spherical and everywhere equally distant, in which the heavenly bodies appear to have their places, and on which the various astronomical circles, as of right ascension and declination, the equator, ecliptic, etc., are conceived to be drawn; an ideal geometrical sphere, with the astronomical and geographical circles in their proper positions on it. (b) In ancient astronomy, one of the concentric and eccentric revolving spherical transparent shells in which the stars, sun, planets, and moon were supposed to be set, and by which they were carried, in such a manner as to produce their apparent motions. 4. (Logic)  The extension of a general conception, or the totality of the individuals or species to which it may be applied. 5. Circuit or range of action, knowledge, or influence; compass; province; employment; place of existence. To be called into a huge sphere, and not to be seen to move in 't. Shak. Taking her out of the ordinary relations with humanity, and inclosing her in a sphere by herself. Hawthorne. Each in his hidden sphere of joy or woe Our hermit spirits dwell. Keble. 6. Rank; order of society; social positions. 7. An orbit, as of a star; a socket. [R.] Shak. Armillary sphere, Crystalline sphere, Oblique sphere,. See under Armillary, Crystalline,. -- Doctrine of the sphere, applications of the principles of spherical trigonometry to the properties and relations of the circles of the sphere, and the problems connected with them, in astronomy and geography, as to the latitudes and longitudes, distance and bearing, of places on the earth, and the right ascension and declination, altitude and azimuth, rising and setting, etc., of the heavenly bodies; spherical geometry. -- Music of the spheres. See under Music. Syn. -- Globe; orb; circle. See Globe.\n\n1. To place in a sphere, or among the spheres; to insphere. The glorious planet Sol In noble eminence enthroned and sphered Amidst the other. Shak. 2. To form into roundness; to make spherical, or spheral; to perfect. Tennyson."}