{"word":"spill","definition":"1. A bit of wood split off; a splinter. [Obs. or Prov. Eng.] 2. A slender piece of anything. Specifically: -- (a) A peg or pin for plugging a hole, as in a cask; a spile. (b) A metallic rod or pin. (c) A small roll of paper, or slip of wood, used as a lamplighter, etc. (d) (Mining) One of the thick laths or poles driven horizontally ahead of the main timbering in advancing a level in loose ground. 3. A little sum of money. [Obs.] Ayliffe.\n\nTo cover or decorate with slender pieces of wood, metal, ivory, etc.; to inlay. [Obs.] Spenser.\n\n1. To destroy; to kill; to put an end to. [Obs.] And gave him to the queen, all at her will To choose whether she would him save or spill. Chaucer. Greater glory think [it] to save than spill. Spenser. 2. To mar; to injure; to deface; hence, to destroy by misuse; to waste. [Obs.] They [the colors] disfigure the stuff and spill the whole workmanship. Puttenham. Spill not the morning, the quintessence of day, in recreations. Fuller. 3. To suffer to fall or run out of a vessel; to lose, or suffer to be scattered; -- applied to fluids and to substances whose particles are small and loose; as, to spill water from a pail; to spill quicksilver from a vessel; to spill powder from a paper; to spill sand or flour. Note: Spill differs from pour in expressing accidental loss, -- a loss or waste contrary to purpose. 4. To cause to flow out and be lost or wasted; to shed, or suffer to be shed, as in battle or in manslaughter; as, a man spills another's blood, or his own blood. And to revenge his blood so justly spilt. Dryden. 5. (Naut.)  To relieve a sail from the pressure of the wind, so that it can be more easily reefed or furled, or to lessen the strain. Spilling line (Naut.), a rope used for spilling, or dislodging, the wind from the belly of a sail. Totten.\n\n1. To be destroyed, ruined, or wasted; to come to ruin; to perish; to waste. [Obs.] That thou wilt suffer innocents to spill. Chaucer. 2. To be shed; to run over; to fall out, and be lost or wasted. \"He was so topful of himself, that he let it spill on all the company.\" I. Watts."}