{"word":"split","definition":"1. To divide lengthwise; to separate from end to end, esp. by force; to divide in the direction of the grain layers; to rive; to cleave; as, to split a piece of timber or a board; to split a gem; to split a sheepskin. Cold winter split the rocks in twain. Dryden. 2. To burst; to rupture; to rend; to tear asunder. A huge vessel of exceeding hard marble split asunder by congealed water. Boyle. 3. To divide or break up into parts or divisions, as by discord; to separate into parts or parties, as a political party; to disunite. [Colloq.] South. 4. (Chem.)  To divide or separate into components; -- often used with up; as, to split up sugar into alcohol and carbonic acid. To split hairs, to make distinctions of useless nicety.\n\n1. To part asunder; to be rent; to burst; as, vessels split by the freezing of water in them. 2. To be broken; to be dashed to pieces. The ship splits on the rock. Shak. 3. To separate into parties or factions. [Colloq.] 4. To burst with laughter. [Colloq.] Each had a gravity would make you split. Pope. 5. To divulge a secret; to betray confidence; to peach. [Slang] Thackeray. To split on a rock, to err fatally; to have the hopes and designs frustrated.\n\nA crack, or longitudinl fissure. 2. A breach or separation, as in a political party; a division. [Colloq.] 3. A piece that is split off, or made thin, by splitting; a splinter; a fragment. 4. Specif (Leather Manuf.), one of the sections of a skin made by dividing it into two or more thicknesses. 5. (Faro)  A division of a stake happening when two cards of the kind on which the stake is laid are dealt in the same turn.\n\n1. Divided; cleft. 2. (Bot.)  Divided deeply; cleft. Split pease, hulled pease split for making soup, etc. -- Split pin (Mach.), a pin with one end split so that it may be spread open to secure it in its place. -- Split pulley, a parting pulley. See under Pulley. -- Split ring, a ring with overlapped or interlocked ends which may be sprung apart so that objects, as keys, may be strung upon the ring or removed from it. -- Split ticket, a ballot containing the names of only a portion of the candidates regularly nominated by one party, other names being substituted for those omitted. [U.S.]"}