{"word":"sponge","definition":"1. (Zoöl.)  Any one of numerous species of Spongiæ, or Porifera. See Illust. and Note under Spongiæ. 2. The elastic fibrous skeleton of many species of horny Spongiæ (keratosa), used for many purposes, especially the varieties of the genus Spongia. The most valuable sponges are found in the Mediterranean and the Red Sea, and on the coasts of Florida and the West Indies. 3. Fig.: One who lives upon others; a pertinaceous and indolent dependent; a parasite; a sponger. 4. Any spongelike substance. Specifically: (a) Dough before it is kneaded and formed into loaves, and after it is converted into a light, spongy mass by the agency of the yeast or leaven. (b) Iron from the puddling furnace, in a pasty condition. (c) Iron ore, in masses, reduced but not melted or worked. 5. (Gun.)  A mop for cleaning the bore of a cannon after a discharge. It consists of a cylinder of wood, covered with sheepskin with the wool on, or cloth with a heavy looped nap, and having a handle, or staff. 6. (Far.)  The extremity, or point, of a horseshoe, answering to the heel. Bath sponge, any one of several varieties of coarse commercial sponges, especially Spongia equina. -- Cup sponge, a toilet sponge growing in a cup-shaped form. -- Glass sponge. See Glass-sponge, in the Vocabulary. -- Glove sponge, a variety of commercial sponge (Spongia officinalis, variety tubulufera), having very fine fibers, native of Florida, and the West Indies. -- Grass sponge, any one of several varieties of coarse commercial sponges having the surface irregularly tufted, as Spongia graminea, and S. equina, variety cerebriformis, of Florida and the West Indies. -- Horse sponge, a coarse commercial sponge, especially Spongia equina. -- Platinum sponge. (Chem.) See under Platinum. -- Pyrotechnical sponge, a substance made of mushrooms or fungi, which are boiled in water, dried, and beaten, then put in a strong lye prepared with saltpeter, and again dried in an oven. This makes the black match, or tinder, brought from Germany. -- Sheep's-wool sponge, a fine and durable commercial sponge (Spongia equina, variety gossypina) found in Florida and the West Indies. The surface is covered with larger and smaller tufts, having the oscula between them. -- Sponge cake, a kind of sweet cake which is light and spongy. -- Sponge lead, or Spongy lead (Chem.), metallic lead brought to a spongy form by reduction of lead salts, or by compressing finely divided lead; -- used in secondary batteries and otherwise. -- Sponge tree (Bot.), a tropical leguminous tree (Acacia Farnesiana), with deliciously fragrant flowers, which are used in perfumery. -- Toilet sponge, a very fine and superior variety of Mediterranean sponge (Spongia officinalis, variety Mediterranea); -- called also turkish sponge. -- To set a sponge (Cookery), to leaven a small mass of flour, to be used in leavening a larger quantity. -- To throw up the sponge, to give up a contest; to acknowledge defeat; -- from a custom of the prize ring, the person employed to sponge a pugilist between rounds throwing his sponge in the air in token of defeat. [Cant or Slang] \"He was too brave a man to throw up the sponge to fate.\" Lowell. -- Vegetable sponge. (Bot.) See Loof. -- Velvet sponge, a fine, soft commercial sponge (Spongia equina, variety meandriniformis) found in Florida and the West Indies. -- Vitreous sponge. See Glass-sponge. -- Yellow sponge, a common and valuable commercial sponge (Spongia agaricina, variety corlosia) found in Florida and the West Indies.\n\n1. To cleanse or wipe with a sponge; as, to sponge a slate or a cannon; to wet with a sponge; as, to sponge cloth. 2. To wipe out with a sponge, as letters or writing; to efface; to destroy all trace of. Hooker. 3. Fig.: To deprive of something by imposition. \"How came such multitudes of our nation . . . to be sponged of their plate and their money\" South. 4. Fig.: To get by imposition or mean arts without cost; as, to sponge a breakfast. Swift.\n\n1. To suck in, or imbile, as a sponge. 2. Fig.: To gain by mean arts, by intrusion, or hanging on; as, an idler sponges on his neighbor. E. Eggleston. The fly is an intruder, and a common smell-feast, that sponges upon other people's trenchers. L'Estrange. 3. To be converted, as dough, into a light, spongy mass by the agency of yeast, or leaven."}