{"word":"sport","definition":"1. That which diverts, and makes mirth; pastime; amusement. It is as sport a fool do mischief. prov. x. 23. Her sports were such as carried riches of knowledge upon the stream of delight. Sir P. Sidney. Think it but a minute spent in sport. Shak. 2. Mock; mockery; contemptuous mirth; derision. Then make sport at me; then let me be your jest.Shak. 3. That with which one plays, or which is driven about in play; a toy; a plaything; an object of mockery. Flitting leaves, the sport of every wind. Dryden. Never does man appear to greater disadvantage than when he is the sport of his own ungoverned pasions. John Clarke. 4. Play; idle jingle. An author who should introduce such a sport of words upon our stage would meet with small applause. Broome. 5. Diversion of the field, as fowling, hunting, fishing, racing, games, and the like, esp. when money is staked. 6. (Bot. & Zoöl.)  A plant or an animal, or part of a plant or animal, which has some peculiarity not usually seen in the species; an abnormal variety or growth. See Sporting plant, under Sporting. 7. A sportsman; a gambler. [Slang] In sport, in jest; for play or diversion. \"So is the man that deceiveth his neighbor, and saith, Am not I in sport\" Prov. xxvi. 19. Syn. -- Play; game; diversion; frolic; mirth; mock; mockery; jeer.\n\n1. To play; to frolic; to wanton. [Fish], sporting with quick glance, Show to the sun their waved coats dropt with gold. Milton. 2. To practice the diversions of the field or the turf; to be given to betting, as upon races. 3. To trifle. \"He sports with his own life.\" Tillotson. 4. (Bot. & Zoöl.)  To assume suddenly a new and different character from the rest of the plant or from the type of the species; -- said of a bud, shoot, plant, or animal. See Sport, n., 6. Darwin. Syn. -- To play; frolic; game; wanton.\n\n1. To divert; to amuse; to make merry; -- used with the reciprocal pronoun. Against whom do ye sport yourselves Isa. lvii. 4. 2. To represent by any knd of play. Now sporting on thy lyre the loves of youth. Dryden. 3. To exhibit, or bring out, in public; to use or wear; as, to sport a new equipage. [Colloq.] Grose. 4. To give utterance to in a sportive manner; to throw out in an easy and copious manner; -- with off; as, to sport off epigrams. Addison. To sport one's oak. See under Oak, n."}