{"word":"spot","definition":"1. A mark on a substance or body made by foreign matter; a blot; a place discolored. Out, damned spot! Out, I say! Shak. 2. A stain on character or reputation; something that soils purity; disgrace; reproach; fault; blemish. Yet Chloe, sure, was formed without a spot. Pope. 3. A small part of a different color from the main part, or from the ground upon which it is; as, the spots of a leopard; the spots on a playing card. 4. A small extent of space; a place; any particular place. \"Fixed to one spot.\" Otway. That spot to which I point is Paradise. Milton. \"A jolly place,\" said he, \"in times of old! But something ails it now: the spot is cursed.\" Wordsworth. 5. (Zoöl.)  A variety of the common domestic pigeon, so called from a spot on its head just above its beak. 6. (Zoöl.) (a) A sciænoid food fish (Liostomus xanthurus) of the Atlantic coast of the United States. It has a black spot behind the shoulders and fifteen oblique dark bars on the sides. Called also goody, Lafayette, masooka, and old wife. (b) The southern redfish, or red horse, which has a spot on each side at the base of the tail. See Redfish. 7. pl.  Commodities, as merchandise and cotton, sold for immediate delivery. [Broker's Cant] Crescent spot (Zoöl.), any butterfly of the family Melitæidæ having crescent-shaped white spots along the margins of the red or brown wings. -- Spot lens (Microscopy), a condensing lens in which the light is confined to an annular pencil by means of a small, round diaphragm (the spot), and used in dark-field ilumination; -- called also spotted lens. -- Spot rump (Zoöl.), the Hudsonian godwit (Limosa hæmastica). -- Spots on the sun. (Astron.) See Sun spot, ander Sun. -- On, or Upon, the spot, immediately; before moving; without changing place. It was determined upon the spot. Swift. Syn. -- Stain; flaw; speck; blot; disgrace; reproach; fault; blemish; place; site; locality.\n\n1. To make visible marks upon with some foreign matter; to discolor in or with spots; to stain; to cover with spots or figures; as, to spot a garnment; to spot paper. 2. To mark or note so as to insure recognition; to recognize; to detect; as, to spot a criminal. [Cant] 3. To stain; to blemish; to taint; to disgrace; to tarnish, as reputation; to asperse. My virgin life no spotted thoughts shall stain. Sir P. Sidney. If ever I shall close these eyes but once, May I live spotted for my perjury. Beau. & Fl. To spot timber, to cut or chip it, in preparation for hewing.\n\nTo become stained with spots."}