{"word":"spread","definition":"1. To extend in length and breadth, or in breadth only; to stretch or expand to a broad or broader surface or extent; to open; to unfurl; as, to spread a carpet; to spread a tent or a sail. He bought a parcel of a field where he had spread his tent. Gen. xxxiii. 19. Here the Rhone Hath spread himself a couch. Byron. 2. To extend so as to cover something; to extend to a great or grater extent in every direction; to cause to fill or cover a wide or wider space. Rose, as in a dance, the stately trees, and spread Their branches hung with copious fruit. Milton. 3. To divulge; to publish, as news or fame; to cause to be more extensively known; to disseminate; to make known fully; as, to spread a report; -- often acompanied by abroad. They, when they were departed, spread abroad his fame in all that country. Matt. ix. 31. 4. To propagate; to cause to affect great numbers; as, to spread a disease. 5. To diffuse, as emanations or effluvia; to emit; as, odoriferous plants spread their fragrance. 6. To strew; to scatter over a surface; as, to spread manure; to spread lime on the ground. 7. To prepare; to set and furnish with provisions; as, to spread a table. Boiled the flesh, and spread the board. Tennyson. To sprad cloth, to unfurl sail. [Obs.] Evelyn. Syn. -- To diffuse; propogate; disperse; publish; distribute; scatter; circulate; disseminate; dispense.\n\n1. To extend in length and breadth in all directions, or in breadth only; to be extended or stretched; to expand. Plants, if they spread much, are seldom tall. Bacon. Govrnor Winthrop, and his associates at Charlestown, had for a church a large, spreading tree. B. Trumbull. 2. To be extended by drawing or beating; as, some metals spread with difficulty. 3. To be made known more extensively, as news. 4. To be propagated from one to another; as, the disease spread into all parts of the city. Shak.\n\n1. Extent; compass. I have got a fine spread of improvable land. Addison. 2. Expansion of parts. No flower hath spread like that of the woodbine. Bacon. 3. A cloth used as a cover for a table or a bed. 4. A table, as spread or furnished with a meal; hence, an entertainment of food; a feast. [Colloq.] 5. A privilege which one person buys of another, of demanding certain shares of stock at a certain price, or of delivering the same shares of stock at another price, within a time agreed upon. [Broker's Cant] 6. (Geom.)  An unlimited expanse of discontinuous points.\n\nimp. & p. p. of Spread, v. Spread eagle. (a) An eagle with outspread wings, the national emblem of the United States. (b) The figure of an eagle, with its wings elevated and its legs extended; often met as a device upon military ornaments, and the like. (c) (Her.) An eagle displayed; an eagle with the wings and legs extended on each side of the body, as in the double-headed eagle of Austria and Russia. See Displayed, 2."}