{"word":"spur","definition":"(a) A sparrow. [Scot.] (b) A tern. [Prov. Eng.]\n\n1. An implement secured to the heel, or above the heel, of a horseman, to urge the horse by its pressure. Modern spurs have a small wheel, or rowel, with short points. Spurs were the badge of knighthood. And on her feet a pair of spurs large. Chaucer. 2. That which goads to action; an incitement. Fame is the spur that the clear spirit doth raise (That last infirmity of noble mind) To scorn delights and live laborious days. Milton. 3. Something that projects; a snag. 4. One of the large or principal roots of a tree. Shak. 5. (Zoöl.)  Any stiff, sharp spine, as on the wings and legs of certain burds, on the legs of insects, etc.; especially, the spine on a cock's leg. 6. A mountain that shoots from any other mountain, or range of mountains, and extends to some distance in a lateral direction, or at right angles. 7. A spiked iron worn by seamen upon the bottom of the boot, to enable them to stand upon the carcass of a whale, to strip off the blubber. 8. (Carp.)  A brace strengthening a post and some connected part, as a rafter or crossbeam; a strut. 9. (Arch.) (a) The short wooden buttress of a post. (b) A projection from the round base of a column, occupying the angle of a square plinth upon which the base rests, or bringing the bottom bed of the base to a nearly square form. It is generally carved in leafage. 10. (Bot.) (a) Any projecting appendage of a flower looking like a spur. Gray. (b) Ergotized rye or other grain. [R.] 11. (Fort.)  A wall that crosses a part of a rampart and joins to an inner wall. 12. (Shipbuilding) (a) A piece of timber fixed on the bilge ways before launching, having the upper ends bolted to the vessel's side. (b) A curved piece of timber serving as a half to support the deck where a whole beam can not be placed. Spur fowl (Zoöl.), any one of several species of Asiatic gallinaceous birds of the genus Galloperdix, allied to the jungle fowl. The males have two or more spurs on each leg. -- Spur gear (Mach.), a cogwheel having teeth which project radially and stand parallel to the axis; a spur wheel. -- Spur gearing, gearing in which spur gears are used. See under Gearing. -- Spur pepper. (Bot.) See the Note under Capsicum. -- Spur wheel. Same as Spur gear, above.\n\n1. To prick with spurs; to incite to a more hasty pace; to urge or goad; as, to spur a horse. 2. To urge or encourage to action, or to a more vigorous pursuit of an object; to incite; to stimulate; to instigate; to impel; to drive. Love will not be spurred to what it loathes. Shak. 3. To put spurs on; as, a spurred boot.\n\nTo spur on one' horse; to travel with great expedition; to hasten; hence, to press forward in any pursuit. \"Now spurs the lated traveler.\" Shak. The Parthians shall be there, And, spurring from the fight, confess their fear. Dryden. The roads leading to the capital were covered with multitudes of yeomen, spurring hard to Westminster. Macaulay. Some bold men, . . . by spurring on, refine themselves. Grew."}