{"word":"square","definition":"1. (Geom.) (a) The corner, or angle, of a figure. [Obs.] (b) A parallelogram having four equal sides and four right angles. 2. Hence, anything which is square, or nearly so; as: (a) A square piece or fragment. He bolted his food down his capacious throat in squares of three inches. Sir W. Scott. (b) A pane of glass. (c) (Print.) A certain number of lines, forming a portion of a column, nearly square; -- used chiefly in reckoning the prices of advertisements in newspapers. (d) (Carp.) One hundred superficial feet. 3. An area of four sides, generally with houses on each side; sometimes, a solid block of houses; also, an open place or area for public use, as at the meeting or intersection of two or more streets. The statue of Alexander VII. stands in the large square of the town. Addison. 4. (Mech. & Joinery)  An instrument having at least one right angle and two or more straight edges, used to lay out or test square work. It is of several forms, as the T square, the carpenter's square, the try-square., etc. 5. Hence, a pattern or rule. [Obs.] 6. (Arith. & Alg.)  The product of a number or quantity multiplied by itself; thus, 64 is the square of 8, for 8 × 8 = 64; the square of a + b is a2 + 2ab + b2. 7. Exact proportion; justness of workmanship and conduct; regularity; rule. [Obs.] They of Galatia [were] much more out of square. Hooker. I have not kept my square. Shak. 8. (Mil.)  A body of troops formed in a square, esp. one formed to resist a charge of cavalry; a squadron. \"The brave squares of war.\" Shak. 9. Fig.: The relation of harmony, or exact agreement; equality; level. We live not on the square with such as these. Dryden. 10. (Astrol.)  The position of planets distant ninety degrees from each other; a quadrate. [Obs.] 11. The act of squaring, or quarreling; a quarrel. [R.] 12. The front of a woman's dress over the bosom, usually worked or embroidered. [Obs.] Shak. Geometrical square. See Quadrat, n., 2. -- Hollow square (Mil.), a formation of troops in the shape of a square, each side consisting of four or five ranks, and the colors, officers, horses, etc., occupying the middle. -- Least square, Magic square, etc. See under Least, Magic, etc. -- On the square, or Upon the square, in an open, fair manner; honestly, or upon honor. [Obs. or Colloq.] -- On, or Upon, the square with, upon equality with; even with. Nares. -- To be all squares, to be all settled. [Colloq.] Dickens. -- To be at square, to be in a state of quarreling. [Obs.] Nares. -- To break no square, to give no offense; to make no difference. [Obs.] -- To break squares, to depart from an accustomed order. To see how the squares go, to see how the game proceeds; -- a phrase taken from the game of chess, the chessboard being formed with squares. [Obs.] L'Estrange.\n\n1. (Geom.)  Having four equal sides and four right angles; as, a square figure. 2. Forming a right angle; as, a square corner. 3. Having a shape broad for the height, with rectilineal and angular rather than curving outlines; as, a man of a square frame. 4. Exactly suitable or correspondent; true; just. She's a most truimphant lady, if report be square to her. Shak. 5. Rendering equal justice; exact; fair; honest, as square dealing. 6. Even; leaving no balance; as, to make or leave the accounts square. 7. Leaving nothing; hearty; vigorous. By Heaven, square eaters. More meat, I say. Beau. & Fl. 8. (Naut.)  At right angles with the mast or the keel, and parallel to the horizon; -- said of the yards of a square-rigged vessel when they are so braced. Note: Square is often used in self-explaining compounds or combination, as in square-built, square-cornered, square-cut, square- nosed, etc. Square foot, an area equal to that of a square the sides of which are twelwe inches; 144 square inches. -- Square knot, a knot in which the terminal and standing parts are parallel to each other; a reef knot. See Illust. under Knot. -- Square measure, the measure of a superficies or surface which depends on the length and breadth taken conjointly. The units of square measure are squares whose sides are the linear measures; as, square inches, square feet, square meters, etc. -- Square number. See square, n., 6. -- Square root of a number or quantity (Math.), that number or quantity which, multiplied by itself produces the given number or quantity. -- Square sail (Naut.), a four-sided sail extended upon a yard suspended by the middle; sometimes, the foresail of a schooner set upon a yard; also, a cutter's or sloop's sail boomed out. See Illust of Sail. -- Square stern (Naut.), a stern having a transom and joining the counter timbers at an angle, as distinguished from a round stern, which has no transom. -- Three-square, Five-square, etc., having three, five, etc., equal sides; as, a three-square file. -- To get square with, to get even with; to pay off. [Colloq.]\n\n1. To form with four sides and four right angles. Spenser. 2. To form with right angles and straight lines, or flat surfaces; as, to square mason's work. 3. To compare with, or reduce to, any given measure or standard. Shak. 4. To adjust; to regulate; to mold; to shape; to fit; as, to square our actions by the opinions of others. Square my trial To my proportioned strength. Milton. 5. To make even, so as leave no remainder of difference; to balance; as, to square accounts. 6. (Math.)  To multiply by itself; as, to square a number or a quantity. 7. (Astrol.)  To hold a quartile position respecting. The icy Goat and Crab that square the Scales. Creech. 8. (Naut.)  To place at right angles with the keel; as, to square the yards. To square one's shoulders, to raise the shoulders so as to give them a square appearance, -- a movement expressing contempt or dislike. Sir W. Scott. -- To square the circle (Math.), to determine the exact contents of a circle in square measure. The solution of this famous problem is now generally admitted to be impossible.\n\n1. To accord or agree exactly; to be consistent with; to conform or agree; to suit; to fit. No works shall find acceptamce . . . That square not truly with the Scripture plan. Cowper. 2. To go to opposite sides; to take an attitude of offense or defense, or of defiance; to quarrel. [Obs.] Are you such fools To square for this Shak. 3. To take a boxing attitude; -- often with up, sometimes with off. [Colloq.] Dickens."}