{"word":"staff","definition":"1. A long piece of wood; a stick; the long handle of an instrument or weapon; a pole or srick, used for many purposes; as, a surveyor's staff; the staff of a spear or pike. And he put the staves into the rings on the sides of the altar to bear it withal. Ex. xxxviii. 7. With forks and staves the felon to pursue. Dryden. 2. A stick carried in the hand for support or defense by a person walking; hence, a support; that which props or upholds. \"Hooked staves.\" Piers Plowman. The boy was the very staff of my age. Shak. He spoke of it [beer] in \"The Earnest Cry,\" and likewise in the \"Scotch Drink,\" as one of the staffs of life which had been struck from the poor man's hand. Prof. Wilson. 3. A pole, stick, or wand borne as an ensign of authority; a badge of office; as, a constable's staff. Methought this staff, mine office badge in court, Was broke in twain. Shak. All his officers brake their staves; but at their return new staves were delivered unto them. Hayward. 4. A pole upon which a flag is supported and displayed. 5. The round of a ladder. [R.] I ascend at one [ladder] of six hundred and thirty-nine staves. Dr. J. Campbell (E. Brown's Travels). 6. A series of verses so disposed that, when it is concluded, the same order begins again; a stanza; a stave. Cowley found out that no kind of staff is proper for an heroic poem, as being all too lyrical. Dryden. 7. (Mus.)  The five lines and the spaces on which music is written; -- formerly called stave. 8. (Mech.)  An arbor, as of a wheel or a pinion of a watch. 9. (Surg.)  The grooved director for the gorget, or knife, used in cutting for stone in the bladder. 10. Etym: [From Staff, 3, a badge of office.] (Mil.)  An establishment of officers in various departments attached to an army, to a section of an army, or to the commander of an army. The general's staff consists of those officers about his person who are employed in carrying his commands into execution. See État Major. 11. Hence: A body of assistants serving to carry into effect the plans of a superintendant or manager; as, the staff of a newspaper. Jacob's staff (Surv.), a single straight rod or staff, pointed and iron-shod at the bottom, for penetrating the ground, and having a socket joint at the top, used, instead of a tripod, for supporting a compass. -- Staff angle (Arch.), a square rod of wood standing flush with the wall on each of its sides, at the external angles of plastering, to prevent their being damaged. -- The staff of life, bread. \"Bread is the staff of life.\" Swift. -- Staff tree (Bot.), any plant of the genus Celastrus, mostly climbing shrubs of the northern hemisphere. The American species (C. scandens) is commonly called bittersweet. See 2d Bittersweet, 3 (b). -- To set, or To put, up, or down, one's staff, to take up one's residence; to lodge. [Obs.]"}