{"word":"stag","definition":"1. (Zoöl.) (a) The adult male of the red deer (Cervus elaphus), a large European species closely related to the American elk, or wapiti. (b) The male of certain other species of large deer. 2. A colt, or filly; also, a romping girl. [Prov. Eng.] 3. A castrated bull; -- called also bull stag, and bull seg. See the Note under Ox. 4. (Stock Exchange) (a) An outside irregular dealer in stocks, who is not a member of the exchange. [Cant] (b) One who applies for the allotment of shares in new projects, with a view to sell immediately at a premium, and not to hold the stock. [Cant] 5. (Zoöl.)  The European wren. [Prov. Eng.] Stag beetle (Zoöl.), any one of numerous species of lamellicorn beetles belonging to Lucanus and allied genera, especially L. cervus of Europe and L. dama of the United States. The mandibles are large and branched, or forked, whence the name. The lava feeds on the rotten wood of dead trees. Called also horned bug, and horse beetle. -- Stag dance, a dance by men only. [slang, U.S.] -- Stag hog (Zoöl.), the babiroussa. -- Stag-horn coral (Zoöl.), any one of several species of large branching corals of the genus Madrepora, which somewhat resemble the antlers of the stag, especially Madrepora cervicornis, and M. palmata, of Florida and the West Indies. -- Stag-horn fern (Bot.), an Australian and West African fern (Platycerium alcicorne) having the large fronds branched like a stag's horns; also, any species of the same genus. -- Stag-horn sumac (Bot.), a common American shrub (Rhus typhina) having densely velvety branchlets. See Sumac. -- Stag party, a party consisting of men only. [Slang, U. S.] -- Stag tick (Zoöl.), a parasitic dipterous insect of the family Hippoboscidæ, which lives upon the stag and in usually wingless. The same species lives also upon the European grouse, but in that case has wings.\n\nTo act as a \"stag\", or irregular dealer in stocks. [Cant]\n\nTo watch; to dog, or keep track of. [Prov. Eng. or Slang] H. Kingsley."}