{"word":"stain","definition":"1. To discolor by the application of foreign matter; to make foul; to spot; as, to stain the hand with dye; armor stained with blood. 2. To color, as wood, glass, paper, cloth, or the like, by processess affecting, chemically or otherwise, the material itself; to tinge with a color or colors combining with, or penetrating, the substance; to dye; as, to stain wood with acids, colored washes, paint rubbed in, etc.; to stain glass. 3. To spot with guilt or infamy; to bring reproach on; to blot; to soil; to tarnish. Of honor void, Of innocence, of faith, of purity, Our wonted ornaments now soiled and stained. Milton. 4. To cause to seem inferior or soiled by comparison. She stains the ripest virgins of her age. Beau. & Fl. That did all other beasts in beauty stain. Spenser. Stained glass, glass colored or stained by certain metallic pigments fused into its substance, -- often used for making ornament windows. Syn. -- To paint; dye; blot; soil; sully; discolor; disgrace; taint. -- Paint, Stain, Dye. These denote three different processes; the first mechanical, the other two, chiefly chemical. To paint a thing is so spread a coat of coloring matter over it; to stain or dye a thing is to impart color to its substance. To stain is said chiefly of solids, as wood, glass, paper; to dye, of fibrous substances, textile fabrics, etc.; the one, commonly, a simple process, as applying a wash; the other more complex, as fixing colors by mordants.\n\nTo give or receive a stain; to grow dim.\n\n1. A discoloration by foreign matter; a spot; as, a stain on a garment or cloth. Shak. 2. A natural spot of a color different from the gound. Swift trouts, diversified with crimson stains. Pope. 3. Taint of guilt; tarnish; disgrace; reproach. Nor death itself can wholly wash their stains. Dryden. Our opinion . . . is, I trust, without any blemish or stain of heresy. Hooker. 4. Cause of reproach; shame. Sir P. Sidney. 5. A tincture; a tinge. [R.] You have some stain of soldier in you. Shak. Syn. -- Blot; spot; taint; pollution; blemish; tarnish; color; disgrace; infamy; shame."}