{"word":"standard","definition":"1. A flag; colors; a banner; especially, a national or other ensign. His armies, in the following day, On those fair plains their standards proud display. Fairfax. 2. That which is established by authority as a rule for the measure of quantity, extent, value, or quality; esp., the original specimen weight or measure sanctioned by government, as the standard pound, gallon, or yard. 3. That which is established as a rule or model by authority, custom, or general consent; criterion; test. The court, which used to be the standard of property and correctness of speech. Swift. A disposition to preserve, and an ability to improve, taken together, would be my standard of a statesman. Burke. 4. (Coinage)  The proportion of weights of fine metal and alloy established by authority. By the present standard of the coinage, sixty-two shillings is coined out of one pound weight of silver. Arbuthnot. 5. (Hort.)  A tree of natural size supported by its own stem, and not dwarfed by grafting on the stock of a smaller species nor trained upon a wall or trellis. In France part of their gardens is laid out for flowers, others for fruits; some standards, some against walls. Sir W. Temple. 6. (Bot.)  The upper petal or banner of a papilionaceous corolla. 7. (Mech. & Carp.)  An upright support, as one of the poles of a scaffold; any upright in framing. 8. (Shipbuilding)  An inverted knee timber placed upon the deck instead of beneath it, with its vertical branch turned upward from that which lies horizontally. 9. The sheth of a plow. 10. A large drinking cup. Greene. Standard bearer, an officer of an army, company, or troop, who bears a standard; -- commonly called color sergeantor color bearer; hence, the leader of any organization; as, the standard bearer of a political party.\n\n1. Being, affording, or according with, a standard for comparison and judgment; as, standard time; standard weights and measures; a standard authority as to nautical terms; standard gold or silver. 2. Hence: Having a recognized and permanent value; as, standard works in history; standard authors. 3. (Hort.) (a) Not supported by, or fastened to, a wall; as, standard fruit trees. (b) Not of the dwarf kind; as, a standard pear tree. Standard candle, Standard gauge. See under Candle, and Gauge. -- Standard solution. (Chem.) See Standardized solution, under Solution."}