{"word":"star","definition":"1. One of the innumerable luminous bodies seen in the heavens; any heavenly body other than the sun, moon, comets, and nebulæ. His eyen twinkled in his head aright, As do the stars in the frosty night. Chaucer. Note: The stars are distinguished as planets, and fixed stars. See Planet, Fixed stars under Fixed, and Magnitude of a star under Magnitude. 2. The polestar; the north star. Shak. 3. (Astrol.)  A planet supposed to influence one's destiny; (usually pl.) a configuration of the planets, supposed to influence fortune. O malignant and ill-brooding stars. Shak. Blesses his stars, and thinks it luxury. Addison. 4. That which resembles the figure of a star, as an ornament worn on the breast to indicate rank or honor. On whom . . . Lavish Honor showered all her stars. Tennyson. 5. Specifically, a radiated mark in writing or printing; an asterisk [thus, *]; -- used as a reference to a note, or to fill a blank where something is omitted, etc. 6. (Pyrotechny)  A composition of combustible matter used in the heading of rockets, in mines, etc., which, exploding of a air, presents a starlike appearance. 7. A person of brilliant and attractive qualities, especially on public occasions, as a distinguished orator, a leading theatrical performer, etc. Note: Star is used in the formation of compound words generally or obvious signification: as, star-aspiring, star-bespangled, star- bestudded, star-blasting, star-bright, star-crowned, star-directed, star-eyed, star-headed, star-paved, star-roofed; star-sprinkled, star-wreathed. Blazing star, Double star, Multiple star, Shooting star, etc. See under Blazing, Double, etc. -- Nebulous star (Astron.), a small well-defined circular nebula, having a bright nucleus at its center like a star. -- Star anise (Bot.), any plant of the genus Illicium; -- so called from its star-shaped capsules. -- Star apple (Bot.), a tropical American tree (Chrysophyllum Cainito), having a milky juice and oblong leaves with a silky-golden pubescence beneath. It bears an applelike fruit, the carpels of which present a starlike figure when cut across. The name is extended to the whole genus of about sixty species, and the natural order (Sapotaceæ) to which it belongs is called the Star-apple family. -- Star conner, one who cons, or studies, the stars; an astronomer or an astrologer. Gascoigne. -- Star coral (Zoöl.), any one of numerous species of stony corals belonging to Astræa, Orbicella, and allied genera, in which the calicles are round or polygonal and contain conspicuous radiating septa. -- Star cucumber. (Bot.) See under Cucumber. -- Star flower. (Bot.) (a) A plant of the genus Ornithogalum; star- of-Bethlehem. (b) See Starwort (b). (c) An American plant of the genus Trientalis (Trientalis Americana). Gray. -- Star fort (Fort.), a fort surrounded on the exterior with projecting angles; -- whence the name. -- Star gauge (Ordnance), a long rod, with adjustable points projecting radially at its end, for measuring the size of different parts of the bore of a gun. -- Star grass. (Bot.) (a) A small grasslike plant (Hypoxis erecta) having star-shaped yellow flowers. (b) The colicroot. See Colicroot. -- Star hyacinth (Bot.), a bulbous plant of the genus Scilla (S. autumnalis); -- called also star-headed hyacinth. -- Star jelly (Bot.), any one of several gelatinous plants (Nostoc commune, N. edule, etc.). See Nostoc. -- Star lizard. (Zoöl.) Same as Stellion. -- Star-of-Bethlehem (Bot.), a bulbous liliaceous plant (Ornithogalum umbellatum) having a small white starlike flower. -- Star-of-the-earth (Bot.), a plant of the genus Plantago (P. coronopus), growing upon the seashore. -- Star polygon (Geom.), a polygon whose sides cut each other so as to form a star-shaped figure. -- Stars and Stripes, a popular name for the flag of the United States, which consists of thirteen horizontal stripes, alternately red and white, and a union having, in a blue field, white stars to represent the several States, one for each. With the old flag, the true American flag, the Eagle, and the Stars and Stripes, waving over the chamber in which we sit. D. Webster. -- Star showers. See Shooting star, under Shooting. -- Star thistle (Bot.), an annual composite plant (Centaurea solstitialis) having the involucre armed with radiating spines. -- Star wheel (Mach.), a star-shaped disk, used as a kind of ratchet wheel, in repeating watches and the feed motions of some machines. -- Star worm (Zoöl.), a gephyrean. -- Temporary star (Astron.), a star which appears suddenly, shines for a period, and then nearly or quite disappears. These stars are supposed by some astronometers to be variable stars of long and undetermined periods. -- Variable star (Astron.), a star whose brilliancy varies periodically, generally with regularity, but sometimes irregularly; - - called periodical star when its changes occur at fixed periods. -- Water star grass (Bot.), an aquatic plant (Schollera graminea) with small yellow starlike blossoms.\n\nTo set or adorn with stars, or bright, radiating bodies; to bespangle; as, a robe starred with gems. \"A sable curtain starred with gold.\" Young.\n\nTo be bright, or attract attention, as a star; to shine like a star; to be brilliant or prominent; to play a part as a theatrical star. W. Irving."}