{"word":"state","definition":"1. The circumstances or condition of a being or thing at any given time. State is a term nearly synonymous with \"mode,\" but of a meaning more extensive, and is not exclusively limited to the mutable and contingent. Sir W. Hamilton. Declare the past and present state of things. Dryden. Keep the state of the question in your eye. Boyle. 2. Rank; condition; quality; as, the state of honor. Thy honor, state, and seat is due to me. Shak. 3. Condition of prosperity or grandeur; wealthy or prosperous circumstances; social importance. She instructed him how he should keep state, and yet with a modest sense of his misfortunes. Bacon. Can this imperious lord forget to reign, Quit all his state, descend, and serve again Pope. 4. Appearance of grandeur or dignity; pomp. Where least og state there most of love is shown. Dryden. 5. A chair with a canopy above it, often standing on a dais; a seat of dignity; also, the canopy itself. [Obs.] His high throne, . . . under state Of richest texture spread. Milton. When he went to court, he used to kick away the state, and sit down by his prince cheek by jowl. Swift. 6. Estate, possession. [Obs.] Daniel. Your state, my lord, again in yours. Massinger. 7. A person of high rank. [Obs.] Latimer. 8. Any body of men united by profession, or constituting a community of a particular character; as, the civil and ecclesiastical states, or the lords spiritual and temporal and the commons, in Great Britain. Cf. Estate, n., 6. 9. The principal persons in a government. The bold design Pleased highly those infernal states. Milton. 10. The bodies that constitute the legislature of a country; as, the States-general of Holland. 11. A form of government which is not monarchial, as a republic. [Obs.] Well monarchies may own religion's name, But states are atheists in their very fame. Dryden. 12. A political body, or body politic; the whole body of people who are united one government, whatever may be the form of the government; a nation. Municipal law is a rule of conduct prescribed by the supreme power in a state. Blackstone. The Puritans in the reign of Mary, driven from their homes, sought an asylum in Geneva, where they found a state without a king, and a church without a bishop. R. Choate. 13. In the United States, one of the commonwealth, or bodies politic, the people of which make up the body of the nation, and which, under the national constitution, stands in certain specified relations with the national government, and are invested, as commonwealth, with full power in their several spheres over all matters not expressly inhibited. Note: The term State, in its technical sense, is used in distinction from the federal system, i. e., the government of the United States. 14. Highest and stationary condition, as that of maturity between growth and decline, or as that of crisis between the increase and the abating of a disease; height; acme. [Obs.] Note: When state is joined with another word, or used adjectively, it denotes public, or what belongs to the community or body politic, or to the government; also, what belongs to the States severally in the American Union; as, state affairs; state policy; State laws of Iowa. Nascent state. (Chem.) See under Nascent. -- Secretary of state. See Secretary, n., 3. -- State bargea royal barge, or a barge belonging to a government. -- State bed, an elaborately carved or decorated bed. -- State carriage, a highly decorated carriage for officials going in state, or taking part in public processions. -- State paper, an official paper relating to the interests or government of a state. Jay. -- State prison, a public prison or penitentiary; -- called also State's prison. -- State prisoner, one is confinement, or under arrest, for a political offense. -- State rights, or States' rights, the rights of the several independent States, as distinguished from the rights of the Federal government. It has been a question as to what rights have been vested in the general government. [U.S.] -- State's evidence. See Probator, 2, and under Evidence. -- State sword, a sword used on state occasions, being borne before a sovereign by an attendant of high rank. -- State trial, a trial of a person for a political offense. -- States of the Church. See under Ecclesiastical. Syn. -- State, Situation, Condition. State is the generic term, and denotes in general the mode in which a thing stands or exists. The situation of a thing is its state in reference to external objects and influences; its condition is its internal state, or what it is in itself considered. Our situation is good or bad as outward things bear favorably or unfavorably upon us; our condition is good or bad according to the state we are actually in as respects our persons, families, property, and other things which comprise our sources of enjoyment. I do not, brother, Infer as if I thought my sister's state Secure without all doubt or controversy. Milton. We hoped to enjoy with ease what, in our situation, might be called the luxuries of life. Cock. And, O, what man's condition can be worse Than his whom plenty starves and blessings curse Cowley.\n\n1. Stately. [Obs.] Spenser. 2. Belonging to the state, or body politic; public.\n\n1. To set; to settle; to establish. [R.] I myself, though meanest stated, And in court now almost hated. Wither. Who calls the council, states the certain day. Pope. 2. To express the particulars of; to set down in detail or in gross; to represent fully in words; to narrate; to recite; as, to state the facts of a case, one's opinion, etc. To state it. To assume state or dignity. [Obs.] \"Rarely dressed up, and taught to state it.\" Beau. & Fl.\n\nA statement; also, a document containing a statement. [R.] Sir W. Scott."}