{"word":"station","definition":"1. The act of standing; also, attitude or pose in standing; posture. [R.] A station like the herald, Mercury. Shak. Their manner was to stand at prayer, whereupon their meetings unto that purpose . . . had the names of stations given them. Hooker. 2. A state of standing or rest; equilibrium. [Obs.] All progression is performed by drawing on or impelling forward some part which was before in station, or at quiet. Sir T. Browne. 3. The spot or place where anything stands, especially where a person or thing habitually stands, or is appointed to remain for a time; as, the station of a sentinel. Specifically: (a) A regular stopping place in a stage road or route; a place where railroad trains regularly come to a stand, for the convenience of passengers, taking in fuel, moving freight, etc. (b) The headquarters of the police force of any precinct. (c) The place at which an instrument is planted, or observations are made, as in surveying. (d) (Biol.)  The particular place, or kind of situation, in which a species naturally occurs; a habitat. (e) (Naut.)  A place to which ships may resort, and where they may anchor safely. (f) A place or region to which a government ship or fleet is assigned for duty. (g) (Mil.) A place calculated for the rendezvous of troops, or for the distribution of them; also, a spot well adapted for offensive measures. Wilhelm (Mil. Dict.). (h) (Mining) An enlargement in a shaft or galley, used as a landing, or passing place, or for the accomodation of a pump, tank, etc. 4. Post assigned; office; the part or department of public duty which a person is appointed to perform; sphere of duty or occupation; employment. By spending this day [Sunday] in religious exercises, we acquire new strength and resolution to perform God's will in our several stations the week following. R. Nelson. 5. Situation; position; location. The fig and date -- why love they to remain In middle station, and an even plain Prior. 6. State; rank; condition of life; social status. The greater part have kept, I see, Their station. Milton. They in France of the best rank and station. Shak. 7. (Eccl.) (a) The fast of the fourth and sixth days of the week, Wednesday and Friday, in memory of the council which condemned Christ, and of his passion. (b) (R. C. Ch.) A church in which the procession of the clergy halts on stated days to say stated prayers. Addis & Arnold. (c) One of the places at which ecclesiastical processions pause for the performance of an act of devotion; formerly, the tomb of a martyr, or some similarly consecrated spot; now, especially, one of those representations of the successive stages of our Lord's passion which are often placed round the naves of large churches and by the side of the way leading to sacred edifices or shrines, and which are visited in rotation, stated services being performed at each; -- called also Station of the cross. Fairholt. Station bill. (Naut.) Same as Quarter bill, under Quarter. -- Station house. (a) The house serving for the headquarters of the police assigned to a certain district, and as a place of temporary confinement. (b) The house used as a shelter at a railway station. -- Station master, one who has charge of a station, esp. of a railway station. -- Station pointer (Surv.), an instrument for locating on a chart the position of a place from which the angles subtended by three distant objects, whose positions are known, have been observed. -- Station staff (Surv.), an instrument for taking angles in surveying. Craig. Syn. -- Station, Depot. In the United States, a stopping place on a railway for passengers and freight is commonly called a depot: but to a considerable extent in official use, and in common speech, the more appropriate name, station, has been adopted.\n\nTo place; to set; to appoint or assign to the occupation of a post, place, or office; as, to station troops on the right of an army; to station a sentinel on a rampart; to station ships on the coasts of Africa. He gained the brow of the hill, where the English phalanx was stationed. Lyttelton."}