{"word":"stay","definition":"A large, strong rope, employed to support a mast, by being extended from the head of one mast down to some other, or to some part of the vessel. Those which lead forward are called fore-and-aft stays; those which lead to the vessel's side are called backstays. See Illust. of Ship. In stays, or Hove in stays (Naut.), in the act or situation of staying, or going about from one tack to another. R. H. Dana, Jr. -- Stay holes (Naut.), openings in the edge of a staysail through which the hanks pass which join it to the stay. -- Stay tackle (Naut.), a tackle attached to a stay and used for hoisting or lowering heavy articles over the side. -- To miss stays (Naut.), to fail in the attempt to go about. Totten. -- Triatic stay (Naut.), a rope secured at the ends to the heads of the foremast and mainmast with thimbles spliced to its bight into which the stay tackles hook.\n\n1. To stop from motion or falling; to prop; to fix firmly; to hold up; to support. Aaron and Hur stayed up his hands, the one on the one side, and the other on the other side. Ex. xvii. 12. Sallows and reeds . . . for vineyards useful found To stay thy vines. Dryden. 2. To support from sinking; to sustain with strength; to satisfy in part or for the time. He has devoured a whole loaf of bread and butter, and it has not staid his stomach for a minute. Sir W. Scott. 3. To bear up under; to endure; to support; to resist successfully. She will not stay the siege of loving terms, Nor bide the encounter of assailing eyes. Shak. 4. To hold from proceeding; to withhold; to restrain; to stop; to hold. Him backward overthrew and down him stayed With their rude hands grisly grapplement. Spenser. All that may stay their minds from thinking that true which they heartly wish were false. Hooker. 5. To hinde Your ships are stayed at Venice. Shak. This business staid me in London almost a week. Evelyn. I was willing to stay my reader on an argument that appeared to me new. Locke. 6. To remain for the purpose of; to wait for. \"I stay dinner there.\" Shak. 7. To cause to cease; to put an end to. Stay your strife. Shak. For flattering planets seemed to say This child should ills of ages stay. Emerson. 8. (Engin.)  To fasten or secure with stays; as, to stay a flat sheet in a steam boiler. 9. (Naut.)  To tack, as a vessel, so that the other side of the vessel shall be presented to the wind. To stay a mast (Naut.), to incline it forward or aft, or to one side, by the stays and backstays.\n\n1. To remain; to continue in a place; to abide fixed for a space of time; to stop; to stand still. She would command the hasty sun to stay. Spenser. Stay, I command you; stay and hear me first. Dryden. I stay a little longer, as one stays To cover up the embers that still burn. Longfellow. 2. To continue in a state. The flames augment, and stay At their full height, then languish to decay. Dryden. 3. To wait; to attend; to forbear to act. I'll tell thee all my whole device When I am in my coach, which stays for us. Shak. The father can not stay any longer for the fortune. Locke. 4. To dwell; to tarry; to linger. I must stay a little on one action. Dryden. 5. To rest; to depend; to rely; to stand; to insist. I stay here on my bond. Shak. Ye despise this word, and trust in oppression and perverseness, and stay thereon. Isa. xxx. 12. 6. To come to an end; to cease; as, that day the storm stayed. [Archaic] Here my commission stays. Shak. 7. To hold out in a race or other contest; as, a horse stays well. [Colloq.] 8. (Naut.)  To change tack; as a ship.\n\n1. That which serves as a prop; a support. \"My only strength and stay.\" Milton. Trees serve as so many stays for their vines. Addison. Lord Liverpool is the single stay of this ministry. Coleridge. 2. pl.  A corset stiffened with whalebone or other material, worn by women, and rarely by men. How the strait stays the slender waist constrain. Gay. 3. Continuance in a place; abode for a space of time; sojourn; as, you make a short stay in this city. Make haste, and leave thy business and thy care; No mortal interest can be worth thy stay. Dryden. Embrace the hero and his stay implore. Waller. 4. Cessation of motion or progression; stand; stop. Made of sphere metal, never to decay Until his revolution was at stay. Milton. Affairs of state seemed rather to stand at a stay. Hayward. 5. Hindrance; let; check. [Obs.] They were able to read good authors without any stay, if the book were not false. Robynson (more's Utopia). 6. Restraint of passion; moderation; caution; steadiness; sobriety. [Obs.] \"Not grudging that thy lust hath bounds and stays.\" Herbert. The wisdom, stay, and moderation of the king. Bacon. With prudent stay he long deferred The rough contention. Philips. 7. (Engin.)  Strictly, a part in tension to hold the parts together, or stiffen them. Stay bolt (Mech.), a bolt or short rod, connecting opposite plates, so as to prevent them from being bulged out when acted upon by a pressure which tends to force them apart, as in the leg of a steam boiler. -- Stay busk, a stiff piece of wood, steel, or whalebone, for the front support of a woman's stays. Cf. Busk. -- Stay rod, a rod which acts as a stay, particularly in a steam boiler."}