{"word":"steam","definition":"1. The elastic, aëriform fluid into which water is converted when heated to the boiling points; water in the state of vapor. 2. The mist formed by condensed vapor; visible vapor; -- so called in popular usage. 3. Any exhalation. \"A steam og rich, distilled perfumes.\" Milton. Dry steam, steam which does not contain water held in suspension mechanically; -- sometimes applied to superheated steam. -- Exhaust steam. See under Exhaust. -- High steam, or High-pressure steam, steam of which the pressure greatly exceeds that of the atmosphere. -- Low steam, or Low-pressure steam, steam of which the pressure is less than, equal to, or not greatly above, that of the atmosphere. -- Saturated steam, steam at the temperature of the boiling point which corresponds to its pressure; -- sometimes also applied to wet steam. -- Superheated steam, steam heated to a temperature higher than the boiling point corresponding to its pressure. It can not exist in contact with water, nor contain water, and resembles a perfect gas; - - called also surcharged steam, anhydrous steam, and steam gas. -- Wet steam, steam which contains water held in suspension mechanically; -- called also misty steam. Note: Steam is often used adjectively, and in combination, to denote, produced by heat, or operated by power, derived from steam, in distinction from other sources of power; as in steam boiler or steam- boiler, steam dredger or steam-dredger, steam engine or steam-engine, steam heat, steam plow or steam-plow, etc. Steam blower. (a) A blower for producing a draught consisting of a jet or jets of steam in a chimney or under a fire. (b) A fan blower driven directly by a steam engine. -- Steam boiler, a boiler for producing steam. See Boiler, 3, and Note. In the illustration, the shell a of the boiler is partly in section, showing the tubes, or flues, which the hot gases, from the fire beneath the boiler, enter, after traversing the outside of the shell, and through which the gases are led to the smoke pipe d, which delivers them to the chimney; b is the manhole; c the dome; e the steam pipe; f the feed and blow-off pipe; g the safety value; hthe water gauge. -- Steam car, a car driven by steam power, or drawn by a locomotive. -- Steam carriage, a carriage upon wheels moved on common roads by steam. -- Steam casing. See Steam jacket, under Jacket. -- Steam chest, the box or chamber from which steam is distributed to the cylinder of a steam engine, steam pump, etc., and which usually contains one or more values; -- called also valve chest, and valve box. See Illust. of Slide valve, under Slide. -- Steam chimney, an annular chamber around the chimney of a boiler furnace, for drying steam. -- Steam coil, a coil of pipe, or collection of connected pipes, for containing steam; -- used for heating, drying, etc. -- Steam colors (Calico Printing), colors in which the chemical reaction fixed the coloring matter in the fiber is produced by steam. -- Steam cylinder, the cylinder of a steam engine, which contains the piston. See Illust. of Slide valve, under Slide. -- Steam dome (Steam Boilers), a chamber upon the top of the boiler, from which steam is conduced to the engine. See Illust. of Steam boiler, above. -- Steam fire engine, a fire engine consisting of a steam boiler and engine, and pump which is driven by the engine, combined and mounted on wheels. It is usually drawn by horses, but is sometimes made self- propelling. -- Steam fitter, a fitter of steam pipes. -- Steam fitting, the act or the occupation of a steam fitter; also, a pipe fitting for steam pipes. -- Steam gas. See Superheated steam, above. -- Steam gauge, an instrument for indicating the pressure of the steam in a boiler. The mercurial steam gauge is a bent tube partially filled with mercury, one end of which is connected with the boiler while the other is open to the air, so that the steam by its pressure raises the mercury in the long limb of the tume to a height proportioned to that pressure. A more common form, especially for high pressures, consists of a spring pressed upon by the steam, and connected with the pointer of a dial. The spring may be a flattened, bent tube, closed at one end, which the entering steam tends to straighten, or it may be a diaphragm of elastic metal, or a mass of confined air, etc. -- Steam gun, a machine or contrivance from which projectiles may be thrown by the elastic force of steam. -- Steam hammer, a hammer for forging, which is worked directly by steam; especially, a hammer which is guided vertically and operated by a vertical steam cylinder located directly over an anvil. In the variety known as Nasmyth's, the cylinder is fixed, and the hammer is attached to the piston rod. In that known as Condie's, the piston is fixed, and the hammer attached to the lower end of the cylinder. -- Steam heater. (a) A radiator heated by steam. (b) An apparatus consisting of a steam boiler, radiator, piping, and fixures for warming a house by steam. -- Steam jacket. See under Jacket. -- Steam packet, a packet or vessel propelled by steam, and running periodically between certain ports. -- Steam pipe, any pipe for conveying steam; specifically, a pipe through which steam is supplied to an engine. -- Steam plow or plough, a plow, or gang of plows, moved by a steam engine. -- Steam port, an opening for steam to pass through, as from the steam chest into the cylinder. -- Steam power, the force or energy of steam applied to produce results; power derived from a steam engine. -- Steam propeller. See Propeller. -- Steam pump, a small pumping engine operated by steam. It is usually direct-acting. -- Steam room (Steam Boilers), the space in the boiler above the water level, and in the dome, which contains steam. -- Steam table, a table on which are dishes heated by steam for keeping food warm in the carving room of a hotel, restaurant, etc. -- Steam trap, a self-acting device by means of which water that accumulates in a pipe or vessel containing steam will be discharged without permitting steam to escape. -- Steam tug, a steam vessel used in towing or propelling ships. -- Steam vessel, a vessel propelled by steam; a steamboat or steamship; -- a steamer. -- Steam whistle, an apparatus attached to a steam boiler, as of a locomotive, through which steam is rapidly discharged, producing a loud whistle which serves as a warning signal. The steam issues from a narrow annular orifice around the upper edge of the lower cup or hemisphere, striking the thin edge of the bell above it, and producing sound in the manner of an organ pipe or a common whistle.\n\n1. To emit steam or vapor. My brother's ghost hangs hovering there, O'er his warm blood, that steams into the air. Dryden. Let the crude humors dance In heated brass, steaming with fire intence. J. Philips. 2. To rise in vapor; to issue, or pass off, as vapor. The dissolved amber . . . steamed away into the air. Boyle. 3. To move or travel by the agency of steam. The vessel steamed out of port. N. P. Willis. 4. To generate steam; as, the boiler steams well.\n\n1. To exhale. [Obs.] Spenser. 2. To expose to the action of steam; to apply steam to for softening, dressing, or preparing; as, to steam wood; to steamcloth; to steam food, etc."}