{"word":"steam engine","definition":"An engine moved by steam. Note: In its most common forms its essential parts are a piston, a cylinder, and a valve gear. The piston works in the cylinder, to which steam is admitted by the action of the valve gear, and communicates motion to the machinery to be actuated. Steam engines are thus classified: 1. According to the wat the steam is used or applied, as condencing, noncondencing, compound, double-acting, single-acting, triple-expansion, etc. 2. According to the motion of the piston, as reciprocating, rotary, etc. 3. According to the motion imparted by the engine, as rotative and nonrotative. 4. According to the arrangement of the engine, as stationary, portable, and semiportable engines, beam engine, oscillating engine, direct-acting and back-acting engines, etc. 5. According to their uses, as portable, marine, locomotive, pumping, blowing, winding, and stationary engines. Locomotive and portable engines are usually high- pressure, noncondencing, rotative, and direct-acting. Marine engines are high or low pressure, rotative, and generally condencing, double- acting, and compound. Paddle engines are generally beam, sideScrew engines are generally direct-acting, back-acting, or oscillating. Stationary engines belong to various classes, but are generally rotative. A horizontal or inclined stationary steam engine is called a left-hand or a right-hand engine when the crank shaft and driving pulley are on the left-hand side, or the right-hand side, respectively, or the engine, to a person looking at them from the cylinder, and is said to run forward or backward when the crank traverses the upward half, or lower half, respectively, of its path, while the piston rod makes its stroke outward from the cylinder. A marine engine, or the engine of a locomotive, is said to run forward when its motion is such as would propel the vessel or the locomotive forward. Steam engines are further classified as double-cylinder, disk, semicylinder, trunk engines, etc. Machines, such as cranes, hammers, etc., of which the steam engine forms a part, are called steam cranes, steam hammers, etc. See Illustration in Appendix. Back- acting, or Back-action, steam engine, a steam engine in which the motion is transmitted backward from the crosshead to a crank which is between the crosshead and the cylinder, or beyond the cylinder. -- Portable steam engine, a steam engine combined with, and attached to, a boiler which is mounted on wheels so as to admit of easy transportation; -- used for driving machinery in the field, as trashing machines, draining pumps, etc. -- Semiportable steam engine, a steam engine combined with, and attached to, a steam boiler, but not mounted on wheels."}