{"word":"steal","definition":"A handle; a stale, or stele. [Archaic or Prov. Eng.] And in his hand a huge poleax did bear. Whose steale was iron-studded but not long. Spenser.\n\n1. To take and carry away, feloniously; to take without right or leave, and with intent to keep wrongfully; as, to steal the personal goods of another. Maugre thy heed, thou must for indigence Or steal, or borrow, thy dispense. Chaucer. The man who stole a goose and gave away the giblets in G. Eliot. 2. To withdraw or convey clandestinely (reflexive); hence, to creep furtively, or to insinuate. They could insinuate and steal themselves under the same by their humble carriage and submission. Spenser. He will steal himself into a man's favor. Shak. 3. To gain by insinuating arts or covert means. So Absalom stole the hearts of the men of Israel. 2 Sam. xv. 6. 4. To get into one's power gradually and by imperceptible degrees; to take possession of by a gradual and imperceptible appropriation; -- with away. Variety of objects has a tendency to steal away the mind from its steady pursuit of any subject. I. Watts. 5. To accomplish in a concealed or unobserved manner; to try to carry out secretly; as, to steal a look. Always, when thou changest thine opinion or course, profess it plainly, . . . and do not think to steal it. Bacon. To steal a march, to march in a covert way; to gain an advantage unobserved; -- formerly followed by of, but now by on or upon, and sometimes by over; as, to steal a march upon one's political rivals. She yesterday wanted to steal a march of poor Liddy. Smollett. Fifty thousand men can not easily steal a march over the sea. Walpole. Syn. -- To filch; pilfer; purloin; thieve.\n\n1. To practice, or be guilty of, theft; to commit larceny or theft. Thou shalt not steal. Ex. xx. 15. 2. To withdraw, or pass privily; to slip in, along, or away, unperceived; to go or come furtively. Chaucer. Fixed of mind to avoid further entreaty, and to fly all company, one night she stole away. Sir P. Sidney. From whom you now must steal, and take no leave. Shak. A soft and solemn breathing sound Rose like a steam of rich, distilled perfumes, And stole upon the air. Milton."}