{"word":"steel","definition":"1. (Metal)  A variety of iron intermediate in composition and properties between wrought iron and cast iron (containing between one half of one per cent and one and a half per cent of carbon), and consisting of an alloy of iron with an iron carbide. Steel, unlike wrought iron, can be tempered, and retains magnetism. Its malleability decreases, and fusibility increases, with an increase in carbon. 2. An instrument or implement made of steel; as: -- (a) A weapon, as a sword, dagger, etc. \"Brave Macbeth . . . with his brandished steel.\" Shak. While doubting thus he stood, Received the steel bathed in his brother's blood. Dryden. (b) An instrument of steel (usually a round rod) for sharpening knives. (c) A piece of steel for striking sparks from flint. 3. Fig.: Anything of extreme hardness; that which is characterized by sternness or rigor. \"Heads of steel.\" Johnson. \"Manhood's heart of steel.\" Byron. 4. (Med.)  A chalybeate medicine. Dunglison. Note: Steel is often used in the formation of compounds, generally of obvious meaning; as, steel-clad, steel-girt, steel-hearted, steel- plated, steel-pointed, etc. Bessemer steel (Metal.) See in the Vocabulary. -- Blister steel. (Metal.) See under Blister. -- Cast steel (Metal.), a fine variety of steel, originally made by smelting blister or cementation steel; hence, ordinarily, steel of any process of production when remelted and cast. -- Cromium steel (Metal.), a hard, tenacious variety containing a little cromium, and somewhat resembling tungsten steel. -- Mild steel (Metal.), a kind of steel having a lower proportion of carbon than ordinary steel, rendering it softer and more malleable. -- Puddled steel (Metal.), a variety of steel produced from cast iron by the puddling process. -- Steel duck (Zoöl.), the goosander, or merganser. [Prov. Eng.] -- Steel mill. (a) (Firearms) See Wheel lock, under Wheel. (b) A mill which has steel grinding surfaces. (c) A mill where steel is manufactured. -- Steel trap, a trap for catching wild animals. It consists of two iron jaws, which close by means of a powerful steel spring when the animal disturbs the catch, or tongue, by which they are kept open. -- Steel wine, wine, usually sherry, in which steel filings have been placed for a considerable time, -- used as a medicine. -- Tincture of steel (Med.), an alcoholic solution of the chloride of iron. -- Tungsten steel (Metal.), a variety of steel containing a small amount of tungsten, and noted for its tenacity and hardness, as well as for its malleability and tempering qualities. It is also noted for its magnetic properties.\n\n1. To overlay, point, or edge with steel; as, to steel a razor; to steel an ax. 2. To make hard or strong; hence, to make insensible or obdurate. Lies well steeled with weighty arguments. Shak. O God of battles! steel my soldier's hearts. Shak. Why will you fight against so sweet a passion, And steel your heart to such a world of charms Addison. 3. Fig.: To cause to resemble steel, as in smoothness, polish, or other qualities. These waters, steeled By breezeless air to smoothest polish. Wordsworth. 4. (Elec.)  To cover, as an electrotype plate, with a thin layer of iron by electrolysis. The iron thus deposited is very hard, like steel."}