{"word":"stem","definition":"To gleam. [Obs.] His head bald, that shone as any glass, . . . [And] stemed as a furnace of a leed [caldron]. Chaucer.\n\nA gleam of light; flame. [Obs.]\n\n1. The principal body of a tree, shrub, or plant, of any kind; the main stock; the part which supports the branches or the head or top. After they are shot up thirty feet in length, they spread a very large top, having no bough nor twig in the trunk or the stem. Sir W. Raleigh. The lowering spring, with lavish rain, Beats down the slender stem and breaded grain. Dryden. 2. A little branch which connects a fruit, flower, or leaf with a main branch; a peduncle, pedicel, or petiole; as, the stem of an apple or a cherry. 3. The stock of a family; a race or generation of progenitors. \"All that are of noble stem.\" Milton. While I do pray, learn here thy stem And true descent. Herbert. 4. A branch of a family. This is a stem Of that victorious stock. Shak. 5. (Naut.)  A curved piece of timber to which the two sides of a ship are united at the fore end. The lower end of it is scarfed to the keel, and the bowsprit rests upon its upper end. Hence, the forward part of a vessel; the bow. 6. Fig.: An advanced or leading position; the lookout. Wolsey sat at the stem more than twenty years. Fuller. 7. Anything resembling a stem or stalk; as, the stem of a tobacco pipe; the stem of a watch case, or that part to which the ring, by which it is suspended, is attached. 8. (Bot.)  That part of a plant which bears leaves, or rudiments of leaves, whether rising above ground or wholly subterranean. 9. (Zoöl.) (a) The entire central axis of a feather. (b) The basal portion of the body of one of the Pennatulacea, or of a gorgonian. 10. (Mus.)  The short perpendicular line added to the body of a note; the tail of a crotchet, quaver, semiquaver, etc. 11. (Gram.)  The part of an inflected word which remains unchanged (except by euphonic variations) throughout a given inflection; theme; base. From stem to stern (Naut.), from one end of the ship to the other, or through the whole length. -- Stem leaf (Bot.), a leaf growing from the stem of a plant, as contrasted with a basal or radical leaf.\n\n1. To remove the stem or stems from; as, to stem cherries; to remove the stem and its appendages (ribs and veins) from; as, to stem tobacco leaves. 2. To ram, as clay, into a blasting hole.\n\nTo oppose or cut with, or as with, the stem of a vessel; to resist, or make progress against; to stop or check the flow of, as a current. \"An argosy to stem the waves.\" Shak. [They] stem the flood with their erected breasts. Denham. Stemmed the wild torrent of a barbarous age. Pope.\n\nTo move forward against an obstacle, as a vessel against a current. Stemming nightly toward the pole. Milton."}