{"word":"stern","definition":"The black tern.\n\nHaving a certain hardness or severity of nature, manner, or aspect; hard; severe; rigid; rigorous; austere; fixed; unchanging; unrelenting; hence, serious; resolute; harsh; as, a sternresolve; a stern necessity; a stern heart; a stern gaze; a stern decree. The sterne wind so loud gan to rout. Chaucer. I would outstare the sternest eyes that look. Shak. When that the poor have cried, Cæsar hath wept; Ambition should be made of sterner stuff. Shak. Stern as tutors, and as uncles hard. Dryden. These barren rocks, your stern inheritance. Wordsworth. Syn. -- Gloomy; sullen; forbidding; strict; unkind; hard-hearted; unfeeling; cruel; pitiless.\n\n1. The helm or tiller of a vessel or boat; also, the rudder. [Obs.] Chaucer. 2. (Naut.)  The after or rear end of a ship or other vessel, or of a boat; the part opposite to the stem, or prow. 3. Fig.: The post of management or direction. And sit chiefest stern of public weal. Shak. 4. The hinder part of anything. Spenser. 5. The tail of an animal; -- now used only of the tail of a dog. By the stern. (Naut.) See By the head, under By.\n\nBeing in the stern, or being astern; as, the stern davits. Stern board (Naut.), a going or falling astern; a loss of way in making a tack; as, to make a stern board. See Board, n., 8 (b). -- Stern chase. (Naut.) (a) See under Chase, n. (b) A stern chaser. -- Stern chaser (Naut.), a cannon placed in a ship's stern, pointing backward, and intended to annoy a ship that is in pursuit. -- Stern fast (Naut.), a rope used to confine the stern of a ship or other vessel, as to a wharf or buoy. -- Stern frame (Naut.), the framework of timber forms the stern of a ship. -- Stern knee. See Sternson. -- Stern port (Naut.), a port, or opening, in the stern of a ship. -- Stern sheets (Naut.), that part of an open boat which is between the stern and the aftmost seat of the rowers, -- usually furnished with seats for passengers. -- Stern wheel, a paddle wheel attached to the stern of the steamboat which it propels.stern wheeler."}