{"word":"stick","definition":"1. A small shoot, or branch, separated, as by a cutting, from a tree or shrub; also, any stem or branch of a tree, of any size, cut for fuel or timber. Withered sticks to gather, which might serve Against a winter's day. Milton. 2. Any long and comparatively slender piece of wood, whether in natural form or shaped with tools; a rod; a wand; a staff; as, the stick of a rocket; a walking stick. 3. Anything shaped like a stick; as, a stick of wax. 4. A derogatory expression for a person; one who is inert or stupid; as, an odd stick; a poor stick. [Colloq.] 5. (Print.)  A composing stick. See under Composing. It is usually a frame of metal, but for posters, handbills, etc., one made of wood is used. 6. A thrust with a pointed instrument; a stab. A stick of eels, twenty-five eels. [Prov. Eng.] -- Stick chimney, a chimney made of sticks laid crosswise, and cemented with clay or mud, as in some log houses. [U.S.] -- Stick insect, (Zoöl.), any one of various species of wingless orthopterous insects of the family Phasmidæ, which have a long round body, resembling a stick in form and color, and long legs, which are often held rigidly in such positions as to make them resemble small twigs. They thus imitate the branches and twigs of the trees on which they live. The common American species is Diapheromera femorata. Some of the Asiatic species are more than a foot long. -- To cut one's stick, or To cut stick, to run away. [Slang] De Quincey.\n\n1. To penetrate with a pointed instrument; to pierce; to stab; hence, to kill by piercing; as, to stick a beast. And sticked him with bodkins anon. Chaucer. It was a shame . . . to stick him under the other gentleman's arm while he was redding the fray. Sir W. Scott. 2. To cause to penetrate; to push, thrust, or drive, so as to pierce; as, to stick a needle into one's finger. Thou stickest a dagger in me. Shak. 3. To fasten, attach, or cause to remain, by thrusting in; hence, also, to adorn or deck with things fastened on as by piercing; as, to stick a pin on the sleeve. My shroud of white, stuck all with yew. Shak. The points of spears are stuck within the shield. Dryden. 4. To set; to fix in; as, to stick card teeth. 5. To set with something pointed; as, to stick cards. 6. To fix on a pointed instrument; to impale; as, to stick an apple on a fork. 7. To attach by causing to adhere to the surface; as, to stick on a plaster; to stick a stamp on an envelope; also, to attach in any manner. 8. (Print.)  To compose; to set, or arrange, in a composing stick; as, to stick type. [Cant] 9. (Joinery)  To run or plane (moldings) in a machine, in contradistinction to working them by hand. Such moldings are said to be stuck. 10. To cause to stick; to bring to a stand; to pose; to puzzle; as, to stick one with a hard problem. [Colloq.] 11. To impose upon; to compel to pay; sometimes, to cheat. [Slang] To stick out, to cause to project or protrude; to render prominent.\n\n1. To adhere; as, glue sticks to the fingers; paste sticks to the wall. The green caterpillar breedeth in the inward parts of roses not blown, where the dew sticketh. Bacon. 2. To remain where placed; to be fixed; to hold fast to any position so as to be moved with difficulty; to cling; to abide; to cleave; to be united closely. A friend that sticketh closer than a brother. Prov. xviii. 24. I am a kind of bur; I shall stick. Shak. If on your fame our sex a bolt has thrown, 'T will ever stick through malice of your own. Young. 3. To be prevented from going farther; to stop by reason of some obstacle; to be stayed. I had most need of blessing, and \"Amen\" Stuck in my throat. Shak. The trembling weapon passed Through nine bull hides, . . . and stuck within the last. Dryden. 4. To be embarrassed or puzzled; to hesitate; to be deterred, as by scruples; to scruple; -- often with at. They will stick long at part of a demonstration for want of perceiving the connection of two ideas. Locke. Some stick not to say, that the parson and attorney forged a will. Arbuthnot. 5. To cause difficulties, scruples, or hesitation. This is the difficulty that sticks with the most reasonable. Swift. To stick by. (a) To adhere closely to; to be firm in supporting. \"We are your only friends; stick by us, and we will stick by you.\" Davenant. (b) To be troublesome by adhering. \"I am satisfied to trifle away my time, rather than let it stick by me.\" Pope. -- To stick out. (a) To project; to be prominent. \"His bones that were not seen stick out.\" Job xxxiii. 21. (b) To persevere in a purpose; to hold out; as, the garrison stuck out until relieved. [Colloq.]v.i. to stick it out. -- To stick to, to be persevering in holding to; as, to stick to a party or cause. \"The advantage will be on our side if we stick to its essentials.\" Addison. -- To stick up, to stand erect; as, his hair sticks up. -- To stick up for, to assert and defend; as, to stick up for one's rights or for a friend. [Colloq.] -- To stick upon, to dwell upon; not to forsake. \"If the matter be knotty, the mind must stop and buckle to it, and stick upon it with labor and thought.\" Locke."}