{"word":"still","definition":"1. Motionless; at rest; quiet; as, to stand still; to lie or sit still. \"Still as any stone.\" Chaucer. 2. Uttering no sound; silent; as, the audience is still; the animals are still. The sea that roared at thy command, At thy command was still. Addison. 3. Not disturbed by noise or agitation; quiet; calm; as, a still evening; a still atmosphere. \"When all the woods are still.\" Milton. 4. Comparatively quiet or silent; soft; gentle; low. \"A still small voice.\" 1 Kings xix. 12. 5. Constant; continual. [Obs.] By still practice learn to know thy meaning. Shak. 6. Not effervescing; not sparkling; as, still wines. Still life. (Fine Arts) (a) Inanimate objects. (b) (Painting) The class or style of painting which represents inanimate objects, as fruit, flowers, dead game, etc. Syn. -- Quiet; calm; noiseless; serene; motionless; inert; stagnant.\n\n1. Freedom from noise; calm; silence; as, the still of midnight. [Poetic] 2. A steep hill or ascent. [Obs.] W. Browne.\n\n1. To this time; until and during the time now present; now no less than before; yet. It hath been anciently reported, and is still received. Bacon. 2. In the future as now and before. Hourly joys be still upon you! Shak. 3. In continuation by successive or repeated acts; always; ever; constantly; uniformly. The desire of fame betrays an ambitious man into indecencies that lessen his reputation; he is still afraid lest any of his actions should be thrown away in private. Addison. Chemists would be rich if they could still do in great quantities what they have sometimes done in little. Boyle. 4. In an increasing or additional degree; even more; -- much used with comparatives. The guilt being great, the fear doth still exceed. Shak. 5. Notwithstanding what has been said or done; in spite of what has occured; nevertheless; -- sometimes used as a conjunction. See Synonym of But. As sunshine, broken in the rill, Though turned astray, is sunshine still. Moore. 6. After that; after what is stated. In the primitive church, such as by fear being compelled to sacrifice to strange gods, after repented, and kept still the office of preaching the gospel. Whitgift. Still and anon, at intervals and repeatedly; continually; ever and anon; now and then. And like the watchful minutes to the hour, Still and anon cheered up the heavy time. Shak.\n\n1. To stop, as motion or agitation; to cause to become quiet, or comparatively quiet; to check the agitation of; as, to still the raging sea. He having a full sway over the water, had power to still and compose it, as well as to move and disturb it. Woodward. 2. To stop, as noise; to silence. With his name the mothers still their babies. Shak. 3. To appease; to calm; to quiet, as tumult, agitation, or excitement; as, to still the passions. Shak. Toil that would, at least, have stilled an unquiet impulse in me. Hawthorne. Syn. -- To quiet; calm; allay; lull; pacify; appease; subdue; suppress; silence; stop; check; restrain.\n\n1. A vessel, boiler, or copper used in the distillation of liquids; specifically, one used for the distillation of alcoholic liquors; a retort. The name is sometimes applied to the whole apparatus used in in vaporization and condensation. 2. A house where liquors are distilled; a distillery. Still watcher, a device for indicating the progress of distillation by the density of the liquid given over. Knight.\n\n1. To cause to fall by drops. 2. To expel spirit from by heat, or to evaporate and condense in a refrigeratory; to distill. Tusser.\n\nTo drop, or flow in drops; to distill. [Obs.] Spenser."}