{"word":"stock","definition":"1. The stem, or main body, of a tree or plant; the fixed, strong, firm part; the trunk. Though the root thereof wax old in the earth, and the stock thereof die in the ground, yet through the scent of water it will bud, and bring forth boughs like a plant. Job xiv. 8,9. 2. The stem or branch in which a graft is inserted. The scion overruleth the stock quite. Bacon. 3. A block of wood; something fixed and solid; a pillar; a firm support; a post. All our fathers worshiped stocks and stones. Milton. Item, for a stock of brass for the holy water, seven shillings; which, by the canon, must be of marble or metal, and in no case of brick. Fuller. 4. Hence, a person who is as dull and lifeless as a stock or post; one who has little sense. Let's be no stoics, nor no stocks. Shak. 5. The principal supporting part; the part in which others are inserted, or to which they are attached. Specifically: -- (a) The wood to which the barrel, lock, etc., of a musket or like firearm are secured; also, a long, rectangular piece of wood, which is an important part of several forms of gun carriage. (b) The handle or contrivance by which bits are held in boring; a bitstock; a brace. (c) (Joinery) The block of wood or metal frame which constitutes the body of a plane, and in which the plane iron is fitted; a plane stock. (d) (Naut.) The wooden or iron crosspiece to which the shank of an anchor is attached. See Illust. of Anchor. (e) The support of the block in which an anvil is fixed, or of the anvil itself. (f) A handle or wrench forming a holder for the dies for cutting screws; a diestock. (g) The part of a tally formerly struck in the exchequer, which was delivered to the person who had lent the king money on account, as the evidence of indebtedness. See Counterfoil. [Eng.] 6. The original progenitor; also, the race or line of a family; the progenitor of a family and his direct descendants; lineage; family. And stand betwixt them made, when, severally, All told their stock. Chapman. Thy mother was no goddess, nor thy stock From Dardanus. Denham. 7. Money or capital which an individual or a firm employs in business; fund; in the United States, the capital of a bank or other company, in the form of transferable shares, each of a certain amount; money funded in government securities, called also the public funds; in the plural, property consisting of shares in joint-stock companies, or in the obligations of a government for its funded debt; -- so in the United States, but in England the latter only are called stocks, and the former shares. 8. (Bookkeeping)  Same as Stock account, below. 9. Supply provided; store; accumulation; especially, a merchant's or manufacturer's store of goods; as, to lay in a stock of provisions. Add to that stock which justly we bestow. Dryden. 10. (Agric.)  Domestic animals or beasts collectively, used or raised on a farm; as, a stock of cattle or of sheep, etc.; -- called also live stock. 11. (Card Playing)  That portion of a pack of cards not distributed to the players at the beginning of certain games, as gleek, etc., but which might be drawn from afterward as occasion required; a bank. I must buy the stock; send me good cardings. Beau. & Fl. 12. A thrust with a rapier; a stoccado. [Obs.] 13. Etym: [Cf. Stocking.]  A covering for the leg, or leg and foot; as, upper stocks (breeches); nether stocks (stockings). [Obs.] With a linen stock on one leg. Shak. 14. A kind of stiff, wide band or cravat for the neck; as, a silk stock. 15. pl.  A frame of timber, with holes in which the feet, or the feet and hands, of criminals were formerly confined by way of punishment. He shall rest in my stocks. Piers Plowman. 16. pl. (Shipbuilding)  The frame or timbers on which a ship rests while building. 17. pl.  Red and gray bricks, used for the exterior of walls and the front of buildings. [Eng.] 18. (Bot.)  Any cruciferous plant of the genus Matthiola; as, common stock (Matthiola incana) (see Gilly-flower); ten-weeks stock (M. annua). 19. (Geol.)  An irregular metalliferous mass filling a large cavity in a rock formation, as a stock of lead ore deposited in limestone. 20. A race or variety in a species. 21. (Biol.)  In tectology, an aggregate or colony of persons (see Person), as trees, chains of salpæ, etc. 22. The beater of a fulling mill. Knight. 23. (Cookery)  A liquid or jelly containing the juices and soluble parts of meat, and certain vegetables, etc., extracted by cooking; -- used in making soup, gravy, etc. Bit stock. See Bitstock. -- Dead stock (Agric.), the implements of husbandry, and produce stored up for use; -- in distinction from live stock, or the domestic animals on the farm. See def. 10, above. -- Head stock. See Headstock. -- Paper stock, rags and other material of which paper is made. -- Stock account (Bookkeeping), an account on a merchant's ledger, one side of which shows the original capital, or stock, and the additions thereto by accumulation or contribution, the other side showing the amounts withdrawn. -- Stock car, a railway car for carrying cattle. -- Stock company (Com.), an incorporated company the capital of which is represented by marketable shares having a certain equal par value. -- Stock duck (Zoöl.), the mallard. -- Stock exchange. (a) The building or place where stocks are bought and sold; stock market; hence, transactions of all kinds in stocks. (b) An association or body of stockbrokers who meet and transact business by certain recognized forms, regulations, and usages. Wharton. Brande & C. -- Stock farmer, a farmer who makes it his business to rear live stock. -- Stock gillyflower (Bot.), the common stock. See Stock, n., 18. -- Stock gold, gold laid up so as to form a stock, or hoard. -- Stock in trade, the goods kept for sale by a shopkeeper; the fittings and appliances of a workman. Simmonds. -- Stock list, a list of stocks, or shares, dealt in, of transactions, and of prices. -- Stock lock, a lock inclosed in a wooden case and attached to the face of a door. -- Stock market. (a) A place where stocks are bought and sold; the stock exchange. (b) A market for live stock. -- Stock pigeon. (Zoöl.) Same as Stockdove. -- Stock purse. (a) A common purse, as distinguished from a private purse. (b) (Mil.) Moneys saved out of the expenses of a company or regiment, and applied to objects of common interest. [Eng.] -- Stock shave, a tool used by blockmakers. -- Stock station, a place or district for rearing stock. [Australia] W. Howitt. -- Stock tackle (Naut.), a tackle used when the anchor is hoisted and secured, to keep its stock clear of the ship's sides. Totten. -- Stock taking, an examination and inventory made of goods or stock in a shop or warehouse; -- usually made periodically. -- Tail stock. See Tailstock. -- To have something on the stock, to be at work at something. -- To take stock, to take account of stock; to make an inventory of stock or goods on hand. Dickens. -- To take stock in. (a) To subscribe for, or purchase, shares in a stock company. (b) To put faith in; to accept as trustworthy; as, to take stock in a person's fidelity. [Slang] -- To take stock of, to take account of the stock of; to take an inventory of; hence, to ascertain the facts in regard to (something). [Eng.] At the outset of any inquiry it is proper to take stock of the results obtained by previous explorers of the same field. Leslie Stephen. Syn. -- Fund; capital; store; supply; accumulation; hoard; provision.\n\n1. To lay up; to put aside for future use; to store, as merchandise, and the like. 2. To provide with material requisites; to store; to fill; to supply; as, to stock a warehouse, that is, to fill it with goods; to stock a farm, that is, to supply it with cattle and tools; to stock land, that is, to occupy it with a permanent growth, especially of grass. 3. To suffer to retain milk for twenty-four hours or more previous to sale, as cows. 4. To put in the stocks. [R.] Shak. To stock an anchor (Naut.), to fit it with a stock, or to fasten the stock firmly in place. -- To stock cards (Card Playing), to arrange cards in a certain manner for cheating purposes. [Cant] -- To stock down (Agric.), to sow, as plowed land, with grass seed, in order that it may become swarded, and produce grass. -- To stock up, to extirpate; to dig up.\n\nUsed or employed for constant service or application, as if constituting a portion of a stock or supply; standard; permanent; standing; as, a stock actor; a stock play; a stock sermon. \"A stock charge against Raleigh.\" C. Kingsley. Stock company (Theater), a company of actors regularly employed at one theater, or permanently acting together in various plays under one management."}