{"word":"storm","definition":"1. A violent disturbance of the atmosphere, attended by wind, rain, snow, hail, or thunder and lightning; hence, often, a heavy fall of rain, snow, or hail, whether accompanied with wind or not. We hear this fearful tempest sing, Yet seek no shelter to avoid the storm. Shak. 2. A violent agitation of human society; a civil, political, or domestic commotion; sedition, insurrection, or war; violent outbreak; clamor; tumult. I will stir up in England some black storm. Shak. Her sister Began to scold and raise up such a storm. Shak. 3. A heavy shower or fall, any adverse outburst of tumultuous force; violence. A brave man struggling in the storms of fate. Pope. 4. (Mil.)  A violent assault on a fortified place; a furious attempt of troops to enter and take a fortified place by scaling the walls, forcing the gates, or the like. Note: Storm is often used in the formation of self-explained compounds; as, storm-presaging, stormproof, storm-tossed, and the like. Magnetic storm. See under Magnetic. -- Storm-and-stress period Etym: [a translation of G. sturm und drang periode], a designation given to the literary agitation and revolutionary development in Germany under the lead of Goethe and Schiller in the latter part of the 18th century. -- Storm center (Meteorol.), the center of the area covered by a storm, especially by a storm of large extent. -- Storm door (Arch.), an extra outside door to prevent the entrance of wind, cold, rain, etc.; -- usually removed in summer. -- Storm path (Meteorol.), the course over which a storm, or storm center, travels. -- Storm petrel. (Zoöl.) See Stormy petrel, under Petrel. -- Storm sail (Naut.), any one of a number of strong, heavy sails that are bent and set in stormy weather. -- Storm scud. See the Note under Cloud. Syn. -- Tempest; violence; agitation; calamity. -- Storm, Tempest. Storm is violent agitation, a commotion of the elements by wind, etc., but not necessarily implying the fall of anything from the clouds. Hence, to call a mere fall or rain without wind a storm is a departure from the true sense of the word. A tempest is a sudden and violent storm, such as those common on the coast of Italy, where the term originated, and is usually attended by a heavy rain, with lightning and thunder. Storms beat, and rolls the main; O! beat those storms, and roll the seas, in vain. Pope. What at first was called a gust, the same Hath now a storm's, anon a tempest's name. Donne.\n\nTo assault; to attack, and attempt to take, by scaling walls, forcing gates, breaches, or the like; as, to storm a fortified town.\n\n1. To raise a tempest. Spenser. 2. To blow with violence; also, to rain, hail, snow, or the like, usually in a violent manner, or with high wind; -- used impersonally; as, it storms. 3. To rage; to be in a violent passion; to fume. The master storms, the lady scolds. Swift."}