{"word":"strain","definition":"1. Race; stock; generation; descent; family. He is of a noble strain. Shak. With animals and plants a cross between different varieties, or between individuals of the same variety but of another strain, gives vigor and fertility to the offspring. Darwin. 2. Hereditary character, quality, or disposition. Intemperance and lust breed diseases, which, propogated, spoil the strain of nation. Tillotson. 3. Rank; a sort. \"The common strain.\" Dryden.\n\n1. To draw with force; to extend with great effort; to stretch; as, to strain a rope; to strain the shrouds of a ship; to strain the cords of a musical instrument. \"To strain his fetters with a stricter care.\" Dryden. 2. (Mech.)  To act upon, in any way, so as to cause change of form or volume, as forces on a beam to bend it. 3. To exert to the utmost; to ply vigorously. He sweats, Strains his young nerves. Shak. They strain their warbling throats To welcome in the spring. Dryden. 4. To stretch beyond its proper limit; to do violence to, in the matter of intent or meaning; as, to strain the law in order to convict an accused person. There can be no other meaning in this expression, however some may pretend to strain it. Swift. 5. To injure by drawing, stretching, or the exertion of force; as, the gale strained the timbers of the ship. 6. To injure in the muscles or joints by causing to make too strong an effort; to harm by overexertion; to sprain; as, to strain a horse by overloading; to strain the wrist; to strain a muscle. Prudes decayed about may track, Strain their necks with looking back. Swift. 7. To squeeze; to press closely. Evander with a close embrace Strained his departing friend. Dryden. 8. To make uneasy or unnatural; to produce with apparent effort; to force; to constrain. He talks and plays with Fatima, but his mirth Is forced and strained. Denham. The quality of mercy is not strained. Shak. 9. To urge with importunity; to press; as, to strain a petition or invitation. Note, if your lady strain his entertainment. Shak. 10. To press, or cause to pass, through a strainer, as through a screen, a cloth, or some porous substance; to purify, or separate from extraneous or solid matter, by filtration; to filter; as, to strain milk through cloth. To strain a point, to make a special effort; especially, to do a degree of violence to some principle or to one's own feelings. -- To strain courtesy, to go beyond what courtesy requires; to insist somewhat too much upon the precedence of others; -- often used ironically. Shak.\n\n1. To make violent efforts. \"Straining with too weak a wing.\" Pope. To build his fortune I will strain a little. Shak. 2. To percolate; to be filtered; as, water straining through a sandy soil.\n\n1. The act of straining, or the state of being strained. Specifically: -- (a) A violent effort; an excessive and hurtful exertion or tension, as of the muscles; as, he lifted the weight with a strain the strain upon a ship's rigging in a gale; also, the hurt or injury resulting; a sprain. Whether any poet of our country since Shakespeare has exerted a greater variety of powers with less strain and less ostentation. Landor. Credit is gained by custom, and seldom recovers a strain. Sir W. Temple. (b) (Mech. Physics)  A change of form or dimensions of a solid or liquid mass, produced by a stress. Rankine. 2. (Mus.)  A portion of music divided off by a double bar; a complete musical period or sentence; a movement, or any rounded subdivision of a movement. Their heavenly harps a lower strain began. Dryden. 3. Any sustained note or movement; a song; a distinct portion of an ode or other poem; also, the pervading note, or burden, of a song, poem, oration, book, etc.; theme; motive; manner; style; also, a course of action or conduct; as, he spoke in a noble strain; there was a strain of woe in his story; a strain of trickery appears in his career. \"A strain of gallantry.\" Sir W. Scott. Such take too high a strain at first. Bacon. The genius and strain of the book of Proverbs. Tillotson. It [Pilgrim's Progress] seems a novelty, and yet contains Nothing but sound and honest gospel strains. Bunyan. 4. Turn; tendency; inborn disposition. Cf. 1st Strain. Because heretics have a strain of madness, he applied her with some corporal chastisements. Hayward."}