{"word":"strawberry","definition":"A fragrant edible berry, of a delicious taste and commonly of a red color, the fruit of a plant of the genus Fragaria, of which there are many varieties. Also, the plant bearing the fruit. The common American strawberry is Fragaria virginiana; the European, F. vesca. There are also other less common species. Strawberry bass. (Zoöl.) See Calico bass, under Calico. -- Strawberry blite. (Bot.) See under Blite. -- Strawberry borer (Zoöl.), any one of several species of insects whose larvæ burrow in the crown or roots of the strawberry vine. Especially: (a) The root borer (Anarsia lineatella), a very small dark gray moth whose larvæ burrow both in the larger roots and crown, often doing great damage. (b) The crown borer (Tyloderma fragariæ), a small brown weevil whose larva burrows in the crown and kills the plant. -- Strawberry bush (Bot.), an American shrub (Euonymus Americanus), a kind of spindle tree having crimson pods and the seeds covered with a scarlet aril. -- Strawberry crab (Zoöl.), a small European spider crab (Eurynome aspera); -- so called because the back is covered with pink tubercles. -- Strawberry fish (Zoöl.), the amadavat. -- Strawberry geranium (Bot.), a kind of saxifrage (Saxifraga sarmentosa) having reniform leaves, and producing long runners like those of the strawberry. -- Strawberry leaf. (a) The leaf of the strawberry. (b) The symbol of the rank or estate of a duke, because the ducal coronet is twined with strawberry leaves. \"The strawberry leaves on her chariot panels are engraved on her ladyship's heart.\" Thackeray. -- Strawberry-leaf roller (Zoöl.), any one of several species of moths whose larvæ roll up, and feed upon, the leaves of the strawberry vine; especially, Phoxopteris fragariæ, and Eccopsis permundana. -- Strawberry moth (Zoöl.), any one of several species of moth whose larvæ feed on the strawberry vines; as: (a) The smeared dagger (Apatela oblinita), whose large hairy larva is velvety black with two rows of bright yellow spots on each side. (b) A geometrid (Angerona crocataria) which is yellow with dusky spots on the wings. Called also currant moth. -- Strawberry pear (Bot.), the red ovoid fruit of a West Indian plant of the genus Cereus (C. triangularia). It has a sweetish flavor, and is slightly acid, pleasant, and cooling. Also, the plant bearing the fruit. -- Strawberry sawfly (Zoöl.), a small black sawfly (Emphytus maculatus) whose larva eats the leaves of the strawberry vine. -- Strawberry tomato. (Bot.) See Alkekengi. -- Strawberry tree. (Bot.) See Arbutus. -- Strawberry vine (Bot.), the plant which yields the strawberry. -- Strawberry worm (Zoöl.), the larva of any moth which feeds on the strawberry vine."}