{"word":"strength","definition":"1. The quality or state of being strong; ability to do or to bear; capacity for exertion or endurance, whether physical, intellectual, or moral; force; vigor; power; as, strength of body or of the arm; strength of mind, of memory, or of judgment. All his [Samson's] strength in his hairs were. Chaucer. Thou must outlive Thy youth, thy strength, thy beauty. Milton. 2. Power to resist force; solidity or toughness; the quality of bodies by which they endure the application of force without breaking or yielding; -- in this sense opposed to frangibility; as, the strength of a bone, of a beam, of a wall, a rope, and the like. \"The brittle strength of bones.\" Milton. 3. Power of resisting attacks; impregnability. \"Our castle's strength will laugh a siege to scorn.\" Shak. 4. That quality which tends to secure results; effective power in an institution or enactment; security; validity; legal or moral force; logical conclusiveness; as, the strength of social or legal obligations; the strength of law; the strength of public opinion; strength of evidence; strength of argument. 5. One who, or that which, is regarded as embodying or affording force, strength, or firmness; that on which confidence or reliance is based; support; security. God is our refuge and strength. Ps. xlvi. 1. What they boded would be a mischief to us, you are providing shall be one of our principal strengths. Sprat. Certainly there is not a greater strength against temptation. Jer. Taylor. 6. Force as measured; amount, numbers, or power of any body, as of an army, a navy, and the like; as, what is the strength of the enemy by land, or by sea 7. Vigor or style; force of expression; nervous diction; -- said of literary work. And praise the easy vigor of a life Where Denham's strength and Waller's sweetness join. Pope. 8. Intensity; -- said of light or color. Bright Phoebus in his strength. Shak. 9. Intensity or degree of the distinguishing and essential element; spirit; virtue; excellence; -- said of liquors, solutions, etc.; as, the strength of wine or of acids. 10. A strong place; a stronghold. [Obs.] Shak. On, or Upon, the strength of, in reliance upon. \"The allies, after a successful summer, are too apt, upon the strength of it, to neglect their preparations for the ensuing campaign.\" Addison. Syn. -- Force; robustness; toughness; hardness; stoutness; brawniness; lustiness; firmness; puissance; support; spirit; validity; authority. See Force.\n\nTo strengthen. [Obs.] Chaucer."}