{"word":"string","definition":"1. A small cord, a line, a twine, or a slender strip of leather, or other substance, used for binding together, fastening, or tying things; a cord, larger than a thread and smaller than a rope; as, a shoe string; a bonnet string; a silken string. Shak. Round Ormond's knee thou tiest the mystic string. Prior. 2. A thread or cord on which a number of objects or parts are strung or arranged in close and orderly succession; hence, a line or series of things arranged on a thread, or as if so arranged; a succession; a concatenation; a chain; as, a string of shells or beads; a string of dried apples; a string of houses; a string of arguments. \"A string of islands.\" Gibbon. 3. A strip, as of leather, by which the covers of a book are held together. Milton. 4. The cord of a musical instrument, as of a piano, harp, or violin; specifically (pl.), the stringed instruments of an orchestra, in distinction from the wind instruments; as, the strings took up the theme. \"An instrument of ten strings.\" Ps. xxx. iii. 2. Me softer airs befit, and softer strings Of lute, or viol still. Milton. 5. The line or cord of a bow. Ps. xi. 2. He twangs the grieving string. Pope. 6. A fiber, as of a plant; a little, fibrous root. Duckweed putteth forth a little string into the water, from the bottom. Bacon. 7. A nerve or tendon of an animal body. The string of his tongue was loosed. Mark vii. 35. 8. (Shipbuilding)  An inside range of ceiling planks, corresponding to the sheer strake on the outside and bolted to it. 9. (Bot.)  The tough fibrous substance that unites the valves of the pericap of leguminous plants, and which is readily pulled off; as, the strings of beans. 10. (Mining)  A small, filamentous ramification of a metallic vein. Ure. 11. (Arch.)  Same as Stringcourse. 12. (Billiards)  The points made in a game. String band (Mus.), a band of musicians using only, or chiefly, stringed instruments. -- String beans. (a) A dish prepared from the unripe pods of several kinds of beans; -- so called because the strings are stripped off. (b) Any kind of beans in which the pods are used for cooking before the seeds are ripe; usually, the low bush bean. -- To have two strings to one's bow, to have a means or expedient in reserve in case the one employed fails.\n\n1. To furnish with strings; as, to string a violin. Has not wise nature strung the legs and feet With firmest nerves, designed to walk the street Gay. 2. To put in tune the strings of, as a stringed instrument, in order to play upon it. For here the Muse so oft her harp has strung, That not a mountain rears its head unsung. Addison. 3. To put on a string; to file; as, to string beads. 4. To make tense; to strengthen. Toil strung the nerves, and purified the blood. Dryden. 5. To deprive of strings; to strip the strings from; as, to string beans. See String, n., 9."}