{"word":"study","definition":"1. A setting of the mind or thoughts upon a subject; hence, application of mind to books, arts, or science, or to any subject, for the purpose of acquiring knowledge. Hammond . . . spent thirteen hours of the day in study. Bp. Fell. Study gives strength to the mind; conversation, grace. Sir W. Temple. 2. Mental occupation; absorbed or thoughtful attention; meditation; contemplation. Just men they seemed, and all their study bent To worship God aright, and know his works. Milton. 3. Any particular branch of learning that is studied; any object of attentive consideration. The Holy Scriptures, especially the New Testament, are her daily study. Law. The proper study of mankind is man. Pope. 4. A building or apartment devoted to study or to literary work. \"His cheery little study.\" Hawthorne. 5. (Fine Arts)  A representation or rendering of any object or scene intended, not for exhibition as an original work of art, but for the information, instruction, or assistance of the maker; as, a study of heads or of hands for a figure picture. 6. (Mus.)  A piece for special practice. See Etude.\n\n1. To fix the mind closely upon a subject; to dwell upon anything in thought; to muse; to ponder. Chaucer. I found a moral first, and then studied for a fable. Swift. 2. To apply the mind to books or learning. Shak. 3. To endeavor diligently; to be zealous. 1 Thes. iv. 11.\n\n1. To apply the mind to; to read and examine for the purpose of learning and understanding; as, to study law or theology; to study languages. 2. To consider attentively; to examine closely; as, to study the work of nature. Study thyself; what rank or what degree The wise Creator has ordained for thee. Dryden. 3. To form or arrange by previous thought; to con over, as in committing to memory; as, to study a speech. 4. To make an object of study; to aim at sedulously; to devote one's thoughts to; as, to study the welfare of others; to study variety in composition. For their heart studieth destruction. Prov. xxiv. 2."}