{"word":"style","definition":"1. An instrument used by the ancients in writing on tablets covered with wax, having one of its ends sharp, and the other blunt, and somewhat expanded, for the purpose of making erasures by smoothing the wax. 2. Hence, anything resembling the ancient style in shape or use. Specifically: -- (a) A pen; an author's pen. Dryden. (b) A sharp-pointed tool used in engraving; a graver. (c) A kind of blunt-pointed surgical instrument. (d) (Zoöl.) A long, slender, bristlelike process, as the anal styles of insects. (e) Etym: [Perhaps fr. Gr.  The pin, or gnomon, of a dial, the shadow of which indicates the hour. See Gnomon. (f) Etym: [Probably fr. Gr. (Bot.)  The elongated part of a pistil between the ovary and the stigma. See Illust. of Stamen, and of Pistil. 3. Mode of expressing thought in language, whether oral or written; especially, such use of language in the expression of thought as exhibits the spirit and faculty of an artist; choice or arrangement of words in discourse; rhetorical expression. High style, as when that men to kinges write. Chaucer. Style is the dress of thoughts. Chesterfield. Proper words in proper places make the true definition of style. Swift. It is style alone by which posterity will judge of a great work. I. Disraeli. 4. Mode of presentation, especially in music or any of the fine arts; a characteristic of peculiar mode of developing in idea or accomplishing a result. The ornamental style also possesses its own peculiar merit. Sir J. Reynolds. 5. Conformity to a recognized standard; manner which is deemed elegant and appropriate, especially in social demeanor; fashion. According to the usual style of dedications. C. Middleton. 6. Mode or phrase by which anything is formally designated; the title; the official designation of any important body; mode of address; as, the style of Majesty. One style to a gracious benefactor, another to a proud, insulting foe. Burke. 7. (Chron.)  A mode of reckoning time, with regard to the Julian and Gregorian calendars. Note: Style is Old or New. The Old Style follows the Julian manner of computing the months and days, or the calendar as established by Julius Cæsar, in which every fourth year consists of 366 days, and the other years of 365 days. This is about 11 minutes in a year too much. Pope Georgy XIII. reformed the calendar by retrenching 10 days in October, 1582, in order to bring back the vernal equinox to the same day as at the time of the Council of Nice, A.D. 325. This reformation was adopted by act of the British Parliament in 1751, by which act 11 days in September, 1752, were retrenched, and the third day was reckoned the fourteenth. This mode of reckoning is called New Style, according to which every year divisible by 4, unless it is divisible by 100 without being divisible by 400, has 366 days, and any other year 365 days. Style of court, the practice or manner observed by a court in its proceedings. Ayliffe. Syn. -- Diction; phraseology; manner; course; title. See Diction.\n\nTo entitle; to term, name, or call; to denominate. \"Styled great conquerors.\" Milton. How well his worth and brave adventures styled. Dryden. Syn. -- To call; name; denominate; designate; term; characterize."}