{"word":"subject","definition":"1. Placed or situated under; lying below, or in a lower situation. [Obs.] Spenser. 2. Placed under the power of another; specifically (International Law), owing allegiance to a particular sovereign or state; as, Jamaica is subject to Great Britain. Esau was never subject to Jacob. Locke. 3. Exposed; liable; prone; disposed; as, a country subject to extreme heat; men subject to temptation. All human things are subject to decay. Dryden. 4. Obedient; submissive. Put them in mind to be subject to principalities. Titus iii. 1. Syn. -- Liable; subordinate; inferior; obnoxious; exposed. See Liable.\n\n1. That which is placed under the authority, dominion, control, or influence of something else. 2. Specifically: One who is under the authority of a ruler and is governed by his laws; one who owes allegiance to a sovereign or a sovereign state; as, a subject of Queen Victoria; a British subject; a subject of the United States. Was never subject longed to be a king, As I do long and wish to be a subject. Shak. The subject must obey his prince, because God commands it, human laws require it. Swift. Note: In international law, the term subject is convertible with citizen. 3. That which is subjected, or submitted to, any physical operation or process; specifically (Anat.), a dead body used for the purpose of dissection. 4. That which is brought under thought or examination; that which is taken up for discussion, or concerning which anything is said or done. \"This subject for heroic song.\" Milton. Make choice of a subject, beautiful and noble, which . . . shall afford an ample field of matter wherein to expatiate. Dryden. The unhappy subject of these quarrels. Shak. 5. The person who is treated of; the hero of a piece; the chief character. Writers of particular lives . . . are apt to be prejudiced in favor of their subject. C. Middleton. 6. (Logic & Gram.)  That of which anything is affirmed or predicated; the theme of a proposition or discourse; that which is spoken of; as, the nominative case is the subject of the verb. The subject of a proposition is that concerning which anything is affirmed or denied. I. Watts. 7. That in which any quality, attribute, or relation, whether spiritual or material, inheres, or to which any of these appertain; substance; substratum. That which manifests its qualities -- in other words, that in which the appearing causes inhere, that to which they belong -- is called their subject or substance, or substratum. Sir W. Hamilton. 8. Hence, that substance or being which is conscious of its own operations; the mind; the thinking agent or principal; the ego. Cf. Object, n., 2. The philosophers of mind have, in a manner, usurped and appropriated this expression to themselves. Accordingly, in their hands, the phrases conscious or thinking subject, and subject, mean precisely the same thing. Sir W. Hamilton. 9. (Mus.)  The principal theme, or leading thought or phrase, on which a composition or a movement is based. The earliest known form of subject is the ecclesiastical cantus firmus, or plain song. Rockstro. 10. (Fine Arts)  The incident, scene, figure, group, etc., which it is the aim of the artist to represent.\n\n1. To bring under control, power, or dominion; to make subject; to subordinate; to subdue. Firmness of mind that subjects every gratification of sense to the rule of right reason. C. Middleton. In one short view subjected to our eye, Gods, emperors, heroes, sages, beauties, lie. Pope. He is the most subjected, the most Locke. 2. To expose; to make obnoxious or liable; as, credulity subjects a person to impositions. 3. To submit; to make accountable. God is not bound to subject his ways of operation to the scrutiny of our thoughts. Locke. 4. To make subservient. Subjected to his service angel wings. Milton. 5. To cause to undergo; as, to subject a substance to a white heat; to subject a person to a rigid test."}