{"word":"sublime","definition":"1. Lifted up; high in place; exalted aloft; uplifted; lofty. Sublime on these a tower of steel is reared. Dryden. 2. Distinguished by lofty or noble traits; eminent; -- said of persons. \"The sublime Julian leader.\" De Quincey. 3. Awakening or expressing the emotion of awe, adoration, veneration, heroic resolve, etc.; dignified; grand; solemn; stately; -- said of an impressive object in nature, of an action, of a discourse, of a work of art, of a spectacle, etc.; as, sublime scenery; a sublime deed. Easy in words thy style, in sense sublime. Prior. Know how sublime a thing it is To suffer and be strong. Longfellow. 4. Elevated by joy; elate. [Poetic] Their hearts were jocund and sublime, Drunk with idolatry, drunk with wine. Milton. 5. Lofty of mien; haughty; proud. [Poetic] \"Countenance sublime and insolent.\" Spenser. His fair, large front and eye sublime declared Absolute rule. Milton. Syn. -- Exalted; lofty; noble; majestic. See Grand.\n\nThat which is sublime; -- with the definite article; as: (a) A grand or lofty style in speaking or writing; a style that expresses lofty conceptions. The sublime rises from the nobleness of thoughts, the magnificence of words, or the harmonious and lively turn of the phrase. Addison. (b) That which is grand in nature or art, as distinguished from the merely beautiful.\n\n1. To raise on high. [Archaic] A soul sublimed by an idea above the region of vanity and conceit. E. P. Whipple. 2. (Chem.)  To subject to the process of sublimation; to heat, volatilize, and condense in crystals or powder; to distill off, and condense in solid form; hence, also, to purify. 3. To exalt; to heighten; to improve; to purify. The sun . . . Which not alone the southern wit sublimes, But ripens spirits in cold, northern climes. Pope. 4. To dignify; to ennoble. An ordinary gift can not sublime a person to a supernatural employment. Jer. Taylor.\n\nTo pass off in vapor, with immediate condensation; specifically, to evaporate or volatilize from the solid state without apparent melting; -- said of those substances, like arsenic, benzoic acid, etc., which do not exhibit a liquid form on heating, except under increased pressure."}