{"word":"sucker","definition":"1. One who, or that which, sucks; esp., one of the organs by which certain animals, as the octopus and remora, adhere to other bodies. 2. A suckling; a sucking animal. Beau. & Fl. 3. The embolus, or bucket, of a pump; also, the valve of a pump basket. Boyle. 4. A pipe through which anything is drawn. 5. A small piece of leather, usually round, having a string attached to the center, which, when saturated with water and pressed upon a stone or other body having a smooth surface, adheres, by reason of the atmospheric pressure, with such force as to enable a considerable weight to be thus lifted by the string; -- used by children as a plaything. 6. (Bot.)  A shoot from the roots or lower part of the stem of a plant; -- so called, perhaps, from diverting nourishment from the body of the plant. 7. (Zoöl.) (a) Any one of numerous species of North American fresh-water cyprinoid fishes of the family Catostomidæ; so called because the lips are protrusile. The flesh is coarse, and they are of little value as food. The most common species of the Eastern United States are the northern sucker (Catostomus Commersoni), the white sucker (C. teres), the hog sucker (C. nigricans), and the chub, or sweet sucker (Erimyzon sucetta). Some of the large Western species are called buffalo fish, red horse, black horse, and suckerel. (b) The remora. (c) The lumpfish. (d) The hagfish, or myxine. (e) A California food fish (Menticirrus undulatus) closely allied to the kingfish (a); -- called also bagre. 8. A parasite; a sponger. See def. 6, above. They who constantly converse with men far above their estates shall reap shame and loss thereby; if thou payest nothing, they will count thee a sucker, no branch. Fuller. 9. A hard drinker; a soaker. [Slang] 10. A greenhorn; one easily gulled. [Slang, U.S.] 11. A nickname applied to a native of Illinois. [U. S.] Carp sucker, Cherry sucker, etc. See under Carp, Cherry, etc. -- Sucker fish. See Sucking fish, under Sucking. -- Sucker rod, a pump rod. See under Pump. -- Sucker tube (Zoöl.), one of the external ambulacral tubes of an echinoderm, -- usually terminated by a sucker and used for locomotion. Called also sucker foot. See Spatangoid.\n\nTo strip off the suckers or shoots from; to deprive of suckers; as, to sucker maize.\n\nTo form suckers; as, corn suckers abundantly."}