{"word":"sugar","definition":"1. A sweet white (or brownish yellow) crystalline substance, of a sandy or granular consistency, obtained by crystallizing the evaporated juice of certain plants, as the sugar cane, sorghum, beet root, sugar maple, etc. It is used for seasoning and preserving many kinds of food and drink. Ordinary sugar is essentially sucrose. See the Note below. Note: The term sugar includes several commercial grades, as the white or refined, granulated, loaf or lump, and the raw brown or muscovado. In a more general sense, it includes several distinct chemical compounds, as the glucoses, or grape sugars (including glucose proper, dextrose, and levulose), and the sucroses, or true sugars (as cane sugar). All sugars are carbohydrates. See Carbohydrate. The glucoses, or grape sugars, are ketone alcohols of the formula C6H12O6, and they turn the plane of polarization to the right or the left. They are produced from the amyloses and sucroses, as by the action of heat and acids of ferments, and are themselves decomposed by fermentation into alcohol and carbon dioxide. The only sugar (called acrose) as yet produced artificially belongs to this class. The sucroses, or cane sugars, are doubled glucose anhydrides of the formula C12H22O11. They are usually not fermentable as such (cf. Sucrose), and they act on polarized light. 2. By extension, anything resembling sugar in taste or appearance; as, sugar of lead (lead acetate), a poisonous white crystalline substance having a sweet taste. 3. Compliment or flattery used to disguise or render acceptable something obnoxious; honeyed or soothing words. [Colloq.] Acorn sugar. See Quercite. -- Cane sugar, sugar made from the sugar cane; sucrose, or an isomeric sugar. See Sucrose. -- Diabetes, or Diabetic, sugar (Med. Chem.), a variety of sugar (probably grape sugar or dextrose) excreted in the urine in diabetes mellitus. -- Fruit sugar. See under Fruit, and Fructose. -- Grape sugar, a sirupy or white crystalline sugar (dextrose or glucose) found as a characteristic ingredient of ripe grapes, and also produced from many other sources. See Dextrose, and Glucose. -- Invert sugar. See under Invert. -- Malt sugar, a variety of sugar isomeric with sucrose, found in malt. See Maltose. -- Manna sugar, a substance found in manna, resembling, but distinct from, the sugars. See Mannite. -- Milk sugar, a variety of sugar characteristic of fresh milk, and isomeric with sucrose. See Lactose. -- Muscle sugar, a sweet white crystalline substance isomeric with, and formerly regarded to, the glucoses. It is found in the tissue of muscle, the heart, liver, etc. Called also heart sugar. See Inosite. -- Pine sugar. See Pinite. -- Starch sugar (Com. Chem.), a variety of dextrose made by the action of heat and acids on starch from corn, potatoes, etc.; -- called also potato sugar, corn sugar, and, inaccurately, invert sugar. See Dextrose, and Glucose. -- Sugar barek, one who refines sugar. -- Sugar beet (Bot.), a variety of beet (Beta vulgaris) with very large white roots, extensively grown, esp. in Europe, for the sugar obtained from them. -- Sugar berry (Bot.), the hackberry. -- Sugar bird (Zoöl.), any one of several species of small South American singing birds of the genera Coereba, Dacnis, and allied genera belonging to the family Coerebidæ. They are allied to the honey eaters. -- Sugar bush. See Sugar orchard. -- Sugar camp, a place in or near a sugar orchard, where maple sugar is made. -- Sugar candian, sugar candy. [Obs.] -- Sugar candy, sugar clarified and concreted or crystallized; candy made from sugar. -- Sugar cane (Bot.), a tall perennial grass (Saccharum officinarium), with thick short-jointed stems. It has been cultivated for ages as the principal source of sugar. -- Sugar loaf. (a) A loaf or mass of refined sugar, usually in the form of a truncated cone. (b) A hat shaped like a sugar loaf. Why, do not or know you, grannam, and that sugar loaf J. Webster. -- Sugar maple (Bot.), the rock maple (Acer saccharinum). See Maple. -- Sugar mill, a machine for pressing out the juice of the sugar cane, usually consisting of three or more rollers, between which the cane is passed. -- Sugar mite. (Zoöl.) (a) A small mite (Tyroglyphus sacchari), often found in great numbers in unrefined sugar. (b) The lepisma. -- Sugar of lead. See Sugar, 2, above. -- Sugar of milk. See under Milk. -- Sugar orchard, a collection of maple trees selected and preserved for purpose of obtaining sugar from them; -- called also, sometimes, sugar bush. [U.S.] Bartlett. -- Sugar pine (Bot.), an immense coniferous tree (Pinus Lambertiana) of California and Oregon, furnishing a soft and easily worked timber. The resinous exudation from the stumps, etc., has a sweetish taste, and has been used as a substitute for sugar. -- Sugar squirrel (Zoöl.), an Australian flying phalanger (Belideus sciureus), having a long bushy tail and a large parachute. It resembles a flying squirrel. See Illust. under Phlanger. -- Sugar tongs, small tongs, as of silver, used at table for taking lumps of sugar from a sugar bowl. -- Sugar tree. (Bot.) See Sugar maple, above.\n\nIn making maple sugar, to complete the process of boiling down the sirup till it is thick enough to crystallize; to approach or reach the state of granulation; -- with the preposition off. [Local, U.S.]\n\n1. To impregnate, season, cover, or sprinkle with sugar; to mix sugar with. \"When I sugar my liquor.\" G. Eliot. 2. To cover with soft words; to disguise by flattery; to compliment; to sweeten; as, to sugar reproof. With devotion's visage And pious action we do sugar o'er The devil himself. Shak."}