{"word":"suit","definition":"1. The act of following or pursuing, as game; pursuit. [Obs.] 2. The act of suing; the process by which one endeavors to gain an end or an object; an attempt to attain a certain result; pursuit; endeavor. Thenceforth the suit of earthly conquest shone. Spenser. 3. The act of wooing in love; the solicitation of a woman in marriage; courtship. Rebate your loves, each rival suit suspend, Till this funereal web my labors end. Pope. 4. (Law)  The attempt to gain an end by legal process; an action or process for the recovery of a right or claim; legal application to a court for justice; prosecution of right before any tribunal; as, a civil suit; a criminal suit; a suit in chancery. I arrest thee at the suit of Count Orsino. Shak. In England the several suits, or remedial instruments of justice, are distinguished into three kinds -- actions personal, real, and mixed. Blackstone. 5. That which follows as a retinue; a company of attendants or followers; the assembly of persons who attend upon a prince, magistrate, or other person of distinction; -- often written suite, and pronounced swet. 6. Things that follow in a series or succession; the individual objects, collectively considered, which constitute a series, as of rooms, buildings, compositions, etc.; -- often written suite, and pronounced swet. 7. A number of things used together, and generally necessary to be united in order to answer their purpose; a number of things ordinarily classed or used together; a set; as, a suit of curtains; a suit of armor; a suit of clothes. \"Two rogues in buckram suits.\" Shak. 8. (Playing Cards)  One of the four sets of cards which constitute a pack; -- each set consisting of thirteen cards bearing a particular emblem, as hearts, spades, cubs, or diamonds. To deal and shuffle, to divide and sort Her mingled suits and sequences. Cowper. 9. Regular order; succession. [Obs.] Every five and thirty years the same kind and suit of weather comes again. Bacon. Out of suits, having no correspondence. [Obs.] Shak. -- Suit and service (Feudal Law), the duty of feudatories to attend the courts of their lords or superiors in time of peace, and in war to follow them and do military service; -- called also suit service. Blackstone. -- Suit broker, one who made a trade of obtaining the suits of petitioners at court. [Obs.] -- Suit court (O. Eng. Law), the court in which tenants owe attendance to their lord. -- Suit covenant (O. Eng. Law), a covenant to sue at a certain court. -- Suit custom (Law), a service which is owed from time immemorial. -- Suit service. (Feudal Law) See Suit and service, above. -- To bring suit. (Law) (a) To bring secta, followers or witnesses, to prove the plaintiff's demand. [Obs.] (b) In modern usage, to institute an action. -- To follow suit. (Card Playing) See under Follow, v. t.\n\n1. To fit; to adapt; to make proper or suitable; as, to suit the action to the word. Shak. 2. To be fitted to; to accord with; to become; to befit. Ill suits his cloth the praise of railing well. Dryden. Raise her notes to that sublime degree Which suits song of piety and thee. Prior. 3. To dress; to clothe. [Obs.] So went he suited to his watery tomb. Shak. 4. To please; to make content; as, he is well suited with his place; to suit one's taste.\n\nTo agree; to accord; to be fitted; to correspond; -- usually followed by with or to. The place itself was suiting to his care. Dryden. Give me not an office That suits with me so ill. Addison. Syn. -- To agree; accord; comport; tally; correspond; match; answer."}