{"word":"summer","definition":"One who sums; one who casts up an account.\n\nA large stone or beam placed horizontally on columns, piers, posts, or the like, serving for various uses. Specifically: (a) The lintel of a door or window. (b) The commencement of a cross vault. (c) A central floor timber, as a girder, or a piece reaching from a wall to a girder. Called also summertree.\n\nThe season of the year in which the sun shines most directly upon any region; the warmest period of the year. Note: North of the equator summer is popularly taken to include the months of June, July, and August. Astronomically it may be considered, in the northern hemisphere, to begin with the summer solstice, about June 21st, and to end with the autumnal equinox, about September 22d. Indian summer, in North America, a period of warm weather late in autumn, usually characterized by a clear sky, and by a hazy or smoky appearance of the atmosphere, especially near the horizon. The name is derived probably from the custom of the Indians of using this time in preparation for winter by laying in stores of food. -- Saint Martin's summer. See under Saint. -- Summer bird (Zoöl.), the wryneck. [Prov. Eng.] -- Summer colt, the undulating state of the air near the surface of the ground when heated. [Eng.] -- Summer complaint (Med.), a popular term for any diarrheal disorder occurring in summer, especially when produced by heat and indigestion. -- Summer coot (Zoöl.), the American gallinule. [Local, U.S.] -- Summer cypress (Bot.), an annual plant (Kochia Scoparia) of the Goosefoot family. It has narrow, ciliate, crowded leaves, and is sometimes seen in gardens. -- Summer duck. (Zoöl.) (a) The wood duck. (b) The garganey, or summer teal. See Illust. of Wood duck, under Wood. -- Summer fallow, land uncropped and plowed, etc., during the summer, in order to pulverize the soil and kill the weeds. -- Summer rash (Med.), prickly heat. See under Prickly. -- Summer sheldrake (Zoöl.), the hooded merganser. [Local, U.S.] -- Summer snipe. (Zoöl.) (a) The dunlin. (b) The common European sandpiper. (c) The green sandpiper. -- Summer tanager (Zoöl.), a singing bird (Piranga rubra) native of the Middle and Southern United States. The male is deep red, the female is yellowish olive above and yellow beneath. Called also summer redbird. -- Summer teal (Zoöl.), the blue-winged teal. [Local, U.S.] -- Summer wheat, wheat that is sown in the spring, and matures during the summer following. See Spring wheat. -- Summer yellowbird. (Zoöl.) See Yellowbird.\n\nTo pass the summer; to spend the warm season; as, to summer in Switzerland. The fowls shall summer upon them. Isa. xviii. 6.\n\nTo keep or carry through the summer; to feed during the summer; as, to summer stock."}