{"word":"sun","definition":"See Sunn.\n\n1. The luminous orb, the light of which constitutes day, and its absence night; the central body round which the earth and planets revolve, by which they are held in their orbits, and from which they receive light and heat. Its mean distance from the earth is about 92,500,000 miles, and its diameter about 860,000. Note: Its mean apparent diameter as seen from the earth is 32' 4\", and it revolves on its own axis once in 25photosphere, above which is an envelope consisting partly of hydrogen, called the chromosphere, which can be seen only through the spectroscope, or at the time of a total solar eclipse. Above the chromosphere, and sometimes extending out millions of miles, are luminous rays or streams of light which are visible only at the time of a total eclipse, forming the solar corona. 2. Any heavenly body which forms the center of a system of orbs. 3. The direct light or warmth of the sun; sunshine. Lambs that did frisk in the sun. Shak. 4. That which resembles the sun, as in splendor or importance; any source of light, warmth, or animation. For the Lord God is a sun and shield. Ps. lxxiv. 11. I will never consent to put out the sun of sovereignity to posterity. Eikon Basilike. Sun and planet wheels (Mach.), an ingenious contrivance for converting reciprocating motion, as that of the working beam of a steam engine, into rotatory motion. It consists of a toothed wheel (called the sun wheel), firmly secured to the shaft it is desired to drive, and another wheel (called the planet wheel) secured to the end of a connecting rod. By the motion of the connecting rod, the planet wheel is made to circulate round the central wheel on the shaft, communicating to this latter a velocity of revolution the double of its own. G. Francis. -- Sun angel (Zoöl.), a South American humming bird of the genus Heliangelos, noted for its beautiful colors and the brilliant luster of the feathers of its throat. -- Sun animalcute. (Zoöl.) See Heliozoa. -- Sun bath (Med.), exposure of a patient to the sun's rays; insolation. -- Sun bear (Zoöl.), a species of bear (Helarctos Malayanus) native of Southern Asia and Borneo. It has a small head and short neck, and fine short glossy fur, mostly black, but brownish on the nose. It is easily tamed. Called also bruang, and Malayan bear. -- Sun beetle (Zoöl.), any small lustrous beetle of the genus Amara. -- Sun bittern (Zoöl.), a singular South American bird (Eurypyga helias), in some respects related both to the rails and herons. It is beautifully variegated with white, brown, and black. Called also sunbird, and tiger bittern. -- Sun fever (Med.), the condition of fever produced by sun stroke. -- Sun gem (Zoöl.), a Brazilian humming bird (Heliactin cornutus). Its head is ornamented by two tufts of bright colored feathers, fiery crimson at the base and greenish yellow at the tip. Called also Horned hummer. -- Sun grebe (Zoöl.), the finfoot. -- Sun picture, a picture taken by the agency of the sun's rays; a photograph. -- Sun spots (Astron.), dark spots that appear on the sun's disk, consisting commonly of a black central portion with a surrounding border of lighter shade, and usually seen only by the telescope, but sometimes by the naked eye. They are very changeable in their figure and dimensions, and vary in size from mere apparent points to spaces of 50,000 miles in diameter. The term sun spots is often used to include bright spaces (called faculæ) as well as dark spaces (called maculæ). Called also solar spots. See Illustration in Appendix. -- Sun star (Zoöl.), any one of several species of starfishes belonging to Solaster, Crossaster, and allied genera, having numerous rays. -- Sun trout (Zoöl.), the squeteague. -- Sun wheel. (Mach.) See Sun and planet wheels, above. -- Under the sun, in the world; on earth. \"There is no new thing under the sun.\" Eccl. i. 9. Note: Sun is often used in the formation of compound adjectives of obvious meaning; as, sun-bright, sun-dried, sun-gilt, sunlike, sun- lit, sun-scorched, and the like.\n\nTo expose to the sun's rays; to warm or dry in the sun; as, to sun cloth; to sun grain. Then to sun thyself in open air. Dryden."}