{"word":"supply","definition":"1. To fill up, or keep full; to furnish with what is wanted; to afford, or furnish with, a sufficiency; as, rivers are supplied by smaller streams; an aqueduct supplies an artificial lake; -- often followed by with before the thing furnished; as, to supply a furnace with fuel; to supply soldiers with ammunition. 2. To serve instead of; to take the place of. Burning ships the banished sun supply. Waller. The sun was set, and Vesper, to supply His absent beams, had lighted up the sky. Dryden. 3. To fill temporarily; to serve as substitute for another in, as a vacant place or office; to occupy; to have possession of; as, to supply a pulpit. 4. To give; to bring or furnish; to provide; as, to supply money for the war. Prior. Syn. -- To furnish; provide; administer; minister; contribute; yield; accommodate.\n\n1. The act of supplying; supplial. A. Tucker. 2. That which supplies a want; sufficiency of things for use or want. Specifically: -- (a) Auxiliary troops or reënforcements. \"My promised supply of horsemen.\" Shak. (b) The food, and the like, which meets the daily necessities of an army or other large body of men; store; -- used chiefly in the plural; as, the army was discontented for lack of supplies. (c) An amount of money provided, as by Parliament or Congress, to meet the annual national expenditures; generally in the plural; as, to vote supplies. (d) A person who fills a place for a time; one who supplies the place of another; a substitute; esp., a clergyman who supplies a vacant pulpit. Stated supply (Eccl.), a clergyman employed to supply a pulpit for a definite time, but not settled as a pastor. [U.S.] -- Supply and demand. (Polit. Econ.) \"Demand means the quantity of a given article which would be taken at a given price. Supply means the quantity of that article which could be had at that price.\" F. A. Walker.\n\nServing to contain, deliver, or regulate a supply of anything; as, a supply tank or valve. Supply system (Zoöl.), the system of tubes and canals in sponges by means of which food and water are absorbed. See Illust. of Spongiæ."}