{"word":"survey","definition":"1. To inspect, or take a view of; to view with attention, as from a high place; to overlook; as, to stand on a hill, and survey the surrounding country. Round he surveys and well might, where he stood, So high above. Milton. 2. To view with a scrutinizing eye; to examine. With such altered looks, . . . All pale and speechless, he surveyed me round. Dryden. 3. To examine with reference to condition, situation, value, etc.; to examine and ascertain the state of; as, to survey a building in order to determine its value and exposure to loss by fire. 4. To determine the form, extent, position, etc., of, as a tract of land, a coast, harbor, or the like, by means of linear and angular measurments, and the application of the principles of geometry and trigonometry; as, to survey land or a coast. 5. To examine and ascertain, as the boundaries and royalties of a manor, the tenure of the tenants, and the rent and value of the same. [Eng.] Jacob (Law Dict.).\n\n1. The act of surveying; a general view, as from above. Under his proud survey the city lies. Sir J. Denham. 2. A particular view; an examination, especially an official examination, of all the parts or particulars of a thing, with a design to ascertain the condition, quantity, or quality; as, a survey of the stores of a ship; a survey of roads and bridges; a survey of buildings. 3. The operation of finding the contour, dimensions, position, or other particulars of, as any part of the earth's surface, whether land or water; also, a measured plan and description of any portion of country, or of a road or line through it. Survey of dogs. See Court of regard, under Regard. -- Trigonometrical survey, a survey of a portion of country by measuring a single base, and connecting it with various points in the tract surveyed by a series of triangles, the angles of which are carefully measured, the relative positions and distances of all parts being computed from these data. Syn. -- Review; retrospect; examination; prospect."}