{"word":"suspension","definition":"1. The act of suspending, or the state of being suspended; pendency; as, suspension from a hook. 2. Especially, temporary delay, interruption, or cessation; as: (a) Of labor, study, pain, etc. (b) Of decision, determination, judgment, etc.; as, to ask a suspension of judgment or opinion in view of evidence to be produced. (c) Of the payment of what is due; as, the suspension of a mercantile firm or of a bank. (d) Of punishment, or sentence of punishment. (e) Of a person in respect of the exercise of his office, powers, prerogative, etc.; as, the suspension of a student or of a clergyman. (f) Of the action or execution of law, etc.; as, the suspension of the habeas corpus act. 3. A conditional withholding, interruption, or delay; as, the suspension of a payment on the performance of a condition. 4. The state of a solid when its particles are mixed with, but undissolved in, a fluid, and are capable of separation by straining; also, any substance in this state. 5. (Rhet.)  A keeping of the hearer in doubt and in attentive expectation of what is to follow, or of what is to be the inference or conclusion from the arguments or observations employed. 6. (Scots Law)  A stay or postponement of execution of a sentence condemnatory by means of letters of suspension granted on application to the lord ordinary. 7. (Mus.)  The prolongation of one or more tones of a chord into the chord which follows, thus producing a momentary discord, suspending the concord which the ear expects. Cf. Retardation. Pleas in suspension (Law), pleas which temporarily abate or suspend a suit. -- Points of suspension (Mech.), the points, as in the axis or beam of a balance, at which the weights act, or from which they are suspended. -- Suspension bridge, a bridge supported by chains, ropes, or wires, which usually pass over high piers or columns at each end, and are secured in the ground beyond. -- Suspension of arms (Mil.), a short truce or cessation of operations agreed on by the commanders of contending armies, as for burying the dead, making proposal for surrender or for peace, etc. -- Suspension scale, a scale in which the platform hangs suspended from the weighing apparatus instead of resting upon it. Syn. -- Delay; interruption; intermission; stop."}