{"word":"swallow","definition":"1. (Zoöl.)  Any one of numerous species of passerine birds of the family Hirundinidæ, especially one of those species in which the tail is deeply forked. They have long, pointed wings, and are noted for the swiftness and gracefulness of their flight. Note: The most common North American species are the barn swallow (see under Barn), the cliff, or eaves, swallow (see under Cliff), the white-bellied, or tree, swallow (Tachycineta bicolor), and the bank swallow (see under Bank). The common European swallow (Chelidon rustica), and the window swallow, or martin (Chelidon urbica), are familiar species. 2. (Zoöl.)  Any one of numerous species of swifts which resemble the true swallows in form and habits, as the common American chimney swallow, or swift. 3. (Naut.)  The aperture in a block through which the rope reeves. Ham. Nav. Encyc. Swallow plover (Zoöl.), any one of several species of fork-tailed ploverlike birds of the genus Glareola, as G. orientalis of India; a pratincole. -- Swallow shrike (Zoöl.), any one of several species of East Indian and Asiatic birds of the family Artamiidæ, allied to the shrikes but similar to swallows in appearance and habits. The ashy swallow shrike (Artamus fuscus) is common in India. -- Swallow warbler (Zoöl.), any one of numerous species of East Indian and Australian singing birds of the genus Dicæum. They are allied to the honeysuckers.\n\n1. To take into the stomach; to receive through the gullet, or esophagus, into the stomach; as, to swallow food or drink. As if I had swallowed snowballs for pills. Shak. 2. To draw into an abyss or gulf; to ingulf; to absorb -- usually followed by up. Milton. The earth opened her mouth, and swallowed them up, and their houses. Num. xvi. 32. 3. To receive or embrace, as opinions or belief, without examination or scruple; to receive implicitly. Though that story . . . be not so readily swallowed. Sir T. Browne. 4. To engross; to appropriate; -- usually with up. Homer excels . . . in this, that he swallowed up the honor of those who succeeded him. Pope. 5. To occupy; to take up; to employ. The necessary provision of the life swallows the greatest part of their time. Locke. 6. To seize and waste; to exhaust; to consume. Corruption swallowed what the liberal hand Of bounty scattered. Thomson. 7. To retract; to recant; as, to swallow one's opinions. \"Swallowed his vows whole.\" Shak. 8. To put up with; to bear patiently or without retaliation; as, to swallow an affront or insult. Syn. -- To absorb; imbibe; ingulf; engross; consume. See Absorb.\n\nTo perform the act of swallowing; as, his cold is so severe he is unable to swallow.\n\n1. The act of swallowing. 2. The gullet, or esophagus; the throat. 3. Taste; relish; inclination; liking. [Colloq.] I have no swallow for it. Massinger. 4. Capacity for swallowing; voracity. There being nothing too gross for the swallow of political rancor. Prof. Wilson. 5. As much as is, or can be, swallowed at once; as, a swallow of water. 6. That which ingulfs; a whirlpool. [Obs.] Fabyan."}