{"word":"swamp","definition":"Wet, spongy land; soft, low ground saturated with water, but not usually covered with it; marshy ground away from the seashore. Gray swamps and pools, waste places of the hern. Tennyson. A swamp differs from a bog and a marsh in producing trees and shrubs, while the latter produce only herbage, plants, and mosses. Farming Encyc. (E. Edwards, Words). Swamp blackbird. (Zoöl.) See Redwing (b). -- Swamp cabbage (Bot.), skunk cabbage. -- Swamp deer (Zoöl.), an Asiatic deer (Rucervus Duvaucelli) of India. -- Swamp hen. (Zoöl.) (a) An Australian azure-breasted bird (Porphyrio bellus); -- called also goollema. (b) An Australian water crake, or rail (Porzana Tabuensis); -- called also little swamp hen. (c) The European purple gallinule. -- Swamp honeysuckle (Bot.), an American shrub (Azalea, or Rhododendron, viscosa) growing in swampy places, with fragrant flowers of a white color, or white tinged with rose; -- called also swamp pink. -- Swamp hook, a hook and chain used by lumbermen in handling logs. Cf. Cant hook. -- Swamp itch. (Med.) See Prairie itch, under Prairie. -- Swamp laurel (Bot.), a shrub (Kalmia glauca) having small leaves with the lower surface glaucous. -- Swamp maple (Bot.), red maple. See Maple. -- Swamp oak (Bot.), a name given to several kinds of oak which grow in swampy places, as swamp Spanish oak (Quercus palustris), swamp white oak (Q. bicolor), swamp post oak (Q. lyrata). -- Swamp ore (Min.), big ore; limonite. -- Swamp partridge (Zoöl.), any one of several Australian game birds of the genera Synoicus and Excalfatoria, allied to the European partridges. -- Swamp robin (Zoöl.), the chewink. -- Swamp sassafras (Bot.), a small North American tree of the genus Magnolia (M. glauca) with aromatic leaves and fragrant creamy-white blossoms; -- called also sweet bay. -- Swamp sparrow (Zoöl.), a common North American sparrow (Melospiza Georgiana, or M. palustris), closely resembling the song sparrow. It lives in low, swampy places. -- Swamp willow. (Bot.) See Pussy willow, under Pussy.\n\n1. To plunge or sink into a swamp. 2. (Naut.)  To cause (a boat) to become filled with water; to capsize or sink by whelming with water. 3. Fig.: To plunge into difficulties and perils; to overwhelm; to ruin; to wreck. The Whig majority of the house of Lords was swamped by the creation of twelve Tory peers. J. R. Green. Having swamped himself in following the ignis fatuus of a theory. Sir W. Hamilton.\n\n1. To sink or stick in a swamp; figuratively, to become involved in insuperable difficulties. 2. To become filled with water, as a boat; to founder; to capsize or sink; figuratively, to be ruined; to be wrecked."}