{"word":"swift","definition":"1. Moving a great distance in a short time; moving with celerity or velocity; fleet; rapid; quick; speedy; prompt. My beloved brethren, let every man be swift to hear, slow to speak, slow to wrath. James i. 19. Swift of dispatch and easy of access. Dryden. And bring upon themselves swift destruction. 2 Pet. ii. 1. 2. Of short continuance; passing away quickly. Shak. Note: Swift is often used in the formation of compounds which are generally self-explaining; as, swift-darting, swift-footed, swift- winged, etc. Syn. -- Quick; fleet; speedy; rapid; expeditious.\n\nSwiftly. [Obs. or Poetic] Shak. Ply swift and strong the oar. Southey.\n\n1. The current of a stream. [R.] Walton. 2. (Zoöl.)  Any one of numerous species of small, long-winged, insectivorous birds of the family Micropodidæ. In form and habits the swifts resemble swallows, but they are destitute of complex vocal muscles and are not singing birds, but belong to a widely different group allied to the humming birds. Note: The common European swift (Cypselus, or Micropus, apus) nests in church steeples and under the tiles of roofs, and is noted for its rapid flight and shrill screams. It is called also black martin, black swift, hawk swallow, devil bird, swingdevil, screech martin, and shreik owl. The common American, or chimney, swift (Chætura pelagica) has sharp rigid tips to the tail feathers. It attaches its nest to the inner walls of chimneys, and is called also chimney swallow. The Australian swift (Chætura caudacuta) also has sharp naked tips to the tail quills. The European Alpine swift (Cypselus melba) is whitish beneath, with a white band across the breast. The common Indian swift is Cypselus affinis. See also Palm swift, under Palm, and Tree swift, under Tree. 3. (Zoöl.)  Any one of several species of lizards, as the pine lizard. 4. (Zoöl.)  The ghost moth. See under Ghost. 5. Etym: [Cf. Swivel.]  A reel, or turning instrument, for winding yarn, thread, etc.; -- used chiefly in the plural. 6. The main card cylinder of a flax-carding machine."}