{"word":"swing","definition":"1. To move to and fro, as a body suspended in the air; to wave; to vibrate; to oscillate. I tried if a pendulum would swing faster, or continue swinging longer, in case of exsuction of the air. Boyle. 2. To sway or move from one side or direction to another; as, the door swung open. 3. To use a swing; as, a boy swings for exercise or pleasure. See Swing, n., 3. 4. (Naut.)  To turn round by action of wind or tide when at anchor; as, a ship swings with the tide. 5. To be hanged. [Colloq.] D. Webster. To swing round the circle, to make a complete circuit. [Colloq.] He had swung round the circle of theories and systems in which his age abounded, without finding relief. A. V. G. Allen.\n\n1. To cause to swing or vibrate; to cause to move backward and forward, or from one side to the other. He swings his tail, and swiftly turns his round. Dryden. They get on ropes, as you must have seen the children, and are swung by their men visitants. Spectator. 2. To give a circular movement to; to whirl; to brandish; as, to swing a sword; to swing a club; hence, colloquially, to manage; as, to swing a business. 3. (Mach.)  To admit or turn (anything) for the purpose of shaping it; -- said of a lathe; as, the lathe can swing a pulley of 12 inches diameter. To swing a door, gate, etc. (Carp.), to put it on hinges so that it can swing or turn.\n\n1. The act of swinging; a waving, oscillating, or vibratory motion of a hanging or pivoted object; oscillation; as, the swing of a pendulum. 2. Swaying motion from one side or direction to the other; as, some men walk with a swing. 3. A line, cord, or other thing suspended and hanging loose, upon which anything may swing; especially, an apparatus for recreation by swinging, commonly consisting of a rope, the two ends of which are attached overhead, as to the bough of a tree, a seat being placed in the loop at the bottom; also, any contrivance by which a similar motion is produced for amusement or exercise. 4. Influence of power of a body put in swaying motion. The ram that batters down the wall, For the great swing and rudeness of his poise, They place before his hand that made the engine. Shak. 5. Capacity of a turning lathe, as determined by the diameter of the largest object that can be turned in it. 6. Free course; unrestrained liberty or license; tendency. \"Take thy swing.\" Dryden. To prevent anything which may prove an obstacle to the full swing of his genius. Burke. Full swing. See under Full. -- Swing beam (Railway Mach.), a crosspiece sustaining the car body, and so suspended from the framing of a truck that it may have an independent lateral motion. -- Swing bridge, a form of drawbridge which swings horizontally, as on a vertical pivot. -- Swing plow, or Swing plough. (a) A plow without a fore wheel under the beam. (b) A reversible or sidehill plow. -- Swing wheel. (a) The scape-wheel in a clock, which drives the pendulum. (b) The balance of a watch."}