{"word":"sympathy","definition":"1. Feeling corresponding to that which another feels; the quality of being affected by the affection of another, with feelings correspondent in kind, if not in degree; fellow-feeling. They saw, but other sight instead -- a crowd Of ugly serpents! Horror on them fell, And horrid sympathy. Milton. 2. An agreement of affections or inclinations, or a conformity of natural temperament, which causes persons to be pleased, or in accord, with one another; as, there is perfect sympathy between them. 3. Kindness of feeling toward one who suffers; pity; commiseration; compassion. I value myself upon sympathy, I hate and despise myself for envy. Kames. 4. (Physiol.) (a) The reciprocal influence exercised by the various organs or parts of the body on one another, as manifested in the transmission of a disease by unknown means from one organ to another quite remote, or in the influence exerted by a diseased condition of one part on another part or organ, as in the vomiting produced by a tumor of the brain. (b) That relation which exists between different persons by which one of them produces in the others a state or condition like that of himself. This is shown in the tendency to yawn which a person often feels on seeing another yawn, or the strong inclination to become hysteric experienced by many women on seeing another person suffering with hysteria. 5. A tendency of inanimate things to unite, or to act on each other; as, the sympathy between the loadstone and iron. [R.] 6. Similarity of function, use office, or the like. The adverb has most sympathy with the verb. Earle. Syn. -- Pity; fellow-feeling; compassion; commiseration; tenderness; condolence; agreement. -- Sympathy, Commiseration. Sympathy is literally a fellow-feeling with others in their varied conditions of joy or of grief. This term, however, is now more commonly applied to a fellow-feeling with others under affliction, and then coincides very nearly with commiseration. In this case it is commonly followed by for; as, to feel sympathy for a friend when we see him distressed. The verb sympathize is followed by with; as, to sympathize with a friend in his distresses or enjoyments. \"Every man would be a distinct species to himself, were there no sympathy among individuals.\" South. See Pity. Fault, Acknowledged and deplored, in Adam wrought Commiseration. Milton."}