{"word":"synonymous","definition":"Having the character of a synonym; expressing the same thing; conveying the same, or approximately the same, idea. -- Syn*on\"y*mous*ly, adv. These words consist of two propositions, which are not distinct in sense, but one and the same thing variously expressed; for wisdom and understanding are synonymous words here. Tillotson. Syn. -- Identical; interchangeable. -- Synonymous, Identical. If no words are synonymous except those which are identical in use and meaning, so that the one can in all cases be substituted for the other, we have scarcely ten such words in our language. But the term more properly denotes that the words in question approach so near to each other, that, in many or most cases, they can be used interchangeably. 1. Words may thus coincide in certain connections, and so be interchanged, when they can not be interchanged in other connections; thus we may speak either strength of mind or of force of mind, but we say the force (not strength) of gravitation. 2. Two words may differ slightly, but this difference may be unimportant to the speaker's object, so that he may freely interchange them; thus it makes but little difference, in most cases, whether we speak of a man's having secured his object or having attained his object. For these and other causes we have numerous words which may, in many cases or connections, be used interchangeably, and these are properly called synonyms. Synonymous words \"are words which, with great and essential resemblances of meaning, have, at the same time, small, subordinate, and partial differences, -- these differences being such as either originally and on the ground of their etymology inhered in them; or differences which they have by usage acquired in the eyes of all; or such as, though nearly latent now, they are capable of receiving at the hands of wise and discreet masters of the tongue. Synonyms are words of like significance in the main, but with a certain unlikeness as well.\" Trench."}