{"word":"tail","definition":"Limitation; abridgment. Burrill. Estate in tail, a limited, abridged, or reduced fee; an estate limited to certain heirs, and from which the other heirs are precluded; -- called also estate tail. Blackstone.\n\nLimited; abridged; reduced; curtailed; as, estate tail.\n\n1. (Zoöl.)  The terminal, and usually flexible, posterior appendage of an animal. Note: The tail of mammals and reptiles contains a series of movable vertebræ, and is covered with flesh and hairs or scales like those of other parts of the body. The tail of existing birds consists of several more or less consolidated vertebræ which supports a fanlike group of quills to which the term tail is more particularly applied. The tail of fishes consists of the tapering hind portion of the body ending in a caudal fin. The term tail is sometimes applied to the entire abdomen of a crustacean or insect, and sometimes to the terminal piece or pygidium alone. 2. Any long, flexible terminal appendage; whatever resembles, in shape or position, the tail of an animal, as a catkin. Doretus writes a great praise of the distilled waters of those tails that hang on willow trees. Harvey. 3. Hence, the back, last, lower, or inferior part of anything, -- as opposed to the Ant: head, or the superior part. The Lord will make thee the head, and not the tail. Deut. xxviii. 13. 4. A train or company of attendants; a retinue. \"Ah,\" said he, \"if you saw but the chief with his tail on.\" Sir W. Scott. 5. The side of a coin opposite to that which bears the head, effigy, or date; the reverse; -- rarely used except in the expression \"heads or tails,\" employed when a coin is thrown up for the purpose of deciding some point by its fall. 6. (Anat.)  The distal tendon of a muscle. 7. (Bot.)  A downy or feathery appendage to certain achens. It is formed of the permanent elongated style. 8. (Surg.) (a) A portion of an incision, at its beginning or end, which does not go through the whole thickness of the skin, and is more painful than a complete incision; -- called also tailing. (b) One of the strips at the end of a bandage formed by splitting the bandage one or more times. 9. (Naut.)  A rope spliced to the strap of a block, by which it may be lashed to anything. 10. (Mus.)  The part of a note which runs perpendicularly upward or downward from the head; the stem. Moore (Encyc. of Music). 11. pl.  Same as Tailing, 4. 12. (Arch.)  The bottom or lower portion of a member or part, as a slate or tile. 13. pl. (Mining)  See Tailing, n., 5. Tail beam. (Arch.) Same as Tailpiece. -- Tail coverts (Zoöl.), the feathers which cover the bases of the tail quills. They are sometimes much longer than the quills, and form elegant plumes. Those above the quills are called the upper tail coverts, and those below, the under tail coverts. -- Tail end, the latter end; the termination; as, the tail end of a contest. [Colloq.] -- Tail joist. (Arch.) Same as Tailpiece. -- Tail of a comet (Astron.), a luminous train extending from the nucleus or body, often to a great distance, and usually in a direction opposite to the sun. -- Tail of a gale (Naut.), the latter part of it, when the wind has greatly abated. Totten. -- Tail of a lock (on a canal), the lower end, or entrance into the lower pond. -- Tail of the trenches (Fort.), the post where the besiegers begin to break ground, and cover themselves from the fire of the place, in advancing the lines of approach. -- Tail spindle, the spindle of the tailstock of a turning lathe; -- called also dead spindle. -- To turn tail, to run away; to flee. Would she turn tail to the heron, and fly quite out another way; but all was to return in a higher pitch. Sir P. Sidney.\n\n1. To follow or hang to, like a tail; to be attached closely to, as that which can not be evaded. [Obs.] Nevertheless his bond of two thousand pounds, wherewith he was tailed, continued uncanceled, and was called on the next Parliament. Fuller. 2. To pull or draw by the tail. [R.] Hudibras. To tail in or on (Arch.), to fasten by one of the ends into a wall or some other support; as, to tail in a timber.\n\n1. (Arch.)  To hold by the end; -- said of a timber when it rests upon a wall or other support; -- with in or into. 2. (Naut.)  To swing with the stern in a certain direction; -- said of a vessel at anchor; as, this vessel tails down stream. Tail on. (Naut.) See Tally on, under Tally."}