{"word":"take","definition":"Taken. Chaucer.\n\n1. In an active sense; To lay hold of; to seize with the hands, or otherwise; to grasp; to get into one's hold or possession; to procure; to seize and carry away; to convey. Hence, specifically: -- (a) To obtain possession of by force or artifice; to get the custody or control of; to reduce into subjection to one's power or will; to capture; to seize; to make prisoner; as, to take am army, a city, or a ship; also, to come upon or befall; to fasten on; to attack; to seize; -- said of a disease, misfortune, or the like. This man was taken of the Jews. Acts xxiii. 27. Men in their loose, unguarded hours they take; Not that themselves are wise, but others weak. Pope. They that come abroad after these showers are commonly taken with sickness. Bacon. There he blasts the tree and takes the cattle And makes milch kine yield blood. Shak. (b) To gain or secure the interest or affection of; to captivate; to engage; to interest; to charm. Neither let her take thee with her eyelids. Prov. vi. 25. Cleombroutus was so taken with this prospect, that he had no patience. Wake. I know not why, but there was a something in those half-seen features, -- a charm in the very shadow that hung over their imagined beauty, -- which took me more than all the outshining loveliness of her companions. Moore. (c) To make selection of; to choose; also, to turn to; to have recourse to; as, to take the road to the right. Saul said, Cast lots between me and Jonathan my son. And Jonathan was taken. 1 Sam. xiv. 42. The violence of storming is the course which God is forced to take for the destroying . . . of sinners. Hammond. (d) To employ; to use; to occupy; hence, to demand; to require; as, it takes so much cloth to make a coat. This man always takes time . . . before he passes his judgments. I. Watts. (e) To form a likeness of; to copy; to delineate; to picture; as, to take picture of a person. Beauty alone could beauty take so right. Dryden. (f) To draw; to deduce; to derive. [R.] The firm belief of a future judgment is the most forcible motive to a good life, because taken from this consideration of the most lasting happiness and misery. Tillotson. (g) To assume; to adopt; to acquire, as shape; to permit to one's self; to indulge or engage in; to yield to; to have or feel; to enjoy or experience, as rest, revenge, delight, shame; to form and adopt, as a resolution; -- used in general senses, limited by a following complement, in many idiomatic phrases; as, to take a resolution; I take the liberty to say. (h) To lead; to conduct; as, to take a child to church. (i) To carry; to convey; to deliver to another; to hand over; as, he took the book to the bindery. He took me certain gold, I wot it well. Chaucer. (k) To remove; to withdraw; to deduct; -- with from; as, to take the breath from one; to take two from four. 2. In a somewhat passive sense, to receive; to bear; to endure; to acknowledge; to accept. Specifically: -- (a) To accept, as something offered; to receive; not to refuse or reject; to admit. Ye shall take no satisfaction for the life of a murderer. Num. xxxv. 31. Let not a widow be taken into the number under threescore. 1 Tim. v. 10. (b) To receive as something to be eaten or dronk; to partake of; to swallow; as, to take food or wine. (c) Not to refuse or balk at; to undertake readily; to clear; as, to take a hedge or fence. (d) To bear without ill humor or resentment; to submit to; to tolerate; to endure; as, to take a joke; he will take an affront from no man. (e) To admit, as, something presented to the mind; not to dispute; to allow; to accept; to receive in thought; to entertain in opinion; to understand; to interpret; to regard or look upon; to consider; to suppose; as, to take a thing for granted; this I take to be man's motive; to take men for spies. You take me right. Bacon. Charity, taken in its largest extent, is nothing else but the science love of God and our neighbor. Wake. [He] took that for virtue and affection which was nothing but vice in a disguise. South. You'd doubt his sex, and take him for a girl. Tate. (f) To accept the word or offer of; to receive and accept; to bear; to submit to; to enter into agreement with; -- used in general senses; as, to take a form or shape. I take thee at thy word. Rowe. Yet thy moist clay is pliant to command; . . . Not take the mold. Dryden. To be taken aback, To take advantage of, To take air, etc. See under Aback, Advantage, etc. -- To take aim, to direct the eye or weapon; to aim. -- To take along, to carry, lead, or convey. -- To take arms, to commence war or hostilities. -- To take away, to carry off; to remove; to cause deprivation of; to do away with; as, a bill for taking away the votes of bishops. \"By your own law, I take your life away.\" Dryden. -- To take breath, to stop, as from labor, in order to breathe or rest; to recruit or refresh one's self. -- To take care, to exercise care or vigilance; to be solicitous. \"Doth God take care for oxen\" 1 Cor. ix. 9. -- To take care of, to have the charge or care of; to care for; to superintend or oversee. -- To take down. (a) To reduce; to bring down, as from a high, or higher, place; as, to take down a book; hence, to bring lower; to depress; to abase or humble; as, to take down pride, or the proud. \"I never attempted to be impudent yet, that I was not taken down.\" Goldsmith. (b) To swallow; as, to take down a potion. (c) To pull down; to pull to pieces; as, to take down a house or a scaffold. (d) To record; to write down; as, to take down a man's words at the time he utters them. -- To take effect, To take fire. See under Effect, and Fire. -- To take ground to the right or to the left (Mil.), to extend the line to the right or left; to move, as troops, to the right or left. -- To take heart, to gain confidence or courage; to be encouraged. -- To take heed, to be careful or cautious. \"Take heed what doom against yourself you give.\" Dryden. -- To take heed to, to attend with care, as, take heed to thy ways. -- To take hold of, to seize; to fix on. -- To take horse, to mount and ride a horse. -- To take in. (a) To inclose; to fence. (b) To encompass or embrace; to comprise; to comprehend. (c) To draw into a smaller compass; to contract; to brail or furl; as, to take in sail. (d) To cheat; to circumvent; to gull; to deceive. [Colloq.] (e) To admit; to receive; as, a leaky vessel will take in water. (f) To win by conquest. [Obs.] For now Troy's broad-wayed town He shall take in. Chapman. (g) To receive into the mind or understanding. \"Some bright genius can take in a long train of propositions.\" I. Watts. (h) To receive regularly, as a periodical work or newspaper; to take. [Eng.] -- To take in hand. See under Hand. -- To take in vain, to employ or utter as in an oath. \"Thou shalt not take the name of the Lord thy God in vain.\" Ex. xx. 7. -- To take issue. See under Issue. -- To take leave. See Leave, n., 2. -- To take a newspaper, magazine, or the like, to receive it regularly, as on paying the price of subscription. -- To take notice, to observe, or to observe with particular attention. -- To take notice of. See under Notice. -- To take oath, to swear with solemnity, or in a judicial manner. -- To take off. (a) To remove, as from the surface or outside; to remove from the top of anything; as, to take off a load; to take off one's hat. (b) To cut off; as, to take off the head, or a limb. (c) To destroy; as, to take off life. (d) To remove; to invalidate; as, to take off the force of an argument. (e) To withdraw; to call or draw away. Locke. (f) To swallow; as, to take off a glass of wine. (g) To purchase; to take in trade. \"The Spaniards having no commodities that we will take off.\" Locke. (h) To copy; to reproduce. \"Take off all their models in wood.\" Addison. (i) To imitate; to mimic; to personate. (k) To find place for; to dispose of; as, more scholars than preferments can take off. [R.] Bacon. -- To take on, to assume; to take upon one's self; as, to take on a character or responsibility. -- To take one's own course, to act one's pleasure; to pursue the measures of one's own choice. -- To take order for. See under Order. -- To take order with, to check; to hinder; to repress. [Obs.] Bacon. -- To take orders. (a) To receive directions or commands. (b) (Eccl.) To enter some grade of the ministry. See Order, n., 10. -- To take out. (a) To remove from within a place; to separate; to deduct. (b) To draw out; to remove; to clear or cleanse from; as, to take out a stain or spot from cloth. (c) To produce for one's self; as, to take out a patent. (d) To put an end to; as, to take the conceit out of a man. (e) To escort; as, to take out to dinner. -- To take over, to undertake; to take the management of. [Eng.] Cross (Life of G. Eliot). -- To take part, to share; as, they take part in our rejoicing. -- To take part with, to unite with; to join with. -- To take place, root, sides, stock, etc. See under Place, Root, Side, etc. -- To take the air. (a) (Falconry) To seek to escape by trying to rise higher than the falcon; -- said of a bird. (b) See under Air. -- To take the field. (Mil.) See under Field. -- To take thought, to be concerned or anxious; to be solicitous. Matt. vi. 25, 27. -- To take to heart. See under Heart. -- To take to task, to reprove; to censure. -- to take to the air, to take off. To take up. (a) To lift; to raise. Hood. (b) To buy or borrow; as, to take up goods to a large amount; to take up money at the bank. (c) To begin; as, to take up a lamentation. Ezek. xix. 1. (d) To gather together; to bind up; to fasten or to replace; as, to take up raveled stitches; specifically (Surg.), to fasten with a ligature. (e) To engross; to employ; to occupy or fill; as, to take up the time; to take up a great deal of room. (f) To take permanently. \"Arnobius asserts that men of the finest parts . . . took up their rest in the Christian religion.\" Addison. (g) To seize; to catch; to arrest; as, to take up a thief; to take up vagabonds. (h) To admit; to believe; to receive. [Obs.] The ancients took up experiments upon credit. Bacon. (i) To answer by reproof; to reprimand; to berate. One of his relations took him up roundly. L'Estrange. (k) To begin where another left off; to keep up in continuous succession. Soon as the evening shades prevail, The moon takes up the wondrous tale. Addison. (l) To assume; to adopt as one's own; to carry on or manage; as, to take up the quarrels of our neighbors; to take up current opinions. \"They take up our old trade of conquering.\" Dryden. (m) To comprise; to include. \"The noble poem of Palemon and Arcite . . . takes up seven years.\" Dryden. (n) To receive, accept, or adopt for the purpose of assisting; to espouse the cause of; to favor. Ps. xxvii. 10. (o) To collect; to exact, as a tax; to levy; as, to take up a contribution. \"Take up commodities upon our bills.\" Shak. (p) To pay and receive; as, to take up a note at the bank. (q) (Mach.) To remove, as by an adjustment of parts; as, to take up lost motion, as in a bearing; also, to make tight, as by winding, or drawing; as, to take up slack thread in sewing. (r) To make up; to compose; to settle; as, to take up a quarrel. [Obs.] Shak. -- To take up arms. Same as To take arms, above. -- To take upon one's self. (a) To assume; to undertake; as, he takes upon himself to assert that the fact is capable of proof. (b) To appropriate to one's self; to allow to be imputed to, or inflicted upon, one's self; as, to take upon one's self a punishment. -- To take up the gauntlet. See under Gauntlet.\n\n1. To take hold; to fix upon anything; to have the natural or intended effect; to accomplish a purpose; as, he was inoculated, but the virus did not take. Shak. When flame taketh and openeth, it giveth a noise. Bacon. In impressions from mind to mind, the impression taketh, but is overcome . . . before it work any manifest effect. Bacon. 2. To please; to gain reception; to succeed. Each wit may praise it for his own dear sake, And hint he writ it, if the thing should take. Addison. 3. To move or direct the course; to resort; to betake one's self; to proceed; to go; -- usually with to; as, the fox, being hard pressed, took to the hedge. 4. To admit of being pictured, as in a photograph; as, his face does not take well. To take after. (a) To learn to follow; to copy; to imitate; as, he takes after a good pattern. (b) To resemble; as, the son takes after his father. -- To take in with, to resort to. [Obs.] Bacon. -- To take on, to be violently affected; to express grief or pain in a violent manner. -- To take to. (a) To apply one's self to; to be fond of; to become attached to; as, to take to evil practices. \"If he does but take to you, . . . you will contract a great friendship with him.\" Walpole. (b) To resort to; to betake one's self to. \"Men of learning, who take to business, discharge it generally with greater honesty than men of the world.\" Addison. -- To take up. (a) To stop. [Obs.] \"Sinners at last take up and settle in a contempt of religion.\" Tillotson. (b) To reform. [Obs.] Locke. -- To take up with. (a) To be contended to receive; to receive without opposition; to put up with; as, to take up with plain fare. \"In affairs which may have an extensive influence on our future happiness, we should not take up with probabilities.\" I. Watts. (b) To lodge with; to dwell with. [Obs.] L'Estrange. -- To take with, to please. Bacon.\n\n1. That which is taken; especially, the quantity of fish captured at one haul or catch. 2. (Print.)  The quantity or copy given to a compositor at one time."}