{"word":"telescope","definition":"An optical instrument used in viewing distant objects, as the heavenly bodies. Note: A telescope assists the eye chiefly in two ways; first, by enlarging the visual angle under which a distant object is seen, and thus magnifying that object; and, secondly, by collecting, and conveying to the eye, a larger beam of light than would enter the naked organ, thus rendering objects distinct and visible which would otherwise be indistinct and or invisible. Its essential parts are the object glass, or concave mirror, which collects the beam of light, and forms an image of the object, and the eyeglass, which is a microscope, by which the image is magnified. Achromatic telescope. See under Achromatic. -- Aplanatic telescope, a telescope having an aplanatic eyepiece. -- Astronomical telescope, a telescope which has a simple eyepiece so constructed or used as not to reverse the image formed by the object glass, and consequently exhibits objects inverted, which is not a hindrance in astronomical observations. -- Cassegrainian telescope, a reflecting telescope invented by Cassegrain, which differs from the Gregorian only in having the secondary speculum convex instead of concave, and placed nearer the large speculum. The Cassegrainian represents objects inverted; the Gregorian, in their natural position. The Melbourne telescope (see Illust. under Reflecting telescope, below) is a Cassegrainian telescope. -- Dialytic telescope. See under Dialytic. Equatorial telescope. See the Note under Equatorial. -- Galilean telescope, a refracting telescope in which the eyeglass is a concave instead of a convex lens, as in the common opera glass. This was the construction originally adopted by Galileo, the inventor of the instrument. It exhibits the objects erect, that is, in their natural positions. -- Gregorian telescope, a form of reflecting telescope. See under Gregorian. -- Herschelian telescope, a reflecting telescope of the form invented by Sir William Herschel, in which only one speculum is employed, by means of which an image of the object is formed near one side of the open end of the tube, and to this the eyeglass is applied directly. -- Newtonian telescope, a form of reflecting telescope. See under Newtonian. -- Photographic telescope, a telescope specially constructed to make photographs of the heavenly bodies. -- Prism telescope. See Teinoscope. -- Reflecting telescope, a telescope in which the image is formed by a speculum or mirror (or usually by two speculums, a large one at the lower end of the telescope, and the smaller one near the open end) instead of an object glass. See Gregorian, Cassegrainian, Herschelian, and Newtonian, telescopes, above. -- Refracting telescope, a telescope in which the image is formed by refraction through an object glass. -- Telescope carp (Zoöl.), the telescope fish. -- Telescope fish (Zoöl.), a monstrous variety of the goldfish having very protuberant eyes. -- Telescope fly (Zoöl.), any two-winged fly of the genus Diopsis, native of Africa and Asia. The telescope flies are remarkable for having the eyes raised on very long stalks. -- Telescope shell (Zoöl.), an elongated gastropod (Cerithium telescopium) having numerous flattened whorls. -- Telescope sight (Firearms), a slender telescope attached to the barrel, having cross wires in the eyepiece and used as a sight. -- Terrestrial telescope, a telescope whose eyepiece has one or two lenses more than the astronomical, for the purpose of inverting the image, and exhibiting objects erect.\n\nTo slide or pass one within another, after the manner of the sections of a small telescope or spyglass; to come into collision, as railway cars, in such a manner that one runs into another. [Recent]\n\nTo cause to come into collision, so as to telescope. [Recent]"}