{"word":"temper","definition":"1. To mingle in due proportion; to prepare by combining; to modify, as by adding some new element; to qualify, as by an ingredient; hence, to soften; to mollify; to assuage; to soothe; to calm. Puritan austerity was so tempered by Dutch indifference, that mercy itself could not have dictated a milder system. Bancroft. Woman! lovely woman! nature made thee To temper man: we had been brutes without you. Otway. But thy fire Shall be more tempered, and thy hope far higher. Byron. She [the Goddess of Justice] threw darkness and clouds about her, that tempered the light into a thousand beautiful shades and colors. Addison. 2. To fit together; to adjust; to accomodate. Thy sustenance . . . serving to the appetite of the eater, tempered itself to every man's liking. Wisdom xvi. 21. 3. (Metal.)  To bring to a proper degree of hardness; as, to temper iron or steel. The tempered metals clash, and yield a silver sound. Dryden. 4. To govern; to manage. [A Latinism & Obs.] With which the damned ghosts he governeth, And furies rules, and Tartare tempereth. Spenser. 5. To moisten to a proper consistency and stir thoroughly, as clay for making brick, loam for molding, etc. 6. (Mus.)  To adjust, as the mathematical scale to the actual scale, or to that in actual use. Syn. -- To soften; mollify; assuage; soothe; calm.\n\n1. The state of any compound substance which results from the mixture of various ingredients; due mixture of different qualities; just combination; as, the temper of mortar. 2. Constitution of body; temperament; in old writers, the mixture or relative proportion of the four humors, blood, choler, phlegm, and melancholy. The exquisiteness of his [Christ's] bodily temper increased the exquisiteness of his torment. Fuller. 3. Disposition of mind; the constitution of the mind, particularly with regard to the passions and affections; as, a calm temper; a hasty temper; a fretful temper. Remember with what mild And gracious temper he both heared and judged. Milton. The consequents of a certain ethical temper. J. H. Newman. 4. Calmness of mind; moderation; equanimity; composure; as, to keep one's temper. To fall with dignity, with temper rise. Pope. Restore yourselves to your tempers, fathers. B. Jonson. 5. Heat of mind or passion; irritation; proneness to anger; -- in a reproachful sense. [Colloq.] 6. The state of a metal or other substance, especially as to its hardness, produced by some process of heating or cooling; as, the temper of iron or steel. 7. Middle state or course; mean; medium. [R.] The perfect lawgiver is a just temper between the mere man of theory, who can see nothing but general principles, and the mere man of business, who can see nothing but particular circumstances. Macaulay. 8. (Sugar Works)  Milk of lime, or other substance, employed in the process formerly used to clarify sugar. Temper screw, in deep well boring, an adjusting screw connecting the working beam with the rope carrying the tools, for lowering the tools as the drilling progresses. Syn. -- Disposition; temperament; frame; humor; mood. See Disposition.\n\n1. To accord; to agree; to act and think in conformity. [Obs.] Shak. 2. To have or get a proper or desired state or quality; to grow soft and pliable. I have him already tempering between my finger and my thumb, and shortly will I seal with him. Shak."}