{"word":"temperament","definition":"1. Internal constitution; state with respect to the relative proportion of different qualities, or constituent parts. The common law . . . has reduced the kingdom to its just state and temperament. Sir M. Hale. 2. Due mixture of qualities; a condition brought about by mutual compromises or concessions. [Obs.] However, I forejudge not any probable expedient, any temperament that can be found in things of this nature, so disputable on their side. Milton. 3. The act of tempering or modifying; adjustment, as of clashing rules, interests, passions, or the like; also, the means by which such adjustment is effected. Wholesome temperaments of the rashness of popular assemblies. Sir J. Mackintosh. 4. Condition with regard to heat or cold; temperature. [Obs.] Bodies are denominated \"hot\" and \"cold\" in proportion to the present temperament of that part of our body to which they are applied. Locke. 5. (Mus.)  A system of compromises in the tuning of organs, pianofortes, and the like, whereby the tones generated with the vibrations of a ground tone are mutually modified and in part canceled, until their number reduced to the actual practicable scale of twelve tones to the octave. This scale, although in so far artificial, is yet closely suggestive of its origin in nature, and this system of tuning, although not mathematically true, yet satisfies the ear, while it has the convenience that the same twelve fixed tones answer for every key or scale, C# becoming identical with D, and so on. 6. (Physiol.)  The peculiar physical and mental character of an individual, in olden times erroneously supposed to be due to individual variation in the relations and proportions of the constituent parts of the body, especially of the fluids, as the bile, blood, lymph, etc. Hence the phrases, bilious or choleric temperament, sanguine temperament, etc., implying a predominance of one of these fluids and a corresponding influence on the temperament. Equal temperament (Mus.), that in which the variations from mathematically true pitch are distributed among all the keys alike. -- Unequal temperament (Mus.), that in which the variations are thrown into the keys least used."}