{"word":"tender","definition":"1. One who tends; one who takes care of any person or thing; a nurse. 2. (Naut.)  A vessel employed to attend other vessels, to supply them with provisions and other stores, to convey intelligence, or the like. 3. A car attached to a locomotive, for carrying a supply of fuel and water.\n\n1. (Law)  To offer in payment or satisfaction of a demand, in order to save a penalty or forfeiture; as, to tender the amount of rent or debt. 2. To offer in words; to present for acceptance. You see how all conditions, how all minds, . . . tender down Their services to Lord Timon. Shak.\n\n1. (Law)  An offer, either of money to pay a debt, or of service to be performed, in order to save a penalty or forfeiture, which would be incurred by nonpayment or nonperformance; as, the tender of rent due, or of the amount of a note, with interest. Note: To constitute a legal tender, such money must be offered as the law prescribes. So also the tender must be at the time and place where the rent or debt ought to be paid, and it must be to the full amount due. 2. Any offer or proposal made for acceptance; as, a tender of a loan, of service, or of friendship; a tender of a bid for a contract. A free, unlimited tender of the gospel. South. 3. The thing offered; especially, money offered in payment of an obligation. Shak. Legal tender. See under Legal. -- Tender of issue (Law), a form of words in a pleading, by which a party offers to refer the question raised upon it to the appropriate mode of decision. Burrill.\n\n1. Easily impressed, broken, bruised, or injured; not firm or hard; delicate; as, tender plants; tender flesh; tender fruit. 2. Sensible to impression and pain; easily pained. Our bodies are not naturally more tender than our faces. L'Estrange. 3. Physically weak; not hardly or able to endure hardship; immature; effeminate. The tender and delicate woman among you. Deut. xxviii. 56. 4. Susceptible of the softer passions, as love, compassion, kindness; compassionate; pitiful; anxious for another's good; easily excited to pity, forgiveness, or favor; sympathetic. The Lord is very pitiful, and of tender mercy. James v. 11. I am choleric by my nature, and tender by my temper. Fuller. 5. Exciting kind concern; dear; precious. I love Valentine, Whose life's as tender to me as my soul! Shak. 6. Careful to save inviolate, or not to injure; -- with of. \"Tender of property.\" Burke. The civil authority should be tender of the honor of God and religion. Tillotson. 7. Unwilling to cause pain; gentle; mild. You, that are thus so tender o'er his follies, Will never do him good. Shak. 8. Adapted to excite feeling or sympathy; expressive of the softer passions; pathetic; as, tender expressions; tender expostulations; a tender strain. 9. Apt to give pain; causing grief or pain; delicate; as, a tender subject. \"Things that are tender and unpleasing.\" Bacon. 10. (Naut.)  Heeling over too easily when under sail; -- said of a vessel. Note: Tender is sometimes used in the formation of self-explaining compounds; as, tender-footed, tender-looking, tender-minded, tender- mouthed, and the like. Syn. -- Delicate; effeminate; soft; sensitive; compassionate; kind; humane; merciful; pitiful.\n\nRegard; care; kind concern. [Obs.] Shak.\n\nTo have a care of; to be tender toward; hence, to regard; to esteem; to value. [Obs.] For first, next after life, he tendered her good. Spenser. Tender yourself more dearly. Shak. To see a prince in want would move a miser's charity. Our western princes tendered his case, which they counted might be their own. Fuller."}