{"word":"thick","definition":"1. Measuring in the third dimension other than length and breadth, or in general dimension other than length; -- said of a solid body; as, a timber seven inches thick. Were it as thick as is a branched oak. Chaucer. My little finger shall be thicker than my father's loins. 1 Kings xii. 10. 2. Having more depth or extent from one surface to its opposite than usual; not thin or slender; as, a thick plank; thick cloth; thick paper; thick neck. 3. Dense; not thin; inspissated; as, thick vapors. Also used figuratively; as, thick darkness. Make the gruel thick and slab. Shak. 4. Not transparent or clear; hence, turbid, muddy, or misty; as, the water of a river is apt to be thick after a rain. \"In a thick, misty day.\" Sir W. Scott. 5. Abundant, close, or crowded in space; closely set; following in quick succession; frequently recurring. The people were gathered thick together. Luke xi. 29. Black was the forest; thick with beech it stood. Dryden. 6. Not having due distinction of syllables, or good articulation; indistinct; as, a thick utterance. 7. Deep; profound; as, thick sleep. [R.] Shak. 8. Dull; not quick; as, thick of fearing. Shak. His dimensions to any thick sight were invincible. Shak. 9. Intimate; very friendly; familiar. [Colloq.] We have been thick ever since. T. Hughes. Note: Thick is often used in the formation of compounds, most of which are self-explaining; as, thick-barred, thick-bodied, thick- coming, thick-cut, thick-flying, thick-growing, thick-leaved, thick- lipped, thick-necked, thick-planted, thick-ribbed, thick-shelled, thick-woven, and the like. Thick register. (Phon.) See the Note under Register, n., 7. -- Thick stuff (Naut.), all plank that is more than four inches thick and less than twelve. J. Knowles. Syn. -- Dense; close; compact; solid; gross; coarse.\n\n1. The thickest part, or the time when anything is thickest. In the thick of the dust and smoke. Knolles. 2. A thicket; as, gloomy thicks. [Obs.] Drayton. Through the thick they heard one rudely rush. Spenser. He through a little window cast his sight Through thick of bars, that gave a scanty light. Dryden. Thick-and-thin block (Naut.), a fiddle block. See under Fiddle. -- Through thick and thin, through all obstacles and difficulties, both great and small. Through thick and thin she followed him. Hudibras. He became the panegyrist, through thick and thin, of a military frenzy. Coleridge.\n\n1. Frequently; fast; quick. 2. Closely; as, a plat of ground thick sown. 3. To a great depth, or to a greater depth than usual; as, land covered thick with manure. Thick and threefold, in quick succession, or in great numbers. [Obs.] L'Estrange.\n\nTo thicken. [R.] The nightmare Life-in-death was she, Who thicks man's blood with cold. Coleridge."}