{"word":"thing","definition":"1. Whatever exists, or is conceived to exist, as a separate entity, whether animate or inanimate; any separable or distinguishable object of thought. God made . . . every thing that creepeth upon the earth after his kind. Gen. i. 25. He sent after this manner; ten asses laden with the good things of Egypt. Gen. xiv. 23. A thing of beauty is a joy forever. Keats. 2. An inanimate object, in distinction from a living being; any lifeless material. Ye meads and groves, unsonscious things! Cowper. 3. A transaction or occurrence; an event; a deed. [And Jacob said] All these things are against me. Gen. xlii. 36. Which if ye tell me, I in like wise will tell you by what authority I do these things. Matt. xxi. 24. 4. A portion or part; something. Wieked men who understand any thing of wisdom. Tillotson. 5. A diminutive or slighted object; any object viewed as merely existing; -- often used in pity or contempt. See, sons, what things you are! Shak. The poor thing sighed, and . . . turned from me. Addison. I'll be this abject thing no more. Granville. I have a thing in prose. Swift. 6. pl.  Clothes; furniture; appurtenances; luggage; as, to pack or store one's things. [Colloq.] Note: Formerly, the singular was sometimes used in a plural or collective sense. And them she gave her moebles and her thing. Chaucer. Note: Thing was used in a very general sense in Old English, and is still heard colloquially where some more definite term would be used in careful composition. In the garden [he] walketh to and fro, And hath his things [i. e., prayers, devotions] said full courteously. Chaucer. Hearkening his minstrels their things play. Chaucer. 7. (Law)  Whatever may be possessed or owned; a property; -- distinguished from person. 8. [In this sense pronounced tîng.]  In Scandinavian countries, a legislative or judicial assembly. Longfellow. Things personal. (Law) Same as Personal property, under Personal. -- Things real. Same as Real property, under Real."}