{"word":"throw","definition":"Pain; especially, pain of travail; throe. [Obs.] Spenser. Dryden.\n\nTime; while; space of time; moment; trice. [Obs.] Shak. I will with Thomas speak a little throw. Chaucer.\n\n1. To fling, cast, or hurl with a certain whirling motion of the arm, to throw a ball; -- distinguished from to toss, or to bowl. 2. To fling or cast in any manner; to drive to a distance from the hand or from an engine; to propel; to send; as, to throw stones or dust with the hand; a cannon throws a ball; a fire engine throws a stream of water to extinguish flames. 3. To drive by violence; as, a vessel or sailors may be thrown upon a rock. 4. (Mil.)  To cause to take a strategic position; as, he threw a detachment of his army across the river. 5. To overturn; to prostrate in wrestling; as, a man throws his antagonist. 6. To cast, as dice; to venture at dice. Set less than thou throwest. Shak. 7. To put on hastily; to spread carelessly. O'er his fair limbs a flowery vest he threw. Pope. 8. To divest or strip one's self of; to put off. There the snake throws her enameled skin. Shak. 9. (Pottery)  To form or shape roughly on a throwing engine, or potter's wheel, as earthen vessels. 10. To give forcible utterance to; to cast; to vent. I have thrown A brave defiance in King Henry's teeth. Shak. 11. To bring forth; to produce, as young; to bear; -- said especially of rabbits. 12. To twist two or more filaments of, as silk, so as to form one thread; to twist together, as singles, in a direction contrary to the twist of the singles themselves; -- sometimes applied to the whole class of operations by which silk is prepared for the weaver. Tomlinson. To throw away. (a) To lose by neglect or folly; to spend in vain; to bestow without a compensation; as, to throw away time; to throw away money. (b) To reject; as, to throw away a good book, or a good offer. -- To throw back. (a) To retort; to cast back, as a reply. (b) To reject; to refuse. (c) To reflect, as light. -- To throw by, to lay aside; to discard; to neglect as useless; as, to throw by a garment. -- To throw down, to subvert; to overthrow; to destroy; as, to throw down a fence or wall. -- To throw in. (a) To inject, as a fluid. (b) To put in; to deposit with others; to contribute; as, to throw in a few dollars to help make up a fund; to throw in an occasional comment. (c) To add without enumeration or valuation, as something extra to clinch a bargain. -- To throw off. (a) To expel; to free one's self from; as, to throw off a disease. (b) To reject; to discard; to abandon; as, to throw off all sense of shame; to throw off a dependent. (c) To make a start in a hunt or race. [Eng.](e) To disconcert or confuse. Same as to throw out (f). -- To throw on, to cast on; to load. -- To throw one's self down, to lie down neglectively or suddenly. -- To throw one's self on or upon. (a) To fall upon. (b) To resign one's self to the favor, clemency, or sustain power of (another); to repose upon. -- To throw out. (a) To cast out; to reject or discard; to expel. \"The other two, whom they had thrown out, they were content should enjoy their exile.\" Swift. \"The bill was thrown out.\" Swift. (b) To utter; to give utterance to; to speak; as, to throw out insinuation or observation. \"She throws out thrilling shrieks.\" Spenser. (c) To distance; to leave behind. Addison. (d) To cause to project; as, to throw out a pier or an abutment. (e) To give forth; to emit; as, an electric lamp throws out a brilliant light. (f) To put out; to confuse; as, a sudden question often throws out an orator. -- To throw over, to abandon the cause of; to desert; to discard; as, to throw over a friend in difficulties. -- To throw up. (a) To resign; to give up; to demit; as, to throw up a commission. \"Experienced gamesters throw up their cards when they know that the game is in the enemy's hand.\" Addison. (b) To reject from the stomach; to vomit. (c) To construct hastily; as, to throw up a breastwork of earth.\n\nTo perform the act of throwing or casting; to cast; specifically, to cast dice. To throw about, to cast about; to try expedients. [R.]\n\n1. The act of hurling or flinging; a driving or propelling from the hand or an engine; a cast. He heaved a stone, and, rising to the throw, He sent it in a whirlwind at the foe. Addison. 2. A stroke; a blow. [Obs.] Nor shield defend the thunder of his throws. Spenser. 3. The distance which a missile is, or may be, thrown; as, a stone's throw. 4. A cast of dice; the manner in which dice fall when cast; as, a good throw. 5. An effort; a violent sally. [Obs.] Your youth admires The throws and swellings of a Roman soul. Addison. 6. (Mach.)  The extreme movement given to a sliding or vibrating reciprocating piece by a cam, crank, eccentric, or the like; travel; stroke; as, the throw of a slide valve. Also, frequently, the length of the radius of a crank, or the eccentricity of an eccentric; as, the throw of the crank of a steam engine is equal to half the stroke of the piston. 7. (Pottery)  A potter's wheel or table; a jigger. See 2d Jigger, 2 (a). 8. A turner's lathe; a throwe. [Prov. Eng.] 9. (Mining)  The amount of vertical displacement produced by a fault; -- according to the direction it is designated as an upthrow, or a downthrow."}