{"word":"through","definition":"1. From end to end of, or from side to side of; from one surface or limit of, to the opposite; into and out of at the opposite, or at another, point; as, to bore through a piece of timber, or through a board; a ball passes through the side of a ship. 2. Between the sides or walls of; within; as, to pass through a door; to go through an avenue. Through the gate of ivory he dismissed His valiant offspring. Dryden. 3. By means of; by the agency of. Through these hands this science has passed with great applause. Sir W. Temple. Material things are presented only through their senses. Cheyne. 4. Over the whole surface or extent of; as, to ride through the country; to look through an account. 5. Among or in the midst of; -- used to denote passage; as, a fish swims through the water; the light glimmers through a thicket. 6. From the beginning to the end of; to the end or conclusion of; as, through life; through the year.\n\n1. From one end or side to the other; as, to pierce a thing through. 2. From beginning to end; as, to read a letter through. 3. To the end; to a conclusion; to the ultimate purpose; as, to carry a project through. Note: Through was formerly used to form compound adjectives where we now use thorough; as, through-bred; through-lighted; through-placed, etc. To drop through, to fall through; to come to naught; to fail. -- To fall through. See under Fall, v. i.\n\nGoing or extending through; going, extending, or serving from the beginning to the end; thorough; complete; as, a through line; a through ticket; a through train. Also, admitting of passage through; as, a through bridge. Through bolt, a bolt which passes through all the thickness or layers of that which it fastens, or in which it is fixed. -- Through bridge, a bridge in which the floor is supported by the lower chords of the tissues instead of the upper, so that travel is between the trusses and not over them. Cf. Deck bridge, under Deck. -- Through cold, a deep-seated cold. [Obs.] Holland. -- Through stone, a flat gravestone. [Scot.] [Written also through stane.] Sir W. Scott. -- Through ticket, a ticket for the whole journey. -- Through train, a train which goes the whole length of a railway, or of a long route."}