{"word":"thrust","definition":"Thrist. [Obs.] Spenser.\n\n1. To push or drive with force; to drive, force, or impel; to shove; as, to thrust anything with the hand or foot, or with an instrument. Into a dungeon thrust, to work with slaves. Milton. 2. To stab; to pierce; -- usually with through. To thrust away or from, to push away; to reject. -- To thrust in, to push or drive in. -- To thrust off, to push away. -- To thrust on, to impel; to urge. -- To thrust one's self in or into, to obtrude upon, to intrude, as into a room; to enter (a place) where one is not invited or not welcome. -- To thrust out, to drive out or away; to expel. -- To thrust through, to pierce; to stab. \"I am eight times thrust through the doublet.\" Shak. -- To thrust together, to compress.\n\n1. To make a push; to attack with a pointed weapon; as, a fencer thrusts at his antagonist. 2. To enter by pushing; to squeeze in. And thrust between my father and the god. Dryden. 3. To push forward; to come with force; to press on; to intrude. \"Young, old, thrust there in mighty concourse.\" Chapman. To thrust to, to rush upon. [Obs.] As doth an eager hound Thrust to an hind within some covert glade. Spenser.\n\n1. A violent push or driving, as with a pointed weapon moved in the direction of its length, or with the hand or foot, or with any instrument; a stab; -- a word much used as a term of fencing. [Polites] Pyrrhus with his lance pursues, And often reaches, and his thrusts renews. Dryden. 2. An attack; an assault. One thrust at your pure, pretended mechanism. Dr. H. More. 3. (Mech.)  The force or pressure of one part of a construction against other parts; especially (Arch.), a horizontal or diagonal outward pressure, as of an arch against its abutments, or of rafters against the wall which support them. 4. (Mining)  The breaking down of the roof of a gallery under its superincumbent weight. Thrust bearing (Screw Steamers), a bearing arranged to receive the thrust or endwise pressure of the screw shaft. -- Thrust plane (Geol.), the surface along which dislocation has taken place in the case of a reversed fault. Syn. -- Push; shove; assault; attack. Thrust, Push, Shove. Push and shove usually imply the application of force by a body already in contact with the body to be impelled. Thrust, often, but not always, implies the impulse or application of force by a body which is in motion before it reaches the body to be impelled."}