{"word":"tiger","definition":"1. A very large and powerful carnivore (Felis tigris) native of Southern Asia and the East Indies. Its back and sides are tawny or rufous yellow, transversely striped with black, the tail is ringed with black, the throat and belly are nearly white. When full grown, it equals or exceeds the lion in size and strength. Called also royal tiger, and Bengal tiger. 2. Fig.: A ferocious, bloodthirsty person. As for heinous tiger, Tamora. Shak. 3. A servant in livery, who rids with his master or mistress. Dickens. 4. A kind of growl or screech, after cheering; as, three cheers and a tiger. [Colloq. U.S.] 5. A pneumatic box or pan used in refining sugar. American tiger. (Zoöl.) (a) The puma. (b) The jaguar. -- Clouded tiger (Zoöl.), a handsome striped and spotted carnivore (Felis macrocelis or F. marmorata) native of the East Indies and Southern Asia. Its body is about three and a half feet long, and its tail about three feet long. Its ground color is brownish gray, and the dark markings are irregular stripes, spots, and rings, but there are always two dark bands on the face, one extending back from the eye, and one from the angle of the mouth. Called also tortoise-shell tiger. -- Mexican tiger (Zoöl.), the jaguar. -- Tiger beetle (Zoöl.), any one of numerous species of active carnivorous beetles of the family Cicindelidæ. They usually inhabit dry or sandy places, and fly rapidly. -- Tiger bittern. (Zoöl.) See Sun bittern, under Sun. -- Tiger cat (Zoöl.), any one of several species of wild cats of moderate size with dark transverse bars or stripes somewhat resembling those of the tiger. -- Tiger flower (Bot.), an iridaceous plant of the genus Tigridia (as T. conchiflora, T. grandiflora, etc.) having showy flowers, spotted or streaked somewhat like the skin of a tiger. -- Tiger grass (Bot.), a low East Indian fan palm (Chamærops Ritchieana). It is used in many ways by the natives. J. Smith (Dict. Econ. Plants). -- Tiger lily. (Bot.) See under Lily. -- Tiger moth (Zoöl.), any one of numerous species of moths of the family Arctiadæ which are striped or barred with black and white or with other conspicuous colors. The larvæ are called woolly bears. -- Tiger shark (Zoöl.), a voracious shark (Galeocerdo maculatus or tigrinus) more or less barred or spotted with yellow. It is found in both the Atlantic and Indian Ocean. Called also zebra shark. -- Tiger shell (Zoöl.), a large and conspicuously spotted cowrie (Cypræa tigris); -- so called from its fancied resemblance to a tiger in color and markings. Called also tiger cowrie. -- Tiger wolf (Zoöl.), the spotted hyena (Hyæna crocuta). -- Tiger wood, the variegated heartwood of a tree (Machærium Schomburgkii) found in Guiana."}