{"word":"time","definition":"1. Duration, considered independently of any system of measurement or any employment of terms which designate limited portions thereof. The time wasteth [i. e. passes away] night and day. Chaucer. I know of no ideas . . . that have a better claim to be accounted simple and original than those of space and time. Reid. 2. A particular period or part of duration, whether past, present, or future; a point or portion of duration; as, the time was, or has been; the time is, or will be. God, who at sundry times and in divers manners spake in time past unto the fathers by the prophets. Heb. i. 1. 3. The period at which any definite event occurred, or person lived; age; period; era; as, the Spanish Armada was destroyed in the time of Queen Elizabeth; -- often in the plural; as, ancient times; modern times. 4. The duration of one's life; the hours and days which a person has at his disposal. Believe me, your time is not your own; it belongs to God, to religion, to mankind. Buckminster. 5. A proper time; a season; an opportunity. There is . . . a time to every purpose. Eccl. iii. 1. The time of figs was not yet. Mark xi. 13. 6. Hour of travail, delivery, or parturition. She was within one month of her time. Clarendon. 7. Performance or occurrence of an action or event, considered with reference to repetition; addition of a number to itself; repetition; as, to double cloth four times; four times four, or sixteen. Summers three times eight save one. Milton. 8. The present life; existence in this world as contrasted with immortal life; definite, as contrasted with infinite, duration. Till time and sin together cease. Keble. 9. (Gram.)  Tense. 10. (Mus.)  The measured duration of sounds; measure; tempo; rate of movement; rhythmical division; as, common or triple time; the musician keeps good time. Some few lines set unto a solemn time. Beau. & Fl. Note: Time is often used in the formation of compounds, mostly self- explaining; as, time-battered, time-beguiling, time-consecrated, time-consuming, time-enduring, time-killing, time-sanctioned, time- scorner, time-wasting, time-worn, etc. Absolute time, time irrespective of local standards or epochs; as, all spectators see a lunar eclipse at the same instant of absolute time. -- Apparent time, the time of day reckoned by the sun, or so that 12 o'clock at the place is the instant of the transit of the sun's center over the meridian. -- Astronomical time, mean solar time reckoned by counting the hours continuously up to twenty-four from one noon to the next. -- At times, at distinct intervals of duration; now and then; as, at times he reads, at other times he rides. -- Civil time, time as reckoned for the purposes of common life in distinct periods, as years, months, days, hours, etc., the latter, among most modern nations, being divided into two series of twelve each, and reckoned, the first series from midnight to noon, the second, from noon to midnight. -- Common time (Mil.), the ordinary time of marching, in which ninety steps, each twenty-eight inches in length, are taken in one minute. -- Equation of time. See under Equation, n. -- In time. (a) In good season; sufficiently early; as, he arrived in time to see the exhibition. (b) After a considerable space of duration; eventually; finally; as, you will in time recover your health and strength. -- Mean time. See under 4th Mean. -- Quick time (Mil.), time of marching, in which one hundred and twenty steps, each thirty inches in length, are taken in one minute. -- Sidereal time. See under Sidereal. -- Standard time, the civil time that has been established by law or by general usage over a region or country. In England the standard time is Greenwich mean solar time. In the United States and Canada four kinds of standard time have been adopted by the railroads and accepted by the people, viz., Eastern, Central, Mountain, and Pacific time, corresponding severally to the mean local times of the 75th, 90th, 105th, and 120th meridians west from Greenwich, and being therefore five, six, seven, and eight hours slower than Greenwich time. -- Time ball, a ball arranged to drop from the summit of a pole, to indicate true midday time, as at Greenwich Observatory, England. Nichol. -- Time bargain (Com.), a contract made for the sale or purchase of merchandise, or of stock in the public funds, at a certain time in the future. -- Time bill. Same as Time-table. [Eng.] -- Time book, a book in which is kept a record of the time persons have worked. -- Time detector, a timepiece provided with a device for registering and indicating the exact time when a watchman visits certain stations in his beat. -- Time enough, in season; early enough. \"Stanly at Bosworth field, . . . came time enough to save his life.\" Bacon. -- Time fuse, a fuse, as for an explosive projectile, which can be so arranged as to ignite the charge at a certain definite interval after being itself ignited. -- Time immemorial, or Time out of mind. (Eng. Law) See under Immemorial. -- Time lock, a lock having clockwork attached, which, when wound up, prevents the bolt from being withdrawn when locked, until a certain interval of time has elapsed. -- Time of day, salutation appropriate to the times of the day, as \"good morning,\" \"good evening,\" and the like; greeting. -- To kill time. See under Kill, v. t. -- To make time. (a) To gain time. (b) To occupy or use (a certain) time in doing something; as, the trotting horse made fast time. -- To move, run, or go, against time, to move, run, or go a given distance without a competitor, in the quickest possible time; or, to accomplish the greatest distance which can be passed over in a given time; as, the horse is to run against time. -- True time. (a) Mean time as kept by a clock going uniformly. (b) (Astron.) Apparent time as reckoned from the transit of the sun's center over the meridian.\n\n1. To appoint the time for; to bring, begin, or perform at the proper season or time; as, he timed his appearance rightly. There is no greater wisdom than well to time the beginnings and onsets of things. Bacon. 2. To regulate as to time; to accompany, or agree with, in time of movement. Who overlooked the oars, and timed the stroke. Addison. He was a thing of blood, whose every motion Was timed with dying cries. Shak. 3. To ascertain or record the time, duration, or rate of; as, to time the speed of horses, or hours for workmen. 4. To measure, as in music or harmony.\n\n1. To keep or beat time; to proceed or move in time. With oar strokes timing to their song. Whittier. 2. To pass time; to delay. [Obs.]"}