{"word":"to","definition":"1. The preposition to primarily indicates approach and arrival, motion made in the direction of a place or thing and attaining it, access; and also, motion or tendency without arrival; movement toward; -- opposed to Ant: from. \"To Canterbury they wend.\" Chaucer. Stay with us, go not to Wittenberg. Shak. So to the sylvan lodge They came, that like Pomona's arbor smiled. Milton. I'll to him again, . . . He'll tell me all his purpose. She stretched her arms to heaven. Dryden. 2. Hence, it indicates motion, course, or tendency toward a time, a state or condition, an aim, or anything capable of being regarded as a limit to a tendency, movement, or action; as, he is going to a trade; he is rising to wealth and honor. Note: Formerly, by omission of the verb denoting motion, to sometimes followed a form of be, with the sense of at, or in. \"When the sun was [gone or declined] to rest.\" Chaucer. 3. In a very general way, and with innumerable varieties of application, to connects transitive verbs with their remoter or indirect object, and adjectives, nouns, and neuter or passive verbs with a following noun which limits their action. Its sphere verges upon that of for, but it contains less the idea of design or appropriation; as, these remarks were addressed to a large audience; let us keep this seat to ourselves; a substance sweet to the taste; an event painful to the mind; duty to God and to our parents; a dislike to spirituous liquor. Marks and points out each man of us to slaughter. B. Jonson. Whilst they, distilled Almost to jelly with the act of fear, Stand dumb and speak not to him. Shak. Add to your faith virtue; and to virtue knowledge; and to knowledge temperance; and to temperance patience; and to patience godliness; and to godliness brotherly kindness; and to brotherly kindness charity. 2 Pet. i. 5,6,7. I have a king's oath to the contrary. Shak. Numbers were crowded to death. Clarendon. Fate and the dooming gods are deaf to tears. Dryden. Go, buckle to the law. Dryden. 4. As sign of the infinitive, to had originally the use of last defined, governing the infinitive as a verbal noun, and connecting it as indirect object with a preceding verb or adjective; thus, ready to go, i.e., ready unto going; good to eat, i.e., good for eating; I do my utmost to lead my life pleasantly. But it has come to be the almost constant prefix to the infinitive, even in situations where it has no prepositional meaning, as where the infinitive is direct object or subject; thus, I love to learn, i.e., I love learning; to die for one's country is noble, i.e., the dying for one's country. Where the infinitive denotes the design or purpose, good usage formerly allowed the prefixing of for to the to; as, what went ye out for see (Matt. xi. 8). Then longen folk to go on pilgrimages, And palmers for to seeken strange stranders. Chaucer. Note: Such usage is now obsolete or illiterate. In colloquial usage, to often stands for, and supplies, an infinitive already mentioned; thus, he commands me to go with him, but I do not wish to. 5. In many phrases, and in connection with many other words, to has a pregnant meaning, or is used elliptically. Thus, it denotes or implies: (a) Extent; limit; degree of comprehension; inclusion as far as; as, they met us to the number of three hundred. We ready are to try our fortunes To the last man. Shak. Few of the Esquimaux can count to ten. Quant. Rev. (b) Effect; end; consequence; as, the prince was flattered to his ruin; he engaged in a war to his cost; violent factions exist to the prejudice of the state. (c) Apposition; connection; antithesis; opposition; as, they engaged hand to hand. Now we see through a glass, darkly; but then face to face. 1 Cor. xiii. 12. (d) Accord; adaptation; as, an occupation to his taste; she has a husband to her mind. He to God's image, she to his was made. Dryden. (e) Comparison; as, three is to nine as nine is to twenty-seven; it is ten to one that you will offend him. All that they did was piety to this. B. Jonson. (f) Addition; union; accumulation. Wisdom he has, and to his wisdom, courage. Denham. (g) Accompaniment; as, she sang to his guitar; they danced to the music of a piano. Anon they move In perfect phalanx to the Dorian mood Of flutes and soft recorders. Milton. (h) Character; condition of being; purpose subserved or office filled. [In this sense archaic] \"I have a king here to my flatterer.\" Shak. Made his masters and others . . . to consider him to a little wonder. Walton. Note: To in to-day, to-night, and to-morrow has the sense or force of for or on; for, or on, (this) day, for, or on, (this) night, for, or on, (the) morrow. To-day, to-night, to-morrow may be considered as compounds, and usually as adverbs; but they are sometimes used as nouns; as, to-day is ours. To-morrow, and to-morrow, and to-morrow; Creeps in this petty pace from day to day. Shak. To and again, to and fro. [R.] -- To and fro, forward and back. In this phrase, to is adverbial. There was great showing both to and fro. Chaucer. -- To-and-fro, a pacing backward and forward; as, to commence a to- and-fro. Tennyson. -- To the face, in front of; in behind; hence, in the presence of. -- To wit, to know; namely. See Wit, v. i. Note: To, without an object expressed, is used adverbially; as, put to the door, i. e., put the door to its frame, close it; and in the nautical expressions, to heave to, to come to, meaning to a certain position. To, like on, is sometimes used as a command, forward, set to. \"To, Achilles! to, Ajax! to!\" Shak."}