{"word":"toll","definition":"To take away; to vacate; to annul.\n\n1. To draw; to entice; to allure. See Tole. 2. Etym: [Probably the same word as toll to draw, and at first meaning, to ring in order to draw people to church.]  To cause to sound, as a bell, with strokes slowly and uniformly repeated; as, to toll the funeral bell. \"The sexton tolled the bell.\" Hood. 3. To strike, or to indicate by striking, as the hour; to ring a toll for; as, to toll a departed friend. Shak. Slow tolls the village clock the drowsy hour. Beattie. 4. To call, summon, or notify, by tolling or ringing. When hollow murmurs of their evening bells Dismiss the sleepy swains, and toll them to their cells. Dryden.\n\nTo sound or ring, as a bell, with strokes uniformly repeated at intervals, as at funerals, or in calling assemblies, or to announce the death of a person. The country cocks do crow, the clocks do toll. Shak. Now sink in sorrows with a tolling bell. Pope.\n\nThe sound of a bell produced by strokes slowly and uniformly repeated.\n\n1. A tax paid for some liberty or privilege, particularly for the privilege of passing over a bridge or on a highway, or for that of vending goods in a fair, market, or the like. 2. (Sax. & O. Eng. Law)  A liberty to buy and sell within the bounds of a manor. 3. A portion of grain taken by a miller as a compensation for grinding. Toll and team (O. Eng. Law), the privilege of having a market, and jurisdiction of villeins. Burrill. -- Toll bar, a bar or beam used on a canal for stopping boats at the tollhouse, or on a road for stopping passengers. -- Toll bridge, a bridge where toll is paid for passing over it. -- Toll corn, corn taken as pay for grinding at a mill. -- Toll dish, a dish for measuring toll in mills. -- Toll gatherer, a man who takes, or gathers, toll. -- Toll hop, a toll dish. [Obs.] Crabb. -- Toll thorough (Eng. Law), toll taken by a town for beasts driven through it, or over a bridge or ferry maintained at its cost. Brande & C. -- Toll traverse (Eng. Law), toll taken by an individual for beasts driven across his ground; toll paid by a person for passing over the private ground, bridge, ferry, or the like, of another. -- Toll turn (Eng. Law), a toll paid at the return of beasts from market, though they were not sold. Burrill. Syn. -- Tax; custom; duty; impost.\n\n1. To pay toll or tallage. [R.] Shak. 2. To take toll; to raise a tax. [R.] Well could he [the miller] steal corn and toll thrice. Chaucer. No Italian priest Shall tithe or toll in our dominions. Shak.\n\nTo collect, as a toll. Shak."}