{"word":"tone","definition":"1. Sound, or the character of a sound, or a sound considered as of this or that character; as, a low, high, loud, grave, acute, sweet, or harsh tone. [Harmony divine] smooths her charming tones. Milton. Tones that with seraph hymns might blend. Keble. 2. (Rhet.)  Accent, or inflection or modulation of the voice, as adapted to express emotion or passion. Eager his tone, and ardent were his eyes. Dryden. 3. A whining style of speaking; a kind of mournful or artificial strain of voice; an affected speaking with a measured rhythm ahd a regular rise and fall of the voice; as, children often read with a tone. 4. (Mus.) (a) A sound considered as to pitch; as, the seven tones of the octave; she has good high tones. (b) The larger kind of interval between contiguous sounds in the diatonic scale, the smaller being called a semitone as, a whole tone too flat; raise it a tone. (c) The peculiar quality of sound in any voice or instrument; as, a rich tone, a reedy tone. (d) A mode or tune or plain chant; as, the Gregorian tones. Note: The use of the word tone, both for a sound and for the interval between two sounds or tones, is confusing, but is common -- almost universal. Note: Nearly every musical sound is composite, consisting of several simultaneous tones having different rates of vibration according to fixed laws, which depend upon the nature of the vibrating body and the mode of excitation. The components (of a composite sound) are called partial tones; that one having the lowest rate of vibration is the fundamental tone, and the other partial tones are called harmonics, or overtones. The vibration ratios of the partial tones composing any sound are expressed by all, or by a part, of the numbers in the series 1, 2, 3, 4, 5, etc.; and the quality of any sound (the tone color) is due in part to the presence or absence of overtones as represented in this series, and in part to the greater or less intensity of those present as compared with the fundamental tone and with one another. Resultant tones, combination tones, summation tones, difference tones, Tartini's tones (terms only in part synonymous) are produced by the simultaneous sounding of two or more primary (simple or composite) tones. 5. (Med.)  That state of a body, or of any of its organs or parts, in which the animal functions are healthy and performed with due vigor. Note: In this sense, the word is metaphorically applied to character or faculties, intellectual and moral; as, his mind has lost its tone. 6. (Physiol.)  Tonicity; as, arterial tone. 7. State of mind; temper; mood. The strange situation I am in and the melancholy state of public affairs, . . . drag the mind down . . . from a philosophical tone or temper, to the drudgery of private and public business. Bolingbroke. Their tone was dissatisfied, almost menacing. W. C. Bryant. 8. Tenor; character; spirit; drift; as, the tone of his remarks was commendatory. 9. General or prevailing character or style, as of morals, manners, or sentiment, in reference to a scale of high and low; as, a low tone of morals; a tone of elevated sentiment; a courtly tone of manners. 10. The general effect of a picture produced by the combination of light and shade, together with color in the case of a painting; -- commonly used in a favorable sense; as, this picture has tone. Tone color. (Mus.) see the Note under def. 4, above. -- Tone syllable, an accented syllable. M. Stuart.\n\n1. To utter with an affected tone. 2. To give tone, or a particular tone, to; to tune. See Tune, v. t. 3. (Photog.)  To bring, as a print, to a certain required shade of color, as by chemical treatment. To tone down. (a) To cause to give lower tone or sound; to give a lower tone to. (b) (Paint.) To modify, as color, by making it less brilliant or less crude; to modify, as a composition of color, by making it more harmonius. Its thousand hues toned down harmoniusly. C. Kingsley. (c) Fig.: To moderate or relax; to diminish or weaken the striking characteristics of; to soften. The best method for the purpose in hand was to employ some one of a character and position suited to get possession of their confidence, and then use it to tone down their religious strictures. Palfrey. -- To tone up, to cause to give a higher tone or sound; to give a higher tone to; to make more intense; to heighten; to strengthen."}