{"word":"tooth","definition":"1. (Anat.)  One of the hard, bony appendages which are borne on the jaws, or on other bones in the walls of the mouth or pharynx of most vertebrates, and which usually aid in the prehension and mastication of food. Note: The hard parts of teeth are principally made up of dentine, or ivory, and a very hard substance called enamel. These are variously combined in different animals. Each tooth consist of three parts, a crown, or body, projecting above the gum, one or more fangs imbedded in the jaw, and the neck, or intermediate part. In some animals one or more of the teeth are modified into tusks which project from the mouth, as in both sexes of the elephant and of the walrus, and in the male narwhal. In adult man there are thirty-two teeth, composed largely of dentine, but the crowns are covered with enamel, and the fangs with a layer of bone called cementum. Of the eight teeth on each half of each jaw, the two in front are incisors, then come one canine, cuspid, or dog tooth, two bicuspids, or false molars, and three molars, or grinding teeth. The milk, or temporary, teeth are only twenty in number, there being two incisors, one canine, and two molars on each half of each jaw. The last molars, or wisdom teeth, usually appear long after the others, and occasionally do not appear above the jaw at all. How sharper than a serpent's tooth it is To have a thankless child ! Shak. 2. Fig.: Taste; palate. These are not dishes for thy dainty tooth. Dryden. 3. Any projection corresponding to the tooth of an animal, in shape, position, or office; as, the teeth, or cogs, of a cogwheel; a tooth, prong, or tine, of a fork; a tooth, or the teeth, of a rake, a saw, a file, a card. 4. (a) A projecting member resembling a tenon, but fitting into a mortise that is only sunk, not pierced through. (b) One of several steps, or offsets, in a tusk. See Tusk. 5. (Nat. Hist.)  An angular or prominence on any edge; as, a tooth on the scale of a fish, or on a leaf of a plant; specifically (Bot.),  one of the appendages at the mouth of the capsule of a moss. See Peristome. 6. (Zoöl.)  Any hard calcareous or chitinous organ found in the mouth of various invertebrates and used in feeding or procuring food; as, the teeth of a mollusk or a starfish. In spite of the teeth, in defiance of opposition; in opposition to every effort. -- In the teeth, directly; in direct opposition; in front. \"Nor strive with all the tempest in my teeth.\" Pope. -- To cast in the teeth, to report reproachfully; to taunt or insult one with. -- Tooth and nail, as if by biting and scratching; with one's utmost power; by all possible means. L'Estrange. \"I shall fight tooth and nail for international copyright.\" Charles Reade. -- Tooth coralline (Zoöl.), any sertularian hydroid. -- Tooth edge, the sensation excited in the teeth by grating sounds, and by the touch of certain substances, as keen acids. -- Tooth key, an instrument used to extract teeth by a motion resembling that of turning a key. -- Tooth net, a large fishing net anchored. [Scot.] Jamieson. -- Tooth ornament. (Arch.) Same as Dogtooth, n., 2.Tooth paste, a paste for cleaning the teeth; a dentifrice. -- Tooth powder, a powder for cleaning the teeth; a dentifrice. -- Tooth rash. (Med.) See Red-gum, 1. -- To show the teeth, to threaten. \"When the Law shows her teeth, but dares not bite.\" Young. -- To the teeth, in open opposition; directly to one's face. \"That I shall live, and tell him to his teeth .\" Shak.\n\n1. To furnish with teeth. The twin cards toothed with glittering wire. Wordsworth. 2. To indent; to jag; as, to tooth a saw. 3. To lock into each other. See Tooth, n., 4. Moxon."}