{"word":"top","definition":"1. A child's toy, commonly in the form of a conoid or pear, made to spin on its point, usually by drawing off a string wound round its surface or stem, the motion being sometimes continued by means of a whip. 2. (Rope Making)  A plug, or conical block of wood, with longitudital grooves on its surface, in which the strands of the rope slide in the process of twisting.\n\n1. The highest part of anything; the upper end, edge, or extremity; the upper side or surface; summit; apex; vertex; cover; lid; as, the top of a spire; the top of a house; the top of a mountain; the top of the ground. The star that bids the shepherd fold, Now the top of heaven doth hold. Milton. 2. The utmost degree; the acme; the summit. The top of my ambition is to contribute to that work. Pope. 3. The highest rank; the most honorable position; the utmost attainable place; as, to be at the top of one's class, or at the top of the school. And wears upon hisbaby brow the round And top of sovereignty. Shak. 4. The chief person; the most prominent one. Other . . . aspired to be the top of zealots. Milton. 5. The crown of the head, or the hair upon it; the head. \"From top to toe\" Spenser. All the stored vengeance of Heaven fall On her ungrateful top ! Shak. 6. The head, or upper part, of a plant. The buds . . . are called heads, or tops, as cabbageheads. I. Watts. 7. (Naut.)  A platform surrounding the head of the lower mast and projecting on all sudes. It serves to spead the topmast rigging, thus strengheningthe mast, and also furnishes a convenient standing place for the men aloft. Totten. 8. (Wool Manuf.)  A bundle or ball of slivers of comkbed wool, from which the noils, or dust, have been taken out. 9. Eve; verge; point. [R.] \"He was upon the top of his marriage with Magdaleine.\" Knolles. 10. The part of a cut gem between the girdle, or circumference, and the table, or flat upper surface. Knight. 11. pl.  Top-boots. [Slang] Dickens. Note: Top is often used adjectively or as the first part of compound words, usually self-explaining; as, top stone, or topstone; top- boots, or top boots; top soil, or top-soil. Top and but (Shipbuilding), a phrase used to denote a method of working long tapering planks by bringing the but of one plank to the top of the other to make up a constant breadth in two layers. -- Top minnow (Zoöl.), a small viviparous fresh-water fish (Gambusia patruelis) abundant in the Southern United States. Also applied to other similar species.\n\n1. To rise aloft; to be eminent; to tower; as, lofty ridges and topping mountains. Derham. 2. To predominate; as, topping passions. \"Influenced by topping uneasiness.\" Locke. 3. To excel; to rise above others. But write thy, and top. Dryden.\n\n1. To cover on the top; to tip; to cap; -- chiefly used in the past participle. Like moving mountains topped with snow. Waller. A mount Of alabaster, topped with golden spires. Milton. 2. To rise above; to excel; to outgo; to surpass. Topping all others in boasting. Shak. Edmund the base shall top the legitimate. Shak. 3. To rise to the top of; to go over the top of. But wind about till thou hast topped the hill. Denham. 4. To take off the or upper part of; to crop. Top your rose trees a little with your knife. Evelyn. 5. To perform eminently, or better than before. From endeavoring universally to top their parts, they will go universally beyond them. Jeffrey. 6. (Naut.)  To raise one end of, as a yard, so that that end becomes higher than the other. To top off, to complete by putting on, or finishing, the top or uppermost part of; as, to top off a stack of hay; hence, to complete; to finish; to adorn."}