{"word":"torpedo","definition":"1. (Zoöl.)  Any one of numerous species of elasmobranch fishes belonging to Torpedo and allied genera. They are related to the rays, but have the power of giving electrical shocks. Called also crampfish, and numbfish. See Electrical fish, under Electrical. Note: The common European torpedo (T. vulgaris) and the American species (T. occidentalis) are the best known. 2. An engine or machine for destroying ships by blowing them up. Specifically: -- (a) A quantity of explosives anchored in a channel, beneath the water, or set adrift in a current, and so arranged that they will be exploded when touched by a vessel, or when an electric circuit is closed by an operator on shore. (b) A kind of small submarine boat carrying an explosive charge, and projected from a ship against another ship at a distance, or made self-propelling, and otherwise automatic in its action against a distant ship. 3. (Mil.)  A kind of shell or cartridge buried in earth, to be exploded by electricity or by stepping on it. 4. (Railroad)  A kind of detonating cartridge or shell placed on a rail, and exploded when crushed under the locomotive wheels, -- used as an alarm signal. 5. An explosive cartridge or shell lowered or dropped into a bored oil well, and there exploded, to clear the well of obstructions or to open communication with a source of supply of oil. 6. A kind of firework in the form of a small ball, or pellet, which explodes when thrown upon a hard object. Fish torpedo, a spindle- shaped, or fish-shaped, self-propelling submarine torpedo. -- Spar torpedo, a canister or other vessel containing an explosive charge, and attached to the end of a long spar which projects from a ship or boat and is thrust against an enemy's ship, exploding the torpedo. -- Torpedo boat, a vessel adapted for carrying, launching, operating, or otherwise making use of, torpedoes against an enemy's ship. -- Torpedo nettings, nettings made of chains or bars, which can be suspended around a vessel and allowed to sink beneath the surface of the water, as a protection against torpedoes.\n\nto destroy by, or subject to the action of, a torpedo. London Spectator."}