{"word":"tower","definition":"1. (Arch.) (a) A mass of building standing alone and insulated, usually higher than its diameter, but when of great size not always of that proportion. (b) A projection from a line of wall, as a fortification, for purposes of defense, as a flanker, either or the same height as the curtain wall or higher. (c) A structure appended to a larger edifice for a special purpose, as for a belfry, and then usually high in proportion to its width and to the height of the rest of the edifice; as, a church tower. 2. A citadel; a fortress; hence, a defense. Thou hast been a shelter for me, and a strong tower from the enemy. Ps. lxi. 3. 3. A headdress of a high or towerlike form, fashionable about the end of the seventeenth century and until 1715; also, any high headdress. Lay trains of amorous intrigues In towers, and curls, and periwigs. Hudibras. 4. High flight; elevation. [Obs.] Johnson. Gay Lussac's tower (Chem.), a large tower or chamber used in the sulphuric acid process, to absorb (by means of concentrated acid) the spent nitrous fumes that they may be returned to the Glover's tower to be reemployed. See Sulphuric acid, under Sulphuric, and Glover's tower, below. -- Glover's tower (Chem.), a large tower or chamber used in the manufacture of sulphuric acid, to condense the crude acid and to deliver concentrated acid charged with nitrous fumes. These fumes, as a catalytic, effect the conversion of sulphurous to sulphuric acid. See Sulphuric acid, under Sulphuric, and Gay Lussac's tower, above. -- Round tower. See under Round, a. -- Shot tower. See under Shot. -- Tower bastion (Fort.), a bastion of masonry, often with chambers beneath, built at an angle of the interior polygon of some works. -- Tower mustard (Bot.), the cruciferous plant Arabis perfoliata. -- Tower of London, a collection of buildings in the eastern part of London, formerly containing a state prison, and now used as an arsenal and repository of various objects of public interest.\n\nTo rise and overtop other objects; to be lofty or very high; hence, to soar. On the other side an high rock towered still. Spenser. My lord protector's hawks do tower so well. Shak.\n\nTo soar into. [Obs.] Milton."}