{"word":"town","definition":"1. Formerly: (a) An inclosure which surrounded the mere homestead or dwelling of the lord of the manor. [Obs.] (b) The whole of the land which constituted the domain. [Obs.] (c) A collection of houses inclosed by fences or walls. [Obs.] Palsgrave. 2. Any number or collection of houses to which belongs a regular market, and which is not a city or the see of a bishop. [Eng.] Johnson. 3. Any collection of houses larger than a village, and not incorporated as a city; also, loosely, any large, closely populated place, whether incorporated or not, in distinction from the country, or from rural communities. God made the country, and man made the town. Cowper. 4. The body of inhabitants resident in a town; as, the town voted to send two representatives to the legislature; the town voted to lay a tax for repairing the highways. 5. A township; the whole territory within certain limits, less than those of a country. [U.S.] 6. The court end of London;-commonly with the. 7. The metropolis or its inhabitants; as, in winter the gentleman lives in town; in summer, in the country. Always hankering after the diversions of the town. Addison. Stunned with his giddy larum half the town. Pope. Note: The same form of expressions is used in regard to other populous towns. 8. A farm or farmstead; also, a court or farmyard. [Prov. Eng.& Scot.] Note: Town is often used adjectively or in combination with other words; as, town clerk, or town-clerk; town-crier, or town crier; townhall, town-hall, or town hall; townhouse, town house, or town- house. Syn. -- Village; hamlet. See Village. Town clerk, an office who keeps the records of a town, and enters its official proceedings. See Clerk. -- Town cress (Bot.), the garden cress, or peppergrass. Dr. Prior. -- Town house. (a) A house in town, in distinction from a house in the country. (b) See Townhouse. -- Town meeting, a legal meeting of the inhabitants of a town entitled to vote, for the transaction of public bisiness. [U.S.] -- Town talk, the common talk of a place; the subject or topic of common conversation."}