{"word":"train","definition":"1. To draw along; to trail; to drag. In hollow cube Training his devilish enginery. Milton. 2. To draw by persuasion, artifice, or the like; to attract by stratagem; to entice; to allure. [Obs.] If but a dozen French Were there in arms, they would be as a call To train ten thousand English to their side. Shak. O, train me not, sweet mermaid, with thy note. Shak. This feast, I'll gage my life, Is but a plot to train you to your ruin. Ford. 3. To teach and form by practice; to educate; to exercise; to discipline; as, to train the militia to the manual exercise; to train soldiers to the use of arms. Our trained bands, which are the trustiest and most proper strength of a free nation. Milton. The warrior horse here bred he's taught to train. Dryden. 4. To break, tame, and accustom to draw, as oxen. 5. (Hort.)  To lead or direct, and form to a wall or espalier; to form to a proper shape, by bending, lopping, or pruning; as, to train young trees. He trained the young branches to the right hand or to the left. Jeffrey. 6. (Mining)  To trace, as a lode or any mineral appearance, to its head. To train a gun (Mil. & Naut.), to point it at some object either forward or else abaft the beam, that is, not directly on the side. Totten. -- To train, or To train up, to educate; to teach; to form by instruction or practice; to bring up. Train up a child in the way he should go; and when he is old, he will not depart from it. Prov. xxii. 6. The first Christians were, by great hardships, trained up for glory. Tillotson.\n\n1. To be drilled in military exercises; to do duty in a military company. 2. To prepare by exercise, diet, instruction, etc., for any physical contest; as, to train for a boat race.\n\n1. That which draws along; especially, persuasion, artifice, or enticement; allurement. [Obs.] \"Now to my charms, and to my wily trains.\" Milton. 2. Hence, something tied to a lure to entice a hawk; also, a trap for an animal; a snare. Halliwell. With cunning trains him to entrap un wares. Spenser. 3. That which is drawn along in the rear of, or after, something; that which is in the hinder part or rear. Specifically : -- (a) That part of a gown which trails behind the wearer. (b) (Mil.) The after part of a gun carriage; the trail. (c) The tail of a bird. \"The train steers their flights, and turns their bodies, like the rudder of ship.\" Ray. 4. A number of followers; a body of attendants; a retinue; a suite. The king's daughter with a lovely train. Addison. My train are men of choice and rarest parts. Shak. 5. A consecution or succession of connected things; a series. \"A train of happy sentiments.\" I. Watts. The train of ills our love would draw behind it. Addison. Rivers now Stream and perpetual draw their humid train. Milton. Other truths require a train of ideas placed in order. Locke. 6. Regular method; process; course; order; as, things now in a train for settlement. If things were once in this train, . . . our duty would take root in our nature. Swift. 7. The number of beats of a watch in any certain time. 8. A line of gunpowder laid to lead fire to a charge, mine, or the like. 9. A connected line of cars or carriages on a railroad. 10. A heavy, long sleigh used in Canada for the transportation of merchandise, wood, and the like. 11. (Rolling Mill)  A roll train; as, a 12-inch train. Roll train, or Train of rolls (Rolling Mill), a set of plain or grooved rolls for rolling metal into various forms by a series of consecutive operations. -- Train mile (Railroads), a unit employed in estimating running expenses, etc., being one of the total number of miles run by all the trains of a road, or system of roads, as within a given time, or for a given expenditure; -- called also mile run. -- Train of artillery, any number of cannon, mortars, etc., with the attendants and carriages which follow them into the field. Campbell (Dict. Mil. Sci.). -- Train of mechanism, a series of moving pieces, as wheels and pinions, each of which is follower to that which drives it, and driver to that which follows it. -- Train road, a slight railway for small cars, -- used for construction, or in mining. -- Train tackle (Naut.), a tackle for running guns in and out. Syn. -- Cars. -- Train, Cars. Train is the word universally used in England with reference to railroad traveling; as, I came in the morning train. In the United States, the phrase the cars has been extensively introduced in the room of train; as, the cars are late; I came in the cars. The English expression is obviously more appropriate, and is prevailing more and more among Americans, to the exclusion of the cars."}