{"word":"trail","definition":"1. To hunt by the track; to track. Halliwell. 2. To draw or drag, as along the ground. And hung his head, and trailed his legs along. Dryden. They shall not trail me through their streets Like a wild beast. Milton. Long behind he trails his pompous robe. Pope. 3. (Mil.)  To carry, as a firearm, with the breech near the ground and the upper part inclined forward, the piece being held by the right hand near the middle. 4. To tread down, as grass, by walking through it; to lay flat. Longfellow. 5. To take advantage of the ignorance of; to impose upon. [Prov. Eng.] I presently perceived she was (what is vernacularly termed) trailing Mrs. Dent; that is, playing on her ignorance. C. Bronte.\n\n1. To be drawn out in length; to follow after. When his brother saw the red blood trail. Spenser. 2. To grow to great length, especially when slender and creeping upon the ground, as a plant; to run or climb.\n\n1. A track left by man or beast; a track followed by the hunter; a scent on the ground by the animal pursued; as, a deer trail. They traveled in the bed of the brook, leaving no dangerous trail. Cooper. How cheerfully on the false trail they cry! Shak. 2. A footpath or road track through a wilderness or wild region; as, an Indian trail over the plains. 3. Anything drawn out to a length; as, the trail of a meteor; a trail of smoke. When lightning shoots in glittering trails along. Rowe. 4. Anything drawn behind in long undulations; a train. \"A radiant trail of hair.\" Pope. 5. Anything drawn along, as a vehicle. [Obs.] 6. A frame for trailing plants; a trellis. [Obs.] 7. The entrails of a fowl, especially of game, as the woodcock, and the like; -- applied also, sometimes, to the entrails of sheep. The woodcock is a favorite with epicures, and served with its trail in, is a delicious dish. Baird. 8. (Mil.)  That part of the stock of a gun carriage which rests on the ground when the piece is unlimbered. See Illust. of Gun carriage, under Gun. 9. The act of taking advantage of the ignorance of a person; an imposition. [Prov. Eng.] Trail boards (Shipbuilding), the carved boards on both sides of the cutwater near the figurehead. -- Trail net, a net that is trailed or drawn behind a boat. Wright."}