{"word":"transit","definition":"1. The act of passing; passage through or over. In France you are now . . . in the transit from one form of government to another. Burke. 2. The act or process of causing to pass; conveyance; as, the transit of goods through a country. 3. A line or route of passage or conveyance; as, the Nicaragua transit. E. G. Squier. 4. (Astron.) (a) The passage of a heavenly body over the meridian of a place, or through the field of a telescope. (b) The passage of a smaller body across the disk of a larger, as of Venus across the sun's disk, or of a satellite or its shadow across the disk of its primary. 5. An instrument resembling a theodolite, used by surveyors and engineers; -- called also transit compass, and surveyor's transit. Note: The surveyor's transit differs from the theodolite in having the horizontal axis attached directly to the telescope which is not mounted in Y's and can be turned completely over about the axis. Lower transit (Astron.), the passage of a heavenly body across that part of the meridian which is below the polar axis. -- Surveyor's transit. See Transit, 5, above. -- Transit circle (Astron.), a transit instrument with a graduated circle attached, used for observing the time of transit and the declination at one observation. See Circle, n., 3. -- Transit compass. See Transit, 5, above. -- Transit duty, a duty paid on goods that pass through a country. -- Transit instrument. (Astron.) (a) A telescope mounted at right angles to a horizontal axis, on which it revolves with its line of collimation in the plane of the meridian, -- used in connection with a clock for observing the time of transit of a heavenly body over the meridian of a place. (b) (Surv.) A surveyor's transit. See Transit, 5, above. -- Transit trade (Com.), the business conected with the passage of goods through a country to their destination. -- Upper transit (Astron.), the passage of a heavenly body across that part of the meridian which is above the polar axis.\n\nTo pass over the disk of (a heavenly body)."}