{"word":"transfer","definition":"1. To convey from one place or person another; to transport, remove, or cause to pass, to another place or person; as, to transfer the laws of one country to another; to transfer suspicion. 2. To make over the possession or control of; to pass; to convey, as a right, from one person to another; to give; as, the title to land is transferred by deed. 3. To remove from one substance or surface to another; as, to transfer drawings or engravings to a lithographic stone. Tomlinson. Syn. -- To sell; give; alienate; estrange; sequester.\n\n1. The act of transferring, or the state of being transferred; the removal or conveyance of a thing from one place or person to another. 2. (Law)  The conveyance of right, title, or property, either real or personal, from one person to another, whether by sale, by gift, or otherwise. I shall here only consider it as a transfer of property. Burke. 3. That which is transferred. Specifically: -- (a) A picture, or the like, removed from one body or ground to another, as from wood to canvas, or from one piece of canvas to another. Fairholt. (b) A drawing or writing printed off from one surface on another, as in ceramics and in many decorative arts. (c) (Mil.) A soldier removed from one troop, or body of troops, and placed in another. 4. (Med.)  A pathological process by virtue of which a unilateral morbid condition on being abolished on one side of the body makes its appearance in the corresponding region upon the other side. Transfer day, one of the days fixed by the Bank of England for the transfer, free of charge, of bank stock and government funds. These days are the first five business days in the week before three o'clock. Transfers may be made on Saturdays on payment of a fee of 2s. 6d. Bithell. -- Transfer office, an office or department where transfers of stocks, etc., are made. -- Transfer paper, a prepared paper used by draughtsmen, engravers, lithographers, etc., for transferring impressions. -- Transfer table. (Railroad) Same as Traverse table. See under Traverse."}