{"word":"trap","definition":"To dress with ornaments; to adorn; -- said especially of horses. Steeds . . . that trapped were in steel all glittering. Chaucer. To deck his hearse, and trap his tomb-black steed. Spenser. There she found her palfrey trapped In purple blazoned with armorial gold. Tennyson.\n\nAn old term rather loosely used to designate various dark- colored, heavy igneous rocks, including especially the feldspathic- augitic rocks, basalt, dolerite, amygdaloid, etc., but including also some kinds of diorite. Called also trap rock. Trap tufa, Trap tuff, a kind of fragmental rock made up of fragments and earthy materials from trap rocks.\n\nOf or pertaining to trap rock; as, a trap dike.\n\n1. A machine or contrivance that shuts suddenly, as with a spring, used for taking game or other animals; as, a trap for foxes. She would weep if that she saw a mouse Caught in a trap. Chaucer. 2. Fig.: A snare; an ambush; a stratagem; any device by which one may be caught unawares. Let their table be made a snare and a trap. Rom. xi. 9. God and your majesty Protect mine innocence, or I fall into The trap is laid for me! Shak. 3. A wooden instrument shaped somewhat like a shoe, used in the game of trapball. It consists of a pivoted arm on one end of which is placed the ball to be thrown into the air by striking the other end. Also, a machine for throwing into the air glass balls, clay pigeons, etc., to be shot at. 4. The game of trapball. 5. A bend, sag, or partitioned chamber, in a drain, soil pipe, sewer, etc., arranged so that the liquid contents form a seal which prevents passage of air or gas, but permits the flow of liquids. 6. A place in a water pipe, pump, etc., where air accumulates for want of an outlet. 7. A wagon, or other vehicle. [Colloq.] Thackeray. 8. A kind of movable stepladder. Knight. Trap stairs, a staircase leading to a trapdoor. -- Trap tree (Bot.) the jack; -- so called because it furnishes a kind of birdlime. See 1st Jack.\n\n1. To catch in a trap or traps; as, to trap foxes. 2. Fig.: To insnare; to take by stratagem; to entrap. \"I trapped the foe.\" Dryden. 3. To provide with a trap; to trap a drain; to trap a sewer pipe. See 4th Trap, 5.\n\nTo set traps for game; to make a business of trapping game; as, to trap for beaver."}