{"word":"traverse","definition":"Lying across; being in a direction across something else; as, paths cut with traverse trenches. Oak . . . being strong in all positions, may be better trusted in cross and traverse work. Sir H. Wotton. The ridges of the fallow field traverse. Hayward. Traverse drill (Mach.), a machine tool for drilling slots, in which the work or tool has a lateral motion back and forth; also, a drilling machine in which the spindle holder can be adjusted laterally.\n\nAthwart; across; crosswise.\n\n1. Anything that traverses, or crosses. Specifically: -- (a) Something that thwarts, crosses, or obstructs; a cross accident; as, he would have succeeded, had it not been for unlucky traverses not under his control. (b) A barrier, sliding door, movable screen, curtain, or the like. Men drinken and the travers draw anon. Chaucer. And the entrance of the king, The first traverse was drawn. F. Beaumont. (c) (Arch.)  A gallery or loft of communication from side to side of a church or other large building. Gwilt. (d) (Fort.) A work thrown up to intercept an enfilade, or reverse fire, along exposed passage, or line of work. (e) (Law) A formal denial of some matter of fact alleged by the opposite party in any stage of the pleadings. The technical words introducing a traverse are absque hoc, without this; that is, without this which follows. (f) (Naut.) The zigzag course or courses made by a ship in passing from one place to another; a compound course. (g) (Geom.) A line lying across a figure or other lines; a transversal. (h) (Surv.) A line surveyed across a plot of ground. (i) (Gun.) The turning of a gun so as to make it point in any desired direction. 2. A turning; a trick; a subterfuge. [Obs.] To work, or solve, a traverse (Naut.), to reduce a series of courses or distances to an equivalent single one; to calculate the resultant of a traverse. -- Traverse board (Naut.), a small board hung in the steerage, having the points of the compass marked on it, and for each point as many holes as there are half hours in a watch. It is used for recording the courses made by the ship in each half hour, by putting a peg in the corresponding hole. -- Traverse jury (Law), a jury that tries cases; a petit jury. -- Traverse sailing (Naut.), a sailing by compound courses; the method or process of finding the resulting course and distance from a series of different shorter courses and distances actually passed over by a ship. -- Traverse table. (a) (Naut. & Surv.) A table by means of which the difference of latitude and departure corresponding to any given course and distance may be found by inspection. It contains the lengths of the two sides of a right-angled triangle, usually for every quarter of a degree of angle, and for lengths of the hypothenuse, from 1 to 100. (b) (Railroad) A platform with one or more tracks, and arranged to move laterally on wheels, for shifting cars, etc., from one line of track to another.\n\n1. To lay in a cross direction; to cross. The parts should be often traversed, or crossed, by the flowing of the folds. Dryden. 2. To cross by way of opposition; to thwart with obstacles; to obstruct; to bring to naught. I can not but . . . admit the force of this reasoning, which I yet hope to traverse. Sir W. Scott. 3. To wander over; to cross in traveling; as, to traverse the habitable globe. What seas you traversed, and what fields you fought. Pope. 4. To pass over and view; to survey carefully. My purpose is to traverse the nature, principles, and properties of this detestable vice -- ingratitude. South. 5. (Gun.)  To turn to the one side or the other, in order to point in any direction; as, to traverse a cannon. 6. (Carp.)  To plane in a direction across the grain of the wood; as, to traverse a board. 7. (Law)  To deny formally, as what the opposite party has alleged. When the plaintiff or defendant advances new matter, he avers it to be true, and traverses what the other party has affirmed. To traverse an indictment or an office is to deny it. And save the expense of long litigious laws, Where suits are traversed, and so little won That he who conquers is but last undone. Dryden. To traverse a yard (Naut.), to brace it fore and aft.\n\n1. To use the posture or motions of opposition or counteraction, as in fencing. To see thee fight, to see thee foin, to see thee traverse. Shak. 2. To turn, as on a pivot; to move round; to swivel; as, the needle of a compass traverses; if it does not traverse well, it is an unsafe guide. 3. To tread or move crosswise, as a horse that throws his croup to one side and his head to the other."}