{"word":"tree","definition":"1. (Bot.)  Any perennial woody plant of considerable size (usually over twenty feet high) and growing with a single trunk. Note: The kind of tree referred to, in any particular case, is often indicated by a modifying word; as forest tree, fruit tree, palm tree, apple tree, pear tree, etc. 2. Something constructed in the form of, or considered as resembling, a tree, consisting of a stem, or stock, and branches; as, a genealogical tree. 3. A piece of timber, or something commonly made of timber; -- used in composition, as in axletree, boottree, chesstree, crosstree, whiffletree, and the like. 4. A cross or gallows; as Tyburn tree. [Jesus] whom they slew and hanged on a tree. Acts x. 39. 5. Wood; timber. [Obs.] Chaucer. In a great house ben not only vessels of gold and of silver but also of tree and of earth. Wyclif (2 Tim. ii. 20). 6. (Chem.)  A mass of crystals, aggregated in arborescent forms, obtained by precipitation of a metal from solution. See Lead tree, under Lead. Tree bear (Zoöl.), the raccoon. [Local, U.S.] -- Tree beetle (Zoöl.) any one of numerous species of beetles which feed on the leaves of trees and shrubs, as the May beetles, the rose beetle, the rose chafer, and the goldsmith beetle. -- Tree bug (Zoöl.), any one of numerous species of hemipterous insects which live upon, and suck the sap of, trees and shrubs. They belong to Arma, Pentatoma, Rhaphigaster, and allied genera. -- Tree cat (Zool.), the common paradoxure (Paradoxurus musang). -- Tree clover (Bot.), a tall kind of melilot (Melilotus alba). See Melilot. -- Tree crab (Zoöl.), the purse crab. See under Purse. -- Tree creeper (Zoöl.), any one of numerous species of arboreal creepers belonging to Certhia, Climacteris, and allied genera. See Creeper, 3. -- Tree cricket (Zoöl.), a nearly white arboreal American cricket (Ecanthus nivoeus) which is noted for its loud stridulation; -- called also white cricket. -- Tree crow (Zoöl.), any one of several species of Old World crows belonging to Crypsirhina and allied genera, intermediate between the true crows and the jays. The tail is long, and the bill is curved and without a tooth. -- Tree dove (Zoöl.) any one of several species of East Indian and Asiatic doves belonging to Macropygia and allied genera. They have long and broad tails, are chiefly arboreal in their habits, and feed mainly on fruit. -- Tree duck (Zoöl.), any one of several species of ducks belonging to Dendrocygna and allied genera. These ducks have a long and slender neck and a long hind toe. They are arboreal in their habits, and are found in the tropical parts of America, Africa, Asia, and Australia. -- Tree fern (Bot.), an arborescent fern having a straight trunk, sometimes twenty or twenty-five feet high, or even higher, and bearing a cluster of fronds at the top. Most of the existing species are tropical. -- Tree fish (Zoöl.), a California market fish (Sebastichthys serriceps). -- Tree frog. (Zoöl.) (a) Same as Tree toad. (b) Any one of numerous species of Old World frogs belonging to Chiromantis, Rhacophorus, and allied genera of the family Ranidæ. Their toes are furnished with suckers for adhesion. The flying frog (see under Flying) is an example. -- Tree goose (Zoöl.), the bernicle goose. -- Tree hopper (Zoöl.), any one of numerous species of small leaping hemipterous insects which live chiefly on the branches and twigs of trees, and injure them by sucking the sap. Many of them are very odd in shape, the prothorax being often prolonged upward or forward in the form of a spine or crest. -- Tree jobber (Zoöl.), a woodpecker. [Obs.] -- Tree kangaroo. (Zoöl.) See Kangaroo. -- Tree lark (Zoöl.), the tree pipit. [Prov. Eng.] -- Tree lizard (Zoöl.), any one of a group of Old World arboreal lizards (Dendrosauria) comprising the chameleons. -- Tree lobster. (Zoöl.) Same as Tree crab, above. -- Tree louse (Zoöl.), any aphid; a plant louse. -- Tree moss. (Bot.) (a) Any moss or lichen growing on trees. (b) Any species of moss in the form of a miniature tree. -- Tree mouse (Zoöl.), any one of several species of African mice of the subfamily Dendromyinæ. They have long claws and habitually live in trees. -- Tree nymph, a wood nymph. See Dryad. -- Tree of a saddle, a saddle frame. -- Tree of heaven (Bot.), an ornamental tree (Ailantus glandulosus) having long, handsome pinnate leaves, and greenish flowers of a disagreeable odor. -- Tree of life (Bot.), a tree of the genus Thuja; arbor vitæ. -- Tree onion (Bot.), a species of garlic (Allium proliferum) which produces bulbs in place of flowers, or among its flowers. -- Tree oyster (Zoöl.), a small American oyster (Ostrea folium) which adheres to the roots of the mangrove tree; -- called also raccoon oyster. -- Tree pie (Zoöl.), any species of Asiatic birds of the genus Dendrocitta. The tree pies are allied to the magpie. -- Tree pigeon (Zoöl.), any one of numerous species of longwinged arboreal pigeons native of Asia, Africa, and Australia, and belonging to Megaloprepia, Carpophaga, and allied genera. -- Tree pipit. (Zoöl.) See under Pipit. -- Tree porcupine (Zoöl.), any one of several species of Central and South American arboreal porcupines belonging to the genera Chætomys and Sphingurus. They have an elongated and somewhat prehensile tail, only four toes on the hind feet, and a body covered with short spines mixed with bristles. One South American species (S. villosus) is called also couiy; another (S. prehensilis) is called also coendou. -- Tree rat (Zoöl.), any one of several species of large ratlike West Indian rodents belonging to the genera Capromys and Plagiodon. They are allied to the porcupines. -- Tree serpent (Zoöl.), a tree snake. -- Tree shrike (Zoöl.), a bush shrike. -- Tree snake (Zoöl.), any one of numerous species of snakes of the genus Dendrophis. They live chiefly among the branches of trees, and are not venomous. -- Tree sorrel (Bot.), a kind of sorrel (Rumex Lunaria) which attains the stature of a small tree, and bears greenish flowers. It is found in the Canary Islands and Teneriffe. -- Tree sparrow (Zoöl.) any one of several species of small arboreal sparrows, especially the American tree sparrow (Spizella monticola), and the common European species (Passer montanus). -- Tree swallow (Zoöl.), any one of several species of swallows of the genus Hylochelidon which lay their eggs in holes in dead trees. They inhabit Australia and adjacent regions. Called also martin in Australia. -- Tree swift (Zoöl.), any one of several species of swifts of the genus Dendrochelidon which inhabit the East Indies and Southern Asia. -- Tree tiger (Zoöl.), a leopard. -- Tree toad (Zoöl.), any one of numerous species of amphibians belonging to Hyla and allied genera of the family Hylidæ. They are related to the common frogs and toads, but have the tips of the toes expanded into suckers by means of which they cling to the bark and leaves of trees. Only one species (Hyla arborea) is found in Europe, but numerous species occur in America and Australia. The common tree toad of the Northern United States (H. versicolor) is noted for the facility with which it changes its colors. Called also tree frog. See also Piping frog, under Piping, and Cricket frog, under Cricket. -- Tree warbler (Zoöl.), any one of several species of arboreal warblers belonging to Phylloscopus and allied genera. -- Tree wool (Bot.), a fine fiber obtained from the leaves of pine trees.\n\n1. To drive to a tree; to cause to ascend a tree; as, a dog trees a squirrel. J. Burroughs. 2. To place upon a tree; to fit with a tree; to stretch upon a tree; as, to tree a boot. See Tree, n., 3."}