{"word":"trim","definition":"1. To make trim; to put in due order for any purpose; to make right, neat, or pleasing; to adjust. The hermit trimmed his little fire. Goldsmith. 2. To dress; to decorate; to adorn; to invest; to embellish; as, to trim a hat. trim a Christmas tree. A rotten building newly trimmed over. Milton. I was trimmed in Julia's gown. Shak. 3. To make ready or right by cutting or shortening; to clip or lop; to curtail; as, to trim the hair; to trim a tree. \" And trimmed the cheerful lamp.\" Byron. 4. (Carp.)  To dress, as timber; to make smooth. 5. (Naut.) (a) To adjust, as a ship, by arranging the cargo, or disposing the weight of persons or goods, so equally on each side of the center and at each end, that she shall sit well on the water and sail well; as, to trim a ship, or a boat. (b) To arrange in due order for sailing; as, to trim the sails. 6. To rebuke; to reprove; also, to beat. [Colloq.] To trim in (Carp.), to fit, as a piece of timber, into other work. -- To trim up, to dress; to put in order. I found her trimming up the diadem On her dead mistress. Shak.\n\nTo balance; to fluctuate between parties, so as to appear to favor each.\n\n1. Dress; gear; ornaments. Seeing him just pass the window in his woodland trim. Sir W. Scott. 2. Order; disposition; condition; as, to be in good trim. \" The trim of an encounter.\" Chapman. 3. The state of a ship or her cargo, ballast, masts, etc., by which she is well prepared for sailing. 4. (Arch)  The lighter woodwork in the interior of a building; especially, that used around openings, generally in the form of a molded architrave, to protect the plastering at those points. In ballast trim (Naut.), having only ballast on board. R. H. Dana, Jr. -- Trim of the masts (Naut.), their position in regard to the ship and to each other, as near or distant, far forward or much aft, erect or raking. -- Trim of sails (Naut.), that adjustment, with reference to the wind, witch is best adapted to impel the ship forward.\n\nFitly adjusted; being in good order., or made ready for service or use; firm; compact; snug; neat; fair; as, the ship is trim, or trim built; everything about the man is trim; a person is trim when his body is well shaped and firm; his dress is trim when it fits closely to his body, and appears tight and snug; a man or a soldier is trim when he stands erect. With comely carriage of her countenance trim. Spenser. So deemed I till I viewed their trim array Of boats last night. Trench."}