{"word":"trip","definition":"1. To move with light, quick steps; to walk or move lightly; to skip; to move the feet nimbly; -- sometimes followed by it. See It, 5. This horse anon began to trip and dance. Chaucer. Come, and trip it, as you go, On the light fantastic toe. Milton. She bounded by, and tripped so light They had not time to take a steady sight. Dryden. 2. To make a brief journey or pleasure excursion; as, to trip to Europe. 3. To take a quick step, as when in danger of losing one's balance; hence, to make a false; to catch the foot; to lose footing; to stumble. 4. Fig.: To be guilty of a misstep; to commit an offense against morality, propriety, or rule; to err; to mistake; to fail. \"Till his tongue trip.\" Locke. A blind will thereupon comes to be led by a blind understanding; there is no remedy, but it must trip and stumble. South. Virgil is so exact in every word that none can be changed but for a worse; he pretends sometimes to trip, but it is to make you think him in danger when most secure. Dryden. What dost thou verily trip upon a word R. Browning.\n\n1. To cause to stumble, or take a false step; to cause to lose the footing, by striking the feet from under; to cause to fall; to throw off the balance; to supplant; -- often followed by up; as, to trip up a man in wrestling. The words of Hobbes's defense trip up the heels of his cause. Abp. Bramhall. 2. Fig.: To overthrow by depriving of support; to put an obstacle in the way of; to obstruct; to cause to fail. To trip the course of law, and blunt the sword. Shak. 3. To detect in a misstep; to catch; to convict. [R.] These her women can trip me if I err. Shak. 4. (Naut.) (a) To raise (an anchor) from the bottom, by its cable or buoy rope, so that it hangs free. (b) To pull (a yard) into a perpendicular position for lowering it. 5. (Mach.)  To release, let fall, or see free, as a weight or compressed spring, as by removing a latch or detent.\n\n1. A quick, light step; a lively movement of the feet; a skip. His heart bounded as he sometimes could hear the trip of a light female step glide to or from the door. Sir W. Scott. 2. A brief or rapid journey; an excursion or jaunt. I took a trip to London on the death of the queen. Pope. 3. A false step; a stumble; a misstep; a loss of footing or balance. Fig.: An error; a failure; a mistake. Imperfect words, with childish trips. Milton. Each seeming trip, and each digressive start. Harte. 4. A small piece; a morsel; a bit. [Obs.] \"A trip of cheese.\" Chaucer. 5. A stroke, or catch, by which a wrestler causes his antagonist to lose footing. And watches with a trip his foe to foil. Dryden. It is the sudden trip in wrestling that fetches a man to the ground. South. 6. (Naut.)  A single board, or tack, in plying, or beating, to windward. 7. A herd or flock, as of sheep, goats, etc. [Prov. Eng. & Scott.] 8. A troop of men; a host. [Obs.] Robert of Brunne. 9. (Zoöl.)  A flock of widgeons."}