{"word":"trumpet","definition":"1. (Mus.)  A wind instrument of great antiquity, much used in war and military exercises, and of great value in the orchestra. In consists of a long metallic tube, curved (once or twice) into a convenient shape, and ending in a bell. Its scale in the lower octaves is limited to the first natural harmonics; but there are modern trumpets capable, by means of valves or pistons, of producing every tone within their compass, although at the expense of the true ringing quality of tone. The trumpet's loud clangor Excites us to arms. Dryden. 2. (Mil.)  A trumpeter. Clarendon. 3. One who praises, or propagates praise, or is the instrument of propagating it. Shak. That great politician was pleased to have the greatest wit of those times . . . to be the trumpet of his praises. Dryden. 4. (Mach)  A funnel, or short, fiaring pipe, used as a guide or conductor, as for yarn in a knitting machine. Ear trumpet. See under Ear. -- Sea trumpet (Bot.), a great seaweed (Ecklonia buccinalis) of the Southern Ocean. It has a long, hollow stem, enlarging upwards, which may be made into a kind of trumpet, and is used for many purposes. -- Speaking trumpet, an instrument for conveying articulate sounds with increased force. -- Trumpet animalcule (Zoöl.), any infusorian belonging to Stentor and allied genera, in which the body is trumpet-shaped. See Stentor. -- Trumpet ash (Bot.), the trumpet creeper. [Eng.] -- Trumpet conch (Zoöl.), a trumpet shell, or triton. -- Trumpet creeper (Bot.), an American climbing plant (Tecoma radicans) bearing clusters of large red trumpet-shaped flowers; -- called also trumpet flower, and in England trumpet ash. -- Trumpet fish. (Zoöl.) (a) The bellows fish. (b) The fistularia. -- Trumpet flower. (Bot.) (a) The trumpet creeper; also, its blossom. (b) The trumpet honeysuckle. (c) A West Indian name for several plants with trumpet-shaped flowers. -- Trumpet fly (Zoöl.), a botfly. -- Trumpet honeysuckle (Bot.), a twining plant (Lonicera sempervirens) with red and yellow trumpet-shaped flowers; -- called also trumpet flower. -- Trumpet leaf (Bot.), a name of several plants of the genus Sarracenia. -- Trumpet major (Mil.), the chief trumpeter of a band or regiment. -- Trumpet marine (Mus.), a monochord, having a thick string, sounded with a bow, and stopped with the thumb so as to produce the harmonic tones; -- said to be the oldest bowed instrument known, and in form the archetype of all others. It probably owes its name to \"its external resemblance to the large speaking trumpet used on board Italian vessels, which is of the same length and tapering shape.\" Grove. -- Trumpet shell (Zoöl.), any species of large marine univalve shells belonging to Triton and allied genera. See Triton, 2. -- Trumpet tree. (Bot.) See Trumpetwood.\n\nTo publish by, or as by, sound of trumpet; to noise abroad; to proclaim; as, to trumpet good tidings. They did nothing but publish and trumpet all the reproaches they could devise against the Irish. Bacon.\n\nTo sound loudly, or with a tone like a trumpet; to utter a trumplike cry."}