{"word":"twin","definition":"1. Being one of two born at a birth; as, a twin brother or sister. 2. Being one of a pair much resembling one another; standing the relation of a twin to something else; -- often followed by to or with. Shak. 3. (Bot.)  Double; consisting of two similar and corresponding parts. 4. (Crystallog.)  Composed of parts united according to some definite law of twinning. See Twin, n., 4. Twin boat, or Twin ship (Naut.), a vessel whose deck and upper works rest on two parallel hulls. -- Twin crystal. See Twin, n., 4. -- Twin flower (Bot.), a delicate evergreen plant (Linnæa borealis) of northern climates, which has pretty, fragrant, pendulous flowers borne in pairs on a slender stalk. -- Twin-screw steamer, a steam vessel propelled by two screws, one on either side of the plane of the keel.\n\n1. One of two produced at a birth, especially by an animal that ordinarily brings forth but one at a birth; -- used chiefly in the plural, and applied to the young of beasts as well as to human young. 2. pl. (Astron.)  A sign and constellation of the zodiac; Gemini. See Gemini. 3. A person or thing that closely resembles another. 4. (Crystallog.)  A compound crystal composed of two or more crystals, or parts of crystals, in reversed position with reference to each other. Note: The relative position of the parts of a twin may be explained by supposing one part to be revolved 180º about a certain axis (called the twinning axis), this axis being normal to a plane (called the twinning plane) which is usually one of the fundamental planes of the crystal. This revolution brings the two parts into parallel position, or vice versa. A contact twin is one in which the parts are united by a plane surface, called the composition face, which is usually the same as the twinning plane. A penetration twin is one in which the parts interpenetrate each other, often very irregularly. Twins are also called, according to form, cruciform, geniculated, etc.\n\n1. To bring forth twins. Tusser. 2. To be born at the same birth. Shak.\n\n1. To cause to be twins, or like twins in any way. Shak. Still we moved Together, twinned, as horse's ear and eye. Tennyson. 2. To separate into two parts; to part; to divide; hence, to remove; also, to strip; to rob. [Obs.] The life out of her body for to twin. Chaucer.\n\nTo depart from a place or thing. [Obs.] \"Ere that we farther twin.\" Chaucer."}