{"word":"type","definition":"1. The mark or impression of something; stamp; impressed sign; emblem. The faith they have in tennis, and tall stockings, Short blistered breeches, and those types of travel. Shak. 2. Form or character impressed; style; semblance. Thy father bears the type of king of Naples. Shak. 3. A figure or representation of something to come; a token; a sign; a symbol; -- correlative to antitype. A type is no longer a type when the thing typified comes to be actually exhibited. South. 4. That which possesses or exemplifies characteristic qualities; the representative. Specifically: (a) (Biol.)  A general form or structure common to a number of individuals; hence, the ideal representation of a species, genus, or other group, combining the essential characteristics; an animal or plant possessing or exemplifying the essential characteristics of a species, genus, or other group. Also, a group or division of animals having a certain typical or characteristic structure of body maintained within the group. Since the time of Cuvier and Baer . . . the whole animal kingdom has been universally held to be divisible into a small number of main divisions or types. Haeckel. (b) (Fine Arts)  The original object, or class of objects, scene, face, or conception, which becomes the subject of a copy; esp., the design on the face of a medal or a coin. (c) (Chem.) A simple compound, used as a mode or pattern to which other compounds are conveniently regarded as being related, and from which they may be actually or theoretically derived. Note: The fundamental types used to express the simplest and most essential chemical relations are hydrochloric acid, HCl; water, H2O; ammonia, NH3; and methane, CH4. 5. (Typog.) (a) A raised letter, figure, accent, or other character, cast in metal or cut in wood, used in printing. (b) Such letters or characters, in general, or the whole quantity of them used in printing, spoken of collectively; any number or mass of such letters or characters, however disposed. Note: Type are mostly made by casting type metal in a mold, though some of the larger sizes are made from maple, mahogany, or boxwood. In the cut, a is the body; b, the face, or part from which the impression is taken; c, the shoulder, or top of the body; d, the nick (sometimes two or more are made), designed to assist the compositor in distinguishing the bottom of the face from the top; e, the groove made in the process of finishing, -- each type as cast having attached to the bottom of the body a jet, or small piece of metal (formed by the surplus metal poured into the mold), which, when broken off, leaves a roughness that requires to be removed. The fine lines at the top and bottom of a letter are technically called ceriphs, and when part of the face projects over the body, as in the letter f, the projection is called a kern. The type which compose an ordinary book font consist of Roman CAPITALS, small capitals, and lower-case letters, and Italic CAPITALS and lower-case letters, with accompanying figures, points, and reference marks, -- in all about two hundred characters. Including the various modern styles of fancy type, some three or four hundred varieties of face are made. Besides the ordinary Roman and Italic, some of the most important of the varieties are -- Old English. Black Letter. Old Style. French Elzevir. Boldface. Antique. Clarendon. Gothic. Typewriter. Script. The smallest body in common use is diamond; then follow in order of size, pearl, agate, nonpareil, minion, brevier, bourgeois (or two-line diamond), long primer (or two-line pearl), small pica (or two-line agate), pica (or two-line nonpareil), English (or two-line minion), Columbian (or two- line brevier), great primer (two-line bourgeois), paragon (or two- line long primer), double small pica (or two-line small pica), double pica (or two-line pica), double English (or two-line English), double great primer (or two-line great primer), double paragon (or two-line paragon), canon (or two-line double pica). Above this, the sizes are called five-line pica, six-line pica, seven-line pica, and so on, being made mostly of wood. The following alphabets show the different sizes up to great primer. Brilliant . . abcdefghijklmnopqrstuvwxyz Diamond . . abcdefghijklmnopqrstuvwxyz Pearl . . . abcdefghijklmnopqrstuvwxyz Agate . . . abcdefghijklmnopqrstuvwxyz Nonpareil . . . abcdefghijklmnopqrstuvwxyz Minion . . . abcdefghijklmnopqrstuvwxyz Brevier . . . abcdefghijklmnopqrstuvwxyz Bourgeois . . abcdefghijklmnopqrstuvwxyz Long primer . . . abcdefghijklmnopqrstuvwxyz Small pica . . abcdefghijklmnopqrstuvwxyz Pica . . . . . abcdefghijklmnopqrstuvwxyz English . . . abcdefghijklmnopqrstuvwxyz Columbian . . . abcdefghijklmnopqrstuvwxyz Great primer . . . abcdefghijklmnopqrstuvwxyz The foregoing account is conformed to the designations made use of by American type founders, but is substantially correct for England. Agate, however, is called ruby, in England, where, also, a size intermediate between nonpareil and minion is employed, called emerald. Point system of type bodies (Type Founding), a system adopted by the type founders of the United States by which the various sizes of type have been so modified and changed that each size bears an exact proportional relation to every other size. The system is a modification of a French system, and is based on the pica body. This pica body is divided into twelfths, which are termed \"points,\" and every type body consist of a given number of these points. Many of the type founders indicate the new sizes of type by the number of points, and the old names are gradually being done away with. By the point system type founders cast type of a uniform size and height, whereas formerly fonts of pica or other type made by different founders would often vary slightly so that they could not be used together. There are no type in actual use corresponding to the smaller theoretical sizes of the point system. In some cases, as in that of ruby, the term used designates a different size from that heretofore so called. 1 American 9 Bourgeois | | 1| 2 Saxon 10 Long Primer | | 2| 3 Brilliant 11 Small Pica | | 3| | 4 Excelsior | 4| | 5 Pearl 16 Columbian | | 5| 6 Nonpareil 18 Great Primer | | 7 Minion | 8 Brevier 20 Paragon | | Diagram of the \"points\" by which sizes of Type are graduated in the \"Point System\". Type founder, one who casts or manufacture type. -- Type foundry, Type foundery, a place for the manufacture of type. -- Type metal, an alloy used in making type, stereotype plates, etc., and in backing up electrotype plates. It consists essentially of lead and antimony, often with a little tin, nickel, or copper. -- Type wheel, a wheel having raised letters or characters on its periphery, and used in typewriters, printing telegraphs, etc. -- Unity of type (Biol.), that fundamental agreement in structure which is seen in organic beings of the same class, and is quite independent of their habits of life. Darwin.\n\n1. To represent by a type, model, or symbol beforehand; to prefigure. [R.] White (Johnson). 2. To furnish an expression or copy of; to represent; to typify. [R.] Let us type them now in our own lives. Tennyson."}