{"word":"tyrant","definition":"1. An absolute ruler; a sovereign unrestrained by law or constitution; a usurper of sovereignty. Note: Free governments [in Greece] having superseded the old hereditary sovereignties (basilei^ai), all who obtained absolute power in a state were called ty\\rannoi, tyrants, or rather despots; - - for the term rather regards the irregular way in which the power was gained, whether force or fraud, than the way in which it was exercised, being applied to the mild Pisistratus, but not to the despotic kings of Persia. However, the word soon came to imply reproach, and was then used like our tyrant. Liddell & Scott. 2. Specifically, a monarch, or other ruler or master, who uses power to oppress his subjects; a person who exercises unlawful authority, or lawful authority in an unlawful manner; one who by taxation, injustice, or cruel punishment, or the demand of unreasonable services, imposes burdens and hardships on those under his control, which law and humanity do not authorize, or which the purposes of government do not require; a cruel master; an oppressor. \"This false tyrant, this Nero.\" Chaucer. Love, to a yielding heart, is a king, but to a resisting, is a tyrant. Sir P. Sidney. 3. (Zoöl.)  Any one of numerous species of American clamatorial birds belonging to the family Tyrannidæ; -- called also tyrant bird. Note: These birds are noted for their irritability and pugnacity, and for the courage with which they attack rapacious birds far exceeding them in size and strength. They are mostly plain-colored birds, but often have a bright-colored crown patch. A few species, as the scissorstail, are handsomely colored. The kingbird and pewee are familiar examples. Tyrant flycatcher (Zoöl.), any one of numerous species of tyrants which have a flattened bill, toothed at the tip, and resemble the true flycatchers in habits. The Acadian flycatcher (Empidonax Acadicus) and the vermilion flycatcher (Pyrocephalus rubineus) are examples. -- Tyrant shrike (Zoöl.), any one of numerous species of American tyrants of the genus Tyrannus having a strong toothed bill and resembling the strikes in habits. The kingbird is an example.\n\nTo act like a tyrant; to play the tyrant; to tyrannical. [Obs.] Fuller."}