{"word":"understanding","definition":"Knowing; intelligent; skillful; as, he is an understanding man.\n\n1. The act of one who understands a thing, in any sense of the verb; knowledge; discernment; comprehension; interpretation; explanation. 2. An agreement of opinion or feeling; adjustment of differences; harmony; anything mutually understood or agreed upon; as, to come to an understanding with another. He hoped the loyalty of his subjects would concur with him in the preserving of a good understanding between him and his people. Clarendon. 3. The power to understand; the intellectual faculty; the intelligence; the rational powers collectively conceived an designated; the higher capacities of the intellect; the power to distinguish truth from falsehood, and to adapt means to ends. There is a spirit in man; and the inspiration of the Almighty them understanding. Job xxxii. 8. The power of perception is that which we call the understanding. Perception, which we make the act of the understanding, is of three sorts: 1. The perception of ideas in our mind; 2. The perception of the signification of signs; 3. The perception of the connection or repugnancy, agreement or disagreement, that there is between any of our ideas. All these are attributed to the understanding, or perceptive power, though it be the two latter only that use allows us to say we understand. Locke. In its wider acceptation, understanding is the entire power of perceiving an conceiving, exclusive of the sensibility: the power of dealing with the impressions of sense, and composing them into wholes, according to a law of unity; and in its most comprehensive meaning it includes even simple apprehension. Coleridge. 4. Specifically, the discursive faculty; the faculty of knowing by the medium or use of general conceptions or relations. In this sense it is contrasted with, and distinguished from, the reason. I use the term understanding, not for the noetic faculty, intellect proper, or place of principles, but for the dianoetic or discursive faculty in its widest signification, for the faculty of relations or comparisons; and thus in the meaning in which \"verstand\" is now employed by the Germans. Sir W. Hamilton. Syn. -- Sense; intelligence; perception. See Sense."}