{"word":"universal","definition":"1. Of or pertaining to the universe; extending to, including, or affecting, the whole number, quantity, or space; unlimited; general; all-reaching; all-pervading; as, universal ruin; universal good; universal benevolence or benefice. \"Anointed universal King.\" Milton. The universal cause Acts not by partial, but by general laws. Pope. This universal frame began. Dryden. Note: Universal and its derivatives are used in common discourse for general and its derivatives. See General. 2. Constituting or considered as a whole; total; entire; whole; as, the universal world. Shak. At which the universal host up dent A shout that tore Hell's concave. Milton. 3. (Mech.)  Adapted or adaptable to all or to various uses, shapes, sizes, etc.; as, a universal milling machine. 4. (Logic)  Forming the whole of a genus; relatively unlimited in extension; affirmed or denied of the whole of a subject; as, a universal proposition; -- opposed to particular; e. g. (universal affirmative) All men are animals; (universal negative) No men are omniscient. Universal chuck (Mach.), a chuck, as for a lathe, having jaws which can be moved simultaneously so as to grasp objects of various sizes. -- Universal church, the whole church of God in the world; the catholic church. See the Note under Catholic, a., 1. -- Universal coupling. (Mach.) Same as Universal joint, below. -- Universal dial, a dial by which the hour may be found in any part of the world, or under any elevation of the pole. -- Universal instrument (Astron.), a species of altitude and azimuth instrument, the peculiarity of which is, that the object end of the telescope is placed at right angles to the eye end, with a prism of total reflection at the angle, and the eye end constitutes a portion of the horizontal axis of the instrument, having the eyepiece at the pivot and in the center of the altitude circle, so that the eye has convenient access to both at the same time. -- Universal joint (Mach.), a contrivance used for joining two shafts or parts of a machine endwise, so that the one may give rotary motion to the other when forming an angle with it, or may move freely in all directions with respect to the other, as by means of a cross connecting the forked ends of the two shafts (Fig. 1). Since this joint can not act when the angle of the shafts is less than 140ยบ, a double joint of the same kind is sometimes used for giving rotary motion at angles less than 140ยบ (Fig. 2). -- Universal umbel (Bot.), a primary or general umbel; the first or largest set of rays in a compound umbel; -- opposed to partial umbel. A universal involucre is not unfrequently placed at the foot of a universal umbel. Syn. -- General; all; whole; total. See General.\n\n1. The whole; the general system of the universe; the universe. [Obs.] Plato calleth God the cause and original, the nature and reason, of the universal. Sir W. Raleigh. 2. (Logic) (a) A general abstract conception, so called from being universally applicable to, or predicable of, each individual or species contained under it. (b) A universal proposition. See Universal, a., 4."}