{"word":"up","definition":"1. Aloft; on high; in a direction contrary to that of gravity; toward or in a higher place or position; above; -- the opposite of Ant: down. But up or down, By center or eccentric, hard to tell. Milton. 2. Hence, in many derived uses, specifically: -- (a) From a lower to a higher position, literally or figuratively; as, from a recumbent or sitting position; from the mouth, toward the source, of a river; from a dependent or inferior condition; from concealment; from younger age; from a quiet state, or the like; -- used with verbs of motion expressed or implied. But they presumed to go up unto the hilltop. Num. xiv. 44. I am afflicted and ready to die from my youth up. Ps. lxxxviii. 15. Up rose the sun, and up rose Emelye. Chaucer. We have wrought ourselves up into this degree of Christian indifference. Atterbury. (b) In a higher place or position, literally or figuratively; in the state of having arisen; in an upright, or nearly upright, position; standing; mounted on a horse; in a condition of elevation, prominence, advance, proficiency, excitement, insurrection, or the like; -- used with verbs of rest, situation, condition, and the like; as, to be up on a hill; the lid of the box was up; prices are up. And when the sun was up, they were scorched. Matt. xiii. 6. Those that were up themselves kept others low. Spenser. Helen was up -- was she Shak. Rebels there are up, And put the Englishmen unto the sword. Shak. His name was up through all the adjoining provinces, even to Italy and Rome; many desiring to see who he was that could withstand so many years the Roman puissance. Milton. Thou hast fired me; my soul's up in arms. Dryden. Grief and passion are like floods raised in little brooks by a sudden rain; they are quickly up. Dryden. A general whisper ran among the country people, that Sir Roger was up. Addison. Let us, then, be up and doing, With a heart for any fate. Longfellow. (c) To or in a position of equal advance or equality; not short of, back of, less advanced than, away from, or the like; -- usually followed by to or with; as, to be up to the chin in water; to come up with one's companions; to come up with the enemy; to live up to engagements. As a boar was whetting his teeth, up comes a fox to him. L'Estrange. (d) To or in a state of completion; completely; wholly; quite; as, in the phrases to eat up; to drink up; to burn up; to sum up; etc.; to shut up the eyes or the mouth; to sew up a rent. Note: Some phrases of this kind are now obsolete; as, to spend up (Prov. xxi. 20); to kill up (B. Jonson). (e) Aside, so as not to be in use; as, to lay up riches; put up your weapons. Note: Up is used elliptically for get up, rouse up, etc., expressing a command or exhortation. \"Up, and let us be going.\" Judg. xix. 28. Up, up, my friend! and quit your books, Or surely you 'll grow double. Wordsworth. It is all up with him, it is all over with him; he is lost. -- The time is up, the allotted time is past. -- To be up in, to be informed about; to be versed in. \"Anxious that their sons should be well up in the superstitions of two thousand years ago.\" H. Spencer. -- To be up to. (a) To be equal to, or prepared for; as, he is up to the business, or the emergency. [Colloq.] (b) To be engaged in; to purpose, with the idea of doing ill or mischief; as, I don't know what he's up to. [Colloq.] -- To blow up. (a) To inflate; to distend. (b) To destroy by an explosion from beneath. (c) To explode; as, the boiler blew up. (d) To reprove angrily; to scold. [Slang] -- To bring up. See under Bring, v. t. -- To come up with. See under Come, v. i. -- To cut up. See under Cut, v. t. & i. -- To draw up. See under Draw, v. t. -- To grow up, to grow to maturity. -- Up anchor (Naut.), the order to man the windlass preparatory to hauling up the anchor. -- Up and down. (a) First up, and then down; from one state or position to another. See under Down, adv. Fortune . . . led him up and down. Chaucer. (b) (Naut.) Vertical; perpendicular; -- said of the cable when the anchor is under, or nearly under, the hawse hole, and the cable is taut. Totten. -- Up helm (Naut.), the order given to move the tiller toward the upper, or windward, side of a vessel. -- Up to snuff. See under Snuff. [Slang] -- What is up What is going on [Slang]\n\n1. From a lower to a higher place on, upon, or along; at a higher situation upon; at the top of. In going up a hill, the knees will be most weary; in going down, the thihgs. Bacon. 2. From the coast towards the interior of, as a country; from the mouth towards the source of, as a stream; as, to journey up the country; to sail up the Hudson. 3. Upon. [Obs.] \"Up pain of death.\" Chaucer.\n\nThe state of being up or above; a state of elevation, prosperity, or the like; -- rarely occurring except in the phrase ups and downs. [Colloq.] Ups and downs, alternate states of elevation and depression, or of prosperity and the contrary. [Colloq.] They had their ups and downs of fortune. Thackeray.\n\nInclining up; tending or going up; upward; as, an up look; an up grade; the up train."}