{"word":"use","definition":"1. The act of employing anything, or of applying it to one's service; the state of being so employed or applied; application; employment; conversion to some purpose; as, the use of a pen in writing; his machines are in general use. Books can never teach the use of books. Bacon. This Davy serves you for good uses. Shak. When he framed All things to man's delightful use. Milton. 2. Occasion or need to employ; necessity; as, to have no further use for a book. Shak. 3. Yielding of service; advantage derived; capability of being used; usefulness; utility. God made two great lights, great for their use To man. Milton. 'T is use alone that sanctifies expense. Pope. 4. Continued or repeated practice; customary employment; usage; custom; manner; habit. Let later age that noble use envy. Spenser. How weary, stale, flat and unprofitable, Seem to me all the uses of this world! Shak. 5. Common occurrence; ordinary experience. [R.] O Cæsar! these things are beyond all use. Shak. 6. (Eccl.)  The special form of ritual adopted for use in any diocese; as, the Sarum, or Canterbury, use; the Hereford use; the York use; the Roman use; etc. From henceforth all the whole realm shall have but one use. Pref. to Book of Common Prayer. 7. The premium paid for the possession and employment of borrowed money; interest; usury. [Obs.] Thou art more obliged to pay duty and tribute, use and principal, to him. Jer. Taylor. 8. Etym: [In this sense probably a corruption of OF. oes, fr. L. opus need, business, employment, work. Cf. Operate.] (Law)  The benefit or profit of lands and tenements. Use imports a trust and confidence reposed in a man for the holding of lands. He to whose use or benefit the trust is intended shall enjoy the profits. An estate is granted and limited to A for the use of B. 9. (Forging)  A stab of iron welded to the side of a forging, as a shaft, near the end, and afterward drawn down, by hammering, so as to lengthen the forging. Contingent, or Springing, use (Law), a use to come into operation on a future uncertain event. -- In use. (a) In employment; in customary practice observance. (b) In heat; -- said especially of mares. J. H. Walsh. -- Of no use, useless; of no advantage. -- Of use, useful; of advantage; profitable. -- Out of use, not in employment. -- Resulting use (Law), a use, which, being limited by the deed, expires or can not vest, and results or returns to him who raised it, after such expiration. -- Secondary, or Shifting, use, a use which, though executed, may change from one to another by circumstances. Blackstone. -- Statute of uses (Eng. Law), the stat. 27 Henry VIII., cap. 10, which transfers uses into possession, or which unites the use and possession. -- To make use of, To put to use, to employ; to derive service from; to use.\n\n1. To make use of; to convert to one's service; to avail one's self of; to employ; to put a purpose; as, to use a plow; to use a chair; to use time; to use flour for food; to use water for irrigation. Launcelot Gobbo, use your legs. Shak. Some other means I have which may be used. Milton. 2. To behave toward; to act with regard to; to treat; as, to use a beast cruelly. \"I will use him well.\" Shak. How wouldst thou use me now Milton. Cato has used me ill. Addison. 3. To practice customarily; to make a practice of; as, to use diligence in business. Use hospitality one to another. 1 Pet. iv. 9. 4. To accustom; to habituate; to render familiar by practice; to inure; -- employed chiefly in the passive participle; as, men used to cold and hunger; soldiers used to hardships and danger. I am so used in the fire to blow. Chaucer. Thou with thy compeers, Used to the yoke, draw'st his triumphant wheels. Milton. To use one's self, to behave. [Obs.] \"Pray, forgive me, if I have used myself unmannerly.\" Shak. -- To use up. (a) To consume or exhaust by using; to leave nothing of; as, to use up the supplies. (b) To exhaust; to tire out; to leave no capacity of force or use in; to overthrow; as, he was used up by fatigue. [Colloq.] Syn. -- Employ. -- Use, Employ. We use a thing, or make use of it, when we derive from it some enjoyment or service. We employ it when we turn that service into a particular channel. We use words to express our general meaning; we employ certain technical terms in reference to a given subject. To make use of, implies passivity in the thing; as, to make use of a pen; and hence there is often a material difference between the two words when applied to persons. To speak of \"making use of another\" generally implies a degrading idea, as if we had used him as a tool; while employ has no such sense. A confidential friend is employed to negotiate; an inferior agent is made use of on an intrigue. I would, my son, that thou wouldst use the power Which thy discretion gives thee, to control And manage all. Cowper. To study nature will thy time employ: Knowledge and innocence are perfect joy. Dryden.\n\n1. To be wont or accustomed; to be in the habit or practice; as, he used to ride daily; -- now disused in the present tense, perhaps because of the similarity in sound, between \"use to,\" and \"used to.\" They use to place him that shall be their captain on a stone. Spenser. Fears use to be represented in an imaginary. Bacon. Thus we use to say, it is the room that smokes, when indeed it is the fire in the room. South. Now Moses used to take the tent and to pitch it without the camp. Ex. xxxiii. 7 (Rev. Ver.) 2. To be accustomed to go; to frequent; to inhabit; to dwell; -- sometimes followed by of. [Obs.] \"Where never foot did use.\" Spenser. He useth every day to a merchant's house. B. Jonson. Ye valleys low, where the mild whispers use Of shades, and wanton winds, and gushing brooks. Milton."}