{"word":"value","definition":"1. The property or aggregate properties of a thing by which it is rendered useful or desirable, or the degree of such property or sum of properties; worth; excellence; utility; importance. Ye are all physicians of no value. Job xiii. 4. Ye are of more value than many sparrows. Matt. x. 31. Cæsar is well acquainted with your virtue, And therefore sets this value on your life. Addison. Before events shall have decided on the value of the measures. Marshall. 2. (Trade & Polit. Econ.)  Worth estimated by any standard of purchasing power, especially by the market price, or the amount of money agreed upon as an equivalent to the utility and cost of anything. An article may be possessed of the highest degree of utility, or power to minister to our wants and enjoyments, and may be universally made use of, without possessing exchangeable value. M'Culloch. Value is the power to command commodities generally. A. L. Chapin (Johnson's Cys.). Value is the generic term which expresses power in exchange. F. A. Walker. His design was not to pay him the value of his pictures, because they were above any price. Dryden. Note: In political economy, value is often distinguished as intrinsic and exchangeable. Intrinsic value is the same as utility or adaptation to satisfy the desires or wants of men. Exchangeable value is that in an article or product which disposes individuals to give for it some quantity of labor, or some other article or product obtainable by labor; as, pure air has an intrinsic value, but generally not an exchangeable value. 3. Precise signification; import; as, the value of a word; the value of a legal instrument Mitford. 4. Esteem; regard. Dryden. My relation to the person was so near, and my value for him so great Bp. Burnet. 5. (Mus.)  The relative length or duration of a tone or note, answering to quantity in prosody; thus, a quarter note [value of two eighth notes [ 6. In an artistical composition, the character of any one part in its relation to other parts and to the whole; -- often used in the plural; as, the values are well given, or well maintained. 7. Valor. [Written also valew.] [Obs.] Spenser. Value received, a phrase usually employed in a bill of exchange or a promissory note, to denote that a consideration has been given for it. Bouvier.\n\n1. To estimate the value, or worth, of; to rate at a certain price; to appraise; to reckon with respect to number, power, importance, etc. The mind doth value every moment. Bacon. The queen is valued thirty thousand strong. Shak. The king must take it ill, That he's so slightly valued in his messenger. Shak. Neither of them valued their promises according to rules of honor or integrity. Clarendon. 2. To rate highly; to have in high esteem; to hold in respect and estimation; to appreciate; to prize; as, to value one for his works or his virtues. Which of the dukes he values most. Shak. 3. To raise to estimation; to cause to have value, either real or apparent; to enhance in value. [Obs.] Some value themselves to their country by jealousies of the crown. Sir W. Temple. 4. To be worth; to be equal to in value. [Obs.] The peace between the French and us not values The cost that did conclude it. Shak. Syn. -- To compute; rate; appraise; esteem; respect; regard; estimate; prize; appreciate."}