{"word":"valve","definition":"1. A door; especially, one of a pair of folding doors, or one of the leaves of such a door. Swift through the valves the visionary fair Repassed. Pope. Heavily closed, . . . the valves of the barn doors. Longfellow. 2. A lid, plug, or cover, applied to an aperture so that by its movement, as by swinging, lifting and falling, sliding, turning, or the like, it will open or close the aperture to permit or prevent passage, as of a fluid. Note: A valve may act automatically so as to be opened by the effort of a fluid to pass in one direction, and closed by the effort to pass in the other direction, as a clack valve; or it may be opened or closed by hand or by mechanism, as a screw valve, or a slide valve. 3. (Anat.)  One or more membranous partitions, flaps, or folds, which permit the passage of the contents of a vessel or cavity in one direction, but stop or retard the flow in the opposite direction; as, the ileocolic, mitral, and semilunar valves. 4. (Bot.) (a) One of the pieces into which a capsule naturally separates when it bursts. (b) One of the two similar portions of the shell of a diatom. (c) A small portion of certain anthers, which opens like a trapdoor to allow the pollen to escape, as in the barberry. 5. (Zoöl.)  One of the pieces or divisions of bivalve or multivalve shells. Air valve, Ball valve, Check valve, etc. See under Air. Ball, Check, etc. -- Double-beat valve, a kind of balance valve usually consisting of a movable, open-ended, turban-shaped shell provided with two faces of nearly equal diameters, one above another, which rest upon two corresponding seats when the valve is closed. -- Equilibrium valve. (a) A balance valve. See under Balance. (b) A valve for permitting air, steam, water, etc., to pass into or out of a chamber so as to establish or maintain equal pressure within and without. -- Valve chest (Mach.), a chamber in which a valve works; especially (Steam Engine), the steam chest; -- called in England valve box, and valve casing. See Steam chest, under Steam. -- Valve face (Mach.), that part of the surface of a valve which comes in contact with the valve seat. -- Valve gear, or Valve motion (Steam Engine), the system of parts by which motion is given to the valve or valves for the distribution of steam in the cylinder. For an illustration of one form of valve gear, see Link motion. -- Valve seat. (Mach.) (a) The fixed surface on which a valve rests or against which it presses. (b) A part or piece on which such a surface is formed. -- Valve stem (Mach.), a rod attached to a valve, for moving it. -- Valve yoke (Mach.), a strap embracing a slide valve and connecting it to the valve stem."}