{"word":"vapor","definition":"1. (Physics)  Any substance in the gaseous, or aëriform, state, the condition of which is ordinarily that of a liquid or solid. Note: The term vapor is sometimes used in a more extended sense, as identical with gas; and the difference between the two is not so much one of kind as of degree, the latter being applied to all permanently elastic fluids except atmospheric air, the former to those elastic fluids which lose that condition at ordinary temperatures. The atmosphere contains more or less vapor of water, a portion of which, on a reduction of temperature, becomes condensed into liquid water in the form of rain or dew. The vapor of water produced by boiling, especially in its economic relations, is called steam. Vapor is any substance in the gaseous condition at the maximum of density consistent with that condition. This is the strict and proper meaning of the word vapor. Nichol. 2. In a loose and popular sense, any visible diffused substance floating in the atmosphere and impairing its transparency, as smoke, fog, etc. The vapour which that fro the earth glood [glided]. Chaucer. Fire and hail; snow and vapors; stormy wind fulfilling his word. Ps. cxlviii. 8. 3. Wind; flatulence. [Obs.] Bacon. 4. Something unsubstantial, fleeting, or transitory; unreal fancy; vain imagination; idle talk; boasting. For what is your life It is even a vapor, that appeareth for a little time, and then vanisheth away. James iv. 14. 5. pl.  An old name for hypochondria, or melancholy; the blues. \"A fit of vapors.\" Pope. 6. (Pharm.)  A medicinal agent designed for administration in the form of inhaled vapor. Brit. Pharm. Vapor bath. (a) A bath in vapor; the application of vapor to the body, or part of it, in a close place; also, the place itself. (b) (Chem.) A small metallic drying oven, usually of copper, for drying and heating filter papers, precipitates, etc.; -- called also air bath. A modified form is provided with a jacket in the outside partition for holding water, or other volatile liquid, by which the temperature may be limited exactly to the required degree. -- Vapor burner, a burner for burning a vaporized hydrocarbon. -- Vapor density (Chem.), the relative weight of gases and vapors as compared with some specific standard, usually hydrogen, but sometimes air. The vapor density of gases and vaporizable substances as compared with hydrogen, when multiplied by two, or when compared with air and multiplied by 28.8, gives the molecular weight. -- Vapor engine, an engine worked by the expansive force of a vapor, esp. a vapor other than steam.\n\n1. To pass off in fumes, or as a moist, floating substance, whether visible or invisible, to steam; to be exhaled; to evaporate. 2. To emit vapor or fumes. [R.] Running waters vapor not so much as standing waters. Bacon. 3. To talk idly; to boast or vaunt; to brag. Poets used to vapor much after this manner. Milton. We vapor and say, By this time Matthews has beaten them. Walpole.\n\nTo send off in vapor, or as if in vapor; as, to vapor away a heated fluid. [Written also vapour.] He'd laugh to see one throw his heart away, Another, sighing, vapor forth his soul. B. Jonson."}