{"word":"vegetable","definition":"1. Of or pertaining to plants; having the nature of, or produced by, plants; as, a vegetable nature; vegetable growths, juices, etc. Blooming ambrosial fruit Of vegetable gold. Milton. 2. Consisting of, or comprising, plants; as, the vegetable kingdom. Vegetable alkali (Chem.), an alkaloid. -- Vegetable brimstone. (Bot.) See Vegetable sulphur, below. -- Vegetable butter (Bot.), a name of several kinds of concrete vegetable oil; as that produced by the Indian butter tree, the African shea tree, and the Pentadesma butyracea, a tree of the order Guttiferæ, also African. Still another kind is pressed from the seeds of cocoa (Theobroma). -- Vegetable flannel, a textile material, manufactured in Germany from pine-needle wool, a down or fiber obtained from the leaves of the Pinus sylvestris. -- Vegetable ivory. See Ivory nut, under Ivory. -- Vegetable jelly. See Pectin. -- Vegetable kingdom. (Nat. Hist.) See the last Phrase, below. -- Vegetable leather. (a) (Bot.) A shrubby West Indian spurge (Euphorbia punicea), with leathery foliage and crimson bracts. (b) See Vegetable leather, under Leather. -- Vegetable marrow (Bot.), an egg-shaped gourd, commonly eight to ten inches long. It is noted for the very tender quality of its flesh, and is a favorite culinary vegetable in England. It has been said to be of Persian origin, but is now thought to have been derived from a form of the American pumpkin. -- Vegetable oyster (Bot.), the oyster plant. See under Oyster. -- Vegetable parchment, papyrine. -- Vegetable sheep (Bot.), a white woolly plant (Raoulia eximia) of New Zealand, which grows in the form of large fleecy cushions on the mountains. -- Vegetable silk, a cottonlike, fibrous material obtained from the coating of the seeds of a Brazilian tree (Chorisia speciosa). It us used for various purposes, as for stuffing, and the like, but is incapable of being spun on account of a want of cohesion among the fibers. -- Vegetable sponge. See 1st Loof. -- Vegetable sulphur, the fine highly inflammable spores of the club moss (Lycopodium clavatum); witch. -- Vegetable tallow, a substance resembling tallow, obtained from various plants; as, Chinese vegetable tallow, obtained from the seeds of the tallow tree. Indian vegetable tallow is a name sometimes given to piney tallow. -- Vegetable wax, a waxy excretion on the leaves or fruits of certain plants, as the bayberry. Vegetable kingdom (Nat. Hist.), that primary division of living things which includes all plants. The classes of the vegetable kingdom have been grouped differently by various botanists. The following is one of the best of the many arrangements of the principal subdivisions. I. Phænogamia (called also Phanerogamia).  Plants having distinct flowers and true seeds. { 1. Dicotyledons (called also Exogens). -- Seeds with two or more cotyledons. Stems with the pith, woody fiber, and bark concentrically arranged. Divided into two subclasses: Angiosperms, having the woody fiber interspersed with dotted or annular ducts, and the seed contained in a true ovary; Gymnosperms, having few or no ducts in the woody fiber, and the seeds naked. 2. Monocotyledons (called also Endogens). -- Seeds with single cotyledon. Stems with slender bundles of woody fiber not concentrically arranged, and with no true bark.} II. Cryptogamia.  Plants without true flowers, and reproduced by minute spores of various kinds, or by simple cell division. { 1. Acrogens. -- Plants usually with distinct stems and leaves, existing in two alternate conditions, one of which is nonsexual and sporophoric, the other sexual and oöphoric. Divided into Vascular Acrogens, or Pteridophyta, having the sporophoric plant conspicuous and consisting partly of vascular tissue, as in Ferns, Lycopods, and Equiseta, and Cellular Acrogens, or Bryophyta, having the sexual plant most conspicuous, but destitute of vascular tissue, as in Mosses and Scale Mosses. 2. Thallogens. -- Plants without distinct stem and leaves, consisting of a simple or branched mass of cellular tissue, or educed to a single cell. Reproduction effected variously. Divided into Algæ, which contain chlorophyll or its equivalent, and which live upon air and water, and Fungi, which contain no chlorophyll, and live on organic matter. (Lichens are now believed to be fungi parasitic on included algæ.} Note: Many botanists divide the Phænogamia primarily into Gymnosperms and Angiosperms, and the latter into Dicotyledons and Monocotyledons. Others consider Pteridophyta and Bryophyta to be separate classes. Thallogens are variously divided by different writers, and the places for diatoms, slime molds, and stoneworts are altogether uncertain. For definitions, see these names in the Vocabulary."}