{"word":"velocity","definition":"1. Quickness of motion; swiftness; speed; celerity; rapidity; as, the velocity of wind; the velocity of a planet or comet in its orbit or course; the velocity of a cannon ball; the velocity of light. Note: In such phrases, velocity is more generally used than celerity. We apply celerity to animals; as, a horse or an ostrich runs with celerity; but bodies moving in the air or in ethereal space move with greater or less velocity, not celerity. This usage is arbitrary, and perhaps not universal. 2. (Mech.)  Rate of motion; the relation of motion to time, measured by the number of units of space passed over by a moving body or point in a unit of time, usually the number of feet passed over in a second. See the Note under Speed. Angular velocity. See under Angular. -- Initial velocity, the velocity of a moving body at starting; especially, the velocity of a projectile as it leaves the mouth of a firearm from which it is discharged. -- Relative velocity, the velocity with which a body approaches or recedes from another body, whether both are moving or only one. -- Uniform velocity, velocity in which the same number of units of space are described in each successive unit of time. -- Variable velocity, velocity in which the space described varies from instant, either increasing or decreasing; -- in the former case called accelerated velocity, in the latter, retarded velocity; the acceleration or retardation itself being also either uniform or variable. -- Virtual velocity. See under Virtual. Note: In variable velocity, the velocity, strictly, at any given instant, is the rate of motion at that instant, and is expressed by the units of space, which, if the velocity at that instant were continued uniform during a unit of time, would be described in the unit of time; thus, the velocity of a falling body at a given instant is the number of feet which, if the motion which the body has at that instant were continued uniformly for one second, it would pass through in the second. The scientific sense of velocity differs from the popular sense in being applied to all rates of motion, however slow, while the latter implies more or less rapidity or quickness of motion. Syn. -- Swiftness; celerity; rapidity; fleetness; speed."}