{"word":"vice","definition":"1. A defect; a fault; an error; a blemish; an imperfection; as, the vices of a political constitution; the vices of a horse. Withouten vice of syllable or letter. Chaucer. Mark the vice of the procedure. Sir W. Hamilton. 2. A moral fault or failing; especially, immoral conduct or habit, as in the indulgence of degrading appetites; customary deviation in a single respect, or in general, from a right standard, implying a defect of natural character, or the result of training and habits; a harmful custom; immorality; depravity; wickedness; as, a life of vice; the vice of intemperance. I do confess the vices of my blood. Shak. Ungoverned appetite . . . a brutish vice. Milton. When vice prevails, and impious men bear sway, The post of honor is a private station. Addison. 3. The buffoon of the old English moralities, or moral dramas, having the name sometimes of one vice, sometimes of another, or of Vice itself; -- called also Iniquity. Note: This character was grotesquely dressed in a cap with ass's ears, and was armed with a dagger of lath: one of his chief employments was to make sport with the Devil, leaping on his back, and belaboring him with the dagger of lath till he made him roar. The Devil, however, always carried him off in the end. Nares. How like you the Vice in the play . . . I would not give a rush for a Vice that has not a wooden dagger to snap at everybody. B. Jonson. Syn. -- Crime; sin; iniquity; fault. See Crime.\n\n1. (Mech.)  A kind of instrument for holding work, as in filing. Same as Vise. 2. A tool for drawing lead into cames, or flat grooved rods, for casements. [Written also vise.] 3. A gripe or grasp. [Obs.] Shak.\n\nTo hold or squeeze with a vice, or as if with a vice. Shak. The coachman's hand was viced between his upper and lower thigh. De Quincey.\n\nIn the place of; in the stead; as, A. B. was appointed postmaster vice C. D. resigned.\n\nDenoting one who in certain cases may assume the office or duties of a superior; designating an officer or an office that is second in rank or authority; as, vice president; vice agent; vice consul, etc. Vice admiral. Etym: [Cf. F. vice-amiral.] (a) An officer holding rank next below an admiral. By the existing laws, the rank of admiral and vice admiral in the United States Navy will cease at the death of the present incumbents. (b) A civil officer, in Great Britain, appointed by the lords commissioners of the admiralty for exercising admiralty jurisdiction within their respective districts. -- Vice admiralty, the office of a vice admiral. -- Vice-admiralty court, a court with admiralty jurisdiction, established by authority of Parliament in British possessions beyond the seas. Abbott. -- Vice chamberlain, an officer in court next in rank to the lord chamberlain. [Eng.] -- Vice chancellor. (a) (Law) An officer next in rank to a chancellor. (b) An officer in a university, chosen to perform certain duties, as the conferring of degrees, in the absence of the chancellor. (c) (R. C. Ch.) The cardinal at the head of the Roman Chancery. -- Vice consul Etym: [cf. F. vice-consul], a subordinate officer, authorized to exercise consular functions in some particular part of a district controlled by a consul. -- Vice king, one who acts in the place of a king; a viceroy. -- Vice legate Etym: [cf. F. vice-légat], a legate second in rank to, or acting in place of, another legate. -- Vice presidency, the office of vice president. -- Vice president Etym: [cf. F. vice-président], an officer next in rank below a president."}