{"word":"vine","definition":"(a) Any woody climbing plant which bears grapes. (b) Hence, a climbing or trailing plant; the long, slender stem of any plant that trails on the ground, or climbs by winding round a fixed object, or by seizing anything with its tendrils, or claspers; a creeper; as, the hop vine; the bean vine; the vines of melons, squashes, pumpkins, and other cucurbitaceous plants. There shall be no grapes on the vine. Jer. viii. 13. And one went out into the field to gather herbs, and found a wild vine, and gathered thereof wild gourds. 2 Kings iv. 89. Vine apple (Bot.), a small kind of squash. Roger Williams. -- Vine beetle (Zoöl.), any one of several species of beetles which are injurious to the leaves or branches of the grapevine. Among the more important species are the grapevine fidia (see Fidia), the spotted Pelidnota (see Rutilian), the vine fleabeetle (Graptodera chalybea), the rose beetle (see under Rose), the vine weevil, and several species of Colaspis and Anomala. -- Vine borer. (Zoöl.) (a) Any one of several species of beetles whose larvæ bore in the wood or pith of the grapevine, especially Sinoxylon basilare, a small species the larva of which bores in the stems, and Ampeloglypter sesostris, a small reddish brown weevil (called also vine weevil), which produces knotlike galls on the branches. (b) A clearwing moth (Ægeria polistiformis), whose larva bores in the roots of the grapevine and is often destructive. -- Vine dragon, an old and fruitless branch of a vine. [Obs.] Holland. -- Vine forester (Zoöl.), any one of several species of moths belonging to Alypia and allied genera, whose larvæ feed on the leaves of the grapevine. -- Vine fretter (Zoöl.), a plant louse, esp. the phylloxera that injuries the grapevine. -- Vine grub (Zoöl.), any one of numerous species of insect larvæ that are injurious to the grapevine. -- Vine hopper (Zoöl.), any one of several species of leaf hoppers which suck the sap of the grapevine, especially Erythroneura vitis. See Illust. of Grape hopper, under Grape. -- Vine inchworm (Zoöl.), the larva of any species of geometrid moths which feed on the leaves of the grapevine, especially Cidaria diversilineata. -- Vine-leaf rooer (Zoöl.), a small moth (Desmia maculalis) whose larva makes a nest by rolling up the leaves of the grapevine. The moth is brownish black, spotted with white. -- Vine louse (Zoöl.), the phylloxera. -- Vine mildew (Bot.), a fungous growth which forms a white, delicate, cottony layer upon the leaves, young shoots, and fruit of the vine, causing brown spots upon the green parts, and finally a hardening and destruction of the vitality of the surface. The plant has been called Oidium Tuckeri, but is now thought to be the conidia- producing stage of an Erysiphe. -- Vine of Sodom (Bot.), a plant named in the Bible (Deut. xxxii. 32), now thought to be identical with the apple of Sodom. See Apple of Sodom, under Apple. -- Vine sawfly (Zoöl.), a small black sawfiy (Selandria vitis) whose larva feeds upon the leaves of the grapevine. The larvæ stand side by side in clusters while feeding. -- Vine slug (Zoöl.), the larva of the vine sawfly. -- Vine sorrel (Bot.), a climbing plant (Cissus acida) related to the grapevine, and having acid leaves. It is found in Florida and the West Indies. -- Vine sphinx (Zoöl.), any one of several species of hawk moths. The larvæ feed on grapevine leaves. -- Vine weevil. (Zoöl.) See Vine borer (a) above, and Wound gall, under Wound."}