{"word":"virtue","definition":"1. Manly strength or courage; bravery; daring; spirit; valor. [Obs.] Shak. Built too strong For force or virtue ever to expugn. Chapman. 2. Active quality or power; capacity or power adequate to the production of a given effect; energy; strength; potency; efficacy; as, the virtue of a medicine. Jesus, immediately knowing in himself that virtue had gone out of him, turned him about. Mark v. 30. A man was driven to depend for his security against misunderstanding, upon the pure virtue of his syntax. De Quincey. The virtue of his midnight agony. Keble. 3. Energy or influence operating without contact of the material or sensible substance. She moves the body which she doth possess, Yet no part toucheth, but by virtue's touch. Sir. J. Davies. 4. Excellence; value; merit; meritoriousness; worth. I made virtue of necessity. Chaucer. In the Greek poets, . . . the economy of poems is better observed than in Terence, who thought the sole grace and virtue of their fable the sticking in of sentences. B. Jonson. 5. Specifically, moral excellence; integrity of character; purity of soul; performance of duty. Virtue only makes our bliss below. Pope. If there's Power above us, And that there is all nature cries aloud Through all her works, he must delight in virtue. Addison. 6. A particular moral excellence; as, the virtue of temperance, of charity, etc. \"The very virtue of compassion.\" Shak. \"Remember all his virtues.\" Addison. 7. Specifically: Chastity; purity; especially, the chastity of women; virginity. H. I believe the girl has virtue. M. And if she has, I should be the last man in the world to attempt to corrupt it. Goldsmith. 8. pl.  One of the orders of the celestial hierarchy. Thrones, dominations, princedoms, virtues, powers. Milton. Cardinal virtues. See under Cardinal, a. -- In, or By, virtue of, through the force of; by authority of. \"He used to travel through Greece by virtue of this fable, which procured him reception in all the towns.\" Addison. \"This they shall attain, partly in virtue of the promise made by God, and partly in virtue of piety.\" Atterbury. -- Theological virtues, the three virtues, faith, hope, and charity. See 1 Cor. xiii. 13."}