{"word":"voice","definition":"1. Sound uttered by the mouth, especially that uttered by human beings in speech or song; sound thus uttered considered as possessing some special quality or character; as, the human voice; a pleasant voice; a low voice. He with a manly voice saith his message. Chaucer. Her voice was ever soft, Gentle, and low; an excellent thing in woman. Shak. Thy voice is music. Shak. Join thy voice unto the angel choir. Milton. 2. (Phon.)  Sound of the kind or quality heard in speech or song in the consonants b, v, d, etc., and in the vowels; sonant, or intonated, utterance; tone; -- distinguished from mere breath sound as heard in f, s, sh, etc., and also whisper. Note: Voice, in this sense, is produced by vibration of the so-called vocal cords in the larynx (see Illust. of Larynx) which act upon the air, not in the manner of the strings of a stringed instrument, but as a pair of membranous tongues, or reeds, which, being continually forced apart by the outgoing current of breath, and continually brought together again by their own elasticity and muscular tension, break the breath current into a series of puffs, or pulses, sufficiently rapid to cause the sensation of tone. The power, or loudness, of such a tone depends on the force of the separate pulses, and this is determined by the pressure of the expired air, together with the resistance on the part of the vocal cords which is continually overcome. Its pitch depends on the number of aërial pulses within a given time, that is, on the rapidity of their succession. See Guide to Pronunciation, §§ 5, 146, 155. 3. The tone or sound emitted by anything. After the fire a still small voice. 1 Kings xix. 12. Canst thou thunder with a voice like him Job xl. 9. The floods have lifted up their voice. Ps. xciii. 3. O Marcus, I am warm'd; my heart Leaps at the trumpet's voice. Addison. 4. The faculty or power of utterance; as, to cultivate the voice. 5. Language; words; speech; expression; signification of feeling or opinion. I desire to be present with you now, and to change my voice; for I stand in doubt of you. Gal. iv. 20. My voice is in my sword. Shak. Let us call on God in the voice of his church. Bp. Fell. 6. Opinion or choice expressed; judgment; a vote. Sic. How now, my masters! have you chose this man 1 Cit. He has our voices, sir. Shak. Some laws ordain, and some attend the choice Of holy senates, and elect by voice. Dryden. 7. Command; precept; -- now chiefly used in scriptural language. So shall ye perish; because ye would not be obedient unto the voice of the Lord your God. Deut. viii. 20. 8. One who speaks; a speaker. \"A potent voice of Parliament.\" Tennyson. 9. (Gram.)  A particular mode of inflecting or conjugating verbs, or a particular form of a verb, by means of which is indicated the relation of the subject of the verb to the action which the verb expresses. Active voice (Gram.), that form of the verb by which its subject is represented as the agent or doer of the action expressed by it. -- Chest voice (Phon.), a kind of voice of a medium or low pitch and of a sonorous quality ascribed to resonance in the chest, or thorax; voice of the thick register. It is produced by vibration of the vocal cords through their entire width and thickness, and with convex surfaces presented to each other. -- Head voice (Phon.), a kind of voice of high pitch and of a thin quality ascribed to resonance in the head; voice of the thin register; falsetto. In producing it, the vibration of the cords is limited to their thin edges in the upper part, which are then presented to each other. -- Middle voice (Gram.), that form of the verb by which its subject is represented as both the agent, or doer, and the object of the action, that is, as performing some act to or upon himself, or for his own advantage. -- Passive voice. (Gram.) See under Passive, a. -- Voice glide (Pron.), the brief and obscure neutral vowel sound that sometimes occurs between two consonants in an unaccented syllable (represented by the apostrophe), as in able (a\"b'l). See Glide, n., 2. -- Voice stop. See Voiced stop, under Voiced, a. -- With one voice, unanimously. \"All with one voice . . . cried out, Great is Diana of the Ephesians.\" Acts xix. 34.\n\n1. To give utterance or expression to; to utter; to publish; to announce; to divulge; as, to voice the sentiments of the nation. \"Rather assume thy right in silence and . . . then voice it with claims and challenges.\" Bacon. It was voiced that the king purposed to put to death Edward Plantagenet. Bacon. 2. (Phon.)  To utter with sonant or vocal tone; to pronounce with a narrowed glottis and rapid vibrations of the vocal cords; to speak above a whisper. 3. To fit for producing the proper sounds; to regulate the tone of; as, to voice the pipes of an organ. 4. To vote; to elect; to appoint. [Obs.] Shak.\n\nTo clamor; to cry out. [Obs.] South."}