{"word":"void","definition":"1. Containing nothing; empty; vacant; not occupied; not filled. The earth was without form, and void. Gen. i. 2. I 'll get me to a place more void. Shak. I 'll chain him in my study, that, at void hours, I may run over the story of his country. Massinger. 2. Having no incumbent; unoccupied; -- said of offices and the like. Divers great offices that had been long void. Camden. 3. Being without; destitute; free; wanting; devoid; as, void of learning, or of common use. Milton. A conscience void of offense toward God. Acts xxiv. 16. He that is void of wisdom despiseth his neighbor. Prov. xi. 12. 4. Not producing any effect; ineffectual; vain. [My word] shall not return to me void, but it shall accomplish that which I please. Isa. lv. 11. I will make void the counsel of Judah. Jer. xix. 7. 5. Containing no immaterial quality; destitute of mind or soul. \"Idol, void and vain.\" Pope. 6. (Law)  Of no legal force or effect, incapable of confirmation or ratification; null. Cf. Voidable, 2. Void space (Physics), a vacuum. Syn. -- Empty; vacant; devoid; wanting; unfurnished; unsupplied; unoccupied.\n\nAn empty space; a vacuum. Pride, where wit fails, steps in to our defense, And fills up all the mighty void of sense. Pope.\n\n1. To remove the contents of; to make or leave vacant or empty; to quit; to leave; as, to void a table. Void anon her place. Chaucer. If they will fight with us, bid them come down, Or void the field. Shak. 2. To throw or send out; to evacuate; to emit; to discharge; as, to void excrements. A watchful application of mind in voiding prejudices. Barrow. With shovel, like a fury, voided out The earth and scattered bones. J. Webster. 3. To render void; to make to be of no validity or effect; to vacate; to annul; to nullify. After they had voided the obligation of the oath he had taken. Bp. Burnet. It was become a practice . . . to void the security that was at any time given for money so borrowed. Clarendon.\n\nTo be emitted or evacuated. Wiseman."}