{"word":"wage","definition":"1. To pledge; to hazard on the event of a contest; to stake; to bet, to lay; to wager; as, to wage a dollar. Hakluyt. My life I never but as a pawn To wage against thy enemies. Shak. 2. To expose one's self to, as a risk; to incur, as a danger; to venture; to hazard. \"Too weak to wage an instant trial with the king.\" Shak. To wake and wage a danger profitless. Shak. 3. To engage in, as a contest, as if by previous gage or pledge; to carry on, as a war. [He pondered] which of all his sons was fit To reign and wage immortal war with wit. Dryden. The two are waging war, and the one triumphs by the destruction of the other. I. Taylor. 4. To adventure, or lay out, for hire or reward; to hire out. [Obs.] \"Thou . . . must wage thy works for wealth.\" Spenser. 5. To put upon wages; to hire; to employ; to pay wages to. [Obs.] Abundance of treasure which he had in store, wherewith he might wage soldiers. Holinshed. I would have them waged for their labor. Latimer. 6. (O. Eng. Law)  To give security for the performance of. Burrill. To wage battle (O. Eng. Law), to give gage, or security, for joining in the duellum, or combat. See Wager of battel, under Wager, n. Burrill. -- To wage one's law (Law), to give security to make one's law. See Wager of law, under Wager, n.\n\nTo bind one's self; to engage. [Obs.]\n\n1. That which is staked or ventured; that for which one incurs risk or danger; prize; gage. [Obs.] \"That warlike wage.\" Spenser. 2. That for which one labors; meed; reward; stipulated payment for service performed; hire; pay; compensation; -- at present generally used in the plural. See Wages. \"My day's wage.\" Sir W. Scott. \"At least I earned my wage.\" Thackeray. \"Pay them a wage in advance.\" J. Morley. \"The wages of virtue.\" Tennyson. By Tom Thumb, a fairy page, He sent it, and doth him engage, By promise of a mighty wage, It secretly to carry. Drayton. Our praises are our wages. Shak. Existing legislation on the subject of wages. Encyc. Brit. Note: Wage is used adjectively and as the first part of compounds which are usually self-explaining; as, wage worker, or wage-worker; wage-earner, etc. Board wages. See under 1st Board. Syn. -- Hire; reward; stipend; salary; allowance; pay; compensation; remuneration; fruit."}