{"word":"wait","definition":"1. To watch; to observe; to take notice. [Obs.] \"But [unless] ye wait well and be privy, I wot right well, I am but dead,\" quoth she. Chaucer. 2. To stay or rest in expectation; to stop or remain stationary till the arrival of some person or event; to rest in patience; to stay; not to depart. All the days of my appointed time will I wait, till my change come. Job xiv. 14. They also serve who only stand and wait. Milton. Haste, my dear father; 't is no time to wait. Dryden. To wait on or upon. (a) To attend, as a servant; to perform services for; as, to wait on a gentleman; to wait on the table. \"Authority and reason on her wait.\" Milton. \"I must wait on myself, must I\" Shak. (b) To attend; to go to see; to visit on business or for ceremony. (c) To follow, as a consequence; to await. \"That ruin that waits on such a supine temper.\" Dr. H. More. (d) To look watchfully at; to follow with the eye; to watch. [R.] \"It is a point of cunning to wait upon him with whom you speak with your eye.\" Bacon. (e) To attend to; to perform. \"Aaron and his sons . . . shallwait on their priest's office.\" Num. iii. 10. (f) (Falconry) To fly above its master, waiting till game is sprung; -- said of a hawk. Encyc. Brit.\n\n1. To stay for; to rest or remain stationary in expectation of; to await; as, to wait orders. Awed with these words, in camps they still abide, And wait with longing looks their promised guide. Dryden. 2. To attend as a consequence; to follow upon; to accompany; to await. [Obs.] 3. To attend on; to accompany; especially, to attend with ceremony or respect. [Obs.] He chose a thousand horse, the flower of all His warlike troops, to wait the funeral. Dryden. Remorse and heaviness of heart shall wait thee, And everlasting anguish be thy portion. Rowe. 4. To cause to wait; to defer; to postpone; -- said of a meal; as, to wait dinner. [Colloq.]\n\n1. The act of waiting; a delay; a halt. There is a wait of three hours at the border Mexican town of El Paso. S. B. Griffin. 2. Ambush. \"An enemy in wait.\" Milton. 3. One who watches; a watchman. [Obs.] 4. pl.  Hautboys, or oboes, played by town musicians; not used in the singular. [Obs.] Halliwell. 5. pl.  Musicians who sing or play at night or in the early morning, especially at Christmas time; serenaders; musical watchmen. [Written formerly wayghtes.] Hark! are the waits abroad Beau & Fl. The sound of the waits, rude as may be their minstrelsy, breaks upon the mild watches of a winter night with the effect of perfect harmony. W. Irving. To lay wait, to prepare an ambuscade. -- To lie in wait. See under 4th Lie."}