{"word":"want","definition":"1. The state of not having; the condition of being without anything; absence or scarcity of what is needed or desired; deficiency; lack; as, a want of power or knowledge for any purpose; want of food and clothing. And me, his parent, would full soon devour For want of other prey. Milton. From having wishes in consequence of our wants, we often feel wants in consequence of our wishes. Rambler. Pride is as loud a beggar as want, and more saucy. Franklin. 2. Specifically, absence or lack of necessaries; destitution; poverty; penury; indigence; need. Nothing is so hard for those who abound in riches, as to conceive how others can be in want. Swift. 3. That which is needed or desired; a thing of which the loss is felt; what is not possessed, and is necessary for use or pleasure. Habitual superfluities become actual wants. Paley. 4. (Mining)  A depression in coal strata, hollowed out before the subsequent deposition took place. [Eng.] Syn. -- Indigence; deficiency; defect; destitution; lack; failure; dearth; scarceness.\n\n1. To be without; to be destitute of, or deficient in; not to have; to lack; as, to want knowledge; to want judgment; to want learning; to want food and clothing. They that want honesty, want anything. Beau. & Fl. Nor think, though men were none, That heaven would want spectators, God want praise. Milton. The unhappy never want enemies. Richardson. 2. To have occasion for, as useful, proper, or requisite; to require; to need; as, in winter we want a fire; in summer we want cooling breezes. 3. To feel need of; to wish or long for; to desire; to crave. \" What wants my son\" Addison. I want to speak to you about something. A. Trollope.\n\n1. To be absent; to be deficient or lacking; to fail; not to be sufficient; to fall or come short; to lack; -- often used impersonally with of; as, it wants ten minutes of four. The disposition, the manners, and the thoughts are all before it; where any of those are wanting or imperfect, so much wants or is imperfect in the imitation of human life. Dryden. 2. To be in a state of destitution; to be needy; to lack. You have a gift, sir (thank your education), Will never let you want. B. Jonson. For as in bodies, thus in souls, we find What wants in blood and spirits, swelled with wind. Pope. Note: Want was formerly used impersonally with an indirect object. \"Him wanted audience.\" Chaucer. WA'N'T Wa'n't.  A colloquial contraction of was not."}