{"word":"war","definition":"Ware; aware. [Obs.] Chaucer.\n\n1. A contest between nations or states, carried on by force, whether for defence, for revenging insults and redressing wrongs, for the extension of commerce, for the acquisition of territory, for obtaining and establishing the superiority and dominion of one over the other, or for any other purpose; armed conflict of sovereign powers; declared and open hostilities. Men will ever distinguish war from mere bloodshed. F. W. Robertson. Note: As war is the contest of nations or states, it always implies that such contest is authorized by the monarch or the sovereign power of the nation. A war begun by attacking another nation, is called an offensive war, and such attack is aggressive. War undertaken to repel invasion, or the attacks of an enemy, is called defensive. 2. (Law)  A condition of belligerency to be maintained by physical force. In this sense, levying war against the sovereign authority is treason. 3. Instruments of war. [Poetic] His complement of stores, and total war. Prior. 4. Forces; army. [Poetic] On their embattled ranks the waves return, And overwhelm their war. Milton. 5. The profession of arms; the art of war. Thou art but a youth, and he is a man of war from his youth. 1 Sam. xvii. 33. 6. a state of opposition or contest; an act of opposition; an inimical contest, act, or action; enmity; hostility. \"Raised impious war in heaven.\" Milton. The words of his mouth were smoother than butter, but war was in his heart. Ps. lv. 21. Civil war, a war between different sections or parties of the same country or nation. -- Holy war. See under Holy. -- Man of war. (Naut.) See in the Vocabulary. -- Public war, a war between independent sovereign states. -- War cry, a cry or signal used in war; as, the Indian war cry. -- War dance, a dance among savages preliminary to going to war. Among the North American Indians, it is begun by some distinguished chief, and whoever joins in it thereby enlists as one of the party engaged in a warlike excursion. Schoolcraft. -- War field, a field of war or battle. -- War horse, a horse used in war; the horse of a cavalry soldier; especially, a strong, powerful, spirited horse for military service; a charger. -- War paint, paint put on the face and other parts of the body by savages, as a token of going to war. \"Wash the war paint from your faces.\" Longfellow. -- War song, a song of or pertaining to war; especially, among the American Indians, a song at the war dance, full of incitements to military ardor. -- War whoop, a war cry, especially that uttered by the American Indians.\n\nTo make war; to invade or attack a state or nation with force of arms; to carry on hostilities; to be in a state by violence. Rezin the king of Syria, and Pekah the son of Remaliah, king of Israel, went up toward Jerusalem to war against it. Isa. vii. 1. Why should I war without the walls of Troy Shak. Our countrymen were warring on that day! Byron. 2. To contend; to strive violently; to fight. \"Lusts which war against the soul.\" 1 Pet. ii. 11.\n\n1. To make war upon; to fight. [R.] To war the Scot, and borders to defend. Daniel. 2. To carry on, as a contest; to wage. [R.] That thou . . . mightest war a good warfare. Tim. i. 18."}