{"word":"warbler","definition":"1. One who, or that which, warbles; a singer; a songster; -- applied chiefly to birds. In lulling strains the feathered warblers woo. Tickell. 2. (Zoöl.)  Any one of numerous species of small Old World singing birds belonging to the family Sylviidæ, many of which are noted songsters. The bluethroat, blackcap, reed warbler (see under Reed), and sedge warbler (see under Sedge) are well-known species. 3. (Zoöl.)  Any one of numerous species of small, often bright colored, American singing birds of the family or subfamily Mniotiltidæ, or Sylvicolinæ. They are allied to the Old World warblers, but most of them are not particularly musical. Note: The American warblers are often divided, according to their habits, into bush warblers, creeping warblers, fly-catching warblers, ground warblers, wood warblers, wormeating warblers, etc. Bush warbler (Zoöl.) any American warbler of the genus Opornis, as the Connecticut warbler (O. agilis). -- Creeping warbler (Zoöl.), any one of several species of very small American warblers belonging to Parula, Mniotilta, and allied genera, as the blue yellow-backed warbler (Parula Americana), and the black-and-white creeper (Mniotilta varia). -- Fly-catching warbler (Zoöl.), any one of several species of warblers belonging to Setophaga, Sylvania, and allied genera having the bill hooked and notched at the tip, with strong rictal bristles at the base, as the hooded warbler (Sylvania mitrata), the black- capped warbler (S. pusilla), the Canadian warbler (S. Canadensis), and the American redstart (see Redstart). -- Ground warbler (Zoöl.), any American warbler of the genus Geothlypis, as the mourning ground warbler (G. Philadelphia), and the Maryland yellowthroat (see Yellowthroat). -- Wood warbler (Zoöl.), any one of numerous American warblers of the genus Dendroica. Among the most common wood warblers in the Eastern States are the yellowbird, or yellow warbler (see under Yellow), the black-throated green warbler (Dendroica virens), the yellow-rumped warbler (D. coronata), the blackpoll (D. striata), the bay-breasted warbler (D. castanea), the chestnut-sided warbler (D. Pennsylvanica), the Cape May warbler (D. tigrina), the prairie warbler (see under Prairie), and the pine warbler (D. pinus). See also Magnolia warbler, under Magnolia, and Blackburnian warbler."}