{"word":"ward","definition":"1. The act of guarding; watch; guard; guardianship; specifically, a guarding during the day. See the Note under Watch, n., 1. Still, when she slept, he kept both watch and ward. Spenser. 2. One who, or that which, guards; garrison; defender; protector; means of guarding; defense; protection. For the best ward of mine honor. Shak. The assieged castle's ward Their steadfast stands did mightily maintain. Spenser. For want of other ward, He lifted up his hand, his front to guard. Dryden. 3. The state of being under guard or guardianship; confinement under guard; the condition of a child under a guardian; custody. And he put them in ward in the house of the captain of the guard. Gen. xl. 3. I must attend his majesty's command, to whom I am now in ward. Shak. It is also inconvenient, in Ireland, that the wards and marriages of gentlemen's children should be in the disposal of any of those lords. Spenser. 4. A guarding or defensive motion or position, as in fencing; guard. \"Thou knowest my old ward; here I lay, and thus I bore my point.\" Shak. 5. One who, or that which, is guarded. Specifically: -- (a) A minor or person under the care of a guardian; as, a ward in chancery. \"You know our father's ward, the fair Monimia.\" Otway. (b) A division of a county. [Eng. & Scot.] (c) A division, district, or quarter of a town or city. Throughout the trembling city placed a guard, Dealing an equal share to every ward. Dryden. (d) A division of a forest. [Eng.] (e) A division of a hospital; as, a fever ward. 6. (a) A projecting ridge of metal in the interior of a lock, to prevent the use of any key which has not a corresponding notch for passing it. (b) A notch or slit in a key corresponding to a ridge in the lock which it fits; a ward notch. Knight. The lock is made . . . more secure by attaching wards to the front, as well as to the back, plate of the lock, in which case the key must be furnished with corresponding notches. Tomlinson. Ward penny (O. Eng. Law), money paid to the sheriff or castellan for watching and warding a castle. -- Ward staff, a constable's or watchman's staff. [Obs.]\n\n1. To keep in safety; to watch; to guard; formerly, in a specific sense, to guard during the day time. Whose gates he found fast shut, no living wight To ward the same. Spenser. 2. To defend; to protect. Tell him it was a hand that warded him From thousand dangers. Shak. 3. To defend by walls, fortifications, etc. [Obs.] 4. To fend off; to repel; to turn aside, as anything mischievous that approaches; -- usually followed by off. Now wards a felling blow, now strikes again. Daniel. The pointed javelin warded off his rage. Addison. It instructs the scholar in the various methods of warding off the force of objections. I. Watts.\n\n1. To be vigilant; to keep guard. 2. To act on the defensive with a weapon. She redoubling her blows drove the stranger to no other shift than to ward and go back. Sir P. Sidney."}