{"word":"warrant","definition":"1. That which warrants or authorizes; a commission giving authority, or justifying the doing of anything; an act, instrument, or obligation, by which one person authorizes another to do something which he has not otherwise a right to do; an act or instrument investing one with a right or authority, and thus securing him from loss or damage; commission; authority. Specifically: -- (a) A writing which authorizes a person to receive money or other thing. (b) (Law) A precept issued by a magistrate authorizing an officer to make an arrest, a seizure, or a search, or do other acts incident to the administration of justice. (c) (Mil. & Nav.) An official certificate of appointment issued to an officer of lower rank than a commissioned officer. See Warrant officer, below. 2. That which vouches or insures for anything; guaranty; security. I give thee warrant of thy place. Shak. His worth is warrant for his welcome hither. Shak. 3. That which attests or proves; a voucher. 4. Right; legality; allowance. [Obs.] Shak. Bench warrant. (Law) See in the Vocabulary. -- Dock warrant (Com.), a customhouse license or authority. -- General warrant. (Law) See under General. -- Land warrant. See under Land. -- Search warrant. (Law) See under Search, n. -- Warrant of attorney (Law), written authority given by one person to another empowering him to transact business for him; specifically, written authority given by a client to his attorney to appear for him in court, and to suffer judgment to pass against him by confession in favor of some specified person. Bouvier. -- Warrant officer, a noncommissioned officer, as a sergeant, corporal, bandmaster, etc., in the army, or a quartermaster, gunner, boatswain, etc., in the navy. -- Warrant to sue and defend. (a) (O. Eng. Law) A special warrant from the crown, authorizing a party to appoint an attorney to sue or defend for him. (b) A special authority given by a party to his attorney to commence a suit, or to appear and defend a suit in his behalf. This warrant is now disused. Burrill.\n\n1. To make secure; to give assurance against harm; to guarantee safety to; to give authority or power to do, or forbear to do, anything by which the person authorized is secured, or saved harmless, from any loss or damage by his action. That show I first my body to warrant. Chaucer. I'll warrant him from drowning. Shak. In a place Less warranted than this, or less secure, I can not be. Milton. 2. To support by authority or proof; to justify; to maintain; to sanction; as, reason warrants it. True fortitude is seen in great exploits, That justice warrants, and that wisdom guides. Addison. How little while it is since he went forth out of his study, -- chewing a Hebrew text of Scripture in his mouth, I warrant. Hawthorne. 3. To give a warrant or warranty to; to assure as if by giving a warrant to. [My neck is] as smooth as silk, I warrant ye. L' Estrange. 4. (Law) (a) To secure to, as a grantee, an estate granted; to assure. (b) To secure to, as a purchaser of goods, the title to the same; to indemnify against loss. (c) To secure to, as a purchaser, the quality or quantity of the goods sold, as represented. See Warranty, n., 2. (d) To assure, as a thing sold, to the purchaser; that is, to engage that the thing is what it appears, or is represented, to be, which implies a covenant to make good any defect or loss incurred by it."}