{"word":"waste","definition":"1. Desolate; devastated; stripped; bare; hence, dreary; dismal; gloomy; cheerless. The dismal situation waste and wild. Milton. His heart became appalled as he gazed forward into the waste darkness of futurity. Sir W. Scott. 2. Lying unused; unproductive; worthless; valueless; refuse; rejected; as, waste land; waste paper. But his waste words returned to him in vain. Spenser. Not a waste or needless sound, Till we come to holier ground. Milton. Ill day which made this beauty waste. Emerson. 3. Lost for want of occupiers or use; superfluous. And strangled with her waste fertility. Milton. Waste gate, a gate by which the superfluous water of a reservoir, or the like, is discharged. -- Waste paper. See under Paper. -- Waste pipe, a pipe for carrying off waste, or superfluous, water or other fluids. Specifically: (a) (Steam Boilers) An escape pipe. See under Escape. (b) (Plumbing) The outlet pipe at the bottom of a bowl, tub, sink, or the like. -- Waste steam. (a) Steam which escapes the air. (b) Exhaust steam. -- Waste trap, a trap for a waste pipe, as of a sink.\n\n1. To bring to ruin; to devastate; to desolate; to destroy. Thou barren ground, whom winter's wrath hath wasted, Art made a mirror to behold my plight. Spenser. The Tiber Insults our walls, and wastes our fruitful grounds. Dryden. 2. To wear away by degrees; to impair gradually; to diminish by constant loss; to use up; to consume; to spend; to wear out. Until your carcasses be wasted in the wilderness. Num. xiv. 33. O, were I able To waste it all myself, and leave ye none! Milton. Here condemned To waste eternal days in woe and pain. Milton. Wasted by such a course of life, the infirmities of age daily grew on him. Robertson. 3. To spend unnecessarily or carelessly; to employ prodigally; to expend without valuable result; to apply to useless purposes; to lavish vainly; to squander; to cause to be lost; to destroy by scattering or injury. The younger son gathered all together, and . . . wasted his substance with riotous living. Luke xv. 13. Full many a flower is born to blush unseen, And waste its sweetness on the desert air. Gray. 4. (Law)  To damage, impair, or injure, as an estate, voluntarily, or by suffering the buildings, fences, etc., to go to decay. Syn. -- To squander; dissipate; lavish; desolate.\n\n1. To be diminished; to lose bulk, substance, strength, value, or the like, gradually; to be consumed; to dwindle; to grow less. The time wasteth night and day. Chaucer. The barrel of meal shall not waste. 1 Kings xvii. 14. But man dieth, and wasteth away. Job xiv. 10. 2. (Sporting)  To procure or sustain a reduction of flesh; -- said of a jockey in preparation for a race, etc.\n\n1. The act of wasting, or the state of being wasted; a squandering; needless destruction; useless consumption or expenditure; devastation; loss without equivalent gain; gradual loss or decrease, by use, wear, or decay; as, a waste of property, time, labor, words, etc. \"Waste . . . of catel and of time.\" Chaucer. For all this waste of wealth loss of blood. Milton. He will never . . . in the way of waste, attempt us again. Shak. Little wastes in great establishments, constantly occurring, may defeat the energies of a mighty capital. L. Beecher. 2. That which is wasted or desolate; a devastated, uncultivated, or wild country; a deserted region; an unoccupied or unemployed space; a dreary void; a desert; a wilderness. \"The wastes of Nature.\" Emerson. All the leafy nation sinks at last, And Vulcan rides in triumph o'er the waste. Dryden. The gloomy waste of waters which bears his name is his tomb and his monument. Bancroft. 3. That which is of no value; worthless remnants; refuse. Specifically: Remnants of cops, or other refuse resulting from the working of cotton, wool, hemp, and the like, used for wiping machinery, absorbing oil in the axle boxes of railway cars, etc. 4. (Law)  Spoil, destruction, or injury, done to houses, woods, fences, lands, etc., by a tenant for life or for years, to the prejudice of the heir, or of him in reversion or remainder. Note: Waste is voluntary, as by pulling down buildings; or permissive, as by suffering them to fall for want of necessary repairs. Whatever does a lasting damage to the freehold is a waste. Blackstone. 5. (Mining)  Old or abandoned workings, whether left as vacant space or filled with refuse. Syn. -- Prodigality; diminution; loss; dissipation; destruction; devastation; havoc; desolation; ravage."}