{"word":"watch","definition":"1. The act of watching; forbearance of sleep; vigil; wakeful, vigilant, or constantly observant attention; close observation; guard; preservative or preventive vigilance; formerly, a watching or guarding by night. Shepherds keeping watch by night. Milton. All the long night their mournful watch they keep. Addison. Note: Watch was formerly distinguished from ward, the former signifying a watching or guarding by night, and the latter a watching, guarding, or protecting by day Hence, they were not unfrequently used together, especially in the phrase to keep watch and ward, to denote continuous and uninterrupted vigilance or protection, or both watching and guarding. This distinction is now rarely recognized, watch being used to signify a watching or guarding both by night and by day, and ward, which is now rarely used, having simply the meaning of guard, or protection, without reference to time. Still, when she slept, he kept both watch and ward. Spenser. Ward, guard, or custodia, is chiefly applied to the daytime, in order to apprehend rioters, and robbers on the highway . . . Watch, is properly applicable to the night only, . . . and it begins when ward ends, and ends when that begins. Blackstone. 2. One who watches, or those who watch; a watchman, or a body of watchmen; a sentry; a guard. Pilate said unto them, Ye have a watch; go your way, make it as sure as ye can. Matt. xxvii. 65. 3. The post or office of a watchman; also, the place where a watchman is posted, or where a guard is kept. He upbraids Iago, that he made him Brave me upon the watch. Shak. 4. The period of the night during which a person does duty as a sentinel, or guard; the time from the placing of a sentinel till his relief; hence, a division of the night. I did stand my watch upon the hill. Shak. Might we but hear . . . Or whistle from the lodge, or village cock Count the night watches to his feathery dames. Milton. 5. A small timepiece, or chronometer, to be carried about the person, the machinery of which is moved by a spring. Note: Watches are often distinguished by the kind of escapement used, as an anchor watch, a lever watch, a chronometer watch, etc. (see the Note under Escapement, n., 3); also, by the kind of case, as a gold or silver watch, an open-faced watch, a hunting watch, or hunter, etc. 6. (Naut.) (a) An allotted portion of time, usually four hour for standing watch, or being on deck ready for duty. Cf. Dogwatch. (b) That part, usually one half, of the officers and crew, who together attend to the working of a vessel for an allotted time, usually four hours. The watches are designated as the port watch, and the starboard watch. Anchor watch (Naut.), a detail of one or more men who keep watch on deck when a vessel is at anchor. -- To be on the watch, to be looking steadily for some event. -- Watch and ward (Law), the charge or care of certain officers to keep a watch by night and a guard by day in towns, cities, and other districts, for the preservation of the public peace. Wharton. Burrill. -- Watch and watch (Naut.), the regular alternation in being on watch and off watch of the two watches into which a ship's crew is commonly divided. -- Watch barrel, the brass box in a watch, containing the mainspring. -- Watch bell (Naut.), a bell struck when the half-hour glass is run out, or at the end of each half hour. Craig. -- Watch bill (Naut.), a list of the officers and crew of a ship as divided into watches, with their stations. Totten. -- Watch case, the case, or outside covering, of a watch; also, a case for holding a watch, or in which it is kept. -- Watch chain. Same as watch guard, below. -- Watch clock, a watchman's clock; see under Watchman. -- Watch fire, a fire lighted at night, as a signal, or for the use of a watch or guard. -- Watch glass. (a) A concavo-convex glass for covering the face, or dial, of a watch; -- also called watch crystal. (b) (Naut.) A half- hour glass used to measure the time of a watch on deck.(Chem.) A round concavo-convex glass of shallow depth used for certain manipulations of chemicals in a laboratory. -- Watch guard, a chain or cord by which a watch is attached to the person. -- Watch gun (Naut.), a gun sometimes fired on shipboard at 8 p. m., when the night watch begins. -- Watch light, a low-burning lamp used by watchers at night; formerly, a candle having a rush wick. -- Watch night, The last night of the year; -- so called by the Methodists, Moravians, and others, who observe it by holding religious meetings lasting until after midnight. -- Watch paper, an old-fashioned ornament for the inside of a watch case, made of paper cut in some fanciful design, as a vase with flowers, etc. -- Watch tackle (Naut.), a small, handy purchase, consisting of a tailed double block, and a single block with a hook.\n\n1. To be awake; to be or continue without sleep; to wake; to keep vigil. I have two nights watched with you. Shak. Couldest thou not watch one hour Mark xiv. 37. 2. To be attentive or vigilant; to give heed; to be on the lookout; to keep guard; to act as sentinel. Take ye heed, watch and pray. Mark xiii. 33. The Son gave signal high To the bright minister that watched. Milton. 3. To be expectant; to look with expectation; to wait; to seek opportunity. My soul waiteth for the Lord more than they that watch for the morning. Ps. cxxx. 6. 4. To remain awake with any one as nurse or attendant; to attend on the sick during the night; as, to watch with a man in a fever. 5. (Naut.)  To serve the purpose of a watchman by floating properly in its place; -- said of a buoy. To watch over, to be cautiously observant of; to inspect, superintend, and guard.\n\n1. To give heed to; to observe the actions or motions of, for any purpose; to keep in view; not to lose from sight and observation; as, to watch the progress of a bill in the legislature. Saul also sent messengers unto David's house to watch him, and to slay him. 1 Sam. xix. 11 I must cool a little, and watch my opportunity. Landor. In lazy mood I watched the little circles die. Longfellow. 2. To tend; to guard; to have in keeping. And flaming ministers, to watch and tend Their earthy charge. Milton. Paris watched the flocks in the groves of Ida. Broome."}