{"word":"wax","definition":"1. To increase in size; to grow bigger; to become larger or fuller; - - opposed to wane. The waxing and the waning of the moon. Hakewill. Truth's treasures . . . never shall wax ne wane. P. Plowman. 2. To pass from one state to another; to become; to grow; as, to wax strong; to wax warmer or colder; to wax feeble; to wax old; to wax worse and worse. Your clothes are not waxen old upon you. Deut. xxix. 5. Where young Adonis oft reposes, Waxing well of his deep wound. Milton. Waxing kernels (Med.), small tumors formed by the enlargement of the lymphatic glands, especially in the groins of children; -- popularly so called, because supposed to be caused by growth of the body. Dunglison.\n\n1. A fatty, solid substance, produced by bees, and employed by them in the construction of their comb; -- usually called beeswax. It is first excreted, from a row of pouches along their sides, in the form of scales, which, being masticated and mixed with saliva, become whitened and tenacious. Its natural color is pale or dull yellow. Note: Beeswax consists essentially of cerotic acid (constituting the more soluble part) and of myricyl palmitate (constituting the less soluble part). 2. Hence, any substance resembling beeswax in consistency or appearance. Specifically: --(a) (Physiol.)  Cerumen, or earwax. See Cerumen. (b) A waxlike composition used for uniting surfaces, for excluding air, and for other purposes; as, sealing wax, grafting wax, etching wax, etc. (c) A waxlike composition used by shoemakers for rubbing their thread. (d) (Zoöl.) A substance similar to beeswax, secreted by several species of scale insects, as the Chinese wax. See Wax insect, below. (e) (Bot.) A waxlike product secreted by certain plants. See Vegetable wax, under Vegetable. (f) (Min.)  A substance, somewhat resembling wax, found in connection with certain deposits of rock salt and coal; -- called also mineral wax, and ozocerite. (g) Thick sirup made by boiling down the sap of the sugar maple, and then cooling. [Local U.S.] Japanese wax, a waxlike substance made in Japan from the berries of certain species of Rhus, esp. R. succedanea. -- Mineral wax. (Min.) See Wax, 2 (f), above. -- Wax cloth. See Waxed cloth, under Waxed. -- Wax end. See Waxed end, under Waxed. -- Wax flower, a flower made of, or resembling, wax. -- Wax insect (Zoöl.), any one of several species of scale insects belonging to the family Coccidæ, which secrete from their bodies a waxlike substance, especially the Chinese wax insect (Coccus Sinensis) from which a large amount of the commercial Chinese wax is obtained. Called also pela. -- Wax light, a candle or taper of wax. -- Wax moth (Zoöl.), a pyralid moth (Galleria cereana) whose larvæ feed upon honeycomb, and construct silken galleries among the fragments. The moth has dusky gray wings streaked with brown near the outer edge. The larva is yellowish white with brownish dots. Called also bee moth. -- Wax myrtle. (Bot.) See Bayberry. -- Wax painting, a kind of painting practiced by the ancients, under the name of encaustic. The pigments were ground with wax, and diluted. After being applied, the wax was melted with hot irons and the color thus fixed. -- Wax palm. (Bot.) (a) A species of palm (Ceroxylon Andicola) native of the Andes, the stem of which is covered with a secretion, consisting of two thirds resin and one third wax, which, when melted with a third of fat, makes excellent candles. (b) A Brazilian tree (Copernicia cerifera) the young leaves of which are covered with a useful waxy secretion. -- Wax paper, paper prepared with a coating of white wax and other ingredients. -- Wax plant (Bot.), a name given to several plants, as: (a) The Indian pipe (see under Indian). (b) The Hoya carnosa, a climbing plant with polished, fleshy leaves. (c) Certain species of Begonia with similar foliage. -- Wax tree (Bot.) (a) A tree or shrub (Ligustrum lucidum) of China, on which certain insects make a thick deposit of a substance resembling white wax. (b) A kind of sumac (Rhus succedanea) of Japan, the berries of which yield a sort of wax. (c) A rubiaceous tree (Elæagia utilis) of New Grenada, called by the inhabitants \"arbol del cera.\" -- Wax yellow, a dull yellow, resembling the natural color of beeswax.\n\nTo smear or rub with wax; to treat with wax; as, to wax a thread or a table. Waxed cloth, cloth covered with a coating of wax, used as a cover, of tables and for other purposes; -- called also wax cloth. -- Waxed end, a thread pointed with a bristle and covered with shoemaker's wax, used in sewing leather, as for boots, shoes, and the like; -- called also wax end. Brockett."}