{"word":"way","definition":"Away. [Obs. or Archaic] Chaucer. To do way, to take away; to remove. [Obs.] \"Do way your hands.\" Chaucer. -- To make way with, to make away with. See under Away. [Archaic]\n\n1. That by, upon, or along, which one passes or processes; opportunity or room to pass; place of passing; passage; road, street, track, or path of any kind; as, they built a way to the mine. \"To find the way to heaven.\" Shak. I shall him seek by way and eke by street. Chaucer. The way seems difficult, and steep to scale. Milton. The season and ways were very improper for his majesty's forces to march so great a distance. Evelyn. 2. Length of space; distance; interval; as, a great way; a long way. And whenever the way seemed long, Or his heart began to fail. Longfellow. 3. A moving; passage; procession; journey. I prythee, now, lead the way. Shak. 4. Course or direction of motion or process; tendency of action; advance. If that way be your walk, you have not far. Milton. And let eternal justice take the way. Dryden. 5. The means by which anything is reached, or anything is accomplished; scheme; device; plan. My best way is to creep under his gaberdine. Shak. By noble ways we conquest will prepare. Dryden. What impious ways my wishes took! Prior. 6. Manner; method; mode; fashion; style; as, the way of expressing one's ideas. 7. Regular course; habitual method of life or action; plan of conduct; mode of dealing. \"Having lost the way of nobleness.\" Sir. P. Sidney. Her ways are ways of pleasantness, and all her paths are peace. Prov. iii. 17. When men lived in a grander way. Longfellow. 8. Sphere or scope of observation. Jer. Taylor. The public ministers that fell in my way. Sir W. Temple. 9. Determined course; resolved mode of action or conduct; as, to have one's way. 10. (Naut.) (a) Progress; as, a ship has way. (b) pl.  The timbers on which a ship is launched. 11. pl. (Mach.)  The longitudinal guides, or guiding surfaces, on the bed of a planer, lathe, or the like, along which a table or carriage moves. 12. (Law)  Right of way. See below. By the way, in passing; apropos; aside; apart from, though connected with, the main object or subject of discourse. -- By way of, for the purpose of; as being; in character of. -- Covert way. (Fort.) See Covered way, under Covered. -- In the family way. See under Family. -- In the way, so as to meet, fall in with, obstruct, hinder, etc. -- In the way with, traveling or going with; meeting or being with; in the presence of. -- Milky way. (Astron.) See Galaxy, 1. -- No way, No ways. See Noway, Noways, in the Vocabulary. -- On the way, traveling or going; hence, in process; advancing toward completion; as, on the way to this country; on the way to success. -- Out of the way. See under Out. -- Right of way (Law), a right of private passage over another's ground. It may arise either by grant or prescription. It may be attached to a house, entry, gate, well, or city lot, as well as to a country farm. Kent. -- To be under way, or To have way (Naut.), to be in motion, as when a ship begins to move. -- To give way. See under Give. -- To go one's way, or To come one's way, to go or come; to depart or come along. Shak. -- To go the way of all the earth, to die. -- To make one's way, to advance in life by one's personal efforts. -- To make way. See under Make, v. t. -- Ways and means. (a) Methods; resources; facilities. (b) (Legislation) Means for raising money; resources for revenue. -- Way leave, permission to cross, or a right of way across, land; also, rent paid for such right. [Eng] -- Way of the cross (Eccl.), the course taken in visiting in rotation the stations of the cross. See Station, n., 7 (c). -- Way of the rounds (Fort.), a space left for the passage of the rounds between a rampart and the wall of a fortified town. -- Way pane, a pane for cartage in irrigated land. See Pane, n., 4. [Prov. Eng.] -- Way passenger, a passenger taken up, or set down, at some intermediate place between the principal stations on a line of travel. -- Ways of God, his providential government, or his works. -- Way station, an intermediate station between principal stations on a line of travel, especially on a railroad. -- Way train, a train which stops at the intermediate, or way, stations; an accommodation train. -- Way warden, the surveyor of a road. Syn. -- Street; highway; road. -- Way, Street, Highway, Road. Way is generic, denoting any line for passage or conveyance; a highway is literally one raised for the sake of dryness and convenience in traveling; a road is, strictly, a way for horses and carriages; a street is, etymologically, a paved way, as early made in towns and cities; and, hence, the word is distinctively applied to roads or highways in compact settlements. All keep the broad highway, and take delight With many rather for to go astray. Spenser. There is but one road by which to climb up. Addison. When night Darkens the streets, then wander forth the sons Of Belial, flown with insolence and wine. Milton.\n\nTo go or travel to; to go in, as a way or path. [Obs.] \"In land not wayed.\" Wyclif.\n\nTo move; to progress; to go. [R.] On a time as they together wayed. Spenser."}