{"word":"weak","definition":"1. Wanting physical strength. Specifically: -- (a) Deficient in strength of body; feeble; infirm; sickly; debilitated; enfeebled; exhausted. A poor, infirm, weak, and despised old man. Shak. Weak with hunger, mad with love. Dryden. (b) Not able to sustain a great weight, pressure, or strain; as, a weak timber; a weak rope. (c) Not firmly united or adhesive; easily broken or separated into pieces; not compact; as, a weak ship. (d) Not stiff; pliant; frail; soft; as, the weak stalk of a plant. (e) Not able to resist external force or onset; easily subdued or overcome; as, a weak barrier; as, a weak fortress. (f) Lacking force of utterance or sound; not sonorous; low; small; feeble; faint. A voice not soft, weak, piping, and womanish. Ascham. (g) Not thoroughly or abundantly impregnated with the usual or required ingredients, or with stimulating and nourishing substances; of less than the usual strength; as, weak tea, broth, or liquor; a weak decoction or solution; a weak dose of medicine. (h) Lacking ability for an appropriate function or office; as, weak eyes; a weak stomach; a weak magistrate; a weak regiment, or army. 2. Not possessing or manifesting intellectual, logical, moral, or political strength, vigor, etc. Specifically: - (a) Feeble of mind; wanting discernment; lacking vigor; spiritless; as, a weak king or magistrate. To think every thing disputable is a proof of a weak mind and captious temper. Beattie. Origen was never weak enough to imagine that there were two Gods. Waterland. (b) Resulting from, or indicating, lack of judgment, discernment, or firmness; unwise; hence, foolish. If evil thence ensue, She first his weak indulgence will accuse. Milton. (c) Not having full confidence or conviction; not decided or confirmed; vacillating; wavering. Him that is weak in the faith receive ye, but not to doubtful disputations. Rom. xiv. 1. (d) Not able to withstand temptation, urgency, persuasion, etc.; easily impressed, moved, or overcome; accessible; vulnerable; as, weak resolutions; weak virtue. Guard thy heart On this weak side, where most our nature fails. Addison. (e) Wanting in power to influence or bind; as, weak ties; a weak sense of honor of duty. (f) Not having power to convince; not supported by force of reason or truth; unsustained; as, a weak argument or case. \"Convinced of his weak arguing.\" Milton. A case so weak . . . hath much persisted in. Hooker. (g) Wanting in point or vigor of expression; as, a weak sentence; a weak style. (h) Not prevalent or effective, or not felt to be prevalent; not potent; feeble. \"Weak prayers.\" Shak. (i) Lacking in elements of political strength; not wielding or having authority or energy; deficient in the resources that are essential to a ruler or nation; as, a weak monarch; a weak government or state. I must make fair weather yet awhile, Till Henry be more weak, and I more strong. Shak. (k) (Stock Exchange)  Tending towards lower prices; as, a weak market. 3. (Gram.) (a) Pertaining to, or designating, a verb which forms its preterit (imperfect) and past participle by adding to the present the suffix - ed, -d, or the variant form -t; as in the verbs abash, abashed; abate, abated; deny, denied; feel, felt. See Strong, 19 (a). (b) Pertaining to, or designating, a noun in Anglo-Saxon, etc., the stem of which ends in -n. See Strong, 19 (b). Note: Weak is often used in the formation of self-explaining compounds; as, weak-eyed, weak-handed, weak-hearted, weak-minded, weak-spirited, and the like. Weak conjugation (Gram.), the conjugation of weak verbs; -- called also new, or regular, conjugation, and distinguished from the old, or irregular, conjugation. -- Weak declension (Anglo-Saxon Gram.), the declension of weak nouns; also, one of the declensions of adjectives. -- Weak side, the side or aspect of a person's character or disposition by which he is most easily affected or influenced; weakness; infirmity. -- Weak sore or ulcer (Med.), a sore covered with pale, flabby, sluggish granulations.\n\nTo make or become weak; to weaken. [R.] Never to seek weaking variety. Marston."}