{"word":"weather","definition":"1. The state of the air or atmosphere with respect to heat or cold, wetness or dryness, calm or storm, clearness or cloudiness, or any other meteorological phenomena; meteorological condition of the atmosphere; as, warm weather; cold weather; wet weather; dry weather, etc. Not amiss to cool a man's stomach this hot weather. Shak. Fair weather cometh out of the north. Job xxxvii. 22. 2. Vicissitude of season; meteorological change; alternation of the state of the air. Bacon. 3. Storm; tempest. What gusts of weather from that gathering cloud My thoughts presage! Dryden. 4. A light rain; a shower. [Obs.] Wyclif. Stress of weather, violent winds; force of tempests. -- To make fair weather, to flatter; to give flattering representations. [R.] -- To make good, or bad, weather (Naut.), to endure a gale well or ill; -- said of a vessel. Shak. -- Under the weather, ill; also, financially embarrassed. [Colloq. U. S.] Bartlett. -- Weather box. Same as Weather house, below. Thackeray. -- Weather breeder, a fine day which is supposed to presage foul weather. -- Weather bureau, a popular name for the signal service. See Signal service, under Signal, a. [U.S.] -- Weather cloth (Naut.), a long piece of canvas of tarpaulin used to preserve the hammocks from injury by the weather when stowed in the nettings. -- Weather door. (Mining) See Trapdoor, 2. -- Weather gall. Same as Water gall, 2. [Prov. Eng.] Halliwell. -- Weather house, a mechanical contrivance in the form of a house, which indicates changes in atmospheric conditions by the appearance or retirement of toy images. Peace to the artist whose ingenious thought Devised the weather house, that useful toy! Cowper. -- Weather molding, or Weather moulding (Arch.), a canopy or cornice over a door or a window, to throw off the rain. -- Weather of a windmill sail, the obliquity of the sail, or the angle which it makes with its plane of revolution. -- Weather report, a daily report of meteorological observations, and of probable changes in the weather; esp., one published by government authority. -- Weather spy, a stargazer; one who foretells the weather. [R.] Donne. -- Weather strip (Arch.), a strip of wood, rubber, or other material, applied to an outer door or window so as to cover the joint made by it with the sill, casings, or threshold, in order to exclude rain, snow, cold air, etc.\n\n1. To expose to the air; to air; to season by exposure to air. [An eagle] soaring through his wide empire of the air To weather his broad sails. Spenser. This gear lacks weathering. Latimer. 2. Hence, to sustain the trying effect of; to bear up against and overcome; to sustain; to endure; to resist; as, to weather the storm. For I can weather the roughest gale. Longfellow. You will weather the difficulties yet. F. W. Robertson. 3. (Naut.)  To sail or pass to the windward of; as, to weather a cape; to weather another ship. 4. (Falconry)  To place (a hawk) unhooded in the open air. Encyc. Brit. To weather a point. (a) (Naut.) To pass a point of land, leaving it on the lee side. (b) Hence, to gain or accomplish anything against opposition. -- To weather out, to encounter successfully, though with difficulty; as, to weather out a storm.\n\nTo undergo or endure the action of the atmosphere; to suffer meteorological influences; sometimes, to wear away, or alter, under atmospheric influences; to suffer waste by weather. The organisms . . . seem indestructible, while the hard matrix in which they are imbedded has weathered from around them. H. Miller.\n\nBeing toward the wind, or windward -- opposed to lee; as, weather bow, weather braces, weather gauge, weather lifts, weather quarter, weather shrouds, etc. Weather gauge. (a) (Naut.) The position of a ship to the windward of another. (b) Fig.: A position of advantage or superiority; advantage in position. To veer, and tack, and steer a cause Against the weather gauge of laws. Hudibras. -- Weather helm (Naut.), a tendency on the part of a sailing vessel to come up into the wind, rendering it necessary to put the helm up, that is, toward the weather side. -- Weather shore (Naut.), the shore to the windward of a ship. Totten. -- Weather tide (Naut.), the tide which sets against the lee side of a ship, impelling her to the windward. Mar. Dict."}