{"word":"web","definition":"A weaver. [Obs.] Chaucer.\n\n1. That which is woven; a texture; textile fabric; esp., something woven in a loom. Penelope, for her Ulysses' sake, Devised a web her wooers to deceive. Spenser. Not web might be woven, not a shuttle thrown, or penalty of exile. Bancroft. 2. A whole piece of linen cloth as woven. 3. The texture of very fine thread spun by a spider for catching insects at its prey; a cobweb. \"The smallest spider's web.\" Shak. 4. Fig.: Tissue; texture; complicated fabrication. The somber spirit of our forefathers, who wove their web of life with hardly a . . . thread of rose-color or gold. Hawthorne. Such has been the perplexing ingenuity of commentators that it is difficult to extricate the truth from the web of conjectures. W. Irving. 5. (Carriages)  A band of webbing used to regulate the extension of the hood. 6. A thin metal sheet, plate, or strip, as of lead. And Christians slain roll up in webs of lead. Fairfax. Specifically: - (a) The blade of a sword. [Obs.] The sword, whereof the web was steel, Pommel rich stone, hilt gold. Fairfax. (b) The blade of a saw. (c) The thin, sharp part of a colter. (d) The bit of a key. 7. (Mach. & Engin.)  A plate or thin portion, continuous or perforated, connecting stiffening ribs or flanges, or other parts of an object. Specifically: -- (a) The thin vertical plate or portion connecting the upper and lower flanges of an lower flanges of an iron girder, rolled beam, or railroad rail. (b) A disk or solid construction serving, instead of spokes, for connecting the rim and hub, in some kinds of car wheels, sheaves, etc. (c) The arm of a crank between the shaft and the wrist. (d) The part of a blackmith's anvil between the face and the foot. 8. (Med.)  Pterygium; -- called also webeye. Shak. 9. (Anat.)  The membrane which unites the fingers or toes, either at their bases, as in man, or for a greater part of their length, as in many water birds and amphibians. 10. (Zoöl.)  The series of barbs implanted on each side of the shaft of a feather, whether stiff and united together by barbules, as in ordinary feathers, or soft and separate, as in downy feathers. See Feather. Pin and web (Med.), two diseases of the eye, caligo and pterygium; -- sometimes wrongly explained as one disease. See Pin, n., 8, and Web, n., 8. \"He never yet had pinne or webbe, his sight for to decay.\" Gascoigne. -- Web member (Engin.), one of the braces in a web system. -- Web press, a printing press which takes paper from a roll instead of being fed with sheets. -- Web system (Engin.), the system of braces connecting the flanges of a lattice girder, post, or the like.\n\nTo unite or surround with a web, or as if with a web; to envelop; to entangle."}