{"word":"weed","definition":"1. A garment; clothing; especially, an upper or outer garment. \"Lowweeds.\" Spenser. \"Woman's weeds.\" Shak. \"This beggar woman's weed.\" Tennyson. He on his bed sat, the soft weeds he wore Put off. Chapman. 2. An article of dress worn in token of grief; a mourning garment or badge; as, he wore a weed on his hat; especially, in the plural, mourning garb, as of a woman; as, a widow's weeds. In a mourning weed, with ashes upon her head, and tears abundantly flowing. Milton.\n\nA sudden illness or relapse, often attended with fever, which attacks women in childbed. [Scot.]\n\n1. Underbrush; low shrubs. [Obs. or Archaic] One rushing forth out of the thickest weed. Spenser. A wild and wanton pard . . . Crouched fawning in the weed. Tennyson. 2. Any plant growing in cultivated ground to the injury of the crop or desired vegetation, or to the disfigurement of the place; an unsightly, useless, or injurious plant. Too much manuring filled that field with weeds. Denham. Note: The word has no definite application to any particular plant, or species of plants. Whatever plants grow among corn or grass, in hedges, or elsewhere, and are useless to man, injurious to crops, or unsightly or out of place, are denominated weeds. 3. Fig.: Something unprofitable or troublesome; anything useless. 4. (Stock Breeding)  An animal unfit to breed from. 5. Tobacco, or a cigar. [Slang] Weed hook, a hook used for cutting away or extirpating weeds. Tusser.\n\n1. To free from noxious plants; to clear of weeds; as, to weed corn or onions; to weed a garden. 2. To take away, as noxious plants; to remove, as something hurtful; to extirpate. \"Weed up thyme.\" Shak. Wise fathers . . . weeding from their children ill things. Ascham. Revenge is a kind of wild justice, which the more man's nature runs to, the more ought law to weed it out. Bacon. 3. To free from anything hurtful or offensive. He weeded the kingdom of such as were devoted to Elaiana. Howell. 4. (Stock Breeding)  To reject as unfit for breeding purposes."}