{"word":"wheel","definition":"1. A circular frame turning about an axis; a rotating disk, whether solid, or a frame composed of an outer rim, spokes or radii, and a central hub or nave, in which is inserted the axle, -- used for supporting and conveying vehicles, in machinery, and for various purposes; as, the wheel of a wagon, of a locomotive, of a mill, of a watch, etc. The gasping charioteer beneath the wheel Of his own car. Dryden. 2. Any instrument having the form of, or chiefly consisting of, a wheel. Specifically: -- (a) A spinning wheel. See under Spinning. (b) An instrument of torture formerly used. His examination is like that which is made by the rack and wheel. Addison. Note: This mode of torture is said to have been first employed in Germany, in the fourteenth century. The criminal was laid on a cart wheel with his legs and arms extended, and his limbs in that posture were fractured with an iron bar. In France, where its use was restricted to the most atrocious crimes, the criminal was first laid on a frame of wood in the form of a St. Andrew's cross, with grooves cut transversely in it above and below the knees and elbows, and the executioner struck eight blows with an iron bar, so as to break the limbs in those places, sometimes finishing by two or three blows on the chest or stomach, which usually put an end to the life of the criminal, and were hence called coups-de-grace -- blows of mercy. The criminal was then unbound, and laid on a small wheel, with his face upward, and his arms and legs doubled under him, there to expire, if he had survived the previous treatment. Brande. (c) (Naut.) A circular frame having handles on the periphery, and an axle which is so connected with the tiller as to form a means of controlling the rudder for the purpose of steering. (d) (Pottery) A potter's wheel. See under Potter. Then I went down to the potter's house, and, behold, he wrought a work on the wheels. Jer. xviii. 3. Turn, turn, my wheel! This earthen jar A touch can make, a touch can mar. Longfellow. (e) (Pyrotechny)  A firework which, while burning, is caused to revolve on an axis by the reaction of the escaping gases. (f) (Poetry) The burden or refrain of a song. Note: \"This meaning has a low degree of authority, but is supposed from the context in the few cases where the word is found.\" Nares. You must sing a-down a-down, An you call him a-down-a. O, how the wheel becomes it! Shak. 3. A bicycle or a tricycle; a velocipede. 4. A rolling or revolving body; anything of a circular form; a disk; an orb. Milton. 5. A turn revolution; rotation; compass. According to the common vicissitude and wheel of things, the proud and the insolent, after long trampling upon others, come at length to be trampled upon themselves. South. [He] throws his steep flight in many an aëry wheel. Milton. A wheel within a wheel, or Wheels within wheels, a complication of circumstances, motives, etc. -- Balance wheel. See in the Vocab. -- Bevel wheel, Brake wheel, Cam wheel, Fifth wheel, Overshot wheel, Spinning wheel, etc. See under Bevel, Brake, etc. -- Core wheel. (Mach.) (a) A mortise gear. (b) A wheel having a rim perforated to receive wooden cogs; the skeleton of a mortise gear. -- Measuring wheel, an odometer, or perambulator. -- Wheel and axle (Mech.), one of the elementary machines or mechanical powers, consisting of a wheel fixed to an axle, and used for raising great weights, by applying the power to the circumference of the wheel, and attaching the weight, by a rope or chain, to that of the axle. Called also axis in peritrochio, and perpetual lever, -- the principle of equilibrium involved being the same as in the lever, while its action is continuous. See Mechanical powers, under Mechanical. -- Wheel animal, or Wheel animalcule (Zoöl.), any one of numerous species of rotifers having a ciliated disk at the anterior end. -- Wheel barometer. (Physics) See under Barometer. -- Wheel boat, a boat with wheels, to be used either on water or upon inclined planes or railways. -- Wheel bug (Zoöl.), a large North American hemipterous insect (Prionidus cristatus) which sucks the blood of other insects. So named from the curious shape of the prothorax. -- Wheel carriage, a carriage moving on wheels. -- Wheel chains, or Wheel ropes (Naut.), the chains or ropes connecting the wheel and rudder. -- Wheel cutter, a machine for shaping the cogs of gear wheels; a gear cutter. -- Wheel horse, one of the horses nearest to the wheels, as opposed to a leader, or forward horse; -- called also wheeler. -- Wheel lathe, a lathe for turning railway-car wheels. -- Wheel lock. (a) A letter lock. See under Letter. (b) A kind of gunlock in which sparks were struck from a flint, or piece of iron pyrites, by a revolving wheel. (c) A kind of brake a carriage. -- Wheel ore (Min.), a variety of bournonite so named from the shape of its twin crystals. See Bournonite. -- Wheel pit (Steam Engine), a pit in the ground, in which the lower part of the fly wheel runs. -- Wheel plow, or Wheel plough, a plow having one or two wheels attached, to render it more steady, and to regulate the depth of the furrow. -- Wheel press, a press by which railway-car wheels are forced on, or off, their axles. -- Wheel race, the place in which a water wheel is set. -- Wheel rope (Naut.), a tiller rope. See under Tiller. -- Wheel stitch (Needlework), a stitch resembling a spider's web, worked into the material, and not over an open space. Caulfeild & S. (Dict. of Needlework). -- Wheel tree (Bot.), a tree (Aspidosperma excelsum) of Guiana, which has a trunk so curiously fluted that a transverse section resembles the hub and spokes of a coarsely made wheel. See Paddlewood. -- Wheel urchin (Zoöl.), any sea urchin of the genus Rotula having a round, flat shell. -- Wheel window (Arch.), a circular window having radiating mullions arranged like the spokes of a wheel. Cf. Rose window, under Rose.\n\n1. To convey on wheels, or in a wheeled vehicle; as, to wheel a load of hay or wood. 2. To put into a rotatory motion; to cause to turn or revolve; to cause to gyrate; to make or perform in a circle. \"The beetle wheels her droning flight.\" Gray. Now heaven, in all her glory, shone, and rolled Her motions, as the great first mover's hand First wheeled their course. Milton.\n\n1. To turn on an axis, or as on an axis; to revolve; to more about; to rotate; to gyrate. The moon carried about the earth always shows the same face to us, not once wheeling upon her own center. Bentley. 2. To change direction, as if revolving upon an axis or pivot; to turn; as, the troops wheeled to the right. Being able to advance no further, they are in a fair way to wheel about to the other extreme. South. 3. To go round in a circuit; to fetch a compass. Then wheeling down the steep of heaven he flies. Pope. 4. To roll forward. Thunder mixed with hail, Hail mixed with fire, must rend the Egyptian sky, And wheel on the earth, devouring where it rolls. Milton."}