{"word":"whip","definition":"1. To strike with a lash, a cord, a rod, or anything slender and lithe; to lash; to beat; as, to whip a horse, or a carpet. 2. To drive with lashes or strokes of a whip; to cause to rotate by lashing with a cord; as, to whip a top. 3. To punish with a whip, scourge, or rod; to flog; to beat; as, to whip a vagrant; to whip one with thirty nine lashes; to whip a perverse boy. Who, for false quantities, was whipped at school. Dryden. 4. To apply that which hurts keenly to; to lash, as with sarcasm, abuse, or the like; to apply cutting language to. They would whip me with their fine wits. Shak. 5. To thrash; to beat out, as grain, by striking; as, to whip wheat. 6. To beat (eggs, cream, or the like) into a froth, as with a whisk, fork, or the like. 7. To conquer; to defeat, as in a contest or game; to beat; to surpass. [Slang, U. S.] 8. To overlay (a cord, rope, or the like) with other cords going round and round it; to overcast, as the edge of a seam; to wrap; -- often with about, around, or over. Its string is firmly whipped about with small gut. Moxon. 9. To sew lightly; specifically, to form (a fabric) into gathers by loosely overcasting the rolled edge and drawing up the thread; as, to whip a ruffle. In half-whipped muslin needles useless lie. Gay. 10. To take or move by a sudden motion; to jerk; to snatch; -- with into, out, up, off, and the like. She, in a hurry, whips up her darling under her arm. L'Estrange. He whips out his pocketbook every moment, and writes descriptions of everything he sees. Walpole. 11. (Naut.) (a) To hoist or purchase by means of a whip. (b) To secure the end of (a rope, or the like) from untwisting by overcasting it with small stuff. 12. To fish (a body of water) with a rod and artificial fly, the motion being that employed in using a whip. Whipping their rough surface for a trout. Emerson. To whip in, to drive in, or keep from scattering, as hounds in a hurt; hence, to collect, or to keep together, as member of a party, or the like. -- To whip the cat. (a) To practice extreme parsimony. [Prov. Eng.] Forby. (b) To go from house to house working by the day, as itinerant tailors and carpenters do. [Prov. & U. S.]\n\nTo move nimbly; to start or turn suddenly and do something; to whisk; as, he whipped around the corner. With speed from thence he whipped. Sackville. Two friends, traveling, met a bear upon the way; the one whips up a tree, and the other throws himself flat upon the ground. L'Estrange.\n\n1. An instrument or driving horses or other animals, or for correction, consisting usually of a lash attached to a handle, or of a handle and lash so combined as to form a flexible rod. \"[A] whip's lash.\" Chaucer. In his right hand he holds a whip, with which he is supposed to drive the horses of the sun. Addison. 2. A coachman; a driver of a carriage; as, a good whip. Beaconsfield. 3. (Mach.) (a) One of the arms or frames of a windmill, on which the sails are spread. (b) The length of the arm reckoned from the shaft. 4. (Naut.) (a) A small tackle with a single rope, used to hoist light bodies. (b) The long pennant. See Pennant (a) 5. A huntsman who whips in the hounds; whipper-in. 6. (Eng. Politics) (a) A person (as a member of Parliament) appointed to enforce party discipline, and secure the attendance of the members of a Parliament party at any important session, especially when their votes are needed. (b) A call made upon members of a Parliament party to be in their places at a given time, as when a vote is to be taken. Whip and spur, with the utmost haste. -- Whip crane, or Whip purchase, a simple form of crane having a small drum from which the load is suspended, turned by pulling on a rope wound around larger drum on the same axle. -- Whip gin. See Gin block, under 5th Gin. -- Whip grafting. See under Grafting. -- Whip hand, the hand with which the whip is used; hence, advantage; mastery; as, to have or get the whip hand of a person. Dryden. -- Whip ray (Zoöl.), the European eagle ray. See under Ray. -- Whip roll (Weaving), a roll or bar, behind the reeds in a loom, on which the warp threads rest. -- Whip scorpion (Zoöl.), any one of numerous species of arachnids belonging to Thelyphonus and allied genera. They somewhat resemble true scorpions, but have a long, slender bristle, or lashlike organ, at the end of the body, instead of a sting. -- Whip snake (Zoöl.), any one of various species of slender snakes. Specifically: (a) A bright green South American tree snake (Philodryas viridissimus) having a long and slender body. It is not venomous. Called also emerald whip snake. (b) The coachwhip snake."}