{"word":"white","definition":"1. Reflecting to the eye all the rays of the spectrum combined; not tinted with any of the proper colors or their mixtures; having the color of pure snow; snowy; -- the opposite of Ant: black or dark; as, white paper; a white skin. \"Pearls white.\" Chaucer. White as the whitest lily on a stream. Longfellow. 2. Destitute of color, as in the cheeks, or of the tinge of blood color; pale; pallid; as, white with fear. Or whispering with white lips, \"The foe! They come! they come!\" Byron. 3. Having the color of purity; free from spot or blemish, or from guilt or pollution; innocent; pure. White as thy fame, and as thy honor clear. Dryden. No whiter page than Addison's remains. Pope. 4. Gray, as from age; having silvery hair; hoary. Your high engendered battles 'gainst a head So old and white as this. Shak. 5. Characterized by freedom from that which disturbs, and the like; fortunate; happy; favorable. On the whole, however, the dominie reckoned this as one of the white days of his life. Sir W. Scott. 6. Regarded with especial favor; favorite; darling. Come forth, my white spouse. Chaucer. I am his white boy, and will not be gullet. Ford. Note: White is used in many self-explaining compounds, as white- backed, white-bearded, white-footed. White alder. (Bot.) See Sweet pepper bush, under Pepper. -- White ant (Zoöl.), any one of numerous species of social pseudoneuropterous insects of the genus Termes. These insects are very abundant in tropical countries, and form large and complex communities consisting of numerous asexual workers of one or more kinds, of large-headed asexual individuals called soldiers, of one or more queens (or fertile females) often having the body enormously distended by the eggs, and, at certain seasons of numerous winged males, together with the larvæ and pupæ of each kind in various stages of development. Many of the species construct large and complicated nests, sometimes in the form of domelike structures rising several feet above the ground and connected with extensive subterranean galleries and chambers. In their social habits they closely resemble the true ants. They feed upon animal and vegetable substances of various kinds, including timber, and are often very destructive to buildings and furniture. -- White arsenic (Chem.), arsenious oxide, As2O3, a substance of a white color, and vitreous adamantine luster, having an astringent, sweetish taste. It is a deadly poison. -- White bass (Zoöl.), a fresh-water North American bass (Roccus chrysops) found in the Great Likes. -- White bear (Zoöl.), the polar bear. See under Polar. -- White blood cell. (Physiol.) See Leucocyte. -- White brand (Zoöl.), the snow goose. -- White brass, a white alloy of copper; white copper. -- White campion. (Bot.) (a) A kind of catchfly (Silene stellata) with white flowers. (b) A white-flowered Lychnis (Lychnis vespertina). -- White canon (R. C. Ch.), a Premonstratensian. -- White caps, the members of a secret organization in various of the United States, who attempt to drive away or reform obnoxious persons by lynch-law methods. They appear masked in white. -- White cedar (Bot.), an evergreen tree of North America (Thuja occidentalis), also the related Cupressus thyoides, or Chamæcyparis sphæroidea, a slender evergreen conifer which grows in the so-called cedar swamps of the Northern and Atlantic States. Both are much valued for their durable timber. In California the name is given to the Libocedrus decurrens, the timber of which is also useful, though often subject to dry rot. Goodale. The white cedar of Demerara, Guiana, etc., is a lofty tree (Icica, or Bursera, altissima) whose fragrant wood is used for canoes and cabinetwork, as it is not attacked by insect. -- White cell. (Physiol.) See Leucocyte. -- White cell-blood (Med.), leucocythæmia. -- White clover (Bot.), a species of small perennial clover bearing white flowers. It furnishes excellent food for cattle and horses, as well as for the honeybee. See also under Clover. -- White copper, a whitish alloy of copper. See German silver, under German. -- White copperas (Min.), a native hydrous sulphate of iron; coquimbite. -- White coral (Zoöl.), an ornamental branched coral (Amphihelia oculata) native of the Mediterranean. -- White corpuscle. (Physiol.) See Leucocyte. -- White cricket (Zoöl.), the tree cricket. -- White crop, a crop of grain which loses its green color, or becomes white, in ripening, as wheat, rye, barley, and oats, as distinguished from a green crop, or a root crop. -- White currant (Bot.), a variety of the common red currant, having white berries. -- White daisy (Bot.), the oxeye daisy. See under Daisy. -- White damp, a kind of poisonous gas encountered in coal mines. Raymond. -- White elephant (Zoöl.), a whitish, or albino, variety of the Asiatic elephant. -- White elm (Bot.), a majestic tree of North America (Ulmus Americana), the timber of which is much used for hubs of wheels, and for other purposes. -- White ensign. See Saint George's ensign, under Saint. -- White feather, a mark or symbol of cowardice. See To show the white feather, under Feather, n. -- White fir (Bot.), a name given to several coniferous trees of the Pacific States, as Abies grandis, and A. concolor. -- White flesher (Zoöl.), the ruffed grouse. See under Ruffed. [Canada] -- White frost. See Hoarfrost. -- White game (Zoöl.), the white ptarmigan. -- White garnet (Min.), leucite. -- White grass (Bot.), an American grass (Leersia Virginica) with greenish-white paleæ. -- White grouse. (Zoöl.) (a) The white ptarmigan. (b) The prairie chicken. [Local, U. S.] -- White grub (Zoöl.), the larva of the June bug and other allied species. These grubs eat the roots of grasses and other plants, and often do much damage. -- White hake (Zoöl.), the squirrel hake. See under Squirrel. -- White hawk, or kite (Zoöl.), the hen harrier. -- White heat, the temperature at which bodies become incandescent, and appear white from the bright light which they emit. -- White hellebore (Bot.), a plant of the genus Veratrum (V. album) See Hellebore, 2. -- White herring, a fresh, or unsmoked, herring, as distinguished from a red, or cured, herring. [R.] Shak. -- White hoolet (Zoöl.), the barn owl. [Prov. Eng.] -- White horses (Naut.), white-topped waves; whitecaps. -- The White House. See under House. -- White ibis (Zoöl.), an American ibis (Guara alba) having the plumage pure white, except the tips of the wings, which are black. It inhabits tropical America and the Southern United States. Called also Spanish curlew. -- White iron. (a) Thin sheets of iron coated with tin; tinned iron. (b) A hard, silvery-white cast iron containing a large proportion of combined carbon. -- White iron pyrites (Min.), marcasite. -- White land, a tough clayey soil, of a whitish hue when dry, but blackish after rain. [Eng.] -- White lark (Zoöl.), the snow bunting. -- White lead. (a) A carbonate of lead much used in painting, and for other purposes; ceruse. (b) (Min.) Native lead carbonate; cerusite. -- White leather, buff leather; leather tanned with alum and salt. -- White leg (Med.), milk leg. See under Milk. -- White lettuce (Bot.), rattlesnake root. See under Rattlesnake. -- White lie. See under Lie. -- White light. (a) (Physics) Light having the different colors in the same proportion as in the light coming directly from the sun, without having been decomposed, as by passing through a prism. See the Note under Color, n., 1. (b) A kind of firework which gives a brilliant white illumination for signals, etc. -- White lime, a solution or preparation of lime for whitewashing; whitewash. -- White line (Print.), a void space of the breadth of a line, on a printed page; a blank line. -- White meat. (a) Any light-colored flesh, especially of poultry. (b) Food made from milk or eggs, as butter, cheese, etc. Driving their cattle continually with them, and feeding only upon their milk and white meats. Spenser. -- White merganser (Zoöl.), the smew. -- White metal. (a) Any one of several white alloys, as pewter, britannia, etc. (b) (Metal.) A fine grade of copper sulphide obtained at a certain stage in copper smelting. -- White miller. (Zoöl.) (a) The common clothes moth. (b) A common American bombycid moth (Spilosoma Virginica) which is pure white with a few small black spots; -- called also ermine moth, and virgin moth. See Woolly bear, under Woolly. -- White money, silver money. -- White mouse (Zoöl.), the albino variety of the common mouse. -- White mullet (Zoöl.), a silvery mullet (Mugil curema) ranging from the coast of the United States to Brazil; -- called also blue- back mullet, and liza. -- White nun (Zoöl.), the smew; -- so called from the white crest and the band of black feathers on the back of its head, which give the appearance of a hood. -- White oak. (Bot.) See under Oak. -- White owl. (Zoöl.) (a) The snowy owl. (b) The barn owl. -- White partridge (Zoöl.), the white ptarmigan. -- White perch. (Zoöl.) (a) A North American fresh-water bass (Morone Americana) valued as a food fish. (b) The croaker, or fresh- water drum. (c) Any California surf fish. -- White pine. (Bot.) See the Note under Pine. -- White poplar (Bot.), a European tree (Populus alba) often cultivated as a shade tree in America; abele. -- White poppy (Bot.), the opium-yielding poppy. See Poppy. -- White powder, a kind of gunpowder formerly believed to exist, and to have the power of exploding without noise. [Obs.] A pistol charged with white powder. Beau. & Fl. -- White precipitate. (Old Chem.) See under Precipitate. -- White rabbit. (Zoöl.) (a) The American northern hare in its winter pelage. (b) An albino rabbit. -- White rent, (a) (Eng. Law) Formerly, rent payable in silver; -- opposed to black rent. See Blackmail, n., 3. (b) A rent, or duty, of eight pence, payable yearly by every tinner in Devon and Cornwall to the Duke of Cornwall, as lord of the soil. [Prov. Eng.] -- White rhinoceros. (Zoöl.) (a) The one-horned, or Indian, rhinoceros (Rhinoceros Indicus). See Rhinoceros. (b) The umhofo. -- White ribbon, the distinctive badge of certain organizations for the promotion of temperance or of moral purity; as, the White-ribbon Army. -- White rope (Naut.), untarred hemp rope. -- White rot. (Bot.) (a) Either of several plants, as marsh pennywort and butterwort, which were thought to produce the disease called rot in sheep. (b) A disease of grapes. See White rot, under Rot. -- White sage (Bot.), a white, woolly undershrub (Eurotia lanata) of Western North America; -- called also winter fat. -- White salmon (Zoöl.), the silver salmon. -- White salt, salt dried and calcined; decrepitated salt. -- White scale (Zoöl.), a scale insect (Aspidiotus Nerii) injurious to the orange tree. See Orange scale, under Orange. -- White shark (Zoöl.), a species of man-eating shark. See under Shark. -- White softening. (Med.) See Softening of the brain, under Softening. -- White spruce. (Bot.) See Spruce, n., 1. -- White squall (Naut.), a sudden gust of wind, or furious blow, which comes up without being marked in its approach otherwise than by whitecaps, or white, broken water, on the surface of the sea. -- White staff, the badge of the lord high treasurer of England. Macaulay. -- White stork (Zoöl.), the common European stork. -- White sturgeon. (Zoöl.) See Shovelnose (d). -- White sucker. (Zoöl.) (a) The common sucker. (b) The common red horse (Moxostoma macrolepidotum). -- White swelling (Med.), a chronic swelling of the knee, produced by a strumous inflammation of the synovial membranes of the kneejoint and of the cancellar texture of the end of the bone forming the kneejoint; -- applied also to a lingering chronic swelling of almost any kind. -- White tombac. See Tombac. -- White trout (Zoöl.), the white weakfish, or silver squeteague (Cynoscion nothus), of the Southern United States. -- White vitriol (Chem.), hydrous sulphate of zinc. See White vitriol, under Vitriol. -- White wagtail (Zoöl.), the common, or pied, wagtail. -- White wax, beeswax rendered white by bleaching. -- White whale (Zoöl.), the beluga. -- White widgeon (Zoöl.), the smew. -- White wine. any wine of a clear, transparent color, bordering on white, as Madeira, sherry, Lisbon, etc.; -- distinguished from wines of a deep red color, as port and Burgundy. \"White wine of Lepe.\" Chaucer. -- White witch, a witch or wizard whose supernatural powers are supposed to be exercised for good and beneficent purposes. Addison. Cotton Mather. -- White wolf. (Zoöl.) (a) A light-colored wolf (Canis laniger) native of Thibet; -- called also chanco, golden wolf, and Thibetan wolf. (b) The albino variety of the gray wolf. -- White wren (Zoöl.), the willow warbler; -- so called from the color of the under parts.\n\n1. The color of pure snow; one of the natural colors of bodies, yet not strictly a color, but a composition of all colors; the opposite of black; whiteness. See the Note under Color, n., 1. Finely attired in a of white. Shak. 2. Something having the color of snow; something white, or nearly so; as, the white of the eye. 3. Specifically, the central part of the butt in archery, which was formerly painted white; the center of a mark at which a missile is shot. 'T was I won the wager, though you hit the white. Shak. 4. A person with a white skin; a member of the white, or Caucasian, races of men. 5. A white pigment; as, Venice white. 6. (Zoöl.)  Any one of numerous species of butterflies belonging to Pieris, and allied genera in which the color is usually white. See Cabbage butterfly, under Cabbage. Black and white. See under Black. -- Flake white, Paris white, etc. See under Flack, Paris, etc. -- White of a seed (Bot.), the albumen. See Albumen, 2. -- White of egg, the viscous pellucid fluid which surrounds the yolk in an egg, particularly in the egg of a fowl. In a hen's egg it is alkaline, and contains about 86 per cent of water and 14 per cent of solid matter, the greater portion of which is egg albumin. It likewise contains a small amount of globulin, and traces of fats and sugar, with some inorganic matter. Heated above 60º C. it coagulates to a solid mass, owing to the albumin which it contains. Parr. -- White of the eye (Anat.), the white part of the ball of the eye surrounding the transparent cornea.\n\nTo make white; to whiten; to whitewash; to bleach. Whited sepulchers, which indeed appear beautiful outward, but are within full of . . . uncleanness. Matt. xxiii. 27. So as no fuller on earth can white them. Mark. ix. 3."}