{"word":"wide","definition":"1. Having considerable distance or extent between the sides; spacious across; much extended in a direction at right angles to that of length; not narrow; broad; as, wide cloth; a wide table; a wide highway; a wide bed; a wide hall or entry. The chambers and the stables weren wyde. Chaucer. Wide is the gate . . . that leadeth to destruction. Matt. vii. 18. 2. Having a great extent every way; extended; spacious; broad; vast; extensive; as, a wide plain; the wide ocean; a wide difference. \"This wyde world.\" Chaucer. For sceptered cynics earth were far too wide a den. Byron. When the wide bloom, on earth that lies, Seems of a brighter world than ours. Bryant. 3. Of large scope; comprehensive; liberal; broad; as, wide views; a wide understanding. Men of strongest head and widest culture. M. Arnold. 4. Of a certain measure between the sides; measuring in a direction at right angles to that of length; as, a table three feet wide. 5. Remote; distant; far. The contrary being so wide from the truth of Scripture and the attributes of God. Hammond. 6. Far from truth, from propriety, from necessity, or the like. \"Our wide expositors.\" Milton. It is far wide that the people have such judgments. Latimer. How wide is all this long pretense ! Herbert. 7. On one side or the other of the mark; too far side-wise from the mark, the wicket, the batsman, etc. Surely he shoots wide on the bow hand. Spenser. I was but two bows wide. Massinger. 8. (Phon.)  Made, as a vowel, with a less tense, and more open and relaxed, condition of the mouth organs; -- opposed to primary as used by Mr. Bell, and to narrow as used by Mr. Sweet. The effect, as explained by Mr. Bell, is due to the relaxation or tension of the pharynx; as explained by Mr. Sweet and others, it is due to the action of the tongue. The wide of e (eve) is î (îll); of a (ate) is ê (ênd), etc. See Guide to Pronunciation, § 13-15. Note: Wide is often prefixed to words, esp. to participles and participial adjectives, to form self-explaining compounds; as, wide- beaming, wide-branched, wide-chopped, wide-echoing, wide-extended, wide-mouthed, wide-spread, wide-spreading, and the like. Far and wide. See under Far. -- Wide gauge. See the Note under Cauge, 6.\n\n1. To a distance; far; widely; to a great distance or extent; as, his fame was spread wide. [I] went wyde in this world, wonders to hear. Piers Plowman. 2. So as to leave or have a great space between the sides; so as to form a large opening. Shak. 3. So as to be or strike far from, or on one side of, an object or purpose; aside; astray.\n\n1. That which is wide; wide space; width; extent. \"The waste wide of that abyss.\" Tennyson. 2. That which goes wide, or to one side of the mark."}