{"word":"will","definition":"1. The power of choosing; the faculty or endowment of the soul by which it is capable of choosing; the faculty or power of the mind by which we decide to do or not to do; the power or faculty of preferring or selecting one of two or more objects. It is necessary to form a distinct notion of what is meant by the word \"volition\" in order to understand the import of the word will, for this last word expresses the power of mind of which \"volition\" is the act. Stewart. Will is an ambiguous word, being sometimes put for the faculty of willing; sometimes for the act of that faculty, besides [having] other meanings. But \"volition\" always signifies the act of willing, and nothing else. Reid. Appetite is the will's solicitor, and the will is appetite's controller; what we covet according to the one, by the other we often reject. Hooker. The will is plainly that by which the mind chooses anything. J. Edwards. 2. The choice which is made; a determination or preference which results from the act or exercise of the power of choice; a volition. The word \"will,\" however, is not always used in this its proper acceptation, but is frequently substituted for \"volition\", as when I say that my hand mover in obedience to my will. Stewart. 3. The choice or determination of one who has authority; a decree; a command; discretionary pleasure. Thy will be done. Matt. vi. 10. Our prayers should be according to the will of God. Law. 4. Strong wish or inclination; desire; purpose. Note: \"Inclination is another word with which will is frequently confounded. Thus, when the apothecary says, in Romeo and Juliet, -- My poverty, but not my will, consents; . . . Put this in any liquid thing you will, And drink it off. the word will is plainly used as, synonymous with inclination; not in the strict logical sense, as the immediate antecedent of action. It is with the same latitude that the word is used in common conversation, when we speak of doing a thing which duty prescribes, against one's own will; or when we speak of doing a thing willingly or unwillingly.\" Stewart. 5. That which is strongly wished or desired. What's your will, good friar Shak. The mariner hath his will. Coleridge. 6. Arbitrary disposal; power to control, dispose, or determine. Deliver me not over unto the will of mine enemies. Ps. xxvii. 12. 7 7 (Law)  The legal declaration of a person's mind as to the manner in which he would have his property or estate disposed of after his death; the written instrument, legally executed, by which a man makes disposition of his estate, to take effect after his death; testament; devise. See the Note under Testament, 1. Note: Wills are written or nuncupative, that is, oral. See Nuncupative will, under Nuncupative. At will (Law), at pleasure. To hold an estate at the will of another, is to enjoy the possession at his pleasure, and be liable to be ousted at any time by the lessor or proprietor. An estate at will is at the will of both parties. -- Good will. See under Good. -- Ill will, enmity; unfriendliness; malevolence. -- To have one's will, to obtain what is desired; to do what one pleases. -- Will worship, worship according to the dictates of the will or fancy; formal worship. [Obs.] -- Will worshiper, one who offers will worship. [Obs.] Jer. Taylor. -- With a will, with willingness and zeal; with all one's heart or strength; earnestly; heartily.\n\n1. To wish; to desire; to incline to have. A wife as of herself no thing ne sholde [should] Wille in effect, but as her husband wolde [would]. Chaucer. Caleb said unto her, What will thou Judg. i. 14. They would none of my counsel. Prov. i. 30. 2. As an auxiliary, will is used to denote futurity dependent on the verb. Thus, in first person, \"I will\" denotes willingness, consent, promise; and when \"will\" is emphasized, it denotes determination or fixed purpose; as, I will go if you wish; I will go at all hazards. In the second and third persons, the idea of distinct volition, wish, or purpose is evanescent, and simple certainty is appropriately expressed; as, \"You will go,\" or \"He will go,\" describes a future event as a fact only. To emphasize will denotes (according to the tone or context) certain futurity or fixed determination. Note: Will, auxiliary, may be used elliptically for will go. \"I'll to her lodgings.\" Marlowe. Note: As in shall (which see), the second and third persons may be virtually converted into the first, either by question or indirect statement, so as to receive the meaning which belongs to will in that person; thus, \"Will you go\" (answer, \"I will go\") asks assent, requests, etc.; while \"Will he go\" simply inquires concerning futurity; thus, also,\"He says or thinks he will go,\" \"You say or think you will go,\" both signify willingness or consent. Note: Would, as the preterit of will, is chiefly employed in conditional, subjunctive, or optative senses; as, he would go if he could; he could go if he would; he said that he would go; I would fain go, but can not; I would that I were young again; and other like phrases. In the last use, the first personal pronoun is often omitted; as, would that he were here; would to Heaven that it were so; and, omitting the to in such an adjuration. \"Would God I had died for thee.\" Would is used for both present and future time, in conditional propositions, and would have for past time; as, he would go now if he were ready; if it should rain, he would not go; he would have gone, had he been able. Would not, as also will not, signifies refusal. \"He was angry, and would not go in.\" Luke xv. 28. Would is never a past participle. Note: In Ireland, Scotland, and the United States, especially in the southern and western portions of the United States, shall and will, should and would, are often misused, as in the following examples: -- I am able to devote as much time and attention to other subjects as I will [shall] be under the necessity of doing next winter. Chalmers. A countryman, telling us what he had seen, remarked that if the conflagration went on, as it was doing, we would [should] have, as our next season's employment, the Old Town of Edinburgh to rebuild. H. Miller. I feel assured that I will [shall] not have the misfortune to find conflicting views held by one so enlightened as your excellency. J. Y. Mason.\n\nTo be willing; to be inclined or disposed; to be pleased; to wish; to desire. And behold, there came a leper and worshiped him, saying, Lord if thou wilt, thou canst make me clean. And Jesus . . . touched him, saying, I will; be thou clean. Matt. viii. 2, 3. Note: This word has been confused with will, v. i., to choose, which, unlike this, is of the weak conjugation. Will I, nill I, or Will ye, hill ye, or Will he, nill he, whether I, you, or he will it or not; hence, without choice; compulsorily; -- sometimes corrupted into willy nilly. \"If I must take service willy nilly.\" J. H. Newman. \"Land for all who would till it, and reading and writing will ye, nill ye.\" Lowell.\n\n1. To form a distinct volition of; to determine by an act of choice; to ordain; to decree. \"What she will to do or say.\" Milton. By all law and reason, that which the Parliament will not, is no more established in this kingdom. Milton. Two things he [God] willeth, that we should be good, and that we should be happy. Barrow. 2. To enjoin or command, as that which is determined by an act of volition; to direct; to order. [Obs. or R.] They willed me say so, madam. Shak. Send for music, And will the cooks to use their best of cunning To please the palate. Beau. & Fl. As you go, will the lord mayor . . . To attend our further pleasure presently. J. Webster. 3. To give or direct the disposal of by testament; to bequeath; to devise; as, to will one's estate to a child; also, to order or direct by testament; as, he willed that his nephew should have his watch.\n\nTo exercise an act of volition; to choose; to decide; to determine; to decree. At Winchester he lies, so himself willed. Robert of Brunne. He that shall turn his thoughts inward upon what passes in his own mind when he wills. Locke. I contend for liberty as it signifies a power in man to do as he wills or pleases. Collins."}