{"word":"willow","definition":"1. (Bot.)  Any tree or shrub of the genus Salix, including many species, most of which are characterized often used as an emblem of sorrow, desolation, or desertion. \"A wreath of willow to show my forsaken plight.\" Sir W. Scott. Hence, a lover forsaken by, or having lost, the person beloved, is said to wear the willow. And I must wear the willow garland For him that's dead or false to me. Campbell. 2. (Textile Manuf.)  A machine in which cotton or wool is opened and cleansed by the action of long spikes projecting from a drum which revolves within a box studded with similar spikes; -- probably so called from having been originally a cylindrical cage made of willow rods, though some derive the term from winnow, as denoting the winnowing, or cleansing, action of the machine. Called also willy, twilly, twilly devil, and devil. Almond willow, Pussy willow, Weeping willow. (Bot.) See under Almond, Pussy, and Weeping. -- Willow biter (Zoöl.) the blue tit. [Prov. Eng.] -- Willow fly (Zoöl.), a greenish European stone fly (Chloroperla viridis); -- called also yellow Sally. -- Willow gall (Zoöl.), a conical, scaly gall produced on willows by the larva of a small dipterous fly (Cecidomyia strobiloides). -- Willow grouse (Zoöl.), the white ptarmigan. See ptarmigan. -- Willow lark (Zoöl.), the sedge warbler. [Prov. Eng.] -- Willow ptarmigan (Zoöl.) (a) The European reed bunting, or black-headed bunting. See under Reed. (b) A sparrow (Passer salicicolus) native of Asia, Africa, and Southern Europe. -- Willow tea, the prepared leaves of a species of willow largely grown in the neighborhood of Shanghai, extensively used by the poorer classes of Chinese as a substitute for tea. McElrath. -- Willow thrush (Zoöl.), a variety of the veery, or Wilson's thrush. See Veery. -- Willow warbler (Zoöl.), a very small European warbler (Phylloscopus trochilus); -- called also bee bird, haybird, golden wren, pettychaps, sweet William, Tom Thumb, and willow wren.\n\nTo open and cleanse, as cotton, flax, or wool, by means of a willow. See Willow, n., 2."}