{"word":"window","definition":"1. An opening in the wall of a building for the admission of light and air, usually closed by casements or sashes containing some transparent material, as glass, and capable of being opened and shut at pleasure. I leaped from the window of the citadel. Shak. Then to come, in spite of sorrow, And at my window bid good morrow. Milton. 2. (Arch.)  The shutter, casement, sash with its fittings, or other framework, which closes a window opening. 3. A figure formed of lines crossing each other. [R.] Till he has windows on his bread and butter. King. French window (Arch.), a casement window in two folds, usually reaching to the floor; -- called also French casement. -- Window back (Arch.), the inside face of the low, and usually thin, piece of wall between the window sill and the floor below. -- Window blind, a blind or shade for a window. -- Window bole, part of a window closed by a shutter which can be opened at will. [Scot.] -- Window box, one of the hollows in the sides of a window frame for the weights which counterbalance a lifting sash. -- Window frame, the frame of a window which receives and holds the sashes or casement. -- Window glass, panes of glass for windows; the kind of glass used in windows. -- Window martin (Zoöl.), the common European martin. [Prov. Eng.] - - Window oyster (Zoöl.), a marine bivalve shell (Placuna placenta) native of the East Indies and China. Its valves are very broad, thin, and translucent, and are said to have been used formerly in place of glass. -- Window pane. (a) (Arch.) See Pane, n., 3 (b). (b) (Zoöl.) See Windowpane, in the Vocabulary. -- Window sash, the sash, or light frame, in which panes of glass are set for windows. -- Window seat, a seat arranged in the recess of a window. See Window stool, under Stool. -- Window shade, a shade or blind for a window; usually, one that is hung on a roller. -- Window shell (Zoöl.), the window oyster. -- Window shutter, a shutter or blind used to close or darken windows. -- Window sill (Arch.), the flat piece of wood, stone, or the like, at the bottom of a window frame. -- Window swallow (Zoöl.), the common European martin. [Prov. Eng.] -- Window tax, a tax or duty formerly levied on all windows, or openings for light, above the number of eight in houses standing in cities or towns. [Eng.]\n\n1. To furnish with windows. 2. To place at or in a window. [R.] Wouldst thou be windowed in great Rome and see Thy master thus with pleach'd arms, bending down His corrigible neck Shak."}