{"word":"wind","definition":"1. To turn completely, or with repeated turns; especially, to turn about something fixed; to cause to form convolutions about anything; to coil; to twine; to twist; to wreathe; as, to wind thread on a spool or into a ball. Whether to wind The woodbine round this arbor. Milton. 2. To entwist; to infold; to encircle. Sleep, and I will wind thee in arms. Shak. 3. To have complete control over; to turn and bend at one's pleasure; to vary or alter or will; to regulate; to govern. \"To turn and wind a fiery Pegasus.\" Shak. In his terms so he would him wind. Chaucer. Gifts blind the wise, and bribes do please And wind all other witnesses. Herrick. Were our legislature vested in the prince, he might wind and turn our constitution at his pleasure. Addison. 4. To introduce by insinuation; to insinuate. You have contrived . . . to wind Yourself into a power tyrannical. Shak. Little arts and dexterities they have to wind in such things into discourse. Gov. of Tongue. 5. To cover or surround with something coiled about; as, to wind a rope with twine. To wind off, to unwind; to uncoil. -- To wind out, to extricate. [Obs.] Clarendon. -- To wind up. (a) To coil into a ball or small compass, as a skein of thread; to coil completely. (b) To bring to a conclusion or settlement; as, to wind up one's affairs; to wind up an argument. (c) To put in a state of renewed or continued motion, as a clock, a watch, etc., by winding the spring, or that which carries the weight; hence, to prepare for continued movement or action; to put in order anew. \"Fate seemed to wind him up for fourscore years.\" Dryden. \"Thus they wound up his temper to a pitch.\" Atterbury. (d) To tighten (the strings) of a musical instrument, so as to tune it. \"Wind up the slackened strings of thy lute.\" Waller.\n\n1. To turn completely or repeatedly; to become coiled about anything; to assume a convolved or spiral form; as, vines wind round a pole. So swift your judgments turn and wind. Dryden. 2. To have a circular course or direction; to crook; to bend; to meander; as, to wind in and out among trees. And where the valley winded out below, The murmuring main was heard, and scarcely heard, to flow. Thomson. He therefore turned him to the steep and rocky path which . . . winded through the thickets of wild boxwood and other low aromatic shrubs. Sir W. Scott. 3. To go to the one side or the other; to move this way and that; to double on one's course; as, a hare pursued turns and winds. The lowing herd wind Gray. To wind out, to extricate one's self; to escape. Long struggling underneath are they could wind Out of such prison. Milton.\n\nThe act of winding or turning; a turn; a bend; a twist; a winding.\n\n1. Air naturally in motion with any degree of velocity; a current of air. Except wind stands as never it stood, It is an ill wind that turns none to good. Tusser . Winds were soft, and woods were green. Longfellow. 2. Air artificially put in motion by any force or action; as, the wind of a cannon ball; the wind of a bellows. 3. Breath modulated by the respiratory and vocal organs, or by an instrument. Their instruments were various in their kind, Some for the bow, and some for breathing wind. Dryden. 4. Power of respiration; breath. If my wind were but long enough to say my prayers, I would repent. Shak. 5. Air or gas generated in the stomach or bowels; flatulence; as, to be troubled with wind. 6. Air impregnated with an odor or scent. A pack of dogfish had him in the wind. Swift. 7. A direction from which the wind may blow; a point of the compass; especially, one of the cardinal points, which are often called the four winds. Come from the four winds, O breath, and breathe upon these slain. Ezek. xxxvii. 9. Note: This sense seems to have had its origin in the East. The Hebrews gave to each of the four cardinal points the name of wind. 8. (Far.)  A disease of sheep, in which the intestines are distended with air, or rather affected with a violent inflammation. It occurs immediately after shearing. 9. Mere breath or talk; empty effort; idle words. Nor think thou with wind Of airy threats to awe. Milton. 10. (Zoöl.)  The dotterel. [Prov. Eng.] Note: Wind is often used adjectively, or as the first part of compound words. All in the wind. (Naut.) See under All, n. -- Before the wind. (Naut.) See under Before. -- Between wind and water (Naut.), in that part of a ship's side or bottom which is frequently brought above water by the rolling of the ship, or fluctuation of the water's surface. Hence, colloquially, (as an injury to that part of a vessel, in an engagement, is particularly dangerous) the vulnerable part or point of anything. -- Cardinal winds. See under Cardinal, a. -- Down the wind. (a) In the direction of, and moving with, the wind; as, birds fly swiftly down the wind. (b) Decaying; declining; in a state of decay. [Obs.] \"He went down the wind still.\" L'Estrange. -- In the wind's eye (Naut.), directly toward the point from which the wind blows. -- Three sheets in the wind, unsteady from drink. [Sailors' Slang] - - To be in the wind, to be suggested or expected; to be a matter of suspicion or surmise. [Colloq.] -- To carry the wind (Man.), to toss the nose as high as the ears, as a horse. -- To raise the wind, to procure money. [Colloq.] -- To take, or have, the wind, to gain or have the advantage. Bacon. -- To take the wind out of one's sails, to cause one to stop, or lose way, as when a vessel intercepts the wind of another. [Colloq.] -- To take wind, or To get wind, to be divulged; to become public; as, the story got wind, or took wind. -- Wind band (Mus.), a band of wind instruments; a military band; the wind instruments of an orchestra. -- Wind chest (Mus.), a chest or reservoir of wind in an organ. -- Wind dropsy. (Med.) (a) Tympanites. (b) Emphysema of the subcutaneous areolar tissue. -- Wind egg, an imperfect, unimpregnated, or addled egg. -- Wind furnace. See the Note under Furnace. -- Wind gauge. See under Gauge. -- Wind gun. Same as Air gun. -- Wind hatch (Mining), the opening or place where the ore is taken out of the earth. -- Wind instrument (Mus.), an instrument of music sounded by means of wind, especially by means of the breath, as a flute, a clarinet, etc. -- Wind pump, a pump moved by a windmill. -- Wind rose, a table of the points of the compass, giving the states of the barometer, etc., connected with winds from the different directions. -- Wind sail. (a) (Naut.) A wide tube or funnel of canvas, used to convey a stream of air for ventilation into the lower compartments of a vessel. (b) The sail or vane of a windmill. -- Wind shake, a crack or incoherence in timber produced by violent winds while the timber was growing. -- Wind shock, a wind shake. -- Wind side, the side next the wind; the windward side. [R.] Mrs. Browning. -- Wind rush (Zoöl.), the redwing. [Prov. Eng.] -- Wind wheel, a motor consisting of a wheel moved by wind. -- Wood wind (Mus.), the flutes and reed instruments of an orchestra, collectively.\n\n1. To expose to the wind; to winnow; to ventilate. 2. To perceive or follow by the scent; to scent; to nose; as, the hounds winded the game. 3. (a) To drive hard, or force to violent exertion, as a horse, so as to render scant of wind; to put out of breath. (b) To rest, as a horse, in order to allow the breath to be recovered; to breathe. To wind a ship (Naut.), to turn it end for end, so that the wind strikes it on the opposite side.\n\nTo blow; to sound by blowing; esp., to sound with prolonged and mutually involved notes. \"Hunters who wound their horns.\" Pennant. Ye vigorous swains, while youth ferments your blood, . . . Wind the shrill horn. Pope. That blast was winded by the king. Sir W. Scott."}