{"word":"wine","definition":"1. The expressed juice of grapes, esp. when fermented; a beverage or liquor prepared from grapes by squeezing out their juice, and (usually) allowing it to ferment. \"Red wine of Gascoigne.\" Piers Plowman. Wine is a mocker, strong drink is raging, and whosoever is deceived thereby is not wise. Prov. xx. 1. Bacchus, that first from out the purple grape Crushed the sweet poison of misused wine. Milton. Note: Wine is essentially a dilute solution of ethyl alcohol, containing also certain small quantities of ethers and ethereal salts which give character and bouquet. According to their color, strength, taste, etc., wines are called red, white, spirituous, dry, light, still, etc. 2. A liquor or beverage prepared from the juice of any fruit or plant by a process similar to that for grape wine; as, currant wine; gooseberry wine; palm wine. 3. The effect of drinking wine in excess; intoxication. Noah awoke from his wine. Gen. ix. 24. Birch wine, Cape wine, etc. See under Birch, Cape, etc. -- Spirit of wine. See under Spirit. -- To have drunk wine of ape or wine ape, to be so drunk as to be foolish. [Obs.] Chaucer. -- Wine acid. (Chem.) See Tartaric acid, under Tartaric. [Colloq.] - - Wine apple (Bot.), a large red apple, with firm flesh and a rich, vinous flavor. -- Wine bag, a wine skin. -- Wine biscuit, a kind of sweet biscuit served with wine. -- Wine cask, a cask for holding wine, or which holds, or has held, wine. -- Wine cellar, a cellar adapted or used for storing wine. -- Wine cooler, a vessel of porous earthenware used to cool wine by the evaporation of water; also, a stand for wine bottles, containing ice.a drink composed of approximately equal parts of wine and some carbonated beverage (soda). Also called California cooler. -- Wine fly (Zoöl.), small two-winged fly of the genus Piophila, whose larva lives in wine, cider, and other fermented liquors. -- Wine grower, one who cultivates a vineyard and makes wine. -- Wine measure, the measure by which wines and other spirits are sold, smaller than beer measure. -- Wine merchant, a merchant who deals in wines. -- Wine of opium (Pharm.), a solution of opium in aromatized sherry wine, having the same strength as ordinary laudanum; -- also Sydenham's laudanum. -- Wine press, a machine or apparatus in which grapes are pressed to extract their juice. -- Wine skin, a bottle or bag of skin, used, in various countries, for carrying wine. -- Wine stone, a kind of crust deposited in wine casks. See 1st Tartar, 1. -- Wine vault. (a) A vault where wine is stored. (b) A place where wine is served at the bar, or at tables; a dramshop. Dickens. -- Wine vinegar, vinegar made from wine. -- Wine whey, whey made from milk coagulated by the use of wine."}