{"word":"wing","definition":"1. One of the two anterior limbs of a bird, pterodactyl, or bat. They correspond to the arms of man, and are usually modified for flight, but in the case of a few species of birds, as the ostrich, auk, etc., the wings are used only as an assistance in running or swimming. As an eagle stirreth up her nest, fluttereth over her young, spreadeth abroad her wings, taketh them, beareth them on her wings. Deut. xxxii. 11. Note: In the wing of a bird the long quill feathers are in series. The primaries are those attached to the ulnar side of the hand; the secondaries, or wing coverts, those of the forearm: the scapulars, those that lie over the humerus; and the bastard feathers, those of the short outer digit. See Illust. of Bird, and Plumage. 2. Any similar member or instrument used for the purpose of flying. Specifically: (Zoöl.) (a) One of the two pairs of upper thoracic appendages of most hexapod insects. They are broad, fanlike organs formed of a double membrane and strengthened by chitinous veins or nervures. (b) One of the large pectoral fins of the flying fishes. 3. Passage by flying; flight; as, to take wing. Light thickens; and the crow Makes wing to the rooky wood. Shak. 4. Motive or instrument of flight; means of flight or of rapid motion. Fiery expedition be my wing. Shak. 5. Anything which agitates the air as a wing does, or which is put in winglike motion by the action of the air, as a fan or vane for winnowing grain, the vane or sail of a windmill, etc. 6. An ornament worn on the shoulder; a small epaulet or shoulder knot. 7. Any appendage resembling the wing of a bird or insect in shape or appearance. Specifically: (a) (Zoöl.)  One of the broad, thin, anterior lobes of the foot of a pteropod, used as an organ in swimming. (b) (Bot.) Any membranaceous expansion, as that along the sides of certain stems, or of a fruit of the kind called samara. (c) (Bot.) Either of the two side petals of a papilionaceous flower. 8. One of two corresponding appendages attached; a sidepiece. Hence: (a) (Arch.) A side building, less than the main edifice; as, one of the wings of a palace. (b) (Fort.) The longer side of crownworks, etc., connecting them with the main work. (c) (Hort.) A side shoot of a tree or plant; a branch growing up by the side of another. [Obs.] (d) (Mil.)  The right or left division of an army, regiment, etc. (e) (Naut.) That part of the hold or orlop of a vessel which is nearest the sides. In a fleet, one of the extremities when the ships are drawn up in line, or when forming the two sides of a triangle. Totten. (f) One of the sides of the stags in a theater. On the wing. (a) Supported by, or flying with, the wings another. -- On the wings of the wind, with the utmost velocity. -- Under the wing, or wings, of, under the care or protection of. -- Wing and wing (Naut.), with sails hauled out on either side; -- said of a schooner, or her sails, when going before the wind with the foresail on one side and the mainsail on the other; also said of a square-rigged vessel which has her studding sails set. Cf. Goosewinged. -- Wing case (Zoöl.), one of the anterior wings of beetles, and of some other insects, when thickened and used to protect the hind wings; an elytron; -- called also wing cover. -- Wing covert (Zoöl.), one of the small feathers covering the bases of the wing quills. See Covert, n., 2. -- Wing gudgeon (Mach.), an iron gudgeon for the end of a wooden axle, having thin, broad projections to prevent it from turning in the wood. See Illust. of Gudgeon. -- Wing shell (Zoöl.), wing case of an insect. -- Wing stroke, the stroke or sweep of a wing. -- Wing transom (Naut.), the uppermost transom of the stern; -- called also main transom. J. Knowles.\n\n1. To furnish with wings; to enable to fly, or to move with celerity. Who heaves old ocean, and whowings the storms. Pope. Living, to wing with mirth the weary hours. Longfellow. 2. To supply with wings or sidepieces. The main battle, whose puissance on either side Shall be well winged with our chiefest horse. Shak. 3. To transport by flight; to cause to fly. I, an old turtle, Will wing me to some withered bough. Shak. 4. To move through in flight; to fly through. There's not an arrow wings the sky But fancy turns its point to him. Moore. 5. To cut off the wings of; to wound in the wing; to disable a wing of; as, to wing a bird. To wing a flight, to exert the power of flying; to fly."}