{"word":"winter","definition":"1. The season of the year in which the sun shines most obliquely upon any region; the coldest season of the year. \"Of thirty winter he was old.\" Chaucer. And after summer evermore succeeds Barren winter, with his wrathful nipping cold. Shak. Winter lingering chills the lap of May. Goldsmith. Note: North of the equator, winter is popularly taken to include the months of December, January, and February (see Season). Astronomically, it may be considered to begin with the winter solstice, about December 21st, and to end with the vernal equinox, about March 21st. 2. The period of decay, old age, death, or the like. Life's autumn past, I stand on winter's verge. Wordsworth. Winter apple, an apple that keeps well in winter, or that does not ripen until winter. -- Winter barley, a kind of barley that is sown in autumn. -- Winter berry (Bot.), the name of several American shrubs (Ilex verticillata, I. lævigata, etc.) of the Holly family, having bright red berries conspicuous in winter. -- Winter bloom. (Bot.) (a) A plant of the genus Azalea. (b) A plant of the genus Hamamelis (H. Viginica); witch-hazel; -- so called from its flowers appearing late in autumn, while the leaves are falling. -- Winter bud (Zoöl.), a statoblast. -- Winter cherry (Bot.), a plant (Physalis Alkekengi) of the Nightshade family, which has, a red berry inclosed in the inflated and persistent calyx. See Alkekengi. -- Winter cough (Med.), a form of chronic bronchitis marked by a cough recurring each winter. -- Winter cress (Bot.), a yellow-flowered cruciferous plant (Barbarea vulgaris). -- Winter crop, a crop which will bear the winter, or which may be converted into fodder during the winter. -- Winter duck. (Zoöl.) (a) The pintail. (b) The old squaw. -- Winter egg (Zoöl.), an egg produced in the autumn by many invertebrates, and destined to survive the winter. Such eggs usually differ from the summer eggs in having a thicker shell, and often in being enveloped in a protective case. They sometimes develop in a manner different from that of the summer eggs. -- Winter fallow, ground that is fallowed in winter. -- Winter fat. (Bot.) Same as White sage, under White. -- Winter fever (Med.), pneumonia. [Colloq.] -- Winter flounder. (Zoöl.) See the Note under Flounder. -- Winter gull (Zoöl.), the common European gull; -- called also winter mew. [Prov. Eng.] -- Winter itch. (Med.) See Prarie itch, under Prairie. -- Winter lodge, or Winter lodgment. (Bot.) Same as Hibernaculum. -- Winter mew. (Zoöl.) Same as Winter gull, above. [Prov. Eng.] -- Winter moth (Zoöl.), any one of several species of geometrid moths which come forth in winter, as the European species (Cheimatobia brumata). These moths have rudimentary mouth organs, and eat no food in the imago state. The female of some of the species is wingless. -- Winter oil, oil prepared so as not to solidify in moderately cold weather. -- Winter pear, a kind of pear that keeps well in winter, or that does not ripen until winter. -- Winter quarters, the quarters of troops during the winter; a winter residence or station. -- Winter rye, a kind of rye that is sown in autumn. -- Winter shad (Zoöl.), the gizzard shad. -- Winter sheldrake (Zoöl.), the goosander. [Local, U.S.] -- Winter sleep (Zoöl.), hibernation. -- Winter snipe (Zoöl.), the dunlin. -- Winter solstice. (Astron.) See Solstice, 2. -- Winter teal (Zoöl.), the green-winged teal. -- Winter wagtail (Zoöl.), the gray wagtail (Motacilla melanope). [Prov. Eng.] -- Winter wheat, wheat sown in autumn, which lives during the winter, and ripens in the following summer. -- Winter wren (Zoöl.), a small American wren (Troglodytes hiemalis) closely resembling the common wren.\n\nTo pass the winter; to hibernate; as, to winter in Florida. Because the haven was not commodious to winter in, the more part advised to depart thence. Acts xxvii. 12.\n\nTo keep, feed or manage, during the winter; as, to winter young cattle on straw."}