{"word":"wire","definition":"1. A thread or slender rod of metal; a metallic substance formed to an even thread by being passed between grooved rollers, or drawn through holes in a plate of steel. Note: Wire is made of any desired form, as round, square, triangular, etc., by giving this shape to the hole in the drawplate, or between the rollers. 2. A telegraph wire or cable; hence, an electric telegraph; as, to send a message by wire. [Colloq.] Wire bed, Wire mattress, an elastic bed bottom or mattress made of wires interwoven or looped together in various ways. -- Wire bridge, a bridge suspended from wires, or cables made of wire. -- Wire cartridge, a shot cartridge having the shot inclosed in a wire cage. -- Wire cloth, a coarse cloth made of woven metallic wire, -- used for strainers, and for various other purposes. -- Wire edge, the thin, wirelike thread of metal sometimes formed on the edge of a tool by the stone in sharpening it. -- Wire fence, a fence consisting of posts with strained horizontal wires, wire netting, or other wirework, between. -- Wire gauge or gage. (a) A gauge for measuring the diameter of wire, thickness of sheet metal, etc., often consisting of a metal plate with a series of notches of various widths in its edge. (b) A standard series of sizes arbitrarily indicated, as by numbers, to which the diameter of wire or the thickness of sheet metal in usually made, and which is used in describing the size or thickness. There are many different standards for wire gauges, as in different countries, or for different kinds of metal, the Birmingham wire gauges and the American wire gauge being often used and designated by the abbreviations B. W.G. and A. W.G. respectively. -- Wire gauze, a texture of finely interwoven wire, resembling gauze. -- Wire grass (Bot.), either of the two common grasses Eleusine Indica, valuable for hay and pasture, and Poa compressa, or blue grass. See Blue grass. -- Wire grub (Zoöl.), a wireworm. -- Wire iron, wire rods of iron. -- Wire lathing, wire cloth or wire netting applied in the place of wooden lathing for holding plastering. -- Wire mattress. See Wire bed, above. -- Wire micrometer, a micrometer having spider lines, or fine wires, across the field of the instrument. -- Wire nail, a nail formed of a piece of wire which is headed and pointed. -- Wire netting, a texture of woven wire coarser than ordinary wire gauze. -- Wire rod, a metal rod from which wire is formed by drawing. -- Wire rope, a rope formed wholly, or in great part, of wires.\n\n1. To bind with wire; to attach with wires; to apply wire to; as, to wire corks in bottling liquors. 2. To put upon a wire; as, to wire beads. 3. To snare by means of a wire or wires. 4. To send (a message) by telegraph. [Colloq.]\n\n1. To pass like a wire; to flow in a wirelike form, or in a tenuous stream. [R.] P. Fletcher. 2. To send a telegraphic message. [Colloq.]"}