{"word":"wise","definition":"1. Having knowledge; knowing; enlightened; of extensive information; erudite; learned. They are wise to do evil, but to do good they have no knowledge. Jer. iv. 22. 2. Hence, especially, making due use of knowledge; discerning and judging soundly concerning what is true or false, proper or improper; choosing the best ends and the best means for accomplishing them; sagacious. When clouds appear, wise men put their cloaks. Shak. From a child thou hast known the holy scriptures, which are able to make thee wise unto salvation. 2 Tim. iii. 15. 3. Versed in art or science; skillful; dexterous; specifically, skilled in divination. Fal. There was, mine host, an old fat woman even now with me; but she's gone. Sim. Pray you, sir, was't not the wise woman of Brentford Shak. 4. Hence, prudent; calculating; shrewd; wary; subtle; crafty. [R.] \"Thou art . . . no novice, but a governor wily and wise.\" Chaucer. Nor, on the other side, Will I be penuriously wise As to make money, that's my slave, my idol. Beau. & Fl. Lords do not care for me: I am too wise to die yet. Ford. 5. Dictated or guided by wisdom; containing or exhibiting wisdom; well adapted to produce good effects; judicious; discreet; as, a wise saying; a wise scheme or plan; wise conduct or management; a wise determination. \"Eminent in wise deport.\" Milton. To make it wise, to make it a matter of deliberation. [Obs.] \" We thought it was not worth to make it wise.\" Chaucer. -- Wise in years, old enough to be wise; wise from age and experience; hence, aged; old. [Obs.] A very grave, state bachelor, my dainty one; He's wise in years, and of a temperate warmth. Ford. You are too wise in years, too full of counsel, For my green experience. Ford.\n\nWay of being or acting; manner; mode; fashion. \"All armed in complete wise.\" Spenser. To love her in my beste wyse. Chaucer. This song she sings in most commanding wise. Sir P. Sidney. Let not these blessings then, sent from above, Abused be, or spilt in profane wise. Fairfax. Note: This word is nearly obsolete, except in such phrases as in any wise, in no wise, on this wise, etc. \" Fret not thyself in any wise to do evil.\" Ps. xxxvii. 8. \"He shall in no wise lose his reward.\" Matt. x. 42. \" On this wise ye shall bless the children of Israel.\" Num. vi. 23. Note: Wise is often used as a suffix in composition, as in likewise, nowise, lengthwise, etc., in which words -ways is often substituted with the same sense; as, noways, lengthways, etc."}