{"word":"wit","definition":"To know; to learn. \"I wot and wist alway.\" Chaucer. Note: The present tense was inflected as follows; sing. 1st pers. wot; 2d pers. wost, or wot(t)est; 3d pers. wot, or wot(t)eth; pl. witen, or wite. The following variant forms also occur; pres. sing. 1st & 3d pers. wat, woot; pres. pl. wyten, or wyte, weete, wote, wot; imp. wuste (Southern dialect); p. pr. wotting. Later, other variant or corrupt forms are found, as, in Shakespeare, 3d pers. sing. pres. wots. Brethren, we do you to wit [make you to know] of the grace of God bestowed on the churches of Macedonia. 2 Cor. viii. 1. Thou wost full little what thou meanest. Chaucer. We witen not what thing we prayen here. Chaucer. When that the sooth in wist. Chaucer. Note: This verb is now used only in the infinitive, to wit, which is employed, especially in legal language, to call attention to a particular thing, or to a more particular specification of what has preceded, and is equivalent to namely, that is to say.\n\n1. Mind; intellect; understanding; sense. Who knew the wit of the Lord or who was his counselor Wyclif (Rom. xi. 34). A prince most prudent, of an excellent And unmatched wit and judgment. Shak. Will puts in practice what wit deviseth. Sir J. Davies. He wants not wit the dander to decline. Dryden. 2. A mental faculty, or power of the mind; -- used in this sense chiefly in the plural, and in certain phrases; as, to lose one's wits; at one's wits' end, and the like. \"Men's wittes ben so dull.\" Chaucer. I will stare him out of his wits. Shak. 3. Felicitous association of objects not usually connected, so as to produce a pleasant surprise; also. the power of readily combining objects in such a manner. The definition of wit is only this, that it is a propriety of thoughts and words; or, in other terms, thoughts and words elegantly adapted to the subject. Dryden. Wit which discovers partial likeness hidden in general diversity. Coleridge. Wit lying most in the assemblage of ideas, and putting those together with quickness and variety wherein can be found any resemblance or congruity, thereby to make up pleasant pictures in the fancy. Locke. 4. A person of eminent sense or knowledge; a man of genius, fancy, or humor; one distinguished for bright or amusing sayings, for repartee, and the like. In Athens, where books and wits were ever busier than in any other part of Greece, I find but only two sorts of writings which the magistrate cared to take notice of; those either blasphemous and atheistical, or libelous. Milton. Intemperate wits will spare neither friend nor foe. L'Estrange. A wit herself, Amelia weds a wit. Young. The five wits, the five senses; also, sometimes, the five qualities or faculties, common wit, imagination, fantasy, estimation, and memory. Chaucer. Nares. But my five wits nor my five senses can Dissuade one foolish heart from serving thee. Shak. Syn. -- Ingenuity; humor; satire; sarcasm; irony; burlesque. -- Wit, Humor. Wit primarily meant mind; and now denotes the power of seizing on some thought or occurrence, and, by a sudden turn, presenting it under aspects wholly new and unexpected -- apparently natural and admissible, if not perfectly just, and bearing on the subject, or the parties concerned, with a laughable keenness and force. \"What I want,\" said a pompous orator, aiming at his antagonist, \"is common sense.\" \"Exactly!\" was the whispered reply. The pleasure we find in wit arises from the ingenuity of the turn, the sudden surprise it brings, and the patness of its application to the case, in the new and ludicrous relations thus flashed upon the view. Humor is a quality more congenial to the English mind than wit. It consists primarily in taking up the peculiarities of a humorist (or eccentric person) and drawing them out, as Addison did those of Sir Roger de Coverley, so that we enjoy a hearty, good-natured laugh at his unconscious manifestation of whims and oddities. From this original sense the term has been widened to embrace other sources of kindly mirth of the same general character. In a well-known caricature of English reserve, an Oxford student is represented as standing on the brink of a river, greatly agitated at the sight of a drowning man before him, and crying out, \"O that I had been introduced to this gentleman, that I might save his life! The, \"Silent Woman\" of Ben Jonson is one of the most humorous productions, in the original sense of the term, which we have in our language."}