{"word":"wolf","definition":"1. (Zoöl.)  Any one of several species of wild and savage carnivores belonging to the genus Canis and closely allied to the common dog. The best-known and most destructive species are the European wolf (Canis lupus), the American gray, or timber, wolf (C. occidentalis), and the prairie wolf, or coyote. Wolves often hunt in packs, and may thus attack large animals and even man. 2. (Zoöl.)  One of the destructive, and usually hairy, larvæ of several species of beetles and grain moths; as, the bee wolf. 3. Fig.: Any very ravenous, rapacious, or destructive person or thing; especially, want; starvation; as, they toiled hard to keep the wolf from the door. 4. A white worm, or maggot, which infests granaries. 5. An eating ulcer or sore. Cf. Lupus. [Obs.] If God should send a cancer upon thy face, or a wolf into thy side. Jer. Taylor. 6. (Mus.) (a) The harsh, howling sound of some of the chords on an organ or piano tuned by unequal temperament. (b) In bowed instruments, a harshness due to defective vibration in certain notes of the scale. 7. (Textile Manuf.)  A willying machine. Knight. Black wolf. (Zoöl.) (a) A black variety of the European wolf which is common in the Pyrenees. (b) A black variety of the American gray wolf. -- Golden wolf (Zoöl.), the Thibetan wolf (Canis laniger); -- called also chanco. -- Indian wolf (Zoöl.), an Asiatic wolf (Canis pallipes) which somewhat resembles a jackal. Called also landgak. -- Prairie wolf (Zoöl.), the coyote. -- Sea wolf. (Zoöl.) See in the Vocabulary. -- Strand wolf (Zoöl.) the striped hyena. -- Tasmanian wolf (Zoöl.), the zebra wolf. -- Tiger wolf (Zoöl.), the spotted hyena. -- To keep the wolf from the door, to keep away poverty; to prevent starvation. See Wolf, 3, above. Tennyson. -- Wolf dog. (Zoöl.) (a) The mastiff, or shepherd dog, of the Pyrenees, supposed by some authors to be one of the ancestors of the St. Bernard dog. (b) The Irish greyhound, supposed to have been used formerly by the Danes for chasing wolves. (c) A dog bred between a dog and a wolf, as the Eskimo dog. -- Wolf eel (Zoöl.), a wolf fish. -- Wolf fish (Zoöl.), any one of several species of large, voracious marine fishes of the genus Anarrhichas, especially the common species (A. lupus) of Europe and North America. These fishes have large teeth and powerful jaws. Called also catfish, sea cat, sea wolf, stone biter, and swinefish. -- Wolf net, a kind of net used in fishing, which takes great numbers of fish. -- Wolf's peach (Bot.), the tomato, or love apple (Lycopersicum esculentum). -- Wolf spider (Zoöl.), any one of numerous species of running ground spiders belonging to the genus Lycosa, or family Lycosidæ. These spiders run about rapidly in search of their prey. Most of them are plain brown or blackish in color. See Illust. in App. -- Zebra wolf (Zoöl.), a savage carnivorous marsupial (Thylacinus cynocephalus) native of Tasmania; -- called also Tasmanian wolf."}