{"word":"wood","definition":"Mad; insane; possessed; rabid; furious; frantic. [Obs.] [Written also wode.] Our hoste gan to swear as [if] he were wood. Chaucer.\n\nTo grow mad; to act like a madman; to mad. Chaucer.\n\n1. A large and thick collection of trees; a forest or grove; -- frequently used in the plural. Light thickens, and the crow Makes wing to the rooky wood. Shak. 2. The substance of trees and the like; the hard fibrous substance which composes the body of a tree and its branches, and which is covered by the bark; timber. \"To worship their own work in wood and stone for gods.\" Milton. 3. (Bot.)  The fibrous material which makes up the greater part of the stems and branches of trees and shrubby plants, and is found to a less extent in herbaceous stems. It consists of elongated tubular or needle-shaped cells of various kinds, usually interwoven with the shinning bands called silver grain. Note: Wood consists chiefly of the carbohydrates cellulose and lignin, which are isomeric with starch. 4. Trees cut or sawed for the fire or other uses. Wood acid, Wood vinegar (Chem.), a complex acid liquid obtained in the dry distillation of wood, and containing large quantities of acetic acid; hence, specifically, acetic acid. Formerly called pyroligneous acid. -- Wood anemone (Bot.), a delicate flower (Anemone nemorosa) of early spring; -- also called windflower. See Illust. of Anemone. -- Wood ant (Zoöl.), a large ant (Formica rufa) which lives in woods and forests, and constructs large nests. -- Wood apple (Bot.). See Elephant apple, under Elephant. -- Wood baboon (Zoöl.), the drill. -- Wood betony. (Bot.) (a) Same as Betony. (b) The common American lousewort (Pedicularis Canadensis), a low perennial herb with yellowish or purplish flowers. -- Wood borer. (Zoöl.) (a) The larva of any one of numerous species of boring beetles, esp. elaters, longicorn beetles, buprestidans, and certain weevils. See Apple borer, under Apple, and Pine weevil, under Pine. (b) The larva of any one of various species of lepidopterous insects, especially of the clearwing moths, as the peach-tree borer (see under Peach), and of the goat moths. (c) The larva of various species of hymenopterous of the tribe Urocerata. See Tremex. (d) Any one of several bivalve shells which bore in wood, as the teredos, and species of Xylophaga. (e) Any one of several species of small Crustacea, as the Limnoria, and the boring amphipod (Chelura terebrans). -- Wood carpet, a kind of floor covering made of thin pieces of wood secured to a flexible backing, as of cloth. Knight. -- Wood cell (Bot.), a slender cylindrical or prismatic cell usually tapering to a point at both ends. It is the principal constituent of woody fiber. -- Wood choir, the choir, or chorus, of birds in the woods. [Poetic] Coleridge. -- Wood coal, charcoal; also, lignite, or brown coal. -- Wood cricket (Zoöl.), a small European cricket (Nemobius sylvestris). -- Wood culver (Zoöl.), the wood pigeon. -- Wood cut, an engraving on wood; also, a print from such an engraving. -- Wood dove (Zoöl.), the stockdove. -- Wood drink, a decoction or infusion of medicinal woods. -- Wood duck (Zoöl.) (a) A very beautiful American duck (Aix sponsa). The male has a large crest, and its plumage is varied with green, purple, black, white, and red. It builds its nest in trees, whence the name. Called also bridal duck, summer duck, and wood widgeon. (b) The hooded merganser. (c) The Australian maned goose (Chlamydochen jubata). -- Wood echo, an echo from the wood. -- Wood engraver. (a) An engraver on wood. (b) (Zoöl.) Any of several species of small beetles whose larvæ bore beneath the bark of trees, and excavate furrows in the wood often more or less resembling coarse engravings; especially, Xyleborus xylographus. -- Wood engraving. (a) The act or art engraving on wood; xylography. (b) An engraving on wood; a wood cut; also, a print from such an engraving. -- Wood fern. (Bot.) See Shield fern, under Shield. -- Wood fiber. (a) (Bot.) Fibrovascular tissue. (b) Wood comminuted, and reduced to a powdery or dusty mass. -- Wood fretter (Zoöl.), any one of numerous species of beetles whose larvæ bore in the wood, or beneath the bark, of trees. -- Wood frog (Zoöl.), a common North American frog (Rana sylvatica) which lives chiefly in the woods, except during the breeding season. It is drab or yellowish brown, with a black stripe on each side of the head. -- Wood germander. (Bot.) See under Germander. -- Wood god, a fabled sylvan deity. -- Wood grass. (Bot.) See under Grass. -- Wood grouse. (Zoöl.) (a) The capercailzie. (b) The spruce partridge. See under Spruce. -- Wood guest (Zoöl.), the ringdove. [Prov. Eng.] -- Wood hen. (Zoöl.) (a) Any one of several species of Old World short-winged rails of the genus Ocydromus, including the weka and allied species. (b) The American woodcock. -- Wood hoopoe (Zoöl.), any one of several species of Old World arboreal birds belonging to Irrisor and allied genera. They are closely allied to the common hoopoe, but have a curved beak, and a longer tail. -- Wood ibis (Zoöl.), any one of several species of large, long- legged, wading birds belonging to the genus Tantalus. The head and neck are naked or scantily covered with feathers. The American wood ibis (Tantalus loculator) is common in Florida. -- Wood lark (Zoöl.), a small European lark (Alauda arborea), which, like, the skylark, utters its notes while on the wing. So called from its habit of perching on trees. -- Wood laurel (Bot.), a European evergreen shrub (Daphne Laureola). -- Wood leopard (Zoöl.), a European spotted moth (Zeuzera æsculi) allied to the goat moth. Its large fleshy larva bores in the wood of the apple, pear, and other fruit trees. -- Wood lily (Bot.), the lily of the valley. -- Wood lock (Naut.), a piece of wood close fitted and sheathed with copper, in the throating or score of the pintle, to keep the rudder from rising. -- Wood louse (Zoöl.) (a) Any one of numerous species of terrestrial isopod Crustacea belonging to Oniscus, Armadillo, and related genera. See Sow bug, under Sow, and Pill bug, under Pill. (b) Any one of several species of small, wingless, pseudoneuropterous insects of the family Psocidæ, which live in the crevices of walls and among old books and papers. Some of the species are called also book lice, and deathticks, or deathwatches. -- Wood mite (Zoöl.), any one of numerous small mites of the family Oribatidæ. They are found chiefly in woods, on tree trunks and stones. -- Wood mote. (Eng. Law) (a) Formerly, the forest court. (b) The court of attachment. -- Wood nettle. (Bot.) See under Nettle. -- Wood nightshade (Bot.), woody nightshade. -- Wood nut (Bot.), the filbert. -- Wood nymph. (a) A nymph inhabiting the woods; a fabled goddess of the woods; a dryad. \"The wood nymphs, decked with daisies trim.\" Milton. (b) (Zoöl.) Any one of several species of handsomely colored moths belonging to the genus Eudryas. The larvæ are bright-colored, and some of the species, as Eudryas grata, and E. unio, feed on the leaves of the grapevine. (c) (Zoöl.) Any one of several species of handsomely colored South American humming birds belonging to the genus Thalurania. The males are bright blue, or green and blue. -- Wood offering, wood burnt on the altar. We cast the lots . . . for the wood offering. Neh. x. 34. -- Wood oil (Bot.), a resinous oil obtained from several East Indian trees of the genus Dipterocarpus, having properties similar to those of copaiba, and sometimes substituted for it. It is also used for mixing paint. See Gurjun. -- Wood opal (Min.), a striped variety of coarse opal, having some resemblance to wood. -- Wood paper, paper made of wood pulp. See Wood pulp, below. -- Wood pewee (Zoöl.), a North American tyrant flycatcher (Contopus virens). It closely resembles the pewee, but is smaller. -- Wood pie (Zoöl.), any black and white woodpecker, especially the European great spotted woodpecker. -- Wood pigeon. (Zoöl.) (a) Any one of numerous species of Old World pigeons belonging to Palumbus and allied genera of the family Columbidæ. (b) The ringdove. -- Wood puceron (Zoöl.), a plant louse. -- Wood pulp (Technol.), vegetable fiber obtained from the poplar and other white woods, and so softened by digestion with a hot solution of alkali that it can be formed into sheet paper, etc. It is now produced on an immense scale. -- Wood quail (Zoöl.), any one of several species of East Indian crested quails belonging to Rollulus and allied genera, as the red- crested wood quail (R. roulroul), the male of which is bright green, with a long crest of red hairlike feathers. -- Wood rabbit (Zoöl.), the cottontail. -- Wood rat (Zoöl.), any one of several species of American wild rats of the genus Neotoma found in the Southern United States; -- called also bush rat. The Florida wood rat (Neotoma Floridana) is the best-known species. -- Wood reed grass (Bot.), a tall grass (Cinna arundinacea) growing in moist woods. -- Wood reeve, the steward or overseer of a wood. [Eng.] -- Wood rush (Bot.), any plant of the genus Luzula, differing from the true rushes of the genus Juncus chiefly in having very few seeds in each capsule. -- Wood sage (Bot.), a name given to several labiate plants of the genus Teucrium. See Germander. -- Wood screw, a metal screw formed with a sharp thread, and usually with a slotted head, for insertion in wood. -- Wood sheldrake (Zoöl.), the hooded merganser. -- Wood shock (Zoöl.), the fisher. See Fisher, 2. -- Wood shrike (Zoöl.), any one of numerous species of Old World singing birds belonging to Grallina, Collyricincla, Prionops, and allied genera, common in India and Australia. They are allied to the true shrikes, but feed upon both insects and berries. -- Wood snipe. (Zoöl.) (a) The American woodcock. (b) An Asiatic snipe (Gallinago nemoricola). -- Wood soot, soot from burnt wood. -- Wood sore. (Zoöl.) See Cuckoo spit, under Cuckoo. -- Wood sorrel (Bot.), a plant of the genus Oxalis (Oxalis Acetosella), having an acid taste. See Illust. (a) of Shamrock. -- Wood spirit. (Chem.) See Methyl alcohol, under Methyl. -- Wood stamp, a carved or engraved block or stamp of wood, for impressing figures or colors on fabrics. -- Wood star (Zoöl.), any one of several species of small South American humming birds belonging to the genus Calothorax. The male has a brilliant gorget of blue, purple, and other colors. -- Wood sucker (Zoöl.), the yaffle. -- Wood swallow (Zoöl.), any one of numerous species of Old World passerine birds belonging to the genus Artamus and allied genera of the family Artamidæ. They are common in the East Indies, Asia, and Australia. In form and habits they resemble swallows, but in structure they resemble shrikes. They are usually black above and white beneath. -- Wood tapper (Zoöl.), any woodpecker. -- Wood tar. See under Tar. -- Wood thrush, (Zoöl.) (a) An American thrush (Turdus mustelinus) noted for the sweetness of its song. See under Thrush. (b) The missel thrush. -- Wood tick. See in Vocabulary. -- Wood tin. (Min.). See Cassiterite. -- Wood titmouse (Zoöl.), the goldcgest. -- Wood tortoise (Zoöl.), the sculptured tortoise. See under Sculptured. -- Wood vine (Bot.), the white bryony. -- Wood vinegar. See Wood acid, above. -- Wood warbler. (Zoöl.) (a) Any one of numerous species of American warblers of the genus Dendroica. See Warbler. (b) A European warbler (Phylloscopus sibilatrix); -- called also green wren, wood wren, and yellow wren. -- Wood worm (Zoöl.), a larva that bores in wood; a wood borer. -- Wood wren. (Zoöl.) (a) The wood warbler. (b) The willow warbler.\n\nTo supply with wood, or get supplies of wood for; as, to wood a steamboat or a locomotive.\n\nTo take or get a supply of wood."}