{"word":"work","definition":"1. Exertion of strength or faculties; physical or intellectual effort directed to an end; industrial activity; toil; employment; sometimes, specifically, physically labor. Man hath his daily work of body or mind Appointed. Milton. 2. The matter on which one is at work; that upon which one spends labor; material for working upon; subject of exertion; the thing occupying one; business; duty; as, to take up one's work; to drop one's work. Come on, Nerissa; I have work in hand That you yet know not of. Shak. In every work that he began . . . he did it with all his heart, and prospered. 2 Chron. xxxi. 21. 3. That which is produced as the result of labor; anything accomplished by exertion or toil; product; performance; fabric; manufacture; in a more general sense, act, deed, service, effect, result, achievement, feat. To leave no rubs or blotches in the work. Shak. The work some praise, And some the architect. Milton. Fancy . . . Wild work produces oft, and most in dreams. Milton. The composition or dissolution of mixed bodies . . . is the chief work of elements. Sir K. Digby. 4. Specifically: (a) That which is produced by mental labor; a composition; a book; as, a work, or the works, of Addison. (b) Flowers, figures, or the like, wrought with the needle; embroidery. I am glad I have found this napkin; . . . I'll have the work ta'en out, And give 't Iago. Shak. (c) pl.  Structures in civil, military, or naval engineering, as docks, bridges, embankments, trenches, fortifications, and the like; also, the structures and grounds of a manufacturing establishment; as, iron works; locomotive works; gas works. (d) pl.  The moving parts of a mechanism; as, the works of a watch. 5. Manner of working; management; treatment; as, unskillful work spoiled the effect. Bp. Stillingfleet. 6. (Mech.)  The causing of motion against a resisting force. The amount of work is proportioned to, and is measured by, the product of the force into the amount of motion along the direction of the force. See Conservation of energy, under Conservation, Unit of work, under Unit, also Foot pound, Horse power, Poundal, and Erg. Energy is the capacity of doing work . . . Work is the transference of energy from one system to another. Clerk Maxwell. 7. (Mining)  Ore before it is dressed. Raymond. 8. pl. (Script.)  Performance of moral duties; righteous conduct. He shall reward every man according to his works. Matt. xvi. 27. Faith, if it hath not works, is dead. James ii. 17. Muscular work (Physiol.), the work done by a muscle through the power of contraction. -- To go to work, to begin laboring; to commence operations; to contrive; to manage. \"I 'll go another way to work with him.\" Shak. -- To set on work, to cause to begin laboring; to set to work. [Obs.] Hooker. -- To set to work, to employ; to cause to engage in any business or labor.\n\n1. To exert one's self for a purpose; to put forth effort for the attainment of an object; to labor; to be engaged in the performance of a task, a duty, or the like. O thou good Kent, how shall I live and work, To match thy goodness Shak. Go therefore now, and work; for there shall no straw be given you. Ex. v. 18. Whether we work or play, or sleep or wake, Our life doth pass. Sir J. Davies. 2. Hence, in a general sense, to operate; to act; to perform; as, a machine works well. We bend to that the working of the heart. Shak. 3. Hence, figuratively, to be effective; to have effect or influence; to conduce. We know that all things work together for good to them that love God. Rom. viii. 28. This so wrought upon the child, that afterwards he desired to be taught. Locke. She marveled how she could ever have been wrought upon to marry him. Hawthorne. 4. To carry on business; to be engaged or employed customarily; to perform the part of a laborer; to labor; to toil. They that work in fine flax . . . shall be confounded. Isa. xix. 9. 5. To be in a state of severe exertion, or as if in such a state; to be tossed or agitated; to move heavily; to strain; to labor; as, a ship works in a heavy sea. Confused with working sands and rolling waves. Addison. 6. To make one's way slowly and with difficulty; to move or penetrate laboriously; to proceed with effort; -- with a following preposition, as down, out, into, up, through, and the like; as, scheme works out by degrees; to work into the earth. Till body up to spirit work, in bounds Proportioned to each kind. Milton. 7. To ferment, as a liquid. The working of beer when the barm is put in. Bacon. 8. To act or operate on the stomach and bowels, as a cathartic. Purges . . . work best, that is, cause the blood so to do, . . . in warm weather or in a warm room. Grew. To work at, to be engaged in or upon; to be employed in. -- To work to windward (Naut.), to sail or ply against the wind; to tack to windward. Mar. Dict.\n\n1. To labor or operate upon; to give exertion and effort to; to prepare for use, or to utilize, by labor. He could have told them of two or three gold mines, and a silver mine, and given the reason why they forbare to work them at that time. Sir W. Raleigh. 2. To produce or form by labor; to bring forth by exertion or toil; to accomplish; to originate; to effect; as, to work wood or iron into a form desired, or into a utensil; to work cotton or wool into cloth. Each herb he knew, that works or good or ill. Harte. 3. To produce by slow degrees, or as if laboriously; to bring gradually into any state by action or motion. \"Sidelong he works his way.\" Milton. So the pure, limpid stream, when foul with stains Of rushing torrents and descending rains, Works itself clear, and as it runs, refines, Till by degrees the floating mirror shines. Addison. 4. To influence by acting upon; to prevail upon; to manage; to lead. \"Work your royal father to his ruin.\" Philips. 5. To form with a needle and thread or yarn; especially, to embroider; as, to work muslin. 6. To set in motion or action; to direct the action of; to keep at work; to govern; to manage; as, to work a machine. Knowledge in building and working ships. Arbuthnot. Now, Marcus, thy virtue's the proof; Put forth thy utmost strength, work every nerve. Addison. The mariners all 'gan work the ropes, Where they were wont to do. Coleridge. 7. To cause to ferment, as liquor. To work a passage (Naut.), to pay for a passage by doing work. -- To work double tides (Naut.), to perform the labor of three days in two; -- a phrase which alludes to a practice of working by the night tide as well as by the day. -- To work in, to insert, introduce, mingle, or interweave by labor or skill. -- To work into, to force, urge, or insinuate into; as, to work one's self into favor or confidence. -- To work off, to remove gradually, as by labor, or a gradual process; as, beer works off impurities in fermenting. -- To work out. (a) To effect by labor and exertion. \"Work out your own salvation with fear and trembling.\" Phil. ii. 12. (b) To erase; to efface. [R.] Tears of joy for your returning spilt, Work out and expiate our former guilt. Dryden. (c) To solve, as a problem. (d) To exhaust, as a mine, by working. -- To work up. (a) To raise; to excite; to stir up; as, to work up the passions to rage. The sun, that rolls his chariot o'er their heads, Works up more fire and color in their cheeks. Addison. (b) To expend in any work, as materials; as, they have worked up all the stock. (c) (Naut.) To make over or into something else, as yarns drawn from old rigging, made into spun yarn, foxes, sennit, and the like; also, to keep constantly at work upon needless matters, as a crew in order to punish them. R. H. Dana, Jr."}