{"word":"worm","definition":"1. A creeping or a crawling animal of any kind or size, as a serpent, caterpillar, snail, or the like. [Archaic] There came a viper out of the heat, and leapt on his hand. When the men of the country saw the worm hang on his hand, they said, This man must needs be a murderer. Tyndale (Acts xxviii. 3, 4). 'T is slander, Whose edge is sharper than the sword, whose tongue Outvenoms all the worms of Nile. Shak. When Cerberus perceived us, the great worm, His mouth he opened and displayed his tusks. Longfellow. 2. Any small creeping animal or reptile, either entirely without feet, or with very short ones, including a great variety of animals; as, an earthworm; the blindworm. Specifically: (Zoöl.) (a) Any helminth; an entozoön. (b) Any annelid. (c) An insect larva. (d) pl.  Same as Vermes. 3. An internal tormentor; something that gnaws or afflicts one's mind with remorse. The worm of conscience still begnaw thy soul! Shak. 4. A being debased and despised. I am a worm, and no man. Ps. xxii. 6. 5. Anything spiral, vermiculated, or resembling a worm; as: (a) The thread of a screw. The threads of screws, when bigger than can be made in screw plates, are called worms. Moxon. (b) A spiral instrument or screw, often like a double corkscrew, used for drawing balls from firearms. (c) (Anat.) A certain muscular band in the tongue of some animals, as the dog; the lytta. See Lytta. (d) The condensing tube of a still, often curved and wound to economize space. See Illust. of Still. (e) (Mach.) A short revolving screw, the threads of which drive, or are driven by, a worm wheel by gearing into its teeth or cogs. See Illust. of Worm gearing, below. Worm abscess (Med.), an abscess produced by the irritation resulting from the lodgment of a worm in some part of the body. -- Worm fence. See under Fence. -- Worm gear. (Mach.) (a) A worm wheel. (b) Worm gearing. -- Worm gearing, gearing consisting of a worm and worm wheel working together. -- Worm grass. (Bot.) (a) See Pinkroot, 2 (a). (b) The white stonecrop (Sedum album) reputed to have qualities as a vermifuge. Dr. Prior. -- Worm oil (Med.), an anthelmintic consisting of oil obtained from the seeds of Chenopodium anthelminticum. -- Worm powder (Med.), an anthelmintic powder. -- Worm snake. (Zoöl.) See Thunder snake (b), under Thunder. -- Worm tea (Med.), an anthelmintic tea or tisane. -- Worm tincture (Med.), a tincture prepared from dried earthworms, oil of tartar, spirit of wine, etc. [Obs.] -- Worm wheel, a cogwheel having teeth formed to fit into the spiral spaces of a screw called a worm, so that the wheel may be turned by, or may turn, the worm; -- called also worm gear, and sometimes tangent wheel. See Illust. of Worm gearing, above.\n\nTo work slowly, gradually, and secretly. When debates and fretting jealousy Did worm and work within you more and more, Your color faded. Herbert.\n\n1. To effect, remove, drive, draw, or the like, by slow and secret means; -- often followed by out. They find themselves wormed out of all power. Swift. They . . . wormed things out of me that I had no desire to tell. Dickens. 2. To clean by means of a worm; to draw a wad or cartridge from, as a firearm. See Worm, n. 5 (b). 3. To cut the worm, or lytta, from under the tongue of, as a dog, for the purpose of checking a disposition to gnaw. The operation was formerly supposed to guard against canine madness. The men assisted the laird in his sporting parties, wormed his dogs, and cut the ears of his terrier puppies. Sir W. Scott. 4. (Naut.)  To wind rope, yarn, or other material, spirally round, between the strands of, as a cable; to wind with spun yarn, as a small rope. Ropes . . . are generally wormed before they are served. Totten. To worm one's self into, to enter into gradually by arts and insinuations; as, to worm one's self into favor."}