{"word":"worship","definition":"1. Excellence of character; dignity; worth; worthiness. [Obs.] Shak. A man of worship and honour. Chaucer. Elfin, born of noble state, And muckle worship in his native land. Spenser. 2. Honor; respect; civil deference. [Obs.] Of which great worth and worship may be won. Spenser. Then shalt thou have worship in the presence of them that sit at meat with thee. Luke xiv. 10. 3. Hence, a title of honor, used in addresses to certain magistrates and others of rank or station. My father desires your worships' company. Shak. 4. The act of paying divine honors to the Supreme Being; religious reverence and homage; adoration, or acts of reverence, paid to God, or a being viewed as God. \"God with idols in their worship joined.\" Milton. The worship of God is an eminent part of religion, and prayer is a chief part of religious worship. Tillotson. 5. Obsequious or submissive respect; extravagant admiration; adoration. 'T is your inky brows, your black silk hair, Your bugle eyeballs, nor your cheek of cream, That can my spirits to your worship. Shak. 6. An object of worship. In attitude and aspect formed to be At once the artist's worship and despair. Longfellow. Devil worship, Fire worship, Hero worship, etc. See under Devil, Fire, Hero, etc.\n\n1. To respect; to honor; to treat with civil reverence. [Obsoles.] Chaucer. Our grave . . . shall have a tongueless mouth, Not worshiped with a waxen epitaph. Shak. This holy image that is man God worshipeth. Foxe. 2. To pay divine honors to; to reverence with supreme respect and veneration; to perform religious exercises in honor of; to adore; to venerate. But God is to be worshiped. Shak. When all our fathers worshiped stocks and stones. Milton. 3. To honor with extravagant love and extreme submission, as a lover; to adore; to idolize. With bended knees I daily worship her. Carew. Syn. -- To adore; revere; reverence; bow to; honor.\n\nTo perform acts of homage or adoration; esp., to perform religious service. Our fathers worshiped in this mountain; and ye say that in Jerusalem is the place where men ought to worship. John iv. 20. Was it for this I have loved . . . and worshiped in silence Longfellow."}