{"word":"wound","definition":"imp. & p. p. of Wind to twist, and Wind to sound by blowing.\n\n1. A hurt or injury caused by violence; specifically, a breach of the skin and flesh of an animal, or in the substance of any creature or living thing; a cut, stab, rent, or the like. Chaucer. Showers of blood Rained from the wounds of slaughtered Englishmen. Shak. 2. Fig.: An injury, hurt, damage, detriment, or the like, to feeling, faculty, reputation, etc. 3. (Criminal Law)  An injury to the person by which the skin is divided, or its continuity broken; a lesion of the body, involving some solution of continuity. Note: Walker condemns the pronunciation woond as a \"capricious novelty.\" It is certainly opposed to an important principle of our language, namely, that the Old English long sound written ou, and pronounced like French ou or modern English oo, has regularly changed, when accented, into the diphthongal sound usually written with the same letters ou in modern English, as in ground, hound, round, sound. The use of ou in Old English to represent the sound of modern English oo was borrowed from the French, and replaced the older and Anglo-Saxon spelling with u. It makes no difference whether the word was taken from the French or not, provided it is old enough in English to have suffered this change to what is now the common sound of ou; but words taken from the French at a later time, or influenced by French, may have the French sound. Wound gall (Zoöl.), an elongated swollen or tuberous gall on the branches of the grapevine, caused by a small reddish brown weevil (Ampeloglypter sesostris) whose larvæ inhabit the galls.\n\n1. To hurt by violence; to produce a breach, or separation of parts, in, as by a cut, stab, blow, or the like. The archers hit him; and he was sore wounded of the archers. 1 Sam. xxxi. 3. 2. To hurt the feelings of; to pain by disrespect, ingratitude, or the like; to cause injury to. When ye sin so against the brethren, and wound their weak conscience, ye sin against Christ. 1 Cor. viii. 12."}