{"word":"write","definition":"1. To set down, as legible characters; to form the conveyance of meaning; to inscribe on any material by a suitable instrument; as, to write the characters called letters; to write figures. 2. To set down for reading; to express in legible or intelligible characters; to inscribe; as, to write a deed; to write a bill of divorcement; hence, specifically, to set down in an epistle; to communicate by letter. Last night she enjoined me to write some lines to one she loves. Shak. I chose to write the thing I durst not speak To her I loved. Prior. 3. Hence, to compose or produce, as an author. I purpose to write the history of England from the accession of King James the Second down to a time within the memory of men still living. Macaulay. 4. To impress durably; to imprint; to engrave; as, truth written on the heart. 5. To make known by writing; to record; to prove by one's own written testimony; -- often used reflexively. He who writes himself by his own inscription is like an ill painter, who, by writing on a shapeless picture which he hath drawn, is fain to tell passengers what shape it is, which else no man could imagine. Milton. To write to, to communicate by a written document to. -- Written laws, laws deriving their force from express legislative enactment, as contradistinguished from unwritten, or common, law. See the Note under Law, and Common law, under Common, a.\n\n1. To form characters, letters, or figures, as representative of sounds or ideas; to express words and sentences by written signs. Chaucer. So it stead you, I will write, Please you command. Shak. 2. To be regularly employed or occupied in writing, copying, or accounting; to act as clerk or amanuensis; as, he writes in one of the public offices. 3. To frame or combine ideas, and express them in written words; to play the author; to recite or relate in books; to compose. They can write up to the dignity and character of the authors. Felton. 4. To compose or send letters. He wrote for all the Jews that went out of his realm up into Jewry concerning their freedom. 1 Esdras iv. 49."}