{"word":"wrong","definition":"imp. of Wring. Wrung. Chaucer.\n\n1. Twisted; wry; as, a wrong nose. [Obs.] Wyclif (Lev. xxi. 19). 2. Not according to the laws of good morals, whether divine or human; not suitable to the highest and best end; not morally right; deviating from rectitude or duty; not just or equitable; not true; not legal; as, a wrong practice; wrong ideas; wrong inclinations and desires. 3. Not fit or suitable to an end or object; not appropriate for an intended use; not according to rule; unsuitable; improper; incorrect; as, to hold a book with the wrong end uppermost; to take the wrong way. I have deceived you both; I have directed you to wrong places. Shak. 4. Not according to truth; not conforming to fact or intent; not right; mistaken; erroneous; as, a wrong statement. 5. Designed to be worn or placed inward; as, the wrong side of a garment or of a piece of cloth. Syn. -- Injurious; unjust; faulty; detrimental; incorrect; erroneous; unfit; unsuitable.\n\nIn a wrong manner; not rightly; amiss; morally ill; erroneously; wrongly. Ten censure wrong for one that writes amiss. Pope.\n\nThat which is not right. Specifically: (a) Nonconformity or disobedience to lawful authority, divine or human; deviation from duty; -- the opposite of moral Ant: right. When I had wrong and she the right. Chaucer. One spake much of right and wrong. Milton. (b) Deviation or departure from truth or fact; state of falsity; error; as, to be in the wrong. (c) Whatever deviates from moral rectitude; usually, an act that involves evil consequences, as one which inflicts injury on a person; any injury done to, or received from; another; a trespass; a violation of right. Friend, I do thee no wrong. Matt. xx. 18. As the king of England can do no wrong, so neither can he do right but in his courts and by his courts. Milton. The obligation to redress a wrong is at least as binding as that of paying a debt. E. Evereth. Note: Wrongs, legally, are private or public. Private wrongs are civil injuries, immediately affecting individuals; public wrongs are crimes and misdemeanors which affect the community. Blackstone.\n\n1. To treat with injustice; to deprive of some right, or to withhold some act of justice from; to do undeserved harm to; to deal unjustly with; to injure. He that sinneth . . . wrongeth his own soul. Prov. viii. 36. 2. To impute evil to unjustly; as, if you suppose me capable of a base act, you wrong me. I rather choose To wrong the dead, to wrong myself and you, Than I will wrong such honorable men. Shak."}