{"word":"yield","definition":"1. To give in return for labor expended; to produce, as payment or interest on what is expended or invested; to pay; as, money at interest yields six or seven per cent. To yelde Jesu Christ his proper rent. Chaucer. When thou tillest the ground, it shall not henceforth yield unto thee her strength. Gen. iv. 12. 2. To furnish; to afford; to render; to give forth. \"Vines yield nectar.\" Milton. [He] makes milch kine yield blood. Shak. The wilderness yieldeth food for them and for their children. Job xxiv. 5. 3. To give up, as something that is claimed or demanded; to make over to one who has a claim or right; to resign; to surrender; to relinquish; as a city, an opinion, etc. And, force perforce, I'll make him yield the crown. Shak. Shall yield up all their virtue, all their fame. Milton. 4. To admit to be true; to concede; to allow. I yield it just, said Adam, and submit. Milton. 5. To permit; to grant; as, to yield passage. 6. To give a reward to; to bless. [Obs.] Chaucer. Tend me to-night two hours, I ask no more, And the gods yield you for 't. Shak. God yield thee, and God thank ye. Beau. & Fl. To yield the breath, the ghost, or the life, to die; to expire; -- often followed by up. One calmly yields his willing breath. Keble.\n\n1. To give up the contest; to submit; to surrender; to succumb. He saw the fainting Grecians yield. Dryden. 2. To comply with; to assent; as, I yielded to his request. 3. To give way; to cease opposition; to be no longer a hindrance or an obstacle; as, men readily yield to the current of opinion, or to customs; the door yielded. Will ye relent, And yield to mercy while 't is offered you Shak. 4. To give place, as inferior in rank or excellence; as, they will yield to us in nothing. Nay tell me first, in what more happy fields The thistle springs, to which the lily yields Pope.\n\nAmount yielded; product; -- applied especially to products resulting from growth or cultivation. \"A goodly yield of fruit doth bring.\" Bacon."}