{"word":"zinc","definition":"An abundant element of the magnesium-cadmium group, extracted principally from the minerals zinc blende, smithsonite, calamine, and franklinite, as an easily fusible bluish white metal, which is malleable, especially when heated. It is not easily oxidized in moist air, and hence is used for sheeting, coating galvanized iron, etc. It is used in making brass, britannia, and other alloys, and is also largely consumed in electric batteries. Symbol Zn. Atomic weight 64.9 [Formerly written also zink.] Butter of zinc (Old Chem.), zinc chloride, ZnCl2, a deliquescent white waxy or oily substance. -- Oxide of zinc. (Chem.) See Zinc oxide, below. -- Zinc amine (Chem.), a white amorphous substance, Zn(NH2)2, obtained by the action of ammonia on zinc ethyl; -- called also zinc amide. -- Zinc amyle (Chem.), a colorless, transparent liquid, composed of zinc and amyle, which, when exposed to the atmosphere, emits fumes, and absorbs oxygen with rapidity. -- Zinc blende Etym: [cf. G. zinkblende] (Min.), a native zinc sulphide. See Blende, n. (a) -- Zinc bloom Etym: [cf. G. zinkblumen flowers of zinc, oxide of zinc] (Min.), hydrous carbonate of zinc, usually occurring in white earthy incrustations; -- called also hydrozincite. -- Zinc ethyl (Chem.), a colorless, transparent, poisonous liquid, composed of zinc and ethyl, which takes fire spontaneously on exposure to the atmosphere. -- Zinc green, a green pigment consisting of zinc and cobalt oxides; -- called also Rinmann's green. -- Zinc methyl (Chem.), a colorless mobile liquid Zn(CH3)2, produced by the action of methyl iodide on a zinc sodium alloy. It has a disagreeable odor, and is spontaneously inflammable in the air. It has been of great importance in the synthesis of organic compounds, and is the type of a large series of similar compounds, as zinc ethyl, zinc amyle, etc. -- Zinc oxide (Chem.), the oxide of zinc, ZnO, forming a light fluffy sublimate when zinc is burned; -- called also flowers of zinc, philosopher's wool, nihil album, etc. The impure oxide produced by burning the metal, roasting its ores, or in melting brass, is called also pompholyx, and tutty. -- Zinc spinel (Min.), a mineral, related to spinel, consisting essentially of the oxides of zinc and aluminium; gahnite. -- Zinc vitriol (Chem.), zinc sulphate. See White vitriol, under Vitriol. -- Zinc white, a white powder consisting of zinc oxide, used as a pigment.\n\nTo coat with zinc; to galvanize."}